Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SQL_TimeOverflow
source: SqlDbType.Time overflow. Value '{0}' is out of range. Must be between 00:00:00.0000000 and 23:59:59.9999999.
de: SqlDbType.Time-Überlauf. Der Wert '{0}' liegt außerhalb des gültigen Bereichs. Er muss zwischen 00:00:00.0000000 und 23:59:59.9999999 liegen.
es: Desbordamiento de SqlDbType.Time. El valor '{0}' se encuentra fuera del intervalo y debe estar entre 00:00:00.0000000 y 23:59:59.9999999.
fr: Dépassement SqlDbType.Time. La valeur '{0}' est hors limites. Elle doit être comprise entre 00:00:00.0000000 et 23:59:59.9999999.
it: Overflow di SqlDbType.Time. Valore '{0}' non incluso nell'intervallo: deve essere compreso fra 00.00.00.0000000 e 23.59.59.9999999.
ja: SqlDbType.Time がオーバーフローしています。値 '{0}' が有効範囲を超えています。00:00:00.0000000 から 23:59:59.9999999 までの値を指定してください。
ko: SqlDbType.Time 오버플로가 발생했습니다. '{0}' 값이 범위를 벗어났습니다. 이 값은 00:00:00.0000000에서 23:59:59.9999999 사이여야 합니다.
pt_br: Estouro SqlDbType.Time. O valor '{0}' está fora do intervalo. Ele deve estar entre 00:00:00.0000000 e 23:59:59.9999999.
ru: Переполнение SqlDbType.Time. Значение "{0}" находится за пределами диапазона. Оно должно быть в диапазоне от 00:00:00.0000000 до 23:59:59.9999999.
zh_hans: SqlDbType.Time 溢出。值“{0}”超出范围。必须介于 00:00:00.0000000 和 23:59:59.9999999 之间。
zh_hant: SqlDbType.Time 已溢位。值 '{0}' 超出範圍。這個值必須介於 00:00:00.0000000 和 23:59:59.9999999 之間。

# SQL_MoneyOverflow
source: SqlDbType.SmallMoney overflow. Value '{0}' is out of range. Must be between -214,748.3648 and 214,748.3647.
de: SqlDbType.SmallMoney-Überlauf. Der Wert '{0}' liegt außerhalb des gültigen Bereichs. Der Wert muss zwischen -214,748.3648 und 214,748.3647 liegen.
es: Desbordamiento de SqlDbType.SmallMoney. El valor '{0}' está fuera del intervalo. Debe estar entre -214,748.3648 y 214,748.3647.
fr: Dépassement SqlDbType.SmallMoney. La valeur '{0}' est hors limites. Elle doit être comprise entre -214 748,3648 et 214 748,3647.
it: Overflow di SqlDbType.SmallMoney. Valore '{0}' non incluso nell'intervallo: deve essere compreso fra -214.748,3648 e 214.748,3647.
ja: SqlDbType.SmallMoney のオーバーフローです。値 '{0}' は範囲外にあります。値は -214,748.3648 と 214,748.3647 の間になければなりません。
ko: SqlDbType.SmallMoney 오버플로가 발생했습니다. '{0}' 값이 범위를 벗어났습니다. 이 값은 -214,748.3648에서 214,748.3647 사이여야 합니다.
pt_br: Estouro de SqlDbType.SmallMoney. O valor '{0}' está fora do intervalo. Deve estar entre -214.748,3648 e 214.748,3647.
ru: Переполнение SqlDbType.SmallMoney. Значение "{0}" вне допустимого диапазона. Должно находиться в пределах от -214748,3648 до 214748,3647.
zh_hans: SqlDbType.SmallMoney 溢出。值“{0}”超出范围。必须介于 -214,748.3648 和 214,748.3647 之间。
zh_hant: SqlDbType.SmallMoney 已溢位。值 '{0}' 超出範圍。這個值必須介於 -214,748.3648 和 214,748.3647 之間。

# SQL_CultureIdError
source: The Collation specified by SQL Server is not supported.
de: Die vom SQL Server angegebene Collation wird nicht unterstützt.
es: La Collation especificada por SQL Server no es compatible.
fr: Le Collation spécifié par SQL Server n'est pas pris en charge.
it: Collation specificato da SQL Server non supportato.
ja: SQL Server で指定された Collation はサポートさていません。
ko: SQL Server에서 지정된 Collation은 지원되지 않습니다.
pt_br: Não há suporte para a Collation especificada pelo SQL Server.
ru: Порядок следования Collation, заданный сервером SQL Server, не поддерживается.
zh_hans: 不支持 SQL Server 指定的 Collation。
zh_hant: 不支援 SQL Server 指定的 Collation。

# SQL_OperationCancelled
source: Operation cancelled by user.
de: Der Vorgang wurde vom Benutzer abgebrochen.
es: Operación cancelada por el usuario.
fr: Opération annulée par l'utilisateur.
it: Operazione annullata dall'utente.
ja: 操作はユーザーによって取り消されました。
ko: 사용자가 작업을 취소했습니다.
pt_br: Operação cancelada pelo usuário.
ru: Операция отменена пользователем.
zh_hans: 用户已取消操作。
zh_hant: 使用者已經取消作業。

# SQL_SevereError
source: A severe error occurred on the current command. The results, if any, should be discarded.
de: Schwerer Fehler für den aktuellen Befehl. Die Ergebnisse (wenn vorhanden) sollten verworfen werden.
es: Se produjo un error grave en el comando actual. Se deberían descartar los resultados, en el caso de haberlos.
fr: Une erreur grave s'est produite pendant la commande actuelle. Les résultats devront être supprimés, le cas échéant.
it: Si è verificato un errore grave durante l'esecuzione del comando corrente. I risultati, se presenti, dovranno essere ignorati.
ja: 現在のコマンドで重大なエラーが発生しました。結果があれば、破棄する必要があります。
ko: 현재 명령에서 오류가 발생했습니다. 결과가 있을 경우 이를 무시해야 합니다.
pt_br: Ocorreu um erro grave no comando atual. Todos os resultados devem ser descartados.
ru: При выполнении текущей команды произошла серьезная ошибка. Пропустите результаты, если они есть.
zh_hans: 当前命令发生服务器错误。结果(如果有)应被放弃。
zh_hant: 目前的命令發生嚴重錯誤。如有任何結果，應予捨棄。

# SQL_SSPIGenerateError
source: The target principal name is incorrect. Cannot generate SSPI context.
de: Der Prinzipalname des Ziels ist nicht korrekt. Der SSPI-Kontext kann nicht generiert werden.
es: El nombre principal no es correcto. No se puede generar contexto SSPI.
fr: Le nom principal de la cible est incorrect. Impossible de générer un contexte SSPI.
it: Nome dell'entità di destinazione non corretto. Impossibile generare il contesto SSPI.
ja: 対象のプリンシパル名が間違っています。SSPI コンテキストを生成できません。
ko: 대상 보안 주체 이름이 잘못되었습니다. SSPI 컨텍스트를 생성할 수 없습니다.
pt_br: O nome da entidade de destino está incorreto. Não é possível gerar contexto SSPI.
ru: Неверное имя целевого субъекта. Невозможно создать контекст SSPI.
zh_hans: 目标主体名称不正确。无法生成 SSPI 上下文。
zh_hant: 目標主體名稱不正確。無法產生 SSPI 內容。

# SQL_InvalidSSPIPacketSize
source: Invalid SSPI packet size.
de: Ungültige SSPI-Paketgröße.
es: Tamaño de paquete SSPI no válido.
fr: Taille de paquet SSPI non valide.
it: Dimensioni del pacchetto SSPI non valide.
ja: 無効な SSPI パケット サイズです。
ko: SSPI 패킷 크기가 잘못되었습니다.
pt_br: Tamanho do pacote SSPI inválido.
ru: Недопустимый размер пакета SSPI.
zh_hans: SSPI 数据包大小无效。
zh_hant: 無效的 SSPI 封包大小。

# SQL_SSPIInitializeError
source: Cannot initialize SSPI package.
de: Das SSPI-Paket kann nicht initialisiert werden.
es: No se puede inicializar el paquete SSPI.
fr: Impossible d'initialiser le package SSPI.
it: Impossibile inizializzare il pacchetto SSPI.
ja: SSPI パッケージを初期化できません。
ko: SSPI 패키지를 초기화할 수 없습니다.
pt_br: Não é possível inicializar pacote SSPI.
ru: Невозможно инициализировать пакет SSPI.
zh_hans: 无法初始化 SSPI 软件包。
zh_hant: 無法初始化 SSPI 封裝。

# SQL_Timeout
source: Timeout expired. The timeout period elapsed prior to completion of the operation or the server is not responding.
de: Timeout abgelaufen. Das Zeitlimit wurde vor dem Beenden des Vorgangs überschritten oder der Server reagiert nicht.
es: Valor de Timeout caducado. El período de tiempo de espera caducó antes de completar la operación o el servidor no responde.
fr: Expiration du Timeout. Le délai d'attente s'est écoulé avant la fin de l'opération ou le serveur ne répond pas.
it: Timeout. Il tempo disponibile è scaduto prima del completamento dell'operazione o il server non risponde.
ja: Timeout に達しました。操作が完了する前にタイムアウト期間が過ぎたか、またはサーバーが応答していません。
ko: Timeout이 만료되었습니다. 작업을 완료하기 전에 제한 시간이 경과되었거나 서버가 응답하지 않았습니다.
pt_br: Timeout expirado. O timeout esgotou antes da conclusão da operação ou o servidor não está respondendo.
ru: Истекло время ожидания (Timeout). Время ожидания истекло до завершения операции или сервер не отвечает.
zh_hans: Timeout 时间已到。在操作完成之前超时时间已过或服务器未响应。
zh_hant: 已超過連接 Timeout 的設定。在作業完成之前超過逾時等待的時間，或者是伺服器未回應。

# SQL_Timeout_PreLogin_Begin
source: Connection Timeout Expired. The timeout period elapsed at the start of the pre-login phase. This could be because of insufficient time provided for connection timeout.
de: Verbindungstimeout abgelaufen. Das Timeout ist zu Beginn der Phase vor der Anmeldung aufgetreten. Möglicherweise wurde ein zu kurzes Verbindungstimeout konfiguriert.
es: Valor de tiempo de espera caducado. El periodo de tiempo de espera se agotó al comienzo de la fase previa al inicio de sesión. El motivo podría ser que el tiempo proporcionado para el tiempo de espera de la conexión no fuera suficiente.
fr: Le délai d'attente pour la connexion expiré. Le délai d'attente s'est écoulé au début de la phase de préconnexion. Cela peut être dû à un manque de temps au niveau du délai d'attente de connexion.
it: Timeout di connessione scaduto. Il tempo disponibile è scaduto all'inizio della fase di pre-accesso. È possibile che il tempo fornito per il timeout della connessione non sia stato sufficiente.
ja: 接続がタイムアウトしました。ログイン前フェーズの開始時にタイムアウト期間が過ぎました。接続タイムアウトに指定されている時間が短すぎる可能性があります。
ko: 연결 제한 시간이 만료되었습니다. 사전 로그인 단계를 시작할 때 제한 시간이 경과되었습니다. 이 문제는 연결 제한 시간에 제공된 시간이 부족하기 때문일 수 있습니다.
pt_br: Tempo Limite de Conexão Expirado. O tempo limite decorrido no início da fase pré-logon. Talvez isso ocorra devido ao tempo insuficiente especificado como tempo limite de conexão.
ru: Истекло время ожидания соединения. Время ожидания подключения истекло на начале этапа предварительного согласования. Это могло произойти из-за недостаточно большого временем ожидания соединения.
zh_hans: 连接超时时间已到。在预登录开始阶段超过了此超时时间。这可能是因为为连接超时提供的时间不够。
zh_hant: 已超過連接逾時的設定。在登入前的開始階段超過逾時等待的時間。這可能是因為連接逾時提供的時間不足所造成。

# SQL_Timeout_PreLogin_InitializeConnection
source: Connection Timeout Expired. The timeout period elapsed while attempting to create and initialize a socket to the server. This could be either because the server was unreachable or unable to respond back in time.
de: Verbindungstimeout abgelaufen. Das Timeout ist bei dem Versuch aufgetreten, einen Socket für den Server zu erstellen und zu initialisieren. Möglicherweise war der Server nicht erreichbar, oder der Server hat nicht rechtzeitig geantwortet.
es: Valor de tiempo de espera de la conexión caducado. El periodo de tiempo de espera se agotó al intentar crear e iniciar un socket para el servidor. El motivo podría ser que no se pudo alcanzar el servidor o que no pudo responder a tiempo.
fr: Le délai d'attente pour la connexion expiré. Le délai d'attente s'est écoulé lors de la tentative de création et d'initialisation d'un socket vers le serveur. Soit le serveur était impossible à joindre, soit il n'a pas pu répondre dans les temps.
it: Timeout di connessione scaduto. Il tempo disponibile è scaduto durante il tentativo di creazione e inizializzazione di un socket nel server. È possibile che il server non sia stato raggiungibile o in grado di rispondere in tempo.
ja: 接続がタイムアウトしました。サーバーへのソケットを作成および初期化している間にタイムアウト期間が過ぎました。サーバーに到達できなかったか、サーバーが時間内に応答できなかった可能性があります。
ko: 연결 제한 시간이 만료되었습니다. 서버에 대한 소켓을 만들고 초기화하려는 동안 제한 시간이 경과되었습니다. 이 문제는 서버에 연결할 수 없거나 서버가 시간 내에 응답할 수 없기 때문일 수 있습니다.
pt_br: Tempo Limite de Conexão Expirado. O tempo limite decorrido durante a tentativa de criar e inicializar um soquete para o servidor. Talvez isso ocorra porque o servidor estava inatingível ou não pôde responder a tempo.
ru: Истекло время ожидания соединения. Время ожидания подключения истекло при попытке создать и инициализировать сокет для подключения к серверу. Возможно, сервер был недоступен или не смог вовремя ответить.
zh_hans: 连接超时时间已到。在尝试创建并初始化服务器的套接字时超过了此超时时间。这可能是因为服务器无法访问或未能及时响应。
zh_hant: 已超過連接逾時的設定。在嘗試建立並初始化伺服器的通訊端時超過逾時等待的時間。這可能是伺服器無法連線或無法及時回應所造成。

# SQL_Timeout_PreLogin_SendHandshake
source: Connection Timeout Expired. The timeout period elapsed while making a pre-login handshake request. This could be because the server was unable to respond back in time.
de: Verbindungstimeout abgelaufen. Das Timeout ist während der Anforderung des Handshakes vor der Anmeldung aufgetreten. Möglicherweise hat der Server nicht rechtzeitig geantwortet.
es: Valor de tiempo de espera de la conexión caducado. El periodo de tiempo de espera se agotó al intentar realizar una solicitud de protocolo de enlace previo al inicio de sesión. El motivo podría ser que el servidor no pudo responder a tiempo.
fr: Le délai d'attente pour la connexion expiré. Le délai d'attente s'est écoulé lors de la demande de poignée de main de préconnexion. Cela peut être dû au fait que le serveur n'a pas pu répondre dans les temps.
it: Timeout di connessione scaduto. Il tempo disponibile è scaduto durante una richiesta di handshake di pre-accesso. È possibile che il server non sia stato in grado di rispondere in tempo.
ja: 接続がタイムアウトしました。ログイン前のハンドシェイクを要求している間にタイムアウト期間が過ぎました。サーバーが時間内に応答できなかった可能性があります。
ko: 연결 제한 시간이 만료되었습니다. 사전 로그인 핸드셰이크 요청을 수행하려는 동안 제한 시간이 경과되었습니다. 이 문제는 서버가 시간 내에 응답할 수 없기 때문일 수 있습니다.
pt_br: Tempo Limite de Conexão Expirado. O tempo limite decorrido durante uma solicitação de handshake pré-logon. Talvez isso ocorra porque o servidor não pôde responder a tempo.
ru: Истекло время ожидания соединения. Время ожидания истекло во время запроса на предварительное согласование. Возможно, сервер не смог вовремя ответить.
zh_hans: 连接超时时间已到。在生成预登录握手请求时超过了此超时时间。这可能是因为服务器未能及时响应。
zh_hant: 已超過連接逾時的設定。在發出登入前的信號交換要求時超過逾時等待的時間。這可能是伺服器無法及時回應所造成。

# SQL_Timeout_PreLogin_ConsumeHandshake
source: Connection Timeout Expired. The timeout period elapsed while attempting to consume the pre-login handshake acknowledgement. This could be because the pre-login handshake failed or the server was unable to respond back in time.
de: Verbindungstimeout abgelaufen. Das Timeout ist aufgetreten, während die Bestätigung des Handshakes vor der Anmeldung verarbeitet wurde. Möglicherweise ist ein Fehler beim Handshake vor der Anmeldung aufgetreten, oder der Server hat nicht rechtzeitig geantwortet.
es: Valor de tiempo de espera caducado. El periodo de tiempo de espera se agotó al intentar consumir la confirmación del protocolo de enlace previo al inicio de sesión. El motivo podría ser que se produjo un error en el protocolo de enlace o que el servidor no pudo responder a tiempo.
fr: Le délai d'attente pour la connexion expiré. Le délai d'attente s'est écoulé lors de la tentative de consommation de l'accusé réception de la poignée de main de préconnexion. Cela peut être dû à un échec de la poignée de main de préconnexion ou au fait que le serveur n'a pas pu répondre dans les temps.
it: Timeout di connessione scaduto. Il tempo disponibile è scaduto durante il tentativo di utilizzo dell'acknowledgement dell'handshake di pre-accesso. È possibile che si sia verificato un errore durante l'handshake di pre-accesso o che il server non sia stato in grado di rispondere in tempo.
ja: 接続がタイムアウトしました。ログイン前のハンドシェイクの確認を実行しようとしている間にタイムアウト期間が過ぎました。ログイン前のハンドシェイクに失敗したか、サーバーが時間内に応答できなかった可能性があります。
ko: 연결 제한 시간이 만료되었습니다. 사전 로그인 핸드셰이크 확인을 사용하려는 동안 제한 시간이 경과되었습니다. 이 문제는 사전 로그인 핸드셰이크가 실패했거나 서버가 시간 내에 응답할 수 없기 때문일 수 있습니다.
pt_br: Tempo Limite de Conexão Expirado. O tempo limite decorrido durante a tentativa de consumo da confirmação de handshake pré-logon. Isso ocorre porque houve falha no handshake pré-logon ou o servidor não pôde responder a tempo.
ru: Истекло время ожидания соединения. Время ожидания истекло при попытке обработки подтверждения предварительного согласования. Возможно, произошел сбой во время предварительного согласования, или сервер не смог ответить вовремя.
zh_hans: 连接超时时间已到。在尝试使用预登录握手确认时超过了此超时时间。这可能是因为预登录握手失败或服务器未能及时响应。
zh_hant: 已超過連接逾時的設定。在嘗試使用登入前的信號交換確認時超過逾時等待的時間。這可能是登入前的信號交換發生失敗，或伺服器無法及時回應所造成。

# SQL_Timeout_Login_Begin
source: Connection Timeout Expired. The timeout period elapsed at the start of the login phase. This could be because of insufficient time provided for connection timeout.
de: Verbindungstimeout abgelaufen. Das Timeout ist zu Beginn der Anmeldephase aufgetreten. Möglicherweise wurde ein zu kurzes Verbindungstimeout konfiguriert.
es: Valor de tiempo de espera de la conexión caducado. El periodo de tiempo de espera se agotó al comienzo de la fase de inicio de sesión. El motivo podría ser que el tiempo proporcionado para el tiempo de espera de la conexión no fue suficiente.
fr: Le délai d'attente pour la connexion expiré. Le délai d'attente s'est écoulé au début de la phase de connexion. Cela peut être dû à un manque de temps au niveau du délai d'attente de connexion.
it: Timeout di connessione scaduto. Il tempo disponibile è scaduto all'inizio della fase di accesso. È possibile che il tempo fornito per il timeout di connessione non sia stato sufficiente.
ja: 接続がタイムアウトしました。ログイン フェーズの開始時にタイムアウト期間が過ぎました。接続タイムアウトに指定されている時間が短すぎる可能性があります。
ko: 연결 제한 시간이 만료되었습니다. 로그인 단계를 시작할 때 제한 시간이 경과되었습니다. 이 문제는 연결 제한 시간에 제공된 시간이 부족하기 때문일 수 있습니다.
pt_br: Tempo Limite de Conexão Expirado. O período de tempo limite decorrido no início da fase de logon. Talvez isso ocorra devido ao tempo insuficiente especificado como tempo limite de conexão.
ru: Истекло время ожидания соединения. Время ожидания истекло на начальном этапе входа. Это могло произойти из-за недостаточно большого временем ожидания соединения.
zh_hans: 连接超时时间已到。在登录开始阶段超过了此超时时间。这可能是因为为连接超时提供的时间不够。
zh_hant: 已超過連接逾時的設定。在登入的開始階段超過逾時等待的時間。這可能是因為連接逾時提供的時間不足所造成。

# SQL_Timeout_Login_ProcessConnectionAuth
source: Connection Timeout Expired. The timeout period elapsed while attempting to authenticate the login. This could be because the server failed to authenticate the user or the server was unable to respond back in time.
de: Verbindungstimeout abgelaufen. Das Timeout ist während der Authentifizierung der Anmeldung aufgetreten. Möglicherweise konnte der Benutzer beim Server nicht authentifiziert werden, oder der Server hat nicht rechtzeitig geantwortet.
es: Valor de tiempo de espera de la conexión caducado. El periodo de tiempo de espera se agotó al intentar autenticar el inicio de sesión. El motivo podría ser que el servidor no pudo autenticar al usuario o que el servidor no pudo aportar una respuesta a tiempo.
fr: Le délai d'attente pour la connexion expiré. Le délai d'attente s'est écoulé lors de l'authentification du nom de connexion. Soit le serveur a échoué lors de l'authentification de l'utilisateur, soit il n'a pas pu répondre dans les temps.
it: Timeout di connessione scaduto. Il tempo disponibile è scaduto durante il tentativo di autenticazione dell'accesso. È possibile che si sia verificato un errore nel server durante l'autenticazione dell'utente o che il server non sia stato in grado di rispondere in tempo.
ja: 接続がタイムアウトしました。ログインの認証中にタイムアウト期間が過ぎました。サーバーがユーザーを認証できなかったか、時間内に応答できなかった可能性があります。
ko: 연결 제한 시간이 만료되었습니다. 로그인을 인증하려는 동안 제한 시간이 경과되었습니다. 이 문제는 서버가 사용자를 인증하지 못했거나 서버가 시간 내에 응답할 수 없기 때문일 수 있습니다.
pt_br: Tempo Limite de Conexão Expirado. O período de tempo limite decorrido durante a tentativa de autenticação de logon. Talvez isso ocorra porque o servidor não autenticou o usuário ou o servidor não pôde responder a tempo.
ru: Истекло время ожидания соединения. Время ожидания истекло при попытке проверки подлинности на входе. Возможно, сервер не смог проверить подлинность пользователя или вовремя ответить.
zh_hans: 连接超时时间已到。在尝试对登录名进行身份验证时超过了此超时时间。这可能是因为服务器未能对用户进行身份验证或服务器未能及时响应。
zh_hant: 已超過連接逾時的設定。在嘗試驗證登入時超過逾時等待的時間。這可能是伺服器無法驗證使用者或無法及時回應所造成。

# SQL_Timeout_PostLogin
source: Connection Timeout Expired. The timeout period elapsed during the post-login phase. The connection could have timed out while waiting for server to complete the login process and respond; Or it could have timed out while attempting to create multiple active connections.
de: Verbindungstimeout abgelaufen. Das Timeout ist in der Phase nach der Anmeldung aufgetreten. Möglicherweise ist das Verbindungstimeout aufgetreten, während auf den Abschluss des Anmeldevorgangs durch den Server und eine entsprechende Antwort des Servers gewartet wurde. Das Timeout kann auch während des Versuchs aufgetreten sein, mehrere aktive Verbindungen zu erstellen.
es: Valor de tiempo de espera caducado. El periodo de tiempo de espera se agotó durante la fase previa al inicio de sesión. Es posible que la conexión agotara el tiempo de espera mientras esperaba que el servidor completara el proceso de inicio de sesión y respondiera; o bien, al intentar crear varias conexiones activas.
fr: Le délai d'attente pour la connexion expiré. Le délai d'attente s'est écoulé au début de la phase suivant la connexion.La connexion a pu passer le délai en attendant que le serveur termine le processus de connexion et réponde. Elle peut également avoir passé le délai lors de la tentative de création de plusieurs connexions actives.
it: Timeout di connessione scaduto. Il tempo disponibile è scaduto durante la fase di post-accesso. È possibile che si sia verificato un timeout della connessione durante l'attesa del completamento del processo di accesso e di una risposta dal server oppure durante il tentativo di creazione di più connessioni attive.
ja: 接続がタイムアウトしました。ログイン後フェーズの間にタイムアウト期間が過ぎました。サーバーがログイン プロセスを完了して応答するまでの間、またはアクティブな接続を複数作成している間にタイムアウトした可能性があります。
ko: 연결 제한 시간이 만료되었습니다. 사후 로그인 단계 중에 제한 시간이 경과되었습니다. 서버가 로그인 처리 및 응답을 완료할 때까지 기다리는 동안 연결 제한 시간이 만료되었거나 여러 활성 연결을 만들려는 동안 연결 제한 시간이 만료되었을 수 있습니다.
pt_br: Tempo Limite de Conexão Expirado. O tempo limite decorrido durante a fase pós-logon. A conexão expirou enquanto aguardava o servidor concluir o processo de logon e responder; ou talvez tenha expirado ao tentar criar várias conexões ativas.
ru: Истекло время ожидания соединения. Время ожидания истекло на этапе после входа. Возможно, время ожидания соединения истекло, пока сервер выполнял процесс входа в систему и отправки ответа, или это произошло при попытке создать несколько активных соединений.
zh_hans: 连接超时时间已到。在登录后阶段超过了此超时时间。连接可能在等待服务器完成登录过程并响应时超时；或者在尝试创建多个活动连接时超时。
zh_hant: 已超過連接逾時的設定。在登入後階段超過逾時等待的時間。連接可能是在等候伺服器完成登入程序並回應時逾時，或是在嘗試建立多個作用中的連接時逾時。

# SQL_Timeout_FailoverInfo
source: This failure occured while attempting to connect to the {0} server.
de: Der Fehler ist bei dem Versuch aufgetreten, eine Verbindung mit dem {0}-Server herzustellen.
es: Se ha producido este error al intentar conectar con el servidor {0}.
fr: Cette erreur s'est produite en essayant de se connecter au serveur {0}.
it: Errore durante il tentativo di connessione al server {0}.
ja: このエラーは、{0} サーバーに接続しているときに発生しました。
ko: 이 오류는 {0} 서버에 연결하려는 중에 발생했습니다.
pt_br: Esta falha ocorreu ao tentar se conectar ao servidor {0}.
ru: Эта ошибка произошла при попытке подключиться к серверу {0}.
zh_hans: 尝试连接到 {0} 服务器时发生了此故障。
zh_hant: 嘗試連接到 {0} 伺服器時發生這項失敗。
