Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataDom_MultipleDataSet
source: DataSet can be associated with at most one XmlDataDocument. Cannot associate the DataSet with the current XmlDataDocument because the DataSet is already associated with another XmlDataDocument.
de: DataSet kann höchstens mit einem XmlDataDocument verknüpft werden. DataSet kann nicht mit dem aktuellen XmlDataDocument verknüpft werden, da der DataSet bereits mit einem anderen XmlDataDocument verknüpft ist.
es: El DataSet se puede asociar a un XmlDataDocument como máximo. No se puede asociar el DataSet al XmlDataDocument actual porque ya está asociado a otro XmlDataDocument.
fr: Le DataSet peut être associé à un XmlDataDocument maximum. Il est impossible d'associer le DataSet au XmlDataDocument actif, car le DataSet est déjà associé à un autre XmlDataDocument.
it: Non è possibile associare un DataSet a più di un XmlDataDocument. Non è possibile associare il DataSet al XmlDataDocument corrente perché è già associato a un altro XmlDataDocument.
ja: DataSet は 1 つの XmlDataDocument のみに関連付けられます。この DataSet は既にほかの XmlDataDocument に関連付けられているため、現在の XmlDataDocument に DataSet を関連付けることはできません。
ko: DataSet은 최대 하나의 XmlDataDocument에 연결될 수 있습니다. DataSet이 다른 XmlDataDocument에 이미 연결되어 있으므로 현재 XmlDataDocument에 연결할 수 없습니다.
pt_br: DataSet pode ser associado somente a um XmlDataDocument. Não é possível associar DataSet ao XmlDataDocument atual porque o DataSet já está associado a outro XmlDataDocument.
ru: Невозможно назначить DataSet по меньшей мере одному XmlDataDocument. Невозможно назначить DataSet текущему XmlDataDocument, т.к. данный DataSet уже назначен другому XmlDataDocument.
zh_hans: DataSet 最多可与一个 XmlDataDocument 关联。不能将 DataSet 与当前的 XmlDataDocument 关联，因为该 DataSet 已与另一个 XmlDataDocument 关联。
zh_hant: DataSet 最多能與一個 XmlDataDocument 產生關聯。當 DataSet 已經與其他 XmlDataDocument 產生關聯時，就無法與目前的 XmlDataDocument 產生關聯。

# DataDom_EnforceConstraintsShouldBeOff
source: Please set DataSet.EnforceConstraints == false before trying to edit XmlDataDocument using XML operations.
de: Legen Sie DataSet.EnforceConstraints == false fest, bevor Sie das XmlDataDocument mit XML-Vorgängen bearbeiten.
es: Establezca DataSet.EnforceConstraints == false antes de intentar editar XmlDataDocument utilizando operaciones de XML.
fr: Définissez DataSet.EnforceConstraints == false avant d'essayer de modifier XmlDataDocument à l'aide d'opérations XML.
it: Impostare DataSet.EnforceConstraints == false prima di tentare di modificare XmlDataDocument mediante operazioni XML.
ja: XML 操作を使って XmlDataDocument を編集する前に、DataSet.EnforceConstraints == false に設定してください。
ko: XML 작업을 사용하여 XmlDataDocument를 편집하기 전에 DataSet.EnforceConstraints == false를 설정하십시오.
pt_br: Defina DataSet.EnforceConstraints == false antes de tentar editar XmlDataDocument usando operações XML.
ru: Перед попыткой изменения XmlDataDocument с помощью операций XML присвойте DataSet.EnforceConstraints значение == false (ложь).
zh_hans: 在尝试使用 XML 操作编辑 XmlDataDocument 之前请设置 DataSet.EnforceConstraints == false。
zh_hant: 在嘗試使用 XML 作業編輯 XmlDataDocument 前請設定 DataSet.EnforceConstraints == false。

# DataDom_NotSupport_GetElementById
source: GetElementById() is not supported on DataDocument.
de: GetElementById() wird auf DataDocument nicht unterstützt.
es: DataDocument no admite GetElementById().
fr: GetElementById() n'est pas pris en charge dans DataDocument.
it: GetElementById() non supportato su DataDocument.
ja: GetElementById() は DataDocument でサポートされていません。
ko: DataDocument에서는 GetElementById()를 지원하지 않습니다.
pt_br: Não há suporte para GetElementById() em DataDocument.
ru: Метод GetElementById() для DataDocument не поддерживается.
zh_hans: DataDocument 上不支持 GetElementById()。
zh_hant: 在 DataDocument 上不支援 GetElementById()。

# DataDom_NotSupport_EntRef
source: Cannot create entity references on DataDocument.
de: Es können keine Entitätsverweise auf ein DataDocument erstellt werden.
es: No se pueden crear referencias de entidad en DataDocument.
fr: Impossible de créer des références d'entité sur DataDocument.
it: Impossibile creare riferimenti a entità su DataDocument.
ja: DataDocument にエンティティ参照を作成できません。
ko: DataDocument에 엔터티 참조를 만들 수 없습니다.
pt_br: Não é possível criar referências de entidade em DataDocument.
ru: Невозможно создать ссылки на объекты подстановки для DataDocument.
zh_hans: 不能在 DataDocument 上创建实体引用。
zh_hant: 無法在 DataDocument 上建立實體參考。

# DataDom_NotSupport_Clear
source: Clear function on DateSet and DataTable is not supported on XmlDataDocument.
de: Clear-Funktion für DateSet und DataTable wird für XmlDataDocument nicht unterstützt.
es: XmlDataDocument no admite la función Clear en DateSet y DataTable.
fr: La fonction Clear sur DateSet et DataTable n'est pas prise en charge sur XmlDataDocument.
it: La funzione Clear in DateSet e DataTable non è supportata da XmlDataDocument.
ja: DateSet および DataTable の Clear 機能は XmlDataDocument でサポートされていません。
ko: DateSet과 DataTable의 Clear 기능은 XmlDataDocument에서 지원되지 않습니다.
pt_br: A função Clear em DateSet e DataTable não oferece suporte em XmlDataDocument.
ru: Функция очистки Clear DateSet и DataTable для XmlDataDocument не поддерживается.
zh_hans: XmlDataDocument 不支持在 DateSet 和 DataTable 上使用 Clear 函数。
zh_hant: XmlDataDocument 不支援對 DateSet 和 DataTable 使用 Clear 函式。

# StrongTyping_CannotRemoveColumn
source: Cannot remove column since it is built in to this dataSet.
de: Die Spalte kann nicht entfernt werden, da sie in das 'dataSet' eingebaut ist.
es: No se puede eliminar la columna porque está incorporada a este dataSet.
fr: Impossible de supprimer la colonne, car elle est intégrée dans ce dataSet.
it: Impossibile rimuovere una colonna incorporata nel dataSet.
ja: 列がこの dataSet に組み込まれているため、削除できません。
ko: 이 열은 현재 dataSet에 내장되어 있으므로 제거할 수 없습니다.
pt_br: Não é possível remover coluna porque ela é interna a este dataSet.
ru: Невозможно удалить столбец, т.к. он встроен в этот dataSet.
zh_hans: 不能移除列，因为它内置于此 dataSet 中。
zh_hant: 無法移除資料行，因為它已內建在這個 dataSet。

# StrongTyping_CananotRemoveRelation
source: Cannot remove relation since it is built in to this dataSet.
de: Die Beziehung kann nicht entfernt werden, da sie in das 'dataSet' eingebaut ist.
es: No se puede eliminar la relación porque está incorporada a este dataSet.
fr: Impossible de supprimer la relation, car elle est intégrée à ce dataSet.
it: Impossibile rimuovere una relazione incorporata nel dataSet.
ja: リレーションシップがこの dataSet に組み込まれているため、削除できません。
ko: 이 관계는 현재 dataSet에 내장되어 있으므로 제거할 수 없습니다.
pt_br: Não é possível remover relação porque ela é interna a este dataSet.
ru: Невозможно удалить отношение, т.к. оно встроено в этот dataSet.
zh_hans: 不能移除关系，因为它内置于此 dataSet 中。
zh_hant: 無法移除關聯，因為它已內建在這個 dataSet。

# propertyChangedEventDescr
source: Occurs whenever a property for this control changes.
de: Tritt auf, wenn eine Eigenschaft für das Steuerelement geändert wird.
es: Tiene lugar cuando la propiedad de este control cambia.
fr: Se produit lorsqu'une propriété pour ce contrôle change.
it: Generato quando una proprietà di questo controllo cambia.
ja: このコントロールのプロパティが変わるときに発生します。
ko: 이 컨트롤의 속성이 변경될 때마다 발생합니다.
pt_br: Ocorre sempre que uma propriedade deste controle é alterada.
ru: Происходит при каждом изменении любого свойства этого элемента управления.
zh_hans: 每当更改该控件的属性时发生。
zh_hant: 當這個控制項的屬性變更時發生。

# collectionChangedEventDescr
source: Occurs whenever this collection's membership changes.
de: Tritt auf, wenn sich die Mitgliedschaft dieser Sammlung ändert.
es: Tiene lugar cuando cambia la pertenencia a esta colección.
fr: Se produit lorsque l'appartenance de cette collection change.
it: Generato quando si modifica l'appartenenza a questa raccolta.
ja: このコレクションのメンバーシップが変わるたびに発生します。
ko: 이 컬렉션의 멤버가 변경될 때마다 발생합니다.
pt_br: Ocorre sempre que os membros desta coleção são alterados.
ru: Происходит при каждом изменении принадлежности этой коллекции.
zh_hans: 每当此集合的成员更改时发生。
zh_hant: 當這個集合的成員資格變更時發生。

# StrongTyping_CananotAccessDBNull
source: Cannot get value because it is DBNull.
de: Der Wert kann nicht abgerufen werden, da er DBNull ist.
es: No se puede obtener el valor porque es DBNull.
fr: Impossible d'obtenir la valeur, car elle est DBNull.
it: Non è possibile ottenere il valore perché è DBNull.
ja: 値が DBNull のため、取得できません。
ko: 값이 DBNull이므로 가져올 수 없습니다.
pt_br: Não é possível obter o valor porque ele é DBNull.
ru: Невозможно получить значение, поскольку оно равно DBNull.
zh_hans: 无法获取值，因为它是 DBNull。
zh_hant: 無法取得值，因為它是 DBNull。

# ADP_PropertyNotSupported
source: The '{0}' property requires Microsoft WindowsNT or a WindowsNT based operating system.
de: Für die '{0}'-Eigenschaft ist Microsoft WindowsNT oder ein WindowsNT-basiertes Betriebssystem erforderlich.
es: La propiedad '{0}' necesita un sistema operativo Microsoft WindowsNT o WindowsNT.
fr: La propriété '{0}' requiert Microsoft WindowsNT ou un système d'exploitation WindowsNT.
it: La proprietà '{0}' richiede Microsoft WindowsNT o un altro sistema operativo basato su WindowsNT.
ja: '{0}' プロパティを使用する場合は、Microsoft WindowsNT または WindowsNT ベースのオペレーティング システムが必要になります。
ko: '{0}' 속성을 사용하려면 Microsoft WindowsNT 또는 WindowsNT 기반 운영 체제가 필요합니다.
pt_br: A propriedade '{0}' requer um sistema operacional com base em Microsoft WindowsNT ou em WindowsNT.
ru: Свойству "{0}" необходима Microsoft WindowsNT или другая операционная система на ее основе.
zh_hans: “{0}”属性需要 Microsoft WindowsNT 或基于 WindowsNT 的操作系统。
zh_hant: 屬性 '{0}' 需要 Microsoft WindowsNT 或 WindowsNT 作業系統。

# ConfigProviderNotFound
source: Unable to find the requested .NET Framework Data Provider. It may not be installed.
de: Der angeforderte .NET Framework-Datenanbieter wurde nicht gefunden. Möglicherweise ist er nicht installiert.
es: No se encuentra el proveedor de datos .NET Framework solicitado. Puede que no esté instalado.
fr: Le fournisseur de données .NET Framework demandé est introuvable. Il n'est peut-être pas installé.
it: Non è possibile trovare il provider di dati .NET Framework richiesto. Potrebbe non essere installato.
ja: 要求された .NET Framework データ プロバイダーが見つかりません。これはインストールされていない可能性があります。
ko: 요청한 .NET Framework 데이터 공급자를 찾을 수 없습니다. 설치되지 않았을 수 있습니다.
pt_br: Não foi possível localizar o Provedor de Dados .NET Framework solicitado. Talvez ele não esteja instalado.
ru: Запрошенный поставщик данных .NET Framework не найден. Возможно, он не установлен.
zh_hans: 找不到请求的 .NET Framework 数据提供程序。它可能没有安装。
zh_hant: 找不到要求的 .NET Framework Data Provider。可能尚未安裝。

# ConfigProviderInvalid
source: The requested .NET Framework Data Provider's implementation does not have an Instance field of a System.Data.Common.DbProviderFactory derived type.
de: Die angeforderte Implementierung des .NET Framework-Datenanbieters umfasst kein Instanzenfeld eines abgeleiteten System.Data.Common.DbProviderFactory-Typs.
es: La implementación del proveedor de datos .NET Framework solicitado no tiene un campo de instancia de un tipo derivado de System.Data.Common.DbProviderFactory.
fr: L'implémentation du fournisseur de données .NET Framework demandée ne comporte pas de champ d'instance d'un type dérivé de System.Data.Common.DbProviderFactory.
it: L'implementazione richiesta del provider di dati .NET Framework non possiede un campo Istanza di un tipo derivato System.Data.Common.DbProviderFactory.
ja: 要求された .NET Framework データ プロバイダーの実装には、System.Data.Common.DbProviderFactory の派生型の Instance フィールドがありません。
ko: 요청한 .NET Framework 데이터 공급자 구현에 System.Data.Common.DbProviderFactory 파생 유형의 인스턴스 필드가 없습니다.
pt_br: A implementação do Provedor de Dados .NET Framework solicitada não tem um campo de Instância de um tipo derivado de System.Data.Common.DbProviderFactory.
ru: Реализация запрошенного поставщика данных .NET Framework не содержит поле Instance (Экземпляр) производного типа System.Data.Common.DbProviderFactory.
zh_hans: 请求的 .NET Framework 数据提供程序实现不包含具有 System.Data.Common.DbProviderFactory 派生类型的 Instance 字段。
zh_hant: 要求的 .NET Framework Data Provider 實作沒有 System.Data.Common.DbProviderFactory 衍生類型的執行個體欄位。

# ConfigProviderNotInstalled
source: Failed to find or load the registered .NET Framework Data Provider.
de: Der registrierte .NET Framework-Datenanbieter wurde nicht gefunden oder kann nicht geladen werden.
es: No se encuentra o no se puede cargar el proveedor de datos .NET Framework registrado.
fr: La recherche ou le chargement du fournisseur de données .NET Framework inscrit a échoué.
it: Non è stato possibile trovare o caricare il provider di dati .NET Framework registrato.
ja: 登録されている .NET Framework データ プロバイダーが見つからないか、読み込めませんでした。
ko: 등록된 .NET Framework 데이터 공급자를 찾거나 로드하지 못했습니다.
pt_br: Falha ao localizar ou carregar o Provedor de Dados .NET Framework registrado.
ru: Не удалось найти или загрузить зарегистрированный поставщик данных .NET Framework.
zh_hans: 找不到或无法加载已注册的 .NET Framework 数据提供程序。
zh_hant: 找不到或無法載入註冊的 .NET Framework Data Provider。

# ConfigProviderMissing
source: The missing .NET Framework Data Provider's assembly qualified name is required.
de: Der fehlende Name mit Assemblyqualifikation des .NET Framework-Datenanbieters ist erforderlich.
es: Se necesita el nombre calificado con el ensamblado del proveedor de datos .NET Framework que falta.
fr: Le nom qualifié d'assembly du fournisseur de données .NET Framework est obligatoire.
it: È richiesto il nome qualificato dall'assembly del provider di dati .NET Framework mancante.
ja: 見つからない .NET Framework データ プロバイダーのアセンブリ修飾名は必須です。
ko: 누락된 .NET Framework 데이터 공급자의 정규화된 어셈블리 이름이 필요합니다.
pt_br: O nome qualificado pelo assembly do Provedor de Dados .NET Framework ausente é obrigatório.
ru: Требуется полное имя сборки поставщика данных .NET Framework.
zh_hans: 缺少必需的 .NET Framework 数据提供程序程序集限定名称。
zh_hant: 所缺少的 .NET Framework Data Provider 組件限定名稱為必要項。

# ConfigBaseElementsOnly
source: Only elements allowed.
de: Nur Elemente sind zulässig.
es: Sólo se permiten elementos.
fr: Seuls éléments autorisés.
it: Solo gli elementi consentiti.
ja: 指定できるのは要素だけです。
ko: 요소만 사용할 수 있습니다.
pt_br: Somente elementos permitidos.
ru: Разрешены только элементы.
zh_hans: 只允许元素。
zh_hant: 僅允許元素。

# ConfigBaseNoChildNodes
source: Child nodes not allowed.
de: Untergeordnete Knoten sind nicht zulässig.
es: No se permiten nodos secundarios.
fr: Nœuds enfants non autorisés.
it: Nodi figlio non consentiti.
ja: 子ノードは指定できません。
ko: 자식 노드는 사용할 수 없습니다.
pt_br: Não são permitidos nós filhos.
ru: Дочерние узлы не разрешены.
zh_hans: 不允许子节点。
zh_hant: 不允許子節點。

# ConfigUnrecognizedAttributes
source: Unrecognized attribute '{0}'.
de: Nicht erkanntes Attribut '{0}'.
es: Atributo no reconocido '{0}'.
fr: Attribut '{0}' non reconnu.
it: Attributo "{0}" non riconosciuto.
ja: 認識されていない属性 '{0}' です。
ko: 인식할 수 없는 특성 '{0}'입니다.
pt_br: Atributo '{0}' não reconhecido.
ru: Неопознанный атрибут "{0}".
zh_hans: 无法识别的特性“{0}”。
zh_hant: 無法識別的屬性 '{0}'。

# ConfigUnrecognizedElement
source: Unrecognized element.
de: Unbekanntes Element.
es: Elemento no reconocido.
fr: Élément non reconnu.
it: Elemento non riconosciuto.
ja: 認識されない要素です。
ko: 인식할 수 없는 요소입니다.
pt_br: Elemento não reconhecido.
ru: Неизвестный элемент.
zh_hans: 无法识别的元素。
zh_hant: 無法辨認的項目。

# ConfigSectionsUnique
source: The '{0}' section can only appear once per config file.
de: Der Abschnitt {0} darf pro Konfigurationsdatei nur einmal angegeben werden.
es: La sección '{0}' sólo puede aparecer una vez en cada archivo de configuración.
fr: La section '{0}' ne peut figurer qu'une seule fois par fichier de configuration.
it: La sezione '{0}' può essere presente una sola volta in ogni file di configurazione.
ja: '{0}' セクションは、1 つの構成ファイルで 1 回しか使用できません。
ko: '{0}' 섹션은 config 파일별로 한 번만 사용할 수 있습니다.
pt_br: A seção '{0}' pode aparecer apenas uma vez por arquivo config.
ru: В файле конфигурации может быть только один раздел "{0}".
zh_hans: 每个配置文件中只能出现一次“{0}”节。
zh_hant: '{0}' 區段僅可在每個組態檔中出現一次。

# ConfigRequiredAttributeMissing
source: Required attribute '{0}' not found.
de: Das erforderliche Attribut "{0}" wurde nicht gefunden.
es: No se encuentra el atributo obligatorio '{0}'.
fr: L'attribut obligatoire '{0}' est introuvable.
it: L'attributo obbligatorio '{0}' non è stato trovato.
ja: 必要な属性 '{0}' が見つかりません。
ko: 필수 특성 '{0}'을(를) 찾을 수 없습니다.
pt_br: Atributo '{0}' necessário não encontrado.
ru: Обязательный атрибут "{0}" не найден.
zh_hans: 找不到所需的特性“{0}”。
zh_hant: 找不到必要的屬性 '{0}'。

# ConfigRequiredAttributeEmpty
source: Required attribute '{0}' cannot be empty.
de: Das erforderliche Attribut '{0}' darf nicht leer sein.
es: El atributo necesario '{0}' no puede estar vacío.
fr: L'attribut requis '{0}' ne peut pas être vide.
it: L'attributo obbligatorio "{0}" non può essere vuoto.
ja: 必要な属性 '{0}' を空にすることはできません。
ko: 필요한 '{0}' 특성은 비워 둘 수 없습니다.
pt_br: O atributo solicitado '{0}' não pode ser vazio.
ru: Обязательный атрибут "{0}" не может быть пустым.
zh_hans: 必需的特性“{0}”不能为空。
zh_hant: 必要的屬性 '{0}' 不可為空。

# ADP_EmptyArray
source: Expecting non-empty array for '{0}' parameter.
de: Für den Parameter '{0}' wird kein leeres Array erwartet.
es: Se esperaba una matriz no vacía para el parámetro '{0}'.
fr: Tableau non vide attendu pour le paramètre '{0}'.
it: Prevista matrice non vuota per il parametro "{0}".
ja: '{0}' パラメーターには空でない配列が必要です。
ko: '{0}' 매개 변수에 대한 배열은 비어 있지 않아야 합니다.
pt_br: Esperando matriz não vazia para o parâmetro '{0}'.
ru: Для параметра "{0}" ожидается непустой массив.
zh_hans: 应为“{0}”参数的非空数组。
zh_hant: '{0}' 參數必須是非空陣列。

# ADP_SingleValuedProperty
source: The only acceptable value for the property '{0}' is '{1}'.
de: Der einzige zulässige Wert für die Eigenschaft '{0}' ist '{1}'.
es: El único valor permitido para la propiedad '{0}' es '{1}'.
fr: La seule valeur acceptable pour la propriété '{0}' est '{1}'.
it: L'unico valore accettabile per la proprietà "{0}" è "{1}".
ja: プロパティ '{0}' に使用できる値は '{1}' のみです。
ko: 속성 '{0}'에 대해 허용되는 유일한 값은 '{1}'입니다.
pt_br: O único valor aceitável para a propriedade '{0}' é '{1}'.
ru: Свойство "{0}" может принимать только значение "{1}".
zh_hans: “{0}”可接受的唯一值是“{1}”。
zh_hant: 屬性 '{0}' 僅可接受的值是 '{1}'。

# ADP_DoubleValuedProperty
source: The acceptable values for the property '{0}' are '{1}' or '{2}'.
de: Die zulässigen Werte für die Eigenschaft '{0}' sind '{1}' oder '{2}'.
es: Los valores permitidos para la propiedad '{0}' son '{1}' o '{2}'.
fr: Les valeurs acceptables de la propriété '{0}' sont '{1}' ou '{2}'.
it: I valori accettabili per la proprietà "{0}" sono "{1}" oppure "{2}".
ja: プロパティ '{0}' に使用できる値は '{1}' または '{2}' です。
ko: 속성 '{0}'에 허용되는 값은 '{1}' 또는 '{2}'입니다.
pt_br: Os valores aceitáveis para a propriedade '{0}' são '{1}' ou '{2}'.
ru: Для свойства "{0}" допустимо только значение "{1}" или "{2}".
zh_hans: 属性“{0}”可以接受的值为“{1}”或“{2}”。
zh_hant: 屬性 '{0}' 可接受的值為 '{1}' 或 '{2}'。

# ADP_InvalidPrefixSuffix
source: Specified QuotePrefix and QuoteSuffix values do not match.
de: Die für QuotePrefix und QuoteSuffix angegebenen Werte stimmen nicht überein.
es: Los valores QuotePrefix y QuoteSuffix especificados no coinciden.
fr: Les valeurs spécifiées de QuotePrefix et de QuoteSuffix ne correspondent pas.
it: I valori specificati per QuotePrefix e QuoteSuffix non corrispondono.
ja: 指定された QuotePrefix の値と QuoteSuffix の値が一致しません。
ko: 지정한 QuotePrefix 및 QuoteSuffix 값이 일치하지 않습니다.
pt_br: Valores de QuotePrefix e QuoteSuffix especificados não coincidem.
ru: Несоответствие указанных значений QuotePrefix и QuoteSuffix.
zh_hans: 指定的 QuotePrefix 和 QuoteSuffix 值不匹配。
zh_hant: 指定的 QuotePrefix 與 QuoteSuffix 值不符。

# ADP_InvalidArgumentLength
source: The length of argument '{0}' exceeds it's limit of '{1}'.
de: Die Länge des Arguments '{0}' überschreitet dessen Grenzwert '{1}'.
es: La longitud del argumento '{0}' supera su límite de '{1}'.
fr: La longueur de l'argument '{0}' dépasse sa limite fixée à '{1}'.
it: La lunghezza dell'argomento "{0}" supera il limite di "{1}".
ja: 引数 '{0}' の長さが、上限の '{1}' を超えています。
ko: 인수 '{0}'의 길이가 한계인 '{1}'을(를) 초과합니다.
pt_br: O comprimento do argumento '{0}' excede o limite de '{1}'.
ru: Длина аргумента "{0}" превышает установленное для него ограничение "{1}".
zh_hans: 参数“{0}”的长度超出了“{1}”的限制。
zh_hant: 引數 '{0}' 的長度超過其上限 '{1}'。

# SQL_WrongType
source: Expecting argument of type {1}, but received type {0}.
de: Erwartet wird ein Argument vom Typ {1}, empfangen wurde jedoch Typ {0}.
es: Se esperaba un argumento del tipo {1}, pero se ha recibido del tipo {0}.
fr: Argument de type {1} attendu, mais type {0} reçu.
it: Previsto un argomento di tipo {1}. Ricevuto tipo {0}.
ja: 型 {1} の引数を予期していましたが、型 {0} が渡されました。
ko: {1} 유형의 인수가 필요한데 {0} 유형을 수신했습니다.
pt_br: Esperado o tipo de argumento {1}, mas recebido o tipo {0}.
ru: Ожидается аргумент типа {1}, получен аргумент типа {0}.
zh_hans: 应为 {1} 类型的参数，而收到的是 {0} 类型。
zh_hant: 必須要收到引數型別 {1}，卻收到型別 {0}。

# ADP_InvalidConnectionOptionValue
source: Invalid value for key '{0}'.
de: Ungültiger Wert für den {0}-Schlüssel.
es: Valor no válido para la clave '{0}'.
fr: Valeur non valide pour la clé « {0} ».
it: Valore non valido per la chiave '{0}'.
ja: キー '{0}' の値が無効です。
ko: 키 '{0}'에 대한 값이 잘못되었습니다.
pt_br: Valor inválido para a chave '{0}'.
ru: Недопустимое значение ключа "{0}".
zh_hans: 键“{0}”的值无效。
zh_hant: 索引鍵 '{0}' 的值無效。

# ADP_MissingConnectionOptionValue
source: Use of key '{0}' requires the key '{1}' to be present.
de: Für die Verwendung des Schlüssels '{0}' muss der Schlüssel '{1}' vorhanden sein.
es: Para poder utilizar la clave '{0}', debe estar presente la clave '{1}'.
fr: L'utilisation de la clé '{0}' nécessite la présence de la clé '{1}'.
it: L'utilizzo della chiave "{0}" richiede la presenza della chiave "{1}".
ja: '{0}' キーを使用するには、キーとして '{1}' が指定されている必要があります。
ko: 키 '{0}'을(를) 사용하려면 키 '{1}'이(가) 있어야 합니다.
pt_br: O uso da chave '{0}' requer a presença da chave '{1}'.
ru: Использование ключа "{0}" требует наличия ключа "{1}".
zh_hans: 使用键“{0}”要求存在键“{1}”。
zh_hant: 必須要顯示索引鍵 '{1}' 才能使用索引鍵 '{0}'。

# ADP_InvalidConnectionOptionValueLength
source: The value's length for key '{0}' exceeds it's limit of '{1}'.
de: Die Wertlänge des Schlüssels '{0}' überschreitet dessen Grenzwert '{1}'.
es: La longitud del valor para la clave '{0}' supera su límite de '{1}'.
fr: La longueur de la valeur de la clé '{0}' dépasse sa limite fixée à '{1}'.
it: La lunghezza del valore per la chiave "{0}" supera il limite di "{1}".
ja: キー '{0}' の値の長さが、上限の '{1}' を超えています。
ko: 키 '{0}'에 대한 값의 길이가 한계인 '{1}'을(를) 초과합니다.
pt_br: O comprimento do argumento para a chave '{0}' excede o limite de '{1}'.
ru: Длина значения для ключа "{0}" превышает его ограничение, установленное для "{1}".
zh_hans: 键“{0}”值的长度超出了“{1}”的限制。
zh_hant: 索引鍵 '{0}' 的長度超過其上限 '{1}'。

# ADP_KeywordNotSupported
source: Keyword not supported: '{0}'.
de: Schlüsselwort wird nicht unterstützt: '{0}'.
es: Palabra clave no admitida: '{0}'.
fr: Mot clé non pris en charge : « {0} ».
it: Parola chiave non supportata: '{0}'.
ja: キーワード '{0}' はサポートされていません。
ko: 지원되지 않는 키워드입니다: '{0}'.
pt_br: Palavra-chave não suportada: '{0}'.
ru: Ключевое слово не поддерживается: "{0}".
zh_hans: 不支持的关键字:“{0}”。
zh_hant: 不支援關鍵字: '{0}'。

# ADP_UdlFileError
source: Unable to load the UDL file.
de: UDL-Datei konnte nicht geladen werden.
es: No se puede cargar el archivo UDL.
fr: Impossible de charger le fichier UDL.
it: Impossibile caricare il file UDL.
ja: UDL ファイルを読み込めません。
ko: UDL 파일을 로드할 수 없습니다.
pt_br: Não é possível carregar o arquivo UDL.
ru: Не удалось загрузить файл UDL.
zh_hans: 无法加载 UDL 文件。
zh_hant: 無法載入 UDL 檔案。

# ADP_InvalidUDL
source: Invalid UDL file.
de: Ungültige UDL-Datei.
es: Archivo UDL no válido.
fr: Fichier UDL non valide.
it: File UDL non valido.
ja: 無効な UDL ファイルです。
ko: 잘못된 UDL 파일입니다.
pt_br: Arquivo UDL inválido.
ru: Недопустимый файл UDL.
zh_hans: 无效的 UDL 文件。
zh_hant: 無效的 UDL 檔案。
