Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataAdapter_FillError
source: Event triggered when a recoverable error occurs during Fill.
de: Ereignis, das ausgelöst wird, wenn während Fill ein wiederherstellbarer Fehler auftritt.
es: Evento que se desencadena cuando se produce un error recuperable durante Fill.
fr: Événement déclenché lorsqu'une erreur récupérable se produit lors d'un remplissage (Fill).
it: Evento generato quando si verifica un errore risolvibile durante un'operazione Fill.
ja: Fill を実行中に修復可能なエラーが発生したときにイベントが発生します。
ko: Fill을 사용하는 동안 복구할 수 있는 오류가 발생할 때 이벤트가 트리거됩니다.
pt_br: Evento disparado quando um erro recuperável ocorre durante Fill.
ru: Событие создается при возникновении устранимой ошибки во время использования метода Fill.
zh_hans: Fill 期间发生可恢复错误时将触发的事件。
zh_hant: 在 Fill 期間若發生可復原的錯誤時觸發的事件。

# DataAdapter_ReturnProviderSpecificTypes
source: Should Fill return provider specific values or common CLSCompliant values.
de: Gibt an, ob Fill providerspezifische Werte oder allgemeine CLSCompliant-Werte zurückgeben soll.
es: Debe Fill devolver valores específicos del proveedor o valores CLSCompliant comunes.
fr: Indique si Fill doit retourner les valeurs propres au fournisseur ou les valeurs CLSCompliant communes.
it: Indica se Fill restituisce valori specifici del provider oppure valori comuni conformi a CLSCompliant.
ja: Fill は、プロバイダー固有の値と共通の CLSCompliant の値のどちらかを返します。
ko: Fill에서 공급자 관련 값 또는 공용 CLSCompliant 값을 반환해야 합니다.
pt_br: Caso Fill retorne valores específicos do provedor ou valores de CLSCompliant comuns.
ru: Должен Fill возвращать особые значения поставщика или обычные значения CLSCompliant.
zh_hans: Fill 应返回提供程序特定值还是普通 CLSCompliant 值。
zh_hant: Fill 應傳回給提供者特定值或一般 CLSCompliant 值。

# DataColumnMapping_SourceColumn
source: Source column name - case sensitive.
de: Quellspaltenname - Groß-/Kleinschreibung wird beachtet.
es: Nombre de la columna de origen- distinguir mayúsculas y minúsculas.
fr: Nom de la colonne source - respecte la casse.
it: Nome colonna di origine (con distinzione tra maiuscole e minuscole).
ja: ソース列名 - 大文字と小文字を区別します。
ko: 원본 열 이름 - 대/소문자 구분
pt_br: Nome da coluna de origem - diferencia maiúsculas de minúsculas.
ru: Имя исходного столбца - с учетом регистра.
zh_hans: 源列名称 - 区分大小写。
zh_hant: 來源資料行名稱 - 區分大小寫。

# DataColumnMappings_Count
source: The number of items in the collection
de: Anzahl der Elemente in der Sammlung
es: Número de elementos en la colección
fr: Le nombre d'éléments dans la collection
it: Numero di elementi contenuti nella raccolta
ja: コレクション内の項目数です。
ko: 컬렉션의 항목 수입니다.
pt_br: Número de itens na coleção
ru: Число элементов в данной коллекции
zh_hans: 集合中项的数目
zh_hant: 集合中的項目數目

# DataColumnMappings_Item
source: The specified DataColumnMapping object.
de: Angegebenes DataColumnMapping-Objekt.
es: Objeto DataColumnMapping especificado.
fr: L'objet DataColumnMapping spécifié.
it: Oggetto DataColumnMapping specificato.
ja: 指定された DataColumnMapping オブジェクトです。
ko: 지정된 DataColumnMapping 개체입니다.
pt_br: O objeto DataColumnMapping especificado.
ru: Указанный объект DataColumnMapping.
zh_hans: 指定的 DataColumnMapping 对象。
zh_hant: 指定的 DataColumnMapping 物件。

# DataTableMapping_ColumnMappings
source: Individual columns mappings when this table mapping is matched.
de: Individuelle Spaltenzuordnungen, wenn diese Tabellenzuordnung übereinstimmt.
es: Asignaciones de columnas individuales cuando coincide esta asignación de tabla.
fr: Mappages de colonnes individuelles lorsqu'une correspondance de ce mappage de table est identifiée.
it: Mapping di singole colonne quando esiste una corrispondenza per il mapping della tabella.
ja: このテーブル マップが一致するときのコラム別のマップです。
ko: 이 테이블 매핑이 일치할 때의 개별 열 매핑입니다.
pt_br: Mapeamento de colunas individuais quando há correspondência do mapeamento da coluna.
ru: Сопоставления отдельных столбцов при соответствии сопоставления этой таблицы.
zh_hans: 匹配此表映射时的各个列映射。
zh_hant: 當符合這個資料表的對應時，以個別資料行的方式對應。

# DataTableMapping_SourceTable
source: The DataTableMapping source table name. This name is case sensitive.
de: Der DataTableMapping-Quelltabellenname. Für diesen Namen muss die Groß-/Kleinschreibung beachtet werden.
es: El nombre de la tabla origen DataTableMapping. Este nombre distingue mayúsculas y minúsculas.
fr: Le nom de table source DataTableMapping. Ce nom respecte la casse.
it: Nome della tabella di origine di DataTableMapping. Distingue tra maiuscole e minuscole.
ja: DataTableMapping ソース テーブル名です。この名前は、大文字小文字を区別します。
ko: DataTableMapping 소스 테이블 이름이며 대/소문자를 구분합니다.
pt_br: O nome da tabela de origem DataTableMapping. Este nome diferencia maiúsculas e minúsculas.
ru: Имя исходной таблицы DataTableMapping. Это имя задается с учетом регистра.
zh_hans: DataTableMapping 源表名称。该名称区分大小写。
zh_hant: DataTableMapping 來源資料表名稱。這個名稱有區分大小寫。

# DataTableMappings_Count
source: The number of items in the collection
de: Anzahl der Elemente in der Sammlung
es: Número de elementos en la colección
fr: Le nombre d'éléments dans la collection
it: Numero di elementi contenuti nella raccolta
ja: コレクション内の項目数です。
ko: 컬렉션의 항목 수입니다.
pt_br: Número de itens na coleção
ru: Число элементов в данной коллекции
zh_hans: 集合中项的数目
zh_hant: 集合中的項目數目

# DataTableMappings_Item
source: The specified DataTableMapping object
de: Das angegebene DataTableMapping-Objekt.
es: Objeto especificado DataTableMapping
fr: L'objet DataTableMapping spécifié
it: Oggetto DataTableMapping specificato.
ja: 指定された DataTableMapping オブジェクトです。
ko: 지정된 DataTableMapping 개체입니다.
pt_br: O objeto DataTableMapping especificado
ru: Указанный объект DataTableMapping
zh_hans: 指定的 DataTableMapping 对象
zh_hant: 指定的 DataTableMapping 物件

# DbDataAdapter_DeleteCommand
source: Used during Update for deleted rows in DataSet.
de: Wird verwendet bei Update für gelöschte Zeilen im DataSet.
es: Se emplea durante Update para filas eliminadas en DataSet.
fr: Utilisé lors de la mise à jour (Update) pour les lignes supprimées dans DataSet.
it: Utilizzato durante l'aggiornamento per le righe eliminate dal DataSet.
ja: DataSet の削除された行の更新中に使用されます。
ko: DataSet의 삭제된 행을 업데이트하는 동안 사용됩니다.
pt_br: Usado durante a atualização de linhas excluídas no DataSet.
ru: Используется при обновлении для удаленных строк в DataSet.
zh_hans: Update 期间用于 DataSet 中的已删除行。
zh_hant: 在 DataSet 中對已刪除的資料列進行 Update 時使用。

# DbDataAdapter_InsertCommand
source: Used during Update for new rows in DataSet.
de: Wird verwendet bei Update für neue Zeilen im DataSet.
es: Se emplea durante Update para las nuevas filas de DataSet.
fr: Utilisé lors de la mise à jour (Update) pour les nouvelles lignes du DataSet.
it: Utilizzato durante l'aggiornamento per le nuove righe del DataSet.
ja: DataSet の新しい行の更新時に使用されます。
ko: DataSet의 새 행을 업데이트하는 동안 사용됩니다.
pt_br: Usado durante a atualização para novas linhas no DataSet.
ru: Используется при обновлении для новых строк в DataSet.
zh_hans: Update 期间用于 DataSet 中的新行。
zh_hant: 在 DataSet 中對新增的資料列進行 Update 時使用。

# DbDataAdapter_SelectCommand
source: Used during Fill/FillSchema.
de: Verwendet während Fill/FillSchema.
es: Utilizado durante Fill/FillSchema.
fr: Utilisé lors de Fill/FillSchema.
it: Utilizzato durante le operazioni di Fill e FillSchema.
ja: Fill/FillSchema 時に使用されます。
ko: Fill/FillSchema 시 사용됩니다.
pt_br: Usado durante Fill/FillSchema.
ru: Используется при выполнении Fill/FillSchema.
zh_hans: 在 Fill/FillSchema 期间使用。
zh_hant: 在進行 Fill/FillSchema 時使用。

# DbDataAdapter_UpdateCommand
source: Used during Update for modified rows in DataSet.
de: Wird bei dem Update für geänderte Zeilen im DataSet verwendet.
es: Se emplea durante Update para las filas modificadas en DataSet.
fr: Utilisé lors de la mise à jour (Update) pour les lignes modifiées dans DataSet.
it: Utilizzato durante l'aggiornamento per le righe modificate nel DataSet.
ja: DataSet の変更された行の更新時に使用されます。
ko: DataSet의 수정된 행에 대한 Update 시 사용됩니다.
pt_br: Usado durante a atualização para linhas modificadas no DataSet.
ru: Используется при обновлении для измененных строк в DataSet.
zh_hans: Update 期间用于 DataSet 中已修改的行。
zh_hant: 在 DataSet 中對已修改的資料列進行 Update 時使用。

# DbDataAdapter_RowUpdated
source: Event triggered before every DataRow during Update.
de: Das Ereignis, das während des Updates vor jeder DataRow ausgelöst wird.
es: Evento que se desencadena antes de cada DataRow durante Update.
fr: Événement déclenché avant chaque DataRow lors de la mise à jour (Update).
it: Evento generato prima di ogni DataRow durante un'operazione di aggiornamento.
ja: 更新中のすべての DataRowRow の前にイベントが発生します。
ko: 업데이트하는 동안 각 DataRow 전에 이벤트가 트리거됩니다.
pt_br: Evento disparado antes de cada DataRow durante a atualização.
ru: Событие создается перед каждым DataRow во время обновления.
zh_hans: Update 期间在每个 DataRow 之前触发的事件。
zh_hant: 在對每個 DataRow 進行 Update 之前觸發的事件。

# DbDataAdapter_RowUpdating
source: Event triggered after every DataRow during Update.
de: Das Ereignis, das während des Updates nach jeder DataRow ausgelöst wird.
es: Evento que se desencadena después de cada DataRow durante Update.
fr: Événement déclenché après chaque DataRow lors de la mise à jour (Update).
it: Evento generato dopo ogni DataRow durante un'operazione di aggiornamento.
ja: 更新中のすべての DataRowRow の後にイベントが発生します。
ko: 업데이트하는 동안 각 DataRow 다음에 이벤트가 트리거됩니다.
pt_br: Evento disparado depois de cada DataRow durante a atualização.
ru: Событие создается после каждого DataRow во время обновления.
zh_hans: Update 期间在每个 DataRow 之后触发的事件。
zh_hant: 在對每個 DataRow 進行 Update 之後觸發的事件。

# DbDataAdapter_UpdateBatchSize
source: Number of rows to batch together before executing against the data source.
de: Die Anzahl der Zeilen, die in einem Batch zusammengefasst werden, vor der Anwendung des Befehls auf die Datenquelle.
es: Número de filas que se deben procesar juntas por lotes antes de ejecutarlas en el origen de datos.
fr: Nombre de lignes à traiter par lots simultanément avant l'exécution pour la source de données.
it: Numero di righe da riunire in batch prima di eseguirle sull'origine dati.
ja: データ ソースに対して実行される前に同時にバッチ処理される行の数です。
ko: 데이터 원본에 대해 실행하기 전에 함께 일괄 처리할 행 수입니다.
pt_br: Número de linhas a serem juntadas em lote antes da execução na fonte de dados.
ru: Количество строк, которые необходимо сгруппировать перед выполнением по отношению к источнику данных.
zh_hans: 在数据源上执行之前要一起组成批的行数。
zh_hant: 執行前一同批次作業的資料列數與資料來源不符。

# DbTable_Connection
source: Connection used if the the Select/Insert/Update/DeleteCommands do not already have a connection.
de: Verwendete Verbindung, wenn die 'Select/Insert/Update/DeleteCommands' nicht bereits über eine Verbindung verfügen.
es: Conexión utilizada si Select/Insert/Update/DeleteCommands no tienen todavía una conexión.
fr: Connexion utilisée si les commandes Select/Insert/Update/DeleteCommands n'en possèdent pas encore.
it: Connessione utilizzata se i comandi Select/Insert/Update/DeleteCommands non dispongono ancora di una connessione.
ja: Select/Insert/Update/DeleteCommands に接続が指定されていない場合に、使用される接続です。
ko: Select/Insert/Update/DeleteCommands에 연결이 없는 경우 사용되는 연결입니다.
pt_br: Conexão usada em Select/Insert/Update/DeleteCommands ainda não tem uma conexão.
ru: Подключение, которое используется, если у команд Select/Insert/Update/DeleteCommands еще нет подключения.
zh_hans: Select/Insert/Update/DeleteCommands 尚未拥有连接时将使用的连接。
zh_hant: 若 Select/Insert/Update/DeleteCommands 尚未連接時，會使用連接。

# DbTable_DeleteCommand
source: Used during Update for deleted rows in the DataTable.
de: Wird während Update für gelöschte Zeilen in der DataTable verwendet.
es: Se emplea durante Update para las filas eliminadas en DataTable.
fr: Utilisé lors de la mise à jour pour les lignes supprimées du DataTable.
it: Utilizzato durante Update per le righe eliminate nel DataTable.
ja: DataTable 内の削除された行に対する Update の処理中に使用されます。
ko: DataTable의 삭제된 행에 대한 Update 시 사용됩니다.
pt_br: Usado durante Update de linhas excluídas no DataTable.
ru: Используется при обновлении для удаленных строк в DataTable.
zh_hans: Update 期间用于 DataTable 中已删除的行。
zh_hant: 在 DataTable 中對已刪除的資料列進行 Update 時使用。

# DbTable_InsertCommand
source: Used during Update for new rows in the DataTable.
de: Wird während Update für neue Zeilen in der DataTable verwendet.
es: Se emplea durante Update para las nuevas filas de DataTable.
fr: Utilisé lors de Update pour les nouvelles lignes du DataTable.
it: Utilizzato durante Update per le nuove righe nel DataTable.
ja: DataTable 内の新しい行に対する Update の処理中に使用されます。
ko: DataTable의 새 행에 대한 Update 시 사용됩니다.
pt_br: Usado durante Update de novas linhas no DataTable.
ru: Используется при операции Update для новых строк в DataTable.
zh_hans: Update 期间用于 DataTable 中的新行。
zh_hant: 在 DataTable 中對新增的資料列進行 Update 時使用。

# DbTable_SelectCommand
source: Used during Fill.
de: Wird während Fill verwendet.
es: Utilizado durante Fill.
fr: Utilisé lors de Fill.
it: Utilizzato durante le operazioni di Fill.
ja: Fill の処理中に使用されます。
ko: Fill 시 사용됩니다.
pt_br: Usado durante Fill.
ru: Используется при выполнении Fill.
zh_hans: Fill 期间使用。
zh_hant: 用於 Fill 時。

# DbTable_UpdateCommand
source: Used during Update for modified rows in the DataTable.
de: Wird während Update für geänderte Zeilen in der DataTable verwendet.
es: Se emplea durante Update para las filas modificadas en DataTable.
fr: Utilisé lors de Update pour les lignes modifiées du DataTable.
it: Utilizzato durante Update per le righe modificate nel DataTable.
ja: DataTable 内の変更された行に対する Update の処理中に使用されます。
ko: DataTable의 수정된 행에 대한 Update 시 사용됩니다.
pt_br: Usado durante Update de linhas modificadas no DataTable.
ru: Используется при выполнении Update для измененных строк в DataTable.
zh_hans: Update 期间用于 DataTable 中已修改的行。
zh_hant: 在 DataTable 中對已修改的資料列進行 Update 時使用。

# DbTable_ReturnProviderSpecificTypes
source: Should Fill return provider specific values or common CLSCompliant values.
de: Gibt an, ob Fill providerspezifische Werte oder allgemeine CLSCompliant-Werte zurückgeben soll.
es: Debe Fill devolver valores específicos del proveedor o valores CLSCompliant comunes.
fr: Indique si Fill doit retourner les valeurs propres au fournisseur ou les valeurs CLSCompliant communes.
it: Indica se Fill restituisce valori specifici del provider oppure valori comuni conformi a CLSCompliant.
ja: Fill は、プロバイダー固有の値と共通の CLSCompliant の値のどちらかを返します。
ko: Fill에서 공급자 관련 값 또는 공용 CLSCompliant 값을 반환해야 합니다.
pt_br: Caso Fill retorne valores específicos do provedor ou valores de CLSCompliant comuns.
ru: Должен Fill возвращать особые значения поставщика или обычные значения CLSCompliant.
zh_hans: Fill 应返回提供程序特定值还是普通 CLSCompliant 值。
zh_hant: Fill 應傳回給提供者特定值或一般 CLSCompliant 值。

# DbTable_TableMapping
source: How to map source table to DataTable.
de: Zuordnen der Quelltabelle zur DataTable.
es: Cómo asignar la tabla de origen a DataTable.
fr: Indique la manière dont une table source doit être mappée vers DataTable.
it: Indica come mappare la tabella di origine a DataTable.
ja: ソース テーブルを DataTable にマップする方法を示します。
ko: 원본 테이블을 DataTable에 매핑하는 방법입니다.
pt_br: Como mapear a tabela de origem para DataTable.
ru: Как исходная таблица отображается в DataTable.
zh_hans: 如何将源表映射到 DataTable。
zh_hant: 如何將來源資料表對應至 DataTable。

# DbTable_ConflictDetection
source: How are the Insert/Update/DeleteCommands generated when not set by the user.
de: Legt fest, wie die Befehle Insert/Update/DeleteCommands generiert werden, wenn diese nicht vom Benutzer festgelegt werden.
es: Cómo se generan Insert/Update/DeleteCommands cuando no han sido establecidos por el usuario.
fr: Indique la manière dont les Insert/Update/DeleteCommands sont générées lorsqu'elles ne sont pas définies par l'utilisateur.
it: Indica il modo in cui vengono generati i comandi Insert/Update/DeleteCommands se non è stato impostato dall'utente.
ja: ユーザーにより設定されていない場合に、Insert/Update/DeleteCommands が生成される方法を示します。
ko: 사용자가 설정하지 않은 경우 Insert/Update/DeleteCommands가 생성되는 방법입니다.
pt_br: Como os comandos Insert/Update/DeleteCommands são gerados quando o usuário não os define.
ru: Как создаются команды Insert/Update/DeleteCommands, если они не определены пользователем.
zh_hans: 用户未设置时生成 Insert/Update/DeleteCommands 的方式。
zh_hant: 當使用者未設定時，如何產生 Insert/Update/DeleteCommands。

# DbTable_UpdateBatchSize
source: Number of rows to batch together before executing against the data source.
de: Die Anzahl der Zeilen, die in einem Batch zusammengefasst werden, vor der Anwendung des Befehls auf die Datenquelle.
es: Número de filas que se deben procesar juntas por lotes antes de ejecutarlas en el origen de datos.
fr: Nombre de lignes à traiter par lots simultanément avant l'exécution pour la source de données.
it: Numero di righe da riunire in batch prima di eseguirle sull'origine dati.
ja: データ ソースに対して実行される前に同時にバッチ処理される行の数です。
ko: 데이터 원본에 대해 실행하기 전에 함께 일괄 처리할 행 수입니다.
pt_br: Número de linhas a serem juntadas em lote antes da execução na fonte de dados.
ru: Количество строк, которые необходимо сгруппировать перед выполнением по отношению к источнику данных.
zh_hans: 在数据源上执行之前要一起组成批的行数。
zh_hant: 執行前一同批次作業的資料列數與資料來源不符。

# DbConnectionString_ConnectionString
source: The connection string used to connect to the Data Source.
de: Die Verbindungszeichenfolge zum Herstellen einer Verbindung mit der Datenquelle.
es: Cadena de conexión utilizada para conectar con el origen de datos.
fr: Chaîne de connexion utilisée pour la connexion à la source de données.
it: Stringa di connessione utilizzata per la connessione a Data Source.
ja: Data Source への接続に使用される接続文字列です。
ko: Data Source에 연결하는 데 사용되는 연결 문자열입니다.
pt_br: A cadeia de conexão usada para conectar à Data Source.
ru: Строка подключения, используемая для подключения к источнику данных Data Source.
zh_hans: 用于连接 Data Source 的连接字符串。
zh_hant: 用於連接至 Data Source 的連接字串。

# DbConnectionString_Driver
source: The name of the ODBC Driver to use when connecting to the Data Source.
de: Der Name des zum Herstellen einer Verbindung mit der Data Source zu verwendenden ODBC-Treibers.
es: Nombre del controlador ODBC que se debe utilizar al conectar con el Data Source.
fr: Nom du pilote ODBC à utiliser lors d'une connexion au Data Source.
it: Nome del driver ODBC da utilizzare per la connessione a Data Source.
ja: Data Source への接続時に使用される ODBC ドライバーの名前を示します。
ko: Data Source에 연결할 때 사용할 ODBC 드라이버의 이름입니다.
pt_br: O nome do driver ODBC a ser usado na conexão com o Data Source.
ru: Имя драйвера ODBC, который следует использовать для подключения к источнику данных Data Source.
zh_hans: 连接到 Data Source 时要使用的 ODBC 驱动程序的名称。
zh_hant: 當連接至 Data Source 所用的 ODBC Driver 名稱。

# DbConnectionString_DSN
source: The DSN to use when connecting to the Data Source.
de: Der zum Herstellen einer Verbindung mit der Data Source zu verwendende DSN-Name.
es: DSN que se debe utilizar al conectar con el Data Source.
fr: DSN à utiliser lors d'une connexion au Data Source.
it: DSN da utilizzare per la connessione a Data Source.
ja: Data Source への接続時に使用される DSN を示します。
ko: Data Source에 연결할 때 사용할 DSN입니다.
pt_br: O DSN usado para conectar ao Data Source.
ru: Имя источника данных DSN, которое следует использовать для подключения к источнику данных Data Source.
zh_hans: 连接到 Data Source 时要使用的 DSN。
zh_hant: 當連接至 Data Source 所用的 DSN。

# DbConnectionString_AdoNetPooler
source: When true, indicates that managed connection pooling should be used.
de: Gibt, falls wahr, an, dass das verwaltete Verbindungspooling verwendet werden soll.
es: Cuando el valor es true, indica la agrupación de conexiones administradas que se debe utilizar.
fr: Lorsque sa valeur est true, indique que le regroupement de connexions managé doit être utilisé.
it: Se il valore è true, indica che è necessario utilizzare un pool di connessioni gestito.
ja: True の場合は、管理下にある接続プールが使用されることを示します。
ko: true인 경우 관리되는 연결 풀링이 사용됨을 나타냅니다.
pt_br: Se for true, indica que pool de conexão gerenciado deve ser usado.
ru: Когда true (истина), то указывает, что необходимо использовать управляемую группировку подключений.
zh_hans: 如果为 True，则指示应使用托管连接池。
zh_hant: 當 True 時，表示應使用管理連接集區。

# DbConnectionString_FileName
source: The UDL file to use when connecting to the Data Source.
de: Die bei Herstellung einer Verbindung mit der Data Source zu verwendende UDL-Datei.
es: Archivo UDL que se debe utilizar al conectar con el Data Source.
fr: Fichier UDL à utiliser lors d'une connexion au Data Source.
it: File UDL da utilizzare per la connessione a Data Source.
ja: Data Source への接続時に使用される UDL ファイルを示します。
ko: Data Source에 연결할 때 사용할 UDL 파일입니다.
pt_br: O arquivo UDL usado para conectar ao Data Source.
ru: Файл UDL, который следует использовать для подключения к источнику данных Data Source.
zh_hans: 连接到 Data Source 时使用的 UDL 文件。
zh_hant: 當連接至 Data Source 所用的 UDL 檔案。

# DbConnectionString_OleDbServices
source: Specifies which OLE DB Services to enable or disable with the OleDb Provider.
de: Gibt an, welche OLE DB Services mit dem OleDb Provider aktiviert oder deaktiviert werden sollen.
es: Especifica los OLE DB Services que se van a habilitar o deshabilitar con el OleDb Provider.
fr: Spécifie les OLE DB Services à activer ou à désactiver avec le OleDb Provider.
it: Specifica quali OLE DB Services attivare o disabilitare con OleDb Provider.
ja: この OleDb Provider で有効または無効にされる OLE DB Services を示します。
ko: OleDb Provider에서 OLE DB Services를 활성화거나 비활성화할지 여부를 지정합니다.
pt_br: Especifica que OLE DB Services deve ser habilitado ou desabilitado com o OleDb Provider.
ru: Указывает, какие службы OLE DB Services необходимо включить или выключить с поставщиком OleDb Provider.
zh_hans: 指定使用 OleDb Provider 时启用或禁用的 OLE DB Services。
zh_hant: 指定要啟用的 OLE DB Services 或使用 OleDb Provider 來停用它。

# DbConnectionString_Provider
source: The name of the OLE DB Provider to use when connecting to the Data Source.
de: Der Name des zum Herstellen einer Verbindung mit der Data Source zu verwendenden OLE DB-Providers.
es: Nombre del proveedor OLE DB que se debe utilizar para conectar con el Data Source.
fr: Nom du fournisseur OLE DB à utiliser lors d'une connexion au Data Source.
it: Nome del provider OLE DB da utilizzare per la connessione a Data Source.
ja: Data Source への接続時に使用される OLE DB プロバイダーの名前を示します。
ko: Data Source에 연결할 때 사용할 OLE DB 공급자의 이름입니다.
pt_br: O nome do Provedor OLE DB a ser usado na conexão com o Data Source.
ru: Имя поставщика OLE DB, который следует использовать для подключения к источнику данных Data Source.
zh_hans: 连接到 Data Source 时要使用的 OLE DB 提供程序名。
zh_hant: 當連接至 Data Source 時所用的 OLE DB Provider 名稱。

# DbConnectionString_ApplicationName
source: The name of the application.
de: Der Name der Anwendung.
es: El nombre de la aplicación.
fr: Le nom de l'application.
it: Nome dell'applicazione.
ja: アプリケーションの名前。
ko: 애플리케이션의 이름입니다.
pt_br: O nome do aplicativo.
ru: Имя приложения.
zh_hans: 应用程序的名称。
zh_hant: 應用程式的名稱。

# DbConnectionString_AsynchronousProcessing
source: When true, enables usage of the Asynchronous functionality in the .NET Framework Data Provider.
de: Bei Festlegung auf TRUE wird die Verwendung der asynchronen Funktionalität im .NET Framework-Datenanbieter aktiviert.
es: Cuando el valor es true, se puede usar la funcionalidad asincrónica en el proveedor de datos .NET Framework.
fr: Quand la valeur est true, active l'utilisation de la fonctionnalité asynchrone du fournisseur de données .NET Framework.
it: Se il valore è true, consente l'utilizzo della funzionalità asincrona nel provider di dati .NET Framework.
ja: True の場合は、.NET Framework データ プロバイダーの非同期機能を使用できるようになります。
ko: true인 경우 .NET Framework 데이터 공급자에서 비동기 기능의 사용을 활성화합니다.
pt_br: Quando é true, permite o uso da funcionalidade Assíncrona no Provedor de Dados .NET Framework.
ru: При значении true (истина) позволяет использовать асинхронные функции в поставщике данных .NET Framework.
zh_hans: 如果为 True，则启用 .NET Framework 数据提供程序中的异步功能。
zh_hant: 若為 true，則允許在 .NET Framework Data Provider 中使用 Asynchronous 功能。
