Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataColumns_OutOfRange
source: Cannot find column {0}.
de: Spalte {0} wurde nicht gefunden.
es: No se puede encontrar la columna {0}.
fr: Impossible de trouver la colonne {0}.
it: Impossibile trovare la colonna {0}.
ja: 列 {0} が見つかりません。
ko: {0} 열을 찾을 수 없습니다.
pt_br: Não é possível encontrar a coluna {0}.
ru: Невозможно найти столбец {0}.
zh_hans: 无法找到列 {0}。
zh_hant: 找不到資料行 {0}。

# DataColumns_Add1
source: Column '{0}' already belongs to this DataTable.
de: Spalte '{0}' gehört bereits zu dieser DataTable.
es: La columna '{0}' ya pertenece a esta DataTable.
fr: La colonne '{0}' appartient déjà à ce DataTable.
it: La colonna '{0}' appartiene già a questa DataTable.
ja: 列 '{0}' は既にこの DataTable に属しています。
ko: '{0}' 열은 이미 현재 DataTable에 속해 있습니다.
pt_br: A coluna '{0}' já pertence a esta DataTable.
ru: Столбец "{0}" уже принадлежит этому DataTable.
zh_hans: 列“{0}”已属于此 DataTable。
zh_hant: 資料行 '{0}' 已經屬於這個 DataTable。

# DataColumns_Add2
source: Column '{0}' already belongs to another DataTable.
de: Spalte '{0}' gehört bereits zu einer anderen DataTable.
es: La columna '{0}' ya pertenece a otra DataTable.
fr: La colonne '{0}' appartient déjà à un autre DataTable.
it: La colonna '{0}' appartiene già a un'altra DataTable.
ja: 列 '{0}' は既に別の DataTable に属しています。
ko: '{0}' 열은 이미 다른 DataTable에 속해 있습니다.
pt_br: A coluna '{0}' já pertence a outra DataTable.
ru: Столбец "{0}" уже принадлежит другому DataTable.
zh_hans: 列“{0}”已属于另一个 DataTable。
zh_hant: 資料行 '{0}' 已經屬於其他 DataTable。

# DataColumns_Add3
source: Cannot have more than one SimpleContent columns in a DataTable.
de: Eine DataTable kann nur eine SimpleContent-Spalte enthalten.
es: No puede haber más de una columna SimpleContent en DataTable.
fr: Impossible d'avoir plus d'une colonne SimpleContent dans un DataTable.
it: Impossibile avere più di una colonna SimpleContent in una DataTable.
ja: DataTable に 2 つ以上の SimpleContent 列を設定することはできません。
ko: DataTable에 SimpleContent 열이 둘 이상 포함될 수 없습니다.
pt_br: Não é possível haver mais de uma coluna SimpleContent em uma DataTable.
ru: DataTable не может содержать несколько столбцов SimpleContent.
zh_hans: 不能在 DataTable 中包含一个以上的 SimpleContent 列。
zh_hant: 在 DataTable 中不可以有一個以上的 SimpleContent 資料行。

# DataColumns_Add4
source: Cannot add a SimpleContent column to a table containing element columns or nested relations.
de: Eine SimpleContent-Spalte kann nicht zu einer Tabelle mit Elementspalten oder geschachtelten Beziehungen hinzugefügt werden.
es: No se puede agregar una columna SimpleContent a una tabla que contenga columnas de elementos o relaciones anidadas.
fr: Impossible d'ajouter une colonne SimpleContent à une table contenant des colonnes d'éléments ou des relations imbriquées.
it: Impossibile aggiungere una colonna SimpleContent a una tabella contenente colonne di elementi o relazioni annidate.
ja: SimpleContent 列を、要素列または入れ子にされたリレーションシップを含むテーブルには追加できません。
ko: 요소 열 또는 중첩 관계를 포함하는 테이블에 SimpleContent 열을 추가할 수 없습니다.
pt_br: Não é possível adicionar uma coluna SimpleContent a uma tabela que contém colunas de elementos ou relações aninhadas.
ru: Невозможно добавить столбец SimpleContent к таблице со столбцами элементов или вложенными отношениями.
zh_hans: 无法将 SimpleContent 列添加到包含元素列或嵌套关系的表中。
zh_hant: 無法將 SimpleContent 資料行加入至含有元素資料行或巢狀關聯的資料表。

# DataColumns_AddDuplicate
source: A column named '{0}' already belongs to this DataTable.
de: Eine Spalte names '{0}' gehört bereits zu dieser DataTable.
es: La columna '{0}' ya pertenece a DataTable.
fr: Une colonne nommée '{0}' appartient déjà à ce DataTable.
it: Una colonna denominata '{0}' appartiene già a questa DataTable.
ja: '{0}' という列は既にこの DataTable に属しています。
ko: 이름이 '{0}'인 열이 이 DataTable에 이미 속해 있습니다.
pt_br: Uma coluna chamada '{0}' já pertence a esta DataTable.
ru: Столбец с именем "{0}" уже принадлежит этому DataTable.
zh_hans: 名为“{0}”的列已属于此 DataTable。
zh_hant: 這個 DataTable 已經有名稱為 '{0}' 的資料行。

# DataColumns_AddDuplicate2
source: Cannot add a column named '{0}': a nested table with the same name already belongs to this DataTable.
de: Spalte '{0}' konnte nicht hinzugefügt werden: eine verschachtelte Tabelle mit demselben Namen gehört bereits zu dieser Tabelle 'DataTable'.
es: No se puede agregar la columna llamada '{0}': esta tabla DataTable ya contiene una tabla anidada con el mismo nombre.
fr: Impossible d'ajouter une colonne nommée '{0}' : un tableau imbriqué avec le même nom appartient déjà à ce DataTable.
it: Impossibile aggiungere colonna con nome '{0}': una tabella annidata con lo stesso nome appartiene già alla DataTable corrente.
ja: '{0}' という列を追加できません。: 同じ名前の、入れ子にされたテーブルが既にこの DataTable に属しています。
ko: 이름이 '{0}'인 열을 추가할 수 없습니다. 같은 이름의 중첩 테이블이 이미 이 DataTable에 속해 있습니다.
pt_br: Não é possível adicionar uma coluna chamada '{0}': uma tabela aninhada com o mesmo nome já pertence a esta DataTable.
ru: Не удалось добавить столбец с именем "{0}": вложенная таблица с таким именем уже принадлежит этому DataTable.
zh_hans: 无法添加名为“{0}”的列: 此 DataTable 中已存在同名的嵌套表。
zh_hant: 無法加入名為 '{0}' 的資料行: 這個 DataTable 已經有同名的巢狀資料表。

# DataColumns_AddDuplicate3
source: A column named '{0}' already belongs to this DataTable: cannot set a nested table name to the same name.
de: Spalte '{0}' gehört bereits zu dieser Tabelle 'DataTable'. Ein verschachtelter Tabellenname kann für denselben Namen nicht festgelegt werden.
es: Esta tabla DataTable ya contiene una columna llamada '{0}' : no se puede utilizar el mismo nombre en una tabla anidada.
fr: Une colonne nommée '{0}' appartient déjà à ce DataTable : impossible de définir un nom de tableau imbriqué avec ce même nom.
it: Una colonna con nome '{0}' appartiene già alla DataTable corrente. Impossibile impostare una tabella annidata con lo stesso nome.
ja: '{0}' という列が既にこの DataTable に属しています : 入れ子されたテーブル名を同じ名前に設定できません。
ko: 이름이 '{0}'인 열이 이미 이 DataTable에 속해 있습니다. 중첩 테이블 이름을 같은 이름으로 설정할 수 없습니다.
pt_br: Uma coluna chamada '{0}' já pertence a esta DataTable: não é possível definir um nome de tabela aninhada como o mesmo nome.
ru: Столбец с именем "{0}" уже принадлежит этому DataTable: невозможно присвоить имя вложенной таблицы таблице с тем же именем.
zh_hans: 此 DataTable 中已经有一个名为“{0}”的列: 无法将嵌套表的名称设置为相同的名称。
zh_hant: 這個 DataTable 已經有名為 '{0}' 的資料行: 無法將巢狀資料表名稱設定為相同的名稱。

# DataColumns_Remove
source: Cannot remove a column that doesn't belong to this table.
de: Eine Spalte, die nicht zu dieser Tabelle gehört, kann nicht entfernt werden.
es: No se puede eliminar una columna que no pertenece a esta tabla.
fr: Impossible de supprimer une colonne qui n'appartient pas à cette table.
it: Impossibile rimuovere una colonna che non appartiene a questa tabella.
ja: このテーブルに属していない列を削除することはできません。
ko: 이 테이블에 속하지 않는 열은 제거할 수 없습니다.
pt_br: Não é possível remover uma coluna que não pertence a esta tabela.
ru: Невозможно удалить столбец, не принадлежащий этой таблице.
zh_hans: 不能移除不属于此表的列。
zh_hant: 無法移除不屬於這個資料表的資料行。

# DataColumns_RemovePrimaryKey
source: Cannot remove this column, because it's part of the primary key.
de: Diese Spalte kann nicht entfernt werden, da sie Teil des Primärschlüssels ist.
es: No se puede eliminar esta columna, porque es parte de la clave principal.
fr: Impossible de supprimer cette colonne, car elle fait partie de la clé primaire.
it: Impossibile rimuovere questa colonna, perché è parte della chiave primaria.
ja: この列は、主キーの一部であるため、削除できません。
ko: 이 열은 기본 키의 일부이므로 제거할 수 없습니다.
pt_br: Não é possível remover esta coluna porque ela é parte da chave primária.
ru: Невозможно удалить этот столбец, т.к. он является частью первичного ключа.
zh_hans: 此列是主键的一部分，因此不能移除。
zh_hant: 無法移除這個資料行，因為它是主索引鍵的一部分。

# DataColumns_RemoveChildKey
source: Cannot remove this column, because it is part of the parent key for relationship {0}.
de: Diese Spalte kann nicht entfernt werden, da sie Teil des übergeordneten Schlüssels für den Bezug {0} ist.
es: No se puede eliminar la columna, porque es parte de una clave primaria de la relación {0}.
fr: Impossible de supprimer cette colonne, car elle fait partie de la clé parente pour la relation {0}.
it: Impossibile rimuovere questa colonna, perché è parte della chiave padre della relazione {0}.
ja: この列は、リレーションシップ {0} の親キーの一部になっているため、削除できません。
ko: 이 열은 {0} 관계의 부모 키 일부이므로 제거할 수 없습니다.
pt_br: Não é possível remover esta coluna porque ela é parte da chave pai da relação {0}.
ru: Невозможно удалить этот столбец, т.к. он является частью родительского ключа в отношении {0}.
zh_hans: 此列是关系 {0} 的父键的一部分，因此不能移除。
zh_hant: 無法移除這個資料行，因為它是關聯性 {0} 父索引鍵的一部分。

# DataColumns_RemoveConstraint
source: Cannot remove this column, because it is a part of the constraint {0} on the table {1}.
de: Diese Spalte kann nicht entfernt werden, da sie Teil der Einschränkung {0} für die Tabelle {1} ist.
es: No se puede eliminar esta columna, porque es parte de una restricción {0} en la tabla {1}.
fr: Impossible de supprimer cette colonne, car elle fait partie de la contrainte {0} dans la table {1}.
it: Impossibile rimuovere questa colonna, perché è una parte del vincolo {0} imposto sulla tabella {1}.
ja: この列は、テーブル {1} で制約 {0} の一部であるため、削除できません。
ko: 이 열은 {1} 테이블에서 {0} 제약 조건의 일부이므로 제거할 수 없습니다.
pt_br: Não é possível remover esta coluna porque ela é parte da restrição {0} na tabela {1}.
ru: Невозможно удалить этот столбец, т.к. он является частью ограничения {0} для таблицы {1}.
zh_hans: 此列是表 {1} 的约束 {0} 的一部分，因此不能移除。
zh_hant: 無法移除這個資料行，因為它是資料表 {1} 條件約束 {0} 中的一部分。

# DataColumns_RemoveExpression
source: Cannot remove this column, because it is part of an expression: {0} = {1}.
de: Diese Spalte kann nicht entfernt werden, da sie Teil eines Ausdrucks ist: {0} = {1}.
es: No se puede eliminar esta columna, porque es parte de una expresión: {0} = {1}.
fr: Impossible de supprimer cette colonne, car elle fait partie d'une expression : {0} = {1}.
it: Impossibile rimuovere questa colonna, perché è parte di un'espressione: {0} = {1}.
ja: この列は、式 {0} = {1} の一部であるため、削除できません。
ko: 이 열은 식의 일부이므로 제거할 수 없습니다. {0} = {1}.
pt_br: Não é possível remover esta coluna porque ela é parte de uma expressão: {0} = {1}.
ru: Невозможно удалить этот столбец, т.к. он является частью выражения: {0} = {1}.
zh_hans: 此列是表达式 {0} = {1} 的一部分，因此不能移除。
zh_hant: 無法移除這個資料行，因為它是運算式的一部分: {0} = {1}。

# DataColumn_AutoIncrementAndExpression
source: Cannot set AutoIncrement property for a computed column.
de: Die AutoIncrement-Eigenschaft kann nicht für eine berechnete Spalte festgelegt werden.
es: No se puede establecer la propiedad AutoIncrement en una columna calculada.
fr: Impossible de définir une propriété AutoIncrement pour une colonne calculée.
it: Impossibile impostare la proprietà AutoIncrement per una colonna calcolata.
ja: 計算列の AutoIncrement プロパティを設定できません。
ko: 계산 열에 AutoIncrement 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade AutoIncrement para uma coluna calculada.
ru: Невозможно задать свойство AutoIncrement для вычисляемого столбца.
zh_hans: 无法为计算所得的列设置 AutoIncrement 属性。
zh_hant: 無法設定計算資料行的 AutoIncrement 屬性。

# DataColumn_AutoIncrementAndDefaultValue
source: Cannot set AutoIncrement property for a column with DefaultValue set.
de: Die AutoIncrement-Eigenschaft kann nicht für eine Spalte festgelegt werden, deren DefaultValue festgelegt ist.
es: No se puede establecer la propiedad AutoIncrement en una columna con DefaultValue.
fr: Impossible de définir la propriété AutoIncrement pour une colonne pour laquelle DefaultValue est défini.
it: Impossibile impostare la proprietà AutoIncrement per una colonna con DefaultValue impostato.
ja: DefaultValue が設定された列に対して AutoIncrement プロパティを設定できません。
ko: DefaultValue가 설정된 열에 AutoIncrement 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade AutoIncrement para uma coluna com DefaultValue definido.
ru: Невозможно задать свойство AutoIncrement для столбца с заданным DefaultValue.
zh_hans: 无法为已设置 DefaultValue 的列设置 AutoIncrement 属性。
zh_hant: 無法設定擁有 DefaultValue 值的資料行的 AutoIncrement 屬性。

# DataColumn_DefaultValueAndAutoIncrement
source: Cannot set a DefaultValue on an AutoIncrement column.
de: Ein DefaultValue kann für eine AutoIncrement-Spalte nicht festgelegt werden.
es: No se puede establecer DefaultValue en una columna AutoIncrement.
fr: Impossible de définir un DefaultValue sur une colonne AutoIncrement.
it: Impossibile impostare DefaultValue su una colonna AutoIncrement.
ja: AutoIncrement 列で DefaultValue を設定できません。
ko: AutoIncrement 열에 DefaultValue를 설정할 수 없습니다.
pt_br: Não é possível definir DefaultValue em uma coluna AutoIncrement.
ru: Невозможно задать DefaultValue для столбца AutoIncrement.
zh_hans: 在 AutoIncrement 列上不能设置 DefaultValue。
zh_hant: 無法在 AutoIncrement 資料行上設定 DefaultValue。

# DataColumn_AutoIncrementSeed
source: AutoIncrementStep must be a non-zero value.
de: AutoIncrementStep muss ein Wert sein, der nicht Null ist.
es: AutoIncrementStep debe ser un valor que no sea cero.
fr: AutoIncrementStep doit être une valeur différente de zéro.
it: Il valore di AutoIncrementStep deve essere diverso da zero.
ja: AutoIncrementStep は 0 以外の値でなければなりません。
ko: AutoIncrementStep 값은 0이 아니어야 합니다.
pt_br: AutoIncrementStep deve ser um valor não nulo.
ru: AutoIncrementStep не должен быть равен нулю.
zh_hans: AutoIncrementStep 必须是非零值。
zh_hant: AutoIncrementStep 必須是不為零的值。

# DataColumn_NameRequired
source: ColumnName is required when it is part of a DataTable.
de: Der ColumnName ist erforderlich wenn er Teil einer DataTable ist.
es: ColumnName es necesario cuando es parte de DataTable.
fr: ColumnName est requis lorsqu'il fait partie d'un DataTable.
it: Quando è parte di DataTable, ColumnName è obbligatorio.
ja: ColumnName は、それが DataTable の一部である場合には必要です。
ko: DataTable의 일부인 경우 ColumnName이 필요합니다.
pt_br: ColumnName é necessário quando ele é parte de um DataTable.
ru: ColumnName обязателен, когда он является частью DataTable.
zh_hans: 当 ColumnName 作为 DataTable 的一部分时是需要的。
zh_hant: 當 ColumnName 是 DataTable 的一部分時，它是必要的。

# DataColumn_ChangeDataType
source: Cannot change DataType of a column once it has data.
de: Der DataType einer Spalte kann nicht geändert werden, wenn diese Daten enthält.
es: No se puede cambiar DataType de una columna que contiene datos.
fr: Impossible de changer DataType d'une colonne lorsqu'il contient des données.
it: Impossibile modificare il DataType di una colonna contenente dati.
ja: データを指定した後に DataType を変更することはできません。
ko: 열에 데이터가 있으면 해당 열의 DataType을 변경할 수 없습니다.
pt_br: Não será possível alterar o DataType de uma coluna com dados.
ru: Невозможно изменить DataType столбца, т.к. он содержит данные.
zh_hans: 在列包含数据的情况下不能更改其 DataType。
zh_hant: 當資料行擁有資料後就無法變更 DataType。

# DataColumn_NullDataType
source: Column requires a valid DataType.
de: Spalte erfordert gültigen DataType.
es: La columna requiere que DataType sea válida.
fr: La colonne requiert un DataType valide.
it: La colonna richiede un DataType valido.
ja: 列には有効な DataType が必要です。
ko: 열에는 올바른 DataType이 필요합니다.
pt_br: A coluna requer DataType válido.
ru: Для столбца требуется допустимый DataType.
zh_hans: 列要求有效的 DataType。
zh_hant: 資料行需要有效的 DataType。

# DataColumn_DefaultValueDataType
source: The DefaultValue for column {0} is of type {1} and cannot be converted to {2}.
de: Der DefaultValue für Spalte {0} ist vom Typ {1} und kann nicht in {2} konvertiert werden.
es: DefaultValue de la columna {0} es de tipo {1} y no se puede convertir a {2}.
fr: Le DefaultValue pour la colonne {0} est de type {1} et ne peut pas être converti en {2}.
it: Il DefaultValue della colonna {0} è di tipo {1} e non può essere convertito in {2}.
ja: 列 {0} の DefaultValue は {1} 型です。{2} に変換することはできません。
ko: {0} 열의 DefaultValue 형식은 {1}이며 {2}(으)로 변환할 수 없습니다.
pt_br: DefaultValue da coluna {0} é do tipo {1} e não pode ser convertido em {2}.
ru: Значение DefaultValue столбца {0} имеет тип {1}, и его невозможно преобразовать в {2}.
zh_hans: {0} 列的 DefaultValue 的类型为 {1}，并且不能被转换为 {2}。
zh_hant: 資料行 {0} 的 DefaultValue 是屬於型別 {1}，並且無法轉換成 {2}。

# DataColumn_DefaultValueDataType1
source: The DefaultValue for the column is of type {0} and cannot be converted to {1}.
de: Der DefaultValue der Spalte ist vom Typ {0} und kann nicht in {1} konvertiert werden.
es: DefaultValue de la columna es de tipo {0} y no se puede convertir a {1}.
fr: Le DefaultValue pour la colonne est de type {0} et ne peut pas être converti en {1}.
it: Il DefaultValue della colonna è di tipo {0} e non può essere convertito in {1}.
ja: 列の DefaultValue は {0} 型です。{1} に変更することはできません。
ko: 열의 DefaultValue 형식은 {0}이며 {1}(으)로 변환할 수 없습니다.
pt_br: DefaultValue da coluna é do tipo {0} e não pode ser convertido em {1}.
ru: Значение DefaultValue данного столбца имеет тип {0}, и его невозможно преобразовать в {1}.
zh_hans: 该列的 DefaultValue 的类型为 {0}，并且不能被转换为 {1}。
zh_hant: 資料行的 DefaultValue 是屬於型別 {0}，並且無法轉換成 {1}。

# DataColumn_DefaultValueColumnDataType
source: The DefaultValue for column {0} is of type {1}, but the column is of type {2}.
de: Der DefaultValue für Spalte {0} ist vom Typ {1}, aber die Spalte ist vom Typ {2}.
es: DefaultValue de la columna {0} es de tipo {1}, pero la columna es de tipo {2}.
fr: Le DefaultValue pour la colonne {0} est de type {1}, mais la colonne est de type {2}.
it: Il DefaultValue della colonna {0} è di tipo {1}, ma la colonna è di tipo {2}.
ja: 列 {0} の DefaultValue は {1} 型ですが、この列は {2} 型です。
ko: {0} 열의 DefaultValue 형식은 {1}이지만 열 형식은 {2}입니다.
pt_br: DefaultValue da coluna {0} é do tipo {1}, mas a coluna é do tipo {2}.
ru: Значение DefaultValue столбца {0} имеет тип {1}, хотя столбец имеет тип {2}.
zh_hans: {0} 列的 DefaultValue 的类型为 {1}，但该列的类型为 {2}。
zh_hant: 資料行 {0} 的 DefaultValue 是屬於型別 {1}，但資料行是屬於型別 {2}。

# DataColumn_ReadOnlyAndExpression
source: Cannot change ReadOnly property for the expression column.
de: ReadOnly-Eigenschaft für die Ausdruckspalte kann nicht geändert werden.
es: No se puede cambiar la propiedad ReadOnly para la columna de expresión.
fr: Impossible de changer la propriété ReadOnly pour la colonne d'expression.
it: Impossibile modificare la proprietà ReadOnly della colonna espressioni.
ja: Expression 列の ReadOnly プロパティを変更できません。
ko: Expression 열의 ReadOnly 속성을 변경할 수 없습니다.
pt_br: Não é possível alterar a propriedade ReadOnly para a coluna de expressões.
ru: Невозможно изменить свойство ReadOnly для столбца выражений.
zh_hans: 不能更改表达式列的 ReadOnly 属性。
zh_hant: 無法變更運算式資料行的 ReadOnly 屬性。

# DataColumn_UniqueAndExpression
source: Cannot change Unique property for the expression column.
de: Die Unique-Eigenschaft der Ausdrucksspalte kann nicht geändert werden.
es: No se puede cambiar la propiedad Unique en la columna de expresión.
fr: Impossible de changer la propriété Unique pour la colonne d'expression.
it: Impossibile modificare la proprietà Unique della colonna espressioni.
ja: 式列の Unique プロパティを変更することはできません。
ko: Expression 열의 Unique 속성을 변경할 수 없습니다.
pt_br: Não é possível alterar a propriedade Unique da coluna de expressões.
ru: Невозможно изменить свойство Unique для столбца выражений.
zh_hans: 不能更改表达式列的 Unique 属性。
zh_hant: 無法變更運算式資料行的 Unique 屬性。

# DataColumn_ExpressionAndUnique
source: Cannot create an expression on a column that has AutoIncrement or Unique.
de: Ein Ausdruck kann nicht für eine Spalte erstellt werden, die AutoIncrement oder Unique hat.
es: No se puede crear una expresión en una columna que tiene AutoIncrement o Unique.
fr: Impossible de créer une expression sur une colonne qui a AutoIncrement ou Unique.
it: Impossibile impostare la proprietà Expression di una colonna con AutoIncrement o Unique.
ja: AutoIncrement または Unique を持つ列で式を作成することはできません。
ko: AutoIncrement 또는 Unique가 지정된 열에 식을 만들 수 없습니다.
pt_br: Não é possível criar uma expressão em uma coluna que tenha AutoIncrement ou Unique.
ru: Невозможно создать выражение в столбце, которому назначено свойство AutoIncrement или Unique.
zh_hans: 在具有 AutoIncrement 或 Unique 的列上不能创建表达式。
zh_hant: 無法在擁有 AutoIncrement 或 Unique 的資料行上建立運算式。

# DataColumn_ExpressionAndReadOnly
source: Cannot set expression because column cannot be made ReadOnly.
de: Der Ausdruck kann nicht festgelegt werden, da die Spalte nicht über ReadOnly mit einem Schreibschutz versehen werden kann.
es: No se puede establecer la expresión porque la columna no puede ser ReadOnly.
fr: Impossible de définir l'expression, car la colonne ne peut pas être ReadOnly.
it: Impossibile impostare la proprietà Expression, perché la colonna non può essere impostata su ReadOnly.
ja: 列を ReadOnly モードにできないため、式を設定できません。
ko: 열을 ReadOnly로 지정할 수 없으므로 식을 설정할 수 없습니다.
pt_br: Não é possível definir a expressão porque a coluna não pode se tornar ReadOnly.
ru: Невозможно задать выражение, т.к. столбец невозможно перевести в состояние ReadOnly.
zh_hans: 不能设置表达式，因为列不能被设置为 ReadOnly。
zh_hant: 無法設定運算式，因為無法將資料行設定成 ReadOnly。

# DataColumn_ExpressionAndConstraint
source: Cannot set Expression property on column {0}, because it is a part of a constraint.
de: Die Expression-Eigenschaft kann für Spalte {0} nicht festgelegt werden, da sie Teil einer Einschränkung ist.
es: No se puede establecer la propiedad Expression en la columna {0}, porque es parte de una restricción.
fr: Impossible de définir la propriété Expression sur la colonne {0}, car elle fait partie d'une contrainte.
it: Impossibile impostare la proprietà Expression sulla colonna {0}, perché è parte di un vincolo.
ja: 列 {0} に Expression プロパティを設定できません。これは制約の一部です。
ko: {0} 열은 제약 조건의 일부이므로 이 열에 Expression 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade Expression na coluna {0} porque ela é parte de uma restrição.
ru: Невозможно задать свойство Expression столбца {0}, т.к. оно является частью ограничения.
zh_hans: 不能在 {0} 列上设置 Expression 属性，因为它是约束的一部分。
zh_hant: 無法在資料行 {0} 上設定 Expression 屬性，因為它是條件約束的一部分。

# DataColumn_ExpressionInConstraint
source: Cannot create a constraint based on Expression column {0}.
de: Eine Einschränkung basierend auf Expression-Spalte {0} kann nicht erstellt werden.
es: No se puede crear una restricción basada en la columna Expression {0}.
fr: Impossible de créer une contrainte à partir d'une colonne Expression {0}.
it: Impossibile creare un vincolo basato sulla colonna Expression {0}.
ja: Expression 列 {0} に基づく制約を作成できません。
ko: Expression 열 {0}을(를) 기반으로 제약 조건을 만들 수 없습니다.
pt_br: Não é possível criar uma restrição com base na coluna Expression {0}.
ru: Невозможно создать ограничение на основе столбца Expression {0}.
zh_hans: 不能基于 Expression 列 {0} 创建约束。
zh_hant: 無法根據 Expression 資料行 {0} 建立條件約束。

# DataColumn_ExpressionCircular
source: Cannot set Expression property due to circular reference in the expression.
de: Die Expression-Eigenschaft kann nicht festgelegt werden, da der Ausdruck einen zirkulären Verweis enthält.
es: No se puede establecer la propiedad Expression debido a una referencia circular en la expresión.
fr: Impossible de définir la propriété Expression en raison d'une référence circulaire dans l'expression.
it: Impossibile impostare la proprietà Expression, perché contiene riferimenti circolari.
ja: 式に循環参照が発生したため、Expression プロパティを設定できません。
ko: 식에 순환 참조가 있으므로 Expression 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade Expression devido à referência circular na expressão.
ru: Невозможно задать свойство Expression по причине циклической ссылки в выражении.
zh_hans: 不能设置 Expression 属性，因为表达式中存在循环引用。
zh_hant: 無法設定 Expression 屬性，因為在運算式中有循環參考。

# DataColumn_NullKeyValues
source: Column '{0}' has null values in it.
de: Spalte '{0}' hat null Werte.
es: La columna '{0}' tiene valores null.
fr: La colonne '{0}' contient des valeurs null.
it: La colonna '{0}' contiene valori null.
ja: 列 '{0}' には null 値が含まれています。
ko: '{0}' 열에 null 값이 있습니다.
pt_br: A coluna '{0}' tem valores nulls.
ru: Столбец "{0}" содержит значения равные null.
zh_hans: 列“{0}”中包含 null 值。
zh_hant: 資料行 '{0}' 中擁有 null 值。
