Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SQL_Timeout_RoutingDestinationInfo
source: This failure occurred while attempting to connect to the routing destination. The duration spent while attempting to connect to the original server was - [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3}; [Post-Login] complete={4};
de: Der Fehler ist bei dem Versuch aufgetreten, eine Verbindung mit dem Routingziel herzustellen. Folgende Verbindungszeiten wurden bei dem Versuch benötigt, eine Verbindung mit dem ursprünglichen Server herzustellen: [Vor Anmeldung] Initialisierung={0}; Handshake={1}; [Anmeldung] Initialisierung={2}; Authentifizierung={3}; [Nach Anmeldung] Abgeschlossen={4};
es: Este error se produjo al intentar conectarse al destino de enrutamiento. La duración del intento de conexión al servidor original fue - [Previo al inicio de sesión] inicialización={0}; protocolo de enlace={1}; [Inicio de sesión] inicialización ={2}; autenticación={3}; [Posterior al inicio de sesión] completado={4};
fr: Cet échec s'est produite en essayant de se connecter à la destination de routage. Le temps écoulé lors de la tentative de connexion à ce serveur était de - [Préconnexion] initialisation={0}; poignée de main={1}; [connexion] initialisation={2}; authentification={3}; [Post connexion] terminé={4};
it: Errore durante il tentativo di connessione alla destinazione di routing. Tempo impiegato per il tentativo di connessione al server originale: - [Pre-Login] inizializzazione={0}; handshake={1}; [Login] inizializzazione={2}; autenticazione={3}; [Post-Login] completato={4};
ja: このエラーは、ルーティング先に接続しているときに発生しました。元のサーバーへの接続の試行に費やされた時間 - [ログイン前] 初期化 ={0}; ハンドシェイク ={1}; [ログイン] 初期化 ={2}; 認証={3}; [ログイン後] 完了={4};
ko: 이 오류는 라우팅 대상에 연결하려는 중에 발생했습니다. 원래 서버에 연결하려고 시도할 때 걸린 시간은 [사전 로그인] 초기화={0}; 핸드셰이크={1}; [로그인] 초기화={2}; 인증={3}; [사후 로그인] 완료={4}입니다.
pt_br: Falha ao tentar conectar ao destino de roteamento. A duração da tentativa de conexão com o servidor original foi - [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3}; [Post-Login] complete={4};
ru: Эта ошибка произошла при попытке подключиться к цели маршрутизации. Продолжительность этапов попытки подключения к исходному серверу: [перед входом в систему] инициализация = {0}; подтверждение установления связи = {1}; [вход в систему] инициализация = {2}; аутентификация = {3}; [после входа в систему] завершено = {4};
zh_hans: 尝试连接到路由目标时发生了此故障。尝试连接原服务器所用时长为 - [预登录] 初始化={0}; 握手={1}; [登录] 初始化={2}; 身份验证={3}; [登录后] 完成={4};
zh_hant: 嘗試連接到路由目的地時發生這項失敗。嘗試連接到原始伺服器所花費的時間為 - [登入前] 初始設定={0}; 信號交換={1}; [登入] 初始設定={2}; 驗證={3}; [登入後] 完成={4};

# SQL_Duration_PreLogin_Begin
source: The duration spent while attempting to connect to this server was - [Pre-Login] initialization={0};
de: Folgende Verbindungszeiten wurden bei dem Versuch benötigt, eine Verbindung mit diesem Server herzustellen: [Vor Anmeldung] Initialisierung={0};
es: El tiempo invertido al intentar conectarse a este servidor fue: [Previo al inicio de sesión] inicialización={0};
fr: Le temps écoulé lors de la tentative de connexion à ce serveur était de -[Préconnexion] initialisation={0};
it: Tempo impiegato nel tentativo di connettersi a questo server: inizializzazione [Pre-Login]={0};
ja: このサーバーへの接続の試行に費やされた時間 - [ログイン前] 初期化 ={0};
ko: 이 서버에 연결하려고 시도할 때 걸린 시간은 [사전 로그인] 초기화={0}입니다.
pt_br: A duração da tentativa de conexão com este servidor foi: [Pre-Login] initialization={0};
ru: Время, затраченное на попытки подключиться к этому серверу, составило: [Pre-Login] initialization={0};
zh_hans: 尝试连接到此服务器时花费的持续时间是 - [Pre-Login] initialization={0}；
zh_hant: 嘗試連接到這部伺服器所花費的時間為 - [登入前] 初始設定={0};

# SQL_Duration_PreLoginHandshake
source: The duration spent while attempting to connect to this server was - [Pre-Login] initialization={0}; handshake={1};
de: Folgende Verbindungszeiten wurden bei dem Versuch benötigt, eine Verbindung mit diesem Server herzustellen: [Vor Anmeldung] Initialisierung={0}; Handshake={1};
es: El tiempo invertido al intentar conectarse a este servidor fue: [Previo al inicio de sesión] inicialización={0}; protocolo de enlace={1};
fr: Le temps écoulé lors de la tentative de connexion à ce serveur était de - [Préconnexion] initialisation={0}; poignée de main={1};
it: Tempo impiegato nel tentativo di connettersi a questo server: inizializzazione [Pre-Login]={0}; handshake={1};
ja: このサーバーへの接続の試行に費やされた時間 - [ログイン前] 初期化 ={0}; ハンドシェイク ={1};
ko: 이 서버에 연결하려고 시도할 때 걸린 시간은 [사전 로그인] 초기화={0}, 핸드셰이크={1}입니다.
pt_br: A duração da tentativa de conexão com este servidor foi: [Pre-Login] initialization={0}; handshake={1};
ru: Время, затраченное на попытки подключиться к этому серверу, составило: [Pre-Login] initialization={0}; handshake={1};
zh_hans: 尝试连接到此服务器时花费的持续时间是 - [Pre-Login] initialization={0}；handshake={1}；
zh_hant: 嘗試連接到這部伺服器所花費的時間為 - [登入前] 初始設定={0}; 信號交換={1};

# SQL_Duration_Login_Begin
source: The duration spent while attempting to connect to this server was - [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2};
de: Folgende Verbindungszeiten wurden bei dem Versuch benötigt, eine Verbindung mit diesem Server herzustellen: [Vor Anmeldung] Initialisierung={0}; Handshake={1}; [Anmeldung] Initialisierung={2};
es: El tiempo invertido al intentar conectarse a este servidor fue: [Previo al inicio de sesión previo] inicialización={0}; protocolo de enlace={1}; [Inicio de sesión] inicialización={2};
fr: Le temps écoulé lors de la tentative de connexion à ce serveur était de - [Préconnexion] initialisation={0}; poignée de main={1}; [connexion] initialisation={2};
it: Tempo impiegato nel tentativo di connettersi a questo server: inizializzazione [Pre-Login]={0}; handshake={1}; inizializzazione [Login]={2};
ja: このサーバーへの接続の試行に費やされた時間 - [ログイン前] 初期化 ={0}; ハンドシェイク ={1}; [ログイン] 初期化 ={2};
ko: 이 서버에 연결하려고 시도할 때 걸린 시간은 [사전 로그인] 초기화={0}, 핸드셰이크={1}, [로그인] 초기화={2}입니다.
pt_br: A duração da tentativa de conexão com este servidor foi: [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2};
ru: Время, затраченное на попытки подключиться к этому серверу, составило: [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2};
zh_hans: 尝试连接到此服务器时花费的持续时间是 - [Pre-Login] initialization={0}；handshake={1}；[Login] initialization={2}；
zh_hant: 嘗試連接到這部伺服器所花費的時間為 - [登入前] 初始設定={0}; 信號交換={1}; [登入] 初始設定={2};

# SQL_Duration_Login_ProcessConnectionAuth
source: The duration spent while attempting to connect to this server was - [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3};
de: Folgende Verbindungszeiten wurden bei dem Versuch benötigt, eine Verbindung mit diesem Server herzustellen: [Vor Anmeldung] Initialisierung={0}; Handshake={1}; [Anmeldung] Initialisierung={2}; Authentifizierung={3};
es: El tiempo invertido al intentar conectarse a este servidor fue: [Previo al inicio de sesión] inicialización={0}; protocolo de enlace={1}; [Inicio de sesión] inicialización={2}; autenticación={3};
fr: Le temps écoulé lors de la tentative de connexion à ce serveur était de - [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3};
it: Tempo impiegato nel tentativo di connettersi a questo server: inizializzazione [Pre-Login]={0}; handshake={1}; inizializzazione [Login]={2}; autenticazione={3};
ja: このサーバーへの接続の試行に費やされた時間 - [ログイン前] 初期化 ={0}; ハンドシェイク ={1}; [ログイン] 初期化 ={2}; 認証={3};
ko: 이 서버에 연결하려고 시도할 때 걸린 시간은 [사전 로그인] 초기화={0}, 핸드셰이크={1}, [로그인] 초기화={2}, 인증={3}입니다.
pt_br: A duração da tentativa de conexão com este servidor foi: [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3};
ru: Время, затраченное на попытки подключиться к этому серверу, составило: [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3};
zh_hans: 尝试连接到此服务器时花费的持续时间是 - [Pre-Login] initialization={0}；handshake={1}；[Login] initialization={2}；authentication={3}；
zh_hant: 嘗試連接到這部伺服器所花費的時間為 - [登入前] 初始設定={0}; 信號交換={1}; [登入] 初始設定={2}; 驗證={3};

# SQL_Duration_PostLogin
source: The duration spent while attempting to connect to this server was - [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3}; [Post-Login] complete={4};
de: Folgende Verbindungszeiten wurden bei dem Versuch benötigt, eine Verbindung mit diesem Server herzustellen: [Vor Anmeldung] Initialisierung={0}; Handshake={1}; [Anmeldung] Initialisierung={2}; Authentifizierung={3}; [Nach Anmeldung] Abgeschlossen={4};
es: El tiempo invertido al intentar conectarse a este servidor fue: [Previo al inicio de sesión] inicialización={0}; protocolo de enlace={1}; [Inicio de sesión] inicialización={2}; autenticación={3}; [Tras el inicio de sesión] completo={4};
fr: Le temps écoulé lors de la tentative de connexion à ce serveur était de - [Préconnexion] initialisation={0}; poignée de main={1}; [connexion] initialisation={2}; authentification={3}; [Post connexion] terminé={4};
it: Tempo impiegato nel tentativo di connettersi a questo server: inizializzazione [Pre-Login]={0}; handshake={1}; inizializzazione [Login]={2}; autenticazione={3}; completamento [Post-Login]={4};
ja: このサーバーへの接続の試行に費やされた時間 - [ログイン前] 初期化 ={0}; ハンドシェイク ={1}; [ログイン] 初期化 ={2}; 認証={3}; [ログイン後] 完了={4};
ko: 이 서버에 연결하려고 시도할 때 걸린 시간은 [사전 로그인] 초기화={0}, 핸드셰이크={1}, [로그인] 초기화={2}, 인증={3}, [사후 로그인] 완료={4}입니다.
pt_br: A duração da tentativa de conexão com este servidor foi: [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3}; [Post-Login] complete={4};
ru: Время, затраченное на попытки подключиться к этому серверу, составило: [Pre-Login] initialization={0}; handshake={1}; [Login] initialization={2}; authentication={3}; [Post-Login] complete={4};
zh_hans: 尝试连接到此服务器时花费的持续时间是 - [Pre-Login] initialization={0}；handshake={1}；[Login] initialization={2}；authentication={3}；[Post-Login] complete={4}；
zh_hant: 嘗試連接到這部伺服器所花費的時間為 - [登入前] 初始設定={0}; 信號交換={1}; [登入] 初始設定={2}; 驗證={3}; [登入後] 完成={4};

# SQL_UserInstanceFailure
source: A user instance was requested in the connection string but the server specified does not support this option.
de: In der Verbindungszeichenfolge wurde eine Benutzerinstanz angefordert, doch der angegebene Server unterstützt diese Option nicht.
es: Se solicitó una instancia de usuario en la cadena de conexión pero el servidor no admite esta opción.
fr: Une instance d'utilisateur a été demandée dans la chaîne de connexion, mais le serveur spécifié ne prend pas en charge cette option.
it: Nella stringa della connessione è stata richiesta un'istanza utente, ma il server specificato non supporta questa opzione.
ja: 接続文字列でユーザー インスタンスが要求されましたが、指定されたサーバーではこのオプションをサポートしていません。
ko: 연결 문자열에서 사용자 인스턴스를 요청했지만 지정한 서버에서 이 옵션을 지원하지 않습니다.
pt_br: Uma instância do usuário foi solicitada na cadeia de conexão, mas o servidor especificado não oferece suporte para esta opção.
ru: В строке подключения был затребован пользовательский экземпляр, но указанный сервер не поддерживает этот параметр.
zh_hans: 在连接字符串中请求了用户实例，但是指定的服务器不支持此选项。
zh_hant: 連接字串中要求一個使用者執行個體，但指定的伺服器並不支援此選項。

# SQL_InvalidServerCertificate
source: The server certificate failed application validation.
de: Fehler bei der Anwendungsüberprüfung für das Serverzertifikat.
es: Error de validación de aplicación en el certificado de servidor.
fr: La validation de l'application du certificat de serveur a échoué.
it: Il certificato del server non ha superato la convalida dell'applicazione.
ja: サーバー証明書がアプリケーションの検証に失敗しました。
ko: 서버 인증서가 애플리케이션 유효성 검사에 실패했습니다.
pt_br: Falha na validação do certificado do servidor no aplicativo.
ru: Сертификат сервера не прошел проверку приложения.
zh_hans: 服务器证书无法通过应用程序验证。
zh_hant: 伺服器憑證無法用於驗證應用程式。

# SQL_ExceedsMaxDataLength
source: Specified data length {0} exceeds the allowed maximum length of {1}.
de: Die angegebene Datenlänge {0} überschreitet die zulässige Höchstlänge {1}.
es: La longitud de datos {0} especificada supera la longitud máxima permitida de {1}.
fr: La longueur de données spécifiée, {0}, est supérieure à la longueur maximale autorisée, {1}.
it: La lunghezza dati specificata {0} supera la lunghezza massima consentita di {1}.
ja: 指定されているデータ長 {0} が、許可されている最大長 {1} を超えています。
ko: 지정한 데이터 길이 {0}이(가) 허용되는 최대 길이 {1}을(를) 초과합니다.
pt_br: O comprimento dos dados especificados {0} excede o comprimento máximo de {1}.
ru: Указанная длина данных {0} превышает максимально допустимую длину {1}.
zh_hans: 指定的数据长度 {0} 超出了允许的最大长度 {1}。
zh_hant: 指定資料的長度 {0} 超過允許的上限 {1}。

# SQL_InvalidRead
source: Invalid attempt to read when no data is present.
de: Ungültiger Leseversuch, wenn keine Daten vorhanden sind.
es: Intento de lectura no válido al no haber datos presentes.
fr: Tentative de lecture non valide lorsque aucune donnée n'est présente.
it: Tentativo non valido di eseguire la lettura in assenza di dati.
ja: データが存在しない場合、データの読み取りは無効です。
ko: 데이터가 없어서 읽을 수 없습니다.
pt_br: Tentativa inválida durante a leitura quando não há dados presentes.
ru: Недопустимая попытка чтения при отсутствии данных.
zh_hans: 没有数据时尝试进行无效的读操作。
zh_hant: 當目前沒有資料時，嘗試讀取無效。

# SQL_NonBlobColumn
source: Invalid attempt to GetBytes on column '{0}'. The GetBytes function can only be used on columns of type Text, NText, or Image.
de: Es wurde versucht, die Funktion 'GetBytes' für die Spalte '{0}' auszuführen. Die GetBytes-Funktion kann nur für Spalten des Typs Text, NText oder Image verwendet werden.
es: Intento no válido de realizar GetBytes en la columna '{0}'. La función GetBytes sólo se puede utilizar en columnas de tipo Text, NText, o Image.
fr: Tentative non valide de GetBytes sur la colonne '{0}'. La fonction GetBytes ne peut être utilisée que sur les colonnes de type Text, NText ou Image.
it: Tentativo non valido di eseguire GetBytes sulla colonna '{0}'. La funzione GetBytes può essere utilizzata solo su colonne di tipo Text, NText o Image.
ja: '{0}' で無効な GetBytes を実行しようとしました。GetBytes 関数は Text、NText、または Image 型の列上でのみ使用できます。
ko: '{0}' 열에서 GetBytes를 사용할 수 없습니다. GetBytes 함수는 Text, NText 또는 Image 형식의 열에서만 사용할 수 있습니다.
pt_br: Tentativa inválida de chamar GetBytes na coluna '{0}'. A função GetBytes só pode ser usada em colunas do tipo Text, NText ou Image.
ru: Недопустимая попытка использования функции GetBytes для столбца "{0}". Функция GetBytes может использоваться только для столбцов типа Text, NText и Image.
zh_hans: 在列“{0}”上的 GetBytes 尝试无效。GetBytes 函数只能用在 Text、NText 或 Image 类型的列上。
zh_hant: 資料行 '{0}' 上的 GetBytes 的嘗試無效。GetBytes 函式只可以用在型別 Text、NText 或 Image 的資料行上。

# SQL_NonCharColumn
source: Invalid attempt to GetChars on column '{0}'. The GetChars function can only be used on columns of type Text, NText, Xml, VarChar or NVarChar.
de: Es wurde versucht, die GetChars-Funktion für die Spalte '{0}' auszuführen. Diese Funktion kann nur auf Spalten vom Typ 'Text', 'NText', 'Xml', 'VarChar' oder 'NVarChar' angewendet werden.
es: Intento no válido de GetChars en la columna '{0}'. La función GetChars sólo se puede utilizar en columnas del tipo Text, NText, Xml, VarChar o NVarChar.
fr: Tentative d'utilisation de GetChars dans la colonne '{0}' non valide. La fonction GetChars ne peut être employée que dans les colonnes de type Text, NText, Xml, VarChar ou NVarChar.
it: Tentativo non valido di utilizzare GetChars nella colonna "{0}". La funzione GetChars può essere utilizzata solo in colonne di tipo Text, NText, Xml, VarChar oppure NVarChar.
ja: '{0}' で無効な GetChars を実行しようとしました。GetChars 関数は Text、NText、Xml、VarChar、または NVarChar 型の列上でのみ使用できます。
ko: 열 '{0}'에서 GetChars를 수행할 수 없습니다. GetChars 기능은 Text, NText, Xml, VarChar 또는 NVarChar 유형의 열에서만 사용할 수 있습니다.
pt_br: Tentativa inválida para GetChars na coluna '{0}'. A função GetChars só pode ser usada em colunas do tipo Text, NText, Xml, VarChar ou NVarChar.
ru: Недопустимая попытка использования функции GetChars для столбца "{0}". Функция GetChars может использоваться только для столбцов типа Text, NText, Xml, VarChar или NVarChar.
zh_hans: 在列“{0}”上的 GetChars 尝试无效。GetChars 函数只能用在 Text、NText、Xml、VarChar 或 NVarChar 类型的列上。
zh_hant: 嘗試在資料欄 '{0}' 進行 GetChars 無效。GetChars 函式僅可用於型別為 Text、NText、Xml、VarChar 或 NVarChar 的資料行。

# SQL_StreamNotSupportOnColumnType
source: Invalid attempt to GetStream on column '{0}'. The GetStream function can only be used on columns of type Binary, Image, Udt or VarBinary.
de: Ungültiger Versuch, GetStream für die Spalte "{0}" auszuführen. Die GetStream-Funktion kann nur auf Spalten vom Typ "Binary", "Image", "Udt" oder "VarBinary" angewendet werden.
es: Intento no válido en GetStream en la columna '{0}'. La función GetStream solo se puede usar en columnas de tipo Binary, Image, Udt o VarBinary.
fr: Tentative non valide d'exécution d'une fonction GetStream sur une colonne « {0} ». La fonction GetStream ne peut être utilisée que sur des colonnes de type Binary, Image, Udt ou VarBinary.
it: Tentativo non valido di eseguire la funzione GetStream sulla colonna '{0}'. La funzione GetStream può essere utilizzata solo su colonne di tipo Binary, Image, Udt o VarBinary.
ja: '{0}' で無効な GetStream を実行しようとしました。GetStream 関数は Binary、Image、Udt、または VarBinary 型の列上でのみ使用できます。
ko: '{0}' 열에 대해 GetStream을 실행하려고 했습니다. GetStream 함수는 Binary, Image, Udt 또는 VarBinary 형식의 열에만 사용할 수 있습니다.
pt_br: Tentativa inválida de chamar GetStream na coluna '{0}'. A função GetStream pode ser usada apenas em colunas do tipo Binary, Image, Udt ou VarBinary.
ru: Недопустимая попытка выполнить операцию GetStream со столбцом "{0}". Функция GetStream может использоваться только со столбцами типа Binary, Image, Udt или VarBinary.
zh_hans: 对列“{0}”进行的 GetStream 尝试无效。GetStream 函数只能对 Binary、Image、Udt 或 VarBinary 类型的列使用。
zh_hant: 嘗試針對資料行 '{0}' 進行 GetStream 無效。GetStream 函式僅可用於型別為 Binary、Image、Udt 或 VarBinary 的資料行。

# SQL_TextReaderNotSupportOnColumnType
source: Invalid attempt to GetTextReader on column '{0}'. The GetTextReader function can only be used on columns of type Char, NChar, NText, NVarChar, Text or VarChar.
de: Ungültiger Versuch, GetTextReader für die Spalte "{0}" auszuführen. Die GetTextReader-Funktion kann nur für Spalten vom Typ "Char", "NChar", "NText", "NVarChar", "Text" oder "VarChar " verwendet werden.
es: Intento no válido en GetTextReader en la columna '{0}'. La función GetTextReader solo se puede usar en columnas de tipo Char, NChar, NText, NVarChar, Text o VarChar.
fr: Tentative non valide d'exécution d'une fonction GetTextReader sur une colonne « {0} ». La fonction GetTextReader ne peut être utilisée que sur des colonnes de type Char, NChar, NText, NVarChar, Text ou VarChar.
it: Tentativo non valido di eseguire la funzione GetTextReader sulla colonna '{0}'. La funzione GetTextReader può essere utilizzata solo su colonne di tipo Char, NChar, NText, NVarChar, Text o VarChar.
ja: '{0}' で無効な GetTextReader を実行しようとしました。GetTextReader 関数は Char、NChar、NText、NVarChar、Text、または VarChar 型の列上でのみ使用できます。
ko: '{0}' 열에 대해 GetTextReader를 실행하려고 했습니다. GetTextReader 함수는 Char, NChar, NText, NVarChar, Text 또는 VarChar 형식의 열에만 사용할 수 있습니다.
pt_br: Tentativa inválida de chamar GetTextReader na coluna '{0}'. A função GetTextReader pode ser usada apenas em colunas do tipo Char, NChar, NText, NVarChar, Text ou VarChar.
ru: Недопустимая попытка выполнить операцию GetTextReader со столбцом "{0}". Функция GetTextReader может использоваться только со столбцами типа Char, NChar, NText, NVarChar, Text или VarChar.
zh_hans: 对列“{0}”进行的 GetTextReader 尝试无效。GetTextReader 函数只能对 Char、NChar、NText、NVarChar、Text 或 VarChar 类型的列使用。
zh_hant: 嘗試針對資料行 '{0}' 進行 GetTextReader 無效。GetTextReader 函式僅可用於型別為 Char、NChar、NText、NVarChar、Text 或 VarChar 的資料行。

# SQL_XmlReaderNotSupportOnColumnType
source: Invalid attempt to GetXmlReader on column '{0}'. The GetXmlReader function can only be used on columns of type Xml.
de: Ungültiger Versuch, GetXmlReader für die Spalte "{0}" auszuführen. Die GetXmlReader-Funktion kann nur für Spalten vom Typ "Xml" verwendet werden.
es: Intento no válido en GetXmlReader en la columna '{0}'. La función GetXmlReader solo se puede usar en columnas de tipo Xml.
fr: Tentative non valide d'exécution d'une fonction GetXmlReader sur une colonne « {0} ». La fonction GetXmlReader ne peut être utilisée que sur des colonnes de type Xml.
it: Tentativo non valido di eseguire la funzione GetXmlReader sulla colonna '{0}'. La funzione GetXmlReader può essere utilizzata solo su colonne di tipo Xml.
ja: '{0}' で無効な GetXmlReader を実行しようとしました。GetXmlReader 関数は Xml 型の列上でのみ使用できます。
ko: '{0}' 열에 대해 GetXmlReader를 실행하려고 했습니다. GetXmlReader 함수는 Xml 형식의 열에만 사용할 수 있습니다.
pt_br: Tentativa inválida de chamar GetXmlReader na coluna '{0}'. A função GetXmlReader pode ser usada apenas em colunas do tipo Xml.
ru: Недопустимая попытка выполнить операцию GetXmlReader со столбцом "{0}". Функция GetXmlReader может использоваться только со столбцами типа Xml.
zh_hans: 对列“{0}”进行的 GetXmlReader 尝试无效。GetXmlReader 函数只能对 XML 类型的列使用。
zh_hant: 嘗試針對資料行 '{0}' 進行 GetXmlReader 無效。GetXmlReader 函式僅可用於型別為 Xml 的資料行。

# SQL_InvalidBufferSizeOrIndex
source: Buffer offset '{1}' plus the bytes available '{0}' is greater than the length of the passed in buffer.
de: Pufferoffset '{1}' plus verfügbare Bytes '{0}' ist größer als die Länge des übergebenen Puffers.
es: El desplazamiento del búfer '{1}' más los bytes disponibles '{0}' es mayor que la longitud del búfer introducido.
fr: L'offset de la mémoire tampon « {1} » plus les octets disponibles « {0} » sont supérieurs à la longueur de la mémoire tampon passée.
it: L'offset del buffer '{1}' sommato ai byte disponibili '{0}' è maggiore della lunghezza del buffer passato.
ja: バッファー オフセット '{1}' と使用できるバイト数 '{0}' の合計が、バッファーに渡された長さを超えています。
ko: 버퍼 오프셋 '{1}'과(와) 사용 가능한 바이트 '{0}'을(를) 더한 값이 전달된 버퍼의 길이보다 큽니다.
pt_br: O valor de deslocamento de buffer '{1}' mais os bytes disponíveis '{0}' é maior que o tamanho passado no buffer.
ru: Смещение в буфере "{1}" и доступные байты "{0}" в сумме больше, чем длина, переданная в буфер.
zh_hans: 缓冲区偏移量“{1}”加上“{0}”可用字节数大于在缓冲区中传递的长度。
zh_hant: 緩衝區位移 '{1}' 加上可用位元組 '{0}'，大於傳入之緩衝區的長度。

# SQL_InvalidDataLength
source: Data length '{0}' is less than 0.
de: Datenlänge '{0}' ist kleiner als 0.
es: La longitud de los datos '{0}' es menor que 0.
fr: La longueur des données « {0} » est inférieure à 0.
it: Lunghezza dei dati '{0}' minore di 0.
ja: データの長さ '{0}' が 0 未満です。
ko: 데이터 길이 '{0}'은(는) 0보다 작습니다.
pt_br: O comprimento de dados '{0}' é menor que 0.
ru: Длина данных "{0}" меньше 0.
zh_hans: 数据长度“{0}”小于 0。
zh_hant: 資料長度 '{0}' 小於 0。

# SQL_SqlResultSetClosed
source: Invalid attempt to call method {0} when SqlResultSet is closed.
de: Ungültiger Versuch des Aufrufs von Methode {0}, wenn SqlResultSet geschlossen ist.
es: Intento no válido de llamar al método {0} cuando SqlResultSet está cerrado.
fr: Tentative d'appel de la méthode {0} non valide avec SqlResultSet fermé.
it: Tentativo non valido di chiamare il metodo {0} quando SqlResultSet è chiuso.
ja: SqlResultSet が閉じている場合は、メソッド {0} の呼び出しは無効です。
ko: SqlResultSet이 닫혀 있으면 메서드 {0}을(를) 호출할 수 없습니다.
pt_br: Tentativa inválida para chamar o método {0} quando o SqlResultSet está fechado.
ru: Недопустимая попытка вызвать метод {0}, когда закрыт SqlResultSet.
zh_hans: SqlResultSet 关闭时，调用方法 {0} 的尝试无效。
zh_hant: 當 SqlResultSet 已關閉時，嘗試呼叫方法 {0} 失敗。

# SQL_SqlResultSetClosed2
source: Operation cannot be completed because the SqlResultSet is closed.
de: Operation kann nicht abgeschlossen werden, da SqlResultSet geschlossen ist.
es: No se puede completar la operación porque SqlResultSet está cerrado.
fr: Opération impossible : le SqlResultSet est fermé.
it: Impossibile completare l'operazione, perché SqlResultSet è chiuso.
ja: SqlResultSet が閉じているため、操作を完了できません。
ko: SqlResultSet이 닫혀 있으므로 작업을 완료할 수 없습니다.
pt_br: A operação não pode ser concluída, pois o SqlResultSet está fechado.
ru: Невозможно завершить операцию, поскольку SqlResultSet закрыт.
zh_hans: 不能完成操作，因为 SqlResultSet 已关闭。
zh_hant: 無法完成操作，因為 SqlResultSet 已關閉。
