Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataRelation_NoName
source: RelationName is required when it is part of a DataSet.
de: RelationName ist erforderlich, wenn er Teil eines DataSet ist.
es: RelationName es necesario como parte de DataSet.
fr: RelationName est requis lorsqu'il fait partie d'un DataSet.
it: RelationName è richiesto quando è parte di un DataSet.
ja: RelationName は、DataSet の一部になっている場合には必要です。
ko: DataSet의 일부인 경우 RelationName이 필요합니다.
pt_br: RelationName é necessário quando ele é parte de um DataSet.
ru: RelationName является обязательным, когда он - часть DataSet.
zh_hans: 当 RelationName 是 DataSet 的一部分时，它是必需的。
zh_hant: 當 RelationName 是 DataSet 的一部分時，它是必要的。

# DataRelation_ForeignTable
source: GetChildRows requires a row whose Table is {0}, but the specified row's Table is {1}.
de: GetChildRows erfordert eine Zeile, deren Table {0} ist. Die Table der angegebenen Zeile ist jedoch {1}.
es: GetChildRows requiere una fila cuya Table es {0}, pero la Table de la fila especificada es {1}.
fr: GetChildRows requiert une ligne dont la table est {0}, mais la Table de la ligne spécifiée est {1}.
it: GetChildRows richiede una riga il cui oggetto Table sia {0}. L'oggetto Table della riga specificata è invece {1}.
ja: GetChildRows には、Table {0} に属する行が必要ですが、指定された行の Table は {1} です。
ko: GetChildRows에는 Table이 {0}인 행이 필요한데 Table이 {1}인 행을 지정했습니다.
pt_br: GetChildRows requer uma linha cuja Table seja {0}, mas a Table da linha especificada é {1}.
ru: Для GetChildRows требуется строка из таблицы {0}, но таблицей Table заданной строки является {1}.
zh_hans: GetChildRows 要求表为 {0} 的行，但指定行的 Table 是 {1}。
zh_hant: GetChildRows 需要 Table 為 {0} 的資料列，但指定資料列的 Table 為 {1}。

# DataRelation_ForeignDataSet
source: This relation should connect two tables in this DataSet to be added to this DataSet.
de: Diese Beziehung sollte zwei Tabellen in diesem DataSet verbinden, die dem DataSet hinzugefügt werden sollen.
es: Esta relación debe conectar dos tablas en este DataSet para agregarse a este DataSet.
fr: Cette relation doit connecter deux tables dans ce DataSet pour être ajoutée à ce DataSet.
it: Per poter essere aggiunta a questo DataSet, la relazione deve connettere due tabelle del DataSet.
ja: このリレーションシップをこの DataSet に追加するには、DataSet にある 2 つのテーブルをこのリレーションシップで関連付けなければなりません。
ko: 이 DataSet에 관계를 추가하려면 해당 DataSet의 두 테이블을 연결해야 합니다.
pt_br: Esta relação deve conectar duas tabelas neste DataSet a serem adicionadas a este DataSet.
ru: Это отношение должно соединять в данном DataSet две таблицы, подлежащие добавлению к этому DataSet.
zh_hans: 此关系应连接 DataSet 中的两个表，以使该关系添加到该 DataSet 中。
zh_hant: 這個關聯必須連接這個 DataSet 中的兩個資料表以加入至這個 DataSet。

# DataRelation_GetParentRowTableMismatch
source: GetParentRow requires a row whose Table is {0}, but the specified row's Table is {1}.
de: GetParentRow erfordert eine Zeile, deren Tabelle {0} ist. Die Tabelle der angegebenen Zeile ist jedoch {1}.
es: GetParentRow requiere una fila cuya tabla es {0}, pero la fila especificada de la tabla es {1}.
fr: GetParentRow requiert une ligne dont la table est {0}, mais la table de la ligne spécifiée est {1}.
it: GetParentRow richiede una riga la cui tabella sia {0}. La tabella della riga specificata è invece {1}.
ja: GetParentRows には、テーブル {0} に属する行が必要ですが、指定された行のテーブルは {1} です。
ko: GetParentRow에는 테이블이 {0}인 행이 필요한데 테이블이 {1}인 행을 지정했습니다.
pt_br: GetParentRow requer uma linha da tabela {0}, mas a tabela da linha especificada é {1}.
ru: Для GetParentRow требуется строка из таблицы {0}, но таблицей заданной строки является {1}.
zh_hans: GetParentRow 要求表为 {0} 的行，但指定行的表是 {1}。
zh_hant: GetParentRow 需要資料表為 {0} 的資料列，但指定資料列的資料表為 {1}。

# DataRelation_SetParentRowTableMismatch
source: SetParentRow requires a child row whose Table is {0}, but the specified row's Table is {1}.
de: SetParentRow erfordert eine untergeordnete Zeile, deren Tabelle {0} ist. Die Tabelle der angegebenen Zeile ist jedoch {1}.
es: SetParentRow requiere una fila secundaria cuya tabla es {0}, pero la fila especificada de la tabla es {1}.
fr: SetParentRow requiert une ligne enfant dont la table est {0}, mais la table de la ligne spécifiée est {1}.
it: SetParentRow richiede una riga figlio la cui tabella sia {0}. La tabella della riga specificata è invece {1}.
ja: SetParentRow にはテーブル {0} の子行が必要ですが、指定された行のテーブルは {1} です。
ko: SetParentRow에는 테이블이 {0}인 자식 행이 필요하지만 지정된 행의 테이블은 {1}입니다.
pt_br: SetParentRow requer uma linha filho da tabela {0}, mas a tabela da linha especificada é {1}.
ru: Для SetParentRow требуется дочерняя строка из таблицы {0}, но таблицей заданной строки является {1}.
zh_hans: SetParentRow 要求表为 {0} 的子行，但指定行的表是 {1}。
zh_hant: SetParentRow 需要資料表為 {0} 的子資料列，但指定資料列的資料表為 {1}。

# DataRelation_DataSetMismatch
source: Cannot have a relationship between tables in different DataSets.
de: Eine Beziehung zwischen Tabellen in unterschiedlichen DataSets ist nicht möglich.
es: No puede haber una relación entre tablas de diferentes DataSet.
fr: Impossible d'avoir une relation entre des tables dans des DataSets différents.
it: Impossibile avere una relazione tra tabelle di DataSet diversi.
ja: 異なる DataSet のテーブル間にリレーションシップを指定することはできません。
ko: 서로 다른 DataSet의 테이블 간에 관계를 가질 수 없습니다.
pt_br: Não é possível haver uma relação entre tabelas de DataSets diferentes.
ru: Отношения между таблицами в различных DataSet невозможны.
zh_hans: 在不同 DataSet 中的表之间不能建立关系。
zh_hant: 不同 DataSet 的資料表之間不可以有關聯性。

# DataRelation_TablesInDifferentSets
source: Cannot create a relation between tables in different DataSets.
de: Es kann keine Beziehung zwischen Tabellen in unterschiedlichen DataSets hergestellt werden.
es: No se puede crear una relación entre tablas de diferentes DataSets.
fr: Impossible de créer une relation entre des tables dans des DataSets différents.
it: Impossibile creare una relazione tra tabelle di DataSet diversi.
ja: 異なる DataSet のテーブル間にリレーションシップを作成することはできません。
ko: 서로 다른 DataSets의 테이블 간에 관계를 만들 수 없습니다.
pt_br: Não é possível criar uma relação entre tabelas de DataSets diferentes.
ru: Невозможно создать отношение между таблицами в различных DataSet.
zh_hans: 不能在不同 DataSet 的各表之间建立关系。
zh_hant: 無法在不同 DataSet 的資料表之間建立關聯。

# DataRelation_AlreadyExists
source: A relation already exists for these child columns.
de: Bezug für diese untergeordneten Spalten ist bereits vorhanden.
es: Ya existe una relación para estas columnas secundarias.
fr: Une relation existe déjà pour ces colonnes enfants.
it: Esiste già una relazione per queste colonne figlio.
ja: これらの子列には既にリレーションシップが存在します。
ko: 해당 자식 열에 대한 관계가 이미 있습니다.
pt_br: Já existe uma relação para essas colunas filho.
ru: Для этих дочерних столбцов уже существует отношение.
zh_hans: 这些子列之间已经存在某种关系。
zh_hant: 已經存在這些子資料行的關聯。

# DataRelation_DoesNotExist
source: This relation doesn't belong to this relation collection.
de: Diese Beziehung gehört nicht zu dieser Beziehungssammlung.
es: Esta relación no pertenece a esta colección de relaciones.
fr: Cette relation n'appartient pas à cette collection relation.
it: Questa relazione non appartiene a questa raccolta di relazioni.
ja: このリレーションシップはこのリレーションシップ コレクションに属していません。
ko: 이 관계는 현재 관계 컬렉션에 속하지 않습니다.
pt_br: Esta relação não pertence a esta coleção de relações.
ru: Это отношение не принадлежит данной коллекции отношений.
zh_hans: 该关系不属于此关系集合。
zh_hant: 這個關聯不屬於這個關聯集合。

# DataRelation_AlreadyInOtherDataSet
source: This relation already belongs to another DataSet.
de: Dieser Bezug gehört bereits zu einen anderen DataSet.
es: Esta relación ya pertenece a otro DataSet.
fr: Cette relation appartient déjà à un autre DataSet.
it: La relazione appartiene già a un DataSet diverso.
ja: このリレーションシップは既に別の DataSet に属しています。
ko: 이 관계는 이미 다른 DataSet에 속해 있습니다.
pt_br: Esta relação já pertence a outro DataSet.
ru: Это отношение уже принадлежит другому DataSet.
zh_hans: 该关系已经属于另一个 DataSet。
zh_hant: 這個關聯已經屬於其他 DataSet。

# DataRelation_AlreadyInTheDataSet
source: This relation already belongs to this DataSet.
de: Dieser Bezug gehört bereits zu diesen DataSet.
es: Esta relación ya pertenece a este DataSet.
fr: Cette relation appartient déjà à ce DataSet.
it: La relazione appartiene già a questo DataSet.
ja: このリレーションシップは既にこの DataSet に属しています。
ko: 이 관계는 이미 현재 DataSet에 속해 있습니다.
pt_br: Esta relação já pertence a este DataSet.
ru: Это отношение уже принадлежит этому DataSet.
zh_hans: 该关系已经属于此 DataSet。
zh_hant: 這個關聯已經屬於這個 DataSet。

# DataRelation_DuplicateName
source: A Relation named '{0}' already belongs to this DataSet.
de: Eine Relation mit dem Namen '{0}' ist bereits in diesem DataSet vorhanden.
es: La Relation denominada '{0}' ya pertenece a este DataSet.
fr: Une Relation nommée '{0}' appartient déjà à ce DataSet.
it: Un oggetto Relation denominato '{0}' appartiene già a questo DataSet.
ja: '{0}' という Relation は既にこの DataSet に属しています。
ko: 이름이 '{0}'인 Relation이 이 DataSet에 이미 속해 있습니다.
pt_br: Este DataSet já possui uma Relation nomeada '{0}'.
ru: Отношение Relation с именем "{0}" уже принадлежит этому DataSet.
zh_hans: 名为“{0}”的 Relation 已经属于此 DataSet。
zh_hant: 名稱為 '{0}' 的 Relation 已經屬於這個 DataSet。

# DataRelation_NotInTheDataSet
source: Relation {0} does not belong to this DataSet.
de: Die Relation {0} gehört nicht in diesen DataSet.
es: La Relation {0} no pertenece a este DataSet.
fr: La Relation {0} n'appartient pas à ce DataSet.
it: L'oggetto Relation {0} non appartiene a questo DataSet.
ja: Relation {0} はこの DataSet に属していません。
ko: Relation {0}이(가) 이 DataSet에 속하지 않습니다.
pt_br: Relation {0} não pertence a este DataSet.
ru: Отношение Relation {0} не принадлежит этому DataSet.
zh_hans: Relation {0} 不属于此 DataSet。
zh_hant: Relation {0} 不屬於這個 DataSet。

# DataRelation_OutOfRange
source: Cannot find relation {0}.
de: Bezug {0} wurde nicht gefunden.
es: No se puede encontrar la relación {0}.
fr: Impossible de trouver la relation {0}.
it: Impossibile trovare la relazione {0}.
ja: リレーションシップ {0} が見つかりません。
ko: {0} 관계를 찾을 수 없습니다.
pt_br: Não é possível encontrar a relação {0}.
ru: Невозможно найти отношение {0}.
zh_hans: 无法找到关系 {0}。
zh_hant: 找不到關聯 {0}。

# DataRelation_TableNull
source: Cannot create a collection on a null table.
de: Eine Sammlung kann nicht für eine null-Tabelle erstellt werden.
es: No se puede crear una colección en una tabla null.
fr: Impossible de créer une collection sur une table null.
it: Impossibile creare una raccolta su una tabella null.
ja: null のテーブルにコレクションを作成することはできません。
ko: null 테이블에 컬렉션을 만들 수 없습니다.
pt_br: Não é possível criar uma coleção em uma tabela null.
ru: Невозможно создать коллекцию для таблицы со значением null.
zh_hans: 不能在 null 表上创建集合。
zh_hant: 無法在 null 資料表上建立集合。

# DataRelation_TableWasRemoved
source: The table this collection displays relations for has been removed from its DataSet.
de: Die Tabelle, für die diese Sammlung Beziehungen anzeigt, wurde aus dem DataSet entfernt.
es: Se ha eliminado del DataSet la tabla para la que esta colección muestra relaciones.
fr: La table dont cette collection affiche les relations a été supprimée de son DataSet.
it: La tabella le cui relazioni sono visualizzate da questa raccolta è stata rimossa dal relativo DataSet.
ja: このコレクションがリレーションシップを示すテーブルは、DataSet から削除されています。
ko: 이 컬렉션이 관계를 표시하는 테이블은 DataSet에서 제거되었습니다.
pt_br: A tabela cujas relações são exibidas nesta coleção foi removida de seu DataSet.
ru: Таблица, для которой эта коллекция отображает отношения, удалена из своего DataSet.
zh_hans: 此集合为其显示关系的表已经从其 DataSet 中移除。
zh_hant: 這個集合所顯示關聯的資料表已經從它的 DataSet 中移除。

# DataRelation_ChildTableMismatch
source: Cannot add a relation to this table's ParentRelation collection where this table isn't the child table.
de: Es kann keine Beziehung zur ParentRelation-Sammlung dieser Tabelle hinzugefügt werden, bei der dieser Tabelle nicht die untergeordnete Tabelle ist.
es: No se puede agregar una relación a la colección de tablas ParentRelation donde esta tabla no es la tabla secundaria.
fr: Impossible d'ajouter une relation à la collection ParentRelation de cette table lorsque cette table n'est pas la table enfant.
it: Impossibile aggiungere una relazione alla raccolta ParentRelation di questa tabella se non è la tabella figlio.
ja: 子テーブルに指定されていないこのテーブルの ParentRelation コレクションにリレーションシップを追加することはできません。
ko: 이 테이블이 자식 테이블이 아닌 경우 테이블의 ParentRelation 컬렉션에 관계를 추가할 수 없습니다.
pt_br: Não é possível adicionar uma relação à coleção ParentRelation desta tabela, onde a tabela não é a tabela filho.
ru: Невозможно добавить отношение в коллекцию ParentRelation этой таблицы, если для коллекции эта таблица не является дочерней.
zh_hans: 如果此表在它的 ParentRelation 集合中不是子表，则不能将关系添加到该集合中。
zh_hant: 無法加入關聯至這個資料表的 ParentRelation 集合，在該集合中這個資料表不是子資料表。

# DataRelation_ParentTableMismatch
source: Cannot add a relation to this table's ChildRelation collection where this table isn't the parent table.
de: Es kann keine Beziehung zur ChildRelation-Sammlung dieser Tabelle hinzugefügt werden, in der diese Tabelle nicht die übergeordnete Tabelle ist.
es: No se puede agregar una relación a la colección de tablas ChildRelation donde esta tabla no es la tabla primaria.
fr: Impossible d'ajouter une relation à la collection ChildRelation de cette table lorsque cette table n'est pas la table parente.
it: Impossibile aggiungere una relazione alla raccolta ChildRelation della tabella se non è la tabella padre.
ja: リレーションシップをこのテーブルの ChildRelation コレクションに追加できません。このテーブルは親テーブルではありません。
ko: 이 테이블이 부모 테이블이 아닌 경우 테이블의 ChildRelation 컬렉션에 관계를 추가할 수 없습니다.
pt_br: Não é possível adicionar uma relação à coleção ChildRelation desta tabela, onde a tabela não é a tabela pai.
ru: Невозможно добавить отношение в коллекцию ChildRelation этой таблицы, не являющейся в этой коллекции родительской таблицей.
zh_hans: 如果此表在它的 ChildRelation 集合中不是父表，则不能将关系添加到该集合中。
zh_hant: 無法加入關聯至這個資料表的 ChildRelation 集合，在該集合中這個資料表不是父資料表。

# DataRelation_RelationNestedReadOnly
source: Cannot set the 'Nested' property to false for this relation.
de: Die 'Nested'-Eigenschaft kann für diese Beziehung nicht auf 'false' gesetzt werden.
es: No se puede establecer en false la propiedad 'Nested' para esta relación.
fr: Impossible de définir la valeur false pour la propriété 'Nested' pour cette relation.
it: Impossibile impostare la proprietà 'Nested' su false per questa relazione.
ja: このリレーションシップに対し、'Nested' プロパティを false に設定することはできません。
ko: 이 관계에 대해 'Nested' 속성을 false로 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade 'Nested' como false para esta relação.
ru: Невозможно присвоить свойству Nested этого отношения значение false (ложь).
zh_hans: 不能将此关系的“Nested”属性设置为 false。
zh_hant: 無法將這個關聯的 'Nested' 屬性設定為 false。

# DataRelation_TableCantBeNestedInTwoTables
source: The same table '{0}' cannot be the child table in two nested relations.
de: Dieselbe Tabelle '{0}' kann in zwei geschachtelten Beziehungen nicht die untergeordnete Tabelle sein.
es: La misma tabla '{0}' no puede ser una tabla secundaria en dos relaciones anidadas.
fr: La même table '{0}' ne peut pas être la table enfant dans deux relations imbriquées.
it: La stessa tabella '{0}' non può essere la tabella figlia in due relazioni annidate.
ja: 入れ子になった 2 つのリレーションシップでは、同じテーブル '{0}' を子テーブルにすることはできません。
ko: 동일한 테이블 '{0}'은(는) 두 개의 중첩 관계에서 자식 테이블이 될 수 없습니다.
pt_br: A mesma tabela '{0}' não pode ser tabela filha em duas relações aninhadas.
ru: Одна и та же таблица "{0}" не может быть дочерней в двух вложенных отношениях.
zh_hans: 同样的表“{0}”不能作为两个嵌套关系中的子表。
zh_hant: 在兩個巢狀關聯中，相同資料表 '{0}' 不可以是子資料表。

# DataRelation_LoopInNestedRelations
source: The table ({0}) cannot be the child table to itself in nested relations.
de: Die Tabelle ({0}) kann in geschachtelten Beziehungen nicht sich selbst untergeordnet sein.
es: La tabla ({0}) no puede ser la tabla secundaria de sí misma en relaciones anidadas.
fr: La table ({0}) ne peut pas être sa table enfant dans les relations imbriquées.
it: La tabella ({0}) non può essere figlia di se stessa nelle relazioni annidate.
ja: テーブル ({0}) を、入れ子にされたリレーションシップでそれ自体の子テーブルにすることはできません。
ko: 테이블({0})은 중첩 관계에서 자신의 자식 테이블이 될 수 없습니다.
pt_br: A tabela ({0}) não pode ser a sua própria tabela filho em relações aninhadas.
ru: Во вложенных отношениях таблица ({0}) не может быть дочерней по отношению к себе.
zh_hans: 表({0})在嵌套关系中不能是其自身的子表。
zh_hant: 在巢狀關聯中資料表 ({0}) 不可是自己的子資料表。

# DataRelation_CaseLocaleMismatch
source: Cannot add a DataRelation or Constraint that has different Locale or CaseSensitive settings between its parent and child tables.
de: DataRelation oder Constraint mit unterschiedlichen Locale- oder CaseSensitive-Einstellungen in den übergeordneten und untergeordneten Tabellen kann nicht hinzugefügt werden.
es: No se puede agregar una clase DataRelation o Constraint con configuración Locale o CaseSensitive distinta entre las tablas primaria y secundarias.
fr: Impossible d'ajouter un DataRelation ou un Constraint ayant des paramètres Locale ou CaseSensitive différents entre ses tables parentes et enfants.
it: Impossibile aggiungere DataRelation o Constraint con impostazioni Locale o CaseSensitive delle tabelle padre diverse da quelle delle tabelle figlio.
ja: 親テーブルと子テーブル間で異なる Locale または CaseSensitive 設定を含む DataRelation または Constraint を追加できません。
ko: 부모 테이블과 자식 테이블 간에 Locale 또는 CaseSensitive 설정이 다른 DataRelation 또는 Constraint를 추가할 수 없습니다.
pt_br: Não é possível adicionar DataRelation ou Constraint que têm configurações Locale ou CaseSensitive diferentes entre suas tabelas pai e filho.
ru: Невозможно добавить DataRelation или Constraint, для которых значения параметров Locale или CaseSensitive различны в родительской и дочерней таблицах.
zh_hans: 无法添加在父表和子表之间具有不同 Locale 或 CaseSensitive 设置的 DataRelation 或 Constraint 。
zh_hant: 加入 DataRelation 或 Constraint 時，若其父和子資料表之間有不同的 Locale 或 CaseSensitive 設定，就無法加入。

# DataRelation_ParentOrChildColumnsDoNotHaveDataSet
source: Cannot create a DataRelation if Parent or Child Columns are not in a DataSet.
de: DataRelation kann nicht erstellt werden, wenn über- und untergeordneten Spalten nicht in einem DataSet enthalten sind.
es: No se puede crear DataRelation si las columnas primarias o secundarias no están en DataSet.
fr: Impossible de créer un DataRelation si les colonnes parent ou enfant ne se trouvent pas dans un DataSet.
it: Impossibile creare una DataRelation se non sono presenti colonne padre o figlio in un DataSet.
ja: 親の列または子の列が DataSet にない場合は、DataRelation を作成できません。
ko: Parent 또는 Child 열이 DataSet에 없는 경우 DataRelation을 만들 수 없습니다.
pt_br: Não será possível criar DataRelation se a coluna Parent ou Child não estiver em DataSet.
ru: Невозможно создать DataRelation, если родительские или дочерние столбцы не входят в DataSet.
zh_hans: 如果父列或子列不在 DataSet 中，则无法创建 DataRelation。
zh_hant: 若 Parent 或 Child Columns 不在 DataSet 中時，無法建立 DataRelation。

# DataRelation_InValidNestedRelation
source: Nested table '{0}' which inherits its namespace cannot have multiple parent tables in different namespaces.
de: Die geschachtelte Tabelle '{0}', die ihren Namespace erbt, darf nicht über mehrere übergeordnete Tabellen in verschiedenen Namespaces verfügen.
es: Una tabla anidada '{0}' que hereda su espacio de nombres no puede tener varias tablas primarias en espacios de nombres diferentes.
fr: La table imbriquée '{0}' héritant de son espace de noms ne peut pas comporter plusieurs tables parent dans des espaces de noms distincts.
it: La tabella annidata "{0}" che eredita il proprio spazio dei nomi non può avere più tabelle padre in spazi dei nomi differenti.
ja: それ自体の名前空間を継承する入れ子テーブル '{0}' は、名前空間が異なる複数の親テーブルを持つことはできません。
ko: 네임스페이스를 상속하는 중첩 테이블 '{0}'에는 네임스페이스가 다른 여러 부모 테이블을 사용할 수 없습니다.
pt_br: Tabela aninhada '{0}' com espaço para nome herdado não pode ter várias tabelas pais em espaços para nome diferentes.
ru: Вложенная таблица "{0}", которая наследует свое пространство имен, не может иметь несколько родительских таблиц в разных пространствах имен.
zh_hans: 嵌套表“{0}”的命名空间是继承而来的，不能在不同的命名空间中拥有多个父表。
zh_hant: 繼承其命名空間的巢狀資料表 '{0}' 無法具有多個不同命名空間的父資料表。

# DataRelation_InValidNamespaceInNestedRelation
source: Nested table '{0}' with empty namespace cannot have multiple parent tables in different namespaces.
de: Die geschachtelte Tabelle '{0}' mit leerem Namespace darf nicht über mehrere übergeordnete Tabellen in verschiedenen Namespaces verfügen.
es: Una tabla anidada '{0}' con espacios de nombres vacíos no puede tener varias tablas primarias es espacios de nombres diferentes.
fr: La table imbriquée '{0}' avec espace de noms vide ne peut pas avoir plusieurs tables parentes dans différents espaces de noms.
it: La tabella annidata '{0}' con spazio dei nomi vuoto non può avere più tabelle padre in spazi dei nomi diversi.
ja: 名前空間が空で、入れ子になったテーブル '{0}' は、異なる名前空間の親テーブルを複数持つことはできません。
ko: 빈 네임스페이스가 있는 중첩 테이블 '{0}'에는 네임스페이스가 다른 여러 개의 부모 테이블을 사용할 수 없습니다.
pt_br: Tabela aninhada '{0}' com espaço para nome vazio não pode ter várias tabelas pais em espaços para nome diferentes.
ru: Вложенная таблица "{0}" с пустым пространством имен не может иметь несколько родительских таблиц в разных пространствах имен.
zh_hans: 具有空命名空间的嵌套表“{0}”不能在不同命名空间中具有多个父表。
zh_hant: 附空白命名空間的巢狀資料表 '{0}' 無法具有多個不同命名空間的父資料表。

# DataRow_NotInTheDataSet
source: The row doesn't belong to the same DataSet as this relation.
de: Die Zeile gehört nicht zum selben DataSet wie diese Beziehung.
es: La fila no pertenece al mismo DataSet que la relación.
fr: La ligne n'appartient pas au même DataSet que cette relation.
it: La riga non appartiene allo stesso DataSet di questa relazione.
ja: この行は、このリレーションシップと同じ DataSet に属していません。
ko: 행이 이 관계와 동일한 DataSet에 속하지 않습니다.
pt_br: A linha não pertence ao mesmo DataSet que esta relação.
ru: Данная строка и это отношение принадлежат разным DataSet.
zh_hans: 该行不属于与此关系相同的 DataSet。
zh_hant: 資料列和這個關聯不屬於相同的 DataSet。

# DataRow_NotInTheTable
source: Cannot perform this operation on a row not in the table.
de: Diese Operation kann nicht an einer Zeile durchgeführt werden, die sich nicht in der Tabelle befindet.
es: No se puede realizar esta operación en una fila que no está en la tabla.
fr: Impossible d'effectuer cette opération sur une ligne qui ne se trouve pas dans la table.
it: Impossibile eseguire questa operazione su una riga non presente nella tabella.
ja: テーブルにない行でこの操作を実行することはできません。
ko: 테이블에 없는 행에서는 이 작업을 수행할 수 없습니다.
pt_br: Não é possível realizar esta operação em uma linha que não esteja na tabela.
ru: Невозможно выполнить эту операцию над строкой, не содержащейся в данной таблице.
zh_hans: 不能对该表中没有的行执行此操作。
zh_hant: 無法對不存在於資料表中的資料列上執行這項作業。

# DataRow_ParentRowNotInTheDataSet
source: This relation and child row don't belong to same DataSet.
de: Diese Beziehung und diese untergeordnete Zeile gehören nicht zu demselben DataSet.
es: La relación y la fila secundaria no pertenecen al mismo DataSet.
fr: Cette relation et cette ligne enfant n'appartiennent pas au même DataSet.
it: Questa relazione e la riga figlio non appartengono allo stesso DataSet.
ja: このリレーションシップおよび子行は同じ DataSet に属していません。
ko: 이 관계 및 자식 행이 동일한 DataSet에 속하지 않습니다.
pt_br: Esta relação e esta linha filho não pertencem ao mesmo DataSet.
ru: Это отношение и дочерняя строка не принадлежат одному DataSet.
zh_hans: 此关系和子行不属于同一个 DataSet。
zh_hant: 這個關聯和子資料列不屬於相同的 DataSet。

# DataRow_EditInRowChanging
source: Cannot change a proposed value in the RowChanging event.
de: Ein vorgeschlagener Wert kann nicht im RowChanging-Ereignis geändert werden.
es: No se puede cambiar un valor propuesto en el evento RowChanging.
fr: Impossible de changer une valeur proposée dans l'événement RowChanging.
it: Impossibile modificare un valore proposto nell'evento RowChanging.
ja: RowChanging イベント内の各値を変更することはできません。
ko: RowChanging 이벤트에서 제안한 값을 변경할 수 없습니다.
pt_br: Não é possível alterar um valor proposto no evento RowChanging.
ru: Невозможно изменить предложенное значение в событии RowChanging.
zh_hans: 不能在 RowChanging 事件中更改建议的值。
zh_hant: 無法變更 RowChanging 事件中的建議值。
