Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# OleDb_CantCreate
source: The provider could not allocate memory in which to return {0} data.
de: Anbieter konnte keinen Arbeitsspeicher für die Rückgabe von {0}-Daten belegen.
es: El proveedor no puede asignar memoria para devolver los datos {0}.
fr: Le fournisseur n'a pas pu allouer de la mémoire pour retourner les données {0}.
it: Impossibile per il provider allocare la memoria in cui restituire i dati di {0}.
ja: プロバイダーによって、{0} データを返すメモリを割り当てることができませんでした。
ko: 공급자가 {0} 데이터를 반환할 메모리를 할당할 수 없습니다.
pt_br: O provedor não pôde alocar memória para retornar dados {0}.
ru: Данный поставщик не может выделить память, в которую возвращаются данные {0}.
zh_hans: 提供程序无法分配返回 {0} 数据的内存。
zh_hant: 提供者無法配置傳回 {0} 資料的記憶體。

# OleDb_DataOverflow
source: Conversion failed because the {0} data value overflowed the type specified for the {0} value part in the consumer's buffer.
de: Die Konvertierung ist fehlgeschlagen, da der Datenwert {0} den für den Wertteil {0} im Puffer des Benutzers festgelegten Typ überlaufen hat.
es: Error de conversión, debido a que el valor de los datos {0} desbordó el tipo especificado para la parte de valor {0} en el búfer del consumidor.
fr: Échec de la conversion, car la valeur des données {0} a dépassé le type spécifié pour la partie de la valeur {0} dans la mémoire tampon du consommateur.
it: Impossibile effettuare la conversione. Il valore dei dati {0} ha provocato un overflow del tipo specificato per la parte di valore {0} del buffer del consumer.
ja: 変換に失敗しました。{0} データ値が、使用者側のバッファーの {0} 値に指定された型をオーバーフローしました。
ko: {0} 데이터 값이 소비자 버퍼의 {0} 값에 지정된 형식에 대해 오버플로되었기 때문에 변환하지 못했습니다.
pt_br: Falha na conversão porque o valor de dados {0} estourou o tipo especificado para a parte de valor {0} no buffer do consumidor.
ru: Сбой преобразования из-за того, что для значения данных {0} произошло переполнение типа, указанного для части значения {0} в буфере потребителя.
zh_hans: 转换失败，因为 {0} 数据值溢出了为使用者缓冲区中 {0} 值部分指定的类型。
zh_hant: 轉換失敗，因為 {0} 資料值溢位消費者緩衝區中 {0} 數值部分的指定型別。

# OleDb_GVtUnknown
source: OleDbDataAdapter internal error: [get] Unknown OLE DB data type: 0x{0} ({1}).
de: Interner OleDbDataAdapter-Fehler: [get] unbekannter OLE DB-Datentyp: 0x{0} ({1}).
es: Error interno de OleDbDataAdapter: tipo de datos de OLE DB [get] desconocido: 0x{0} ({1}).
fr: Erreur interne OleDbDataAdapter : [get] type de données OLE DB inconnu : 0x{0} ({1}).
it: Errore interno OleDbDataAdapter: [get]. Tipo di dati OLE DB sconosciuto: 0x{0} ({1}).
ja: OleDbDataAdapter の内部エラー : [get] 不明な OLE DB データ型です : 0x{0} ({1})。
ko: OleDbDataAdapter 내부 오류: [get] 알 수 없는 OLE DB 데이터 형식입니다. 0x{0} ({1})
pt_br: Erro interno de OleDbDataAdapter: [get] tipo de dados OLE DB desconhecido: 0x{0} ({1}).
ru: Внутренняя ошибка OleDbDataAdapter: [get] Неизвестный тип данных OLE DB: 0x{0} ({1}).
zh_hans: OleDbDataAdapter 内部错误: [get] 未知的 OLE DB 数据类型: 0x{0} ({1})。
zh_hant: OleDbDataAdapter 內部錯誤: [get] 未知的 OLE DB 資料型別: 0x{0} ({1})。

# OleDb_SignMismatch
source: Conversion failed because the {0} data value was signed and the type specified for the {0} value part in the consumer's buffer was unsigned.
de: Konvertierung ist fehlgeschlagen, da der {0}-Datenwert signiert wurde und der für den {0}-Wert angegebene Typ nicht signiert wurde.
es: Error de conversión, debido a que el valor de los datos {0} se firmaron y el tipo especificado para la parte de valor {0} en el búfer del consumidor estaba sin firmar.
fr: Échec de la conversion, car la valeur de données {0} était signée et le type spécifié pour la partie de la valeur {0} dans la mémoire tampon du consommateur n'était pas signé.
it: Impossibile effettuare la conversione. Il valore dei dati {0} è con segno, mentre il tipo specificato per la parte del valore {0} nel buffer del consumer era senza segno.
ja: 変換に失敗しました。{0} データ値が符号付きであるのに対し、コンシューマー バッファーの {0} 値には符号なしが指定されています。
ko: {0} 데이터 값은 부호가 있고 소비자 버퍼의 {0} 값에 지정한 형식은 부호가 없기 때문에 변환하지 못했습니다.
pt_br: Falha na conversão porque o valor dos dados {0} tinha sinal e o tipo especificado para a parte de valor {0} no buffer do consumidor era sem sinal.
ru: Сбой преобразования из-за того, что значение данных {0} имеет знак, а для части значения {0} в буфере потребителя указан тип без знака.
zh_hans: 转换失败，因为 {0} 数据值带有正负号，而为使用者缓冲区中 {0} 值部分指定的类型不带符号。
zh_hant: 轉換失敗，因為 {0} 資料值為 signed，而消費者緩衝區中 {0} 數值部分的指定型別為 unsigned。

# OleDb_SVtUnknown
source: OleDbDataAdapter internal error: [set] Unknown OLE DB data type: 0x{0} ({1}).
de: Interner OleDbDataAdapter-Fehler: [set] unbekannter OLE DB-Datentyp: 0x{0} ({1}).
es: Error interno de OleDbDataAdapter: [set] Tipo de datos OLE DB desconocido: 0x{0} ({1}).
fr: Erreur interne OleDbDataAdapter : [set] type de données OLE DB inconnu : 0x{0} ({1}).
it: Errore interno OleDbDataAdapter: [set]. Tipo di dati OLE DB sconosciuto: 0x{0} ({1}).
ja: OleDbDataAdapter の内部エラー : [set] 不明な OLE DB データ型です。0x{0} ({1})
ko: OleDbDataAdapter 내부 오류: [set] 알 수 없는 OLE DB 데이터 형식입니다: 0x{0}({1}).
pt_br: Erro interno de OleDbDataAdapter: [set] Tipo de dados OLE DB desconhecido: 0x{0} ({1}).
ru: Внутренняя ошибка OleDbDataAdapter: [set] Неизвестный тип данных OLE DB: 0x{0} ({1}).
zh_hans: OleDbDataAdapter 内部错误: [set] 未知的 OLE DB 数据类型: 0x{0} ({1})。
zh_hant: OleDbDataAdapter 內部錯誤: [set] 未知的 OLE DB 資料型別: 0x{0} ({1})。

# OleDb_Unavailable
source: The provider could not determine the {0} value. For example, the row was just created, the default for the {0} column was not available, and the consumer had not yet set a new {0} value.
de: Anbieter konnte den {0}-Wert nicht ermitteln. Zum Beispiel: die Zeile wurde gerade erstellt, der Standard für die {0}-Spalte nicht verfügbar und der Consumer hat noch keinen neuen {0}-Wert gesetzt.
es: El proveedor no puede determinar el valor {0}. Por ejemplo, la fila se acaba de crear, el valor predeterminado para la columna {0} no está disponible y el consumidor todavía no ha establecido un nuevo valor {0}.
fr: Le fournisseur n'a pas pu déterminer la valeur {0}. Par exemple, la ligne venait d'être créée, la valeur par défaut pour la colonne {0} n'était pas disponible et le consommateur n'avait pas encore défini une nouvelle valeur {0}.
it: Il provider non ha potuto determinare il valore di {0}. Esempio: la riga è stata appena creata, non è disponibile un valore predefinito per la colonna {0} e il consumer non ha ancora assegnato a {0} un nuovo valore.
ja: プロバイダーで {0} 値を特定できませんでした。たとえば、行が作成されたときに {0} 列の既定値が使用できない状態で、使用者が新しい {0} 値を設定していなかった場合が考えられます。
ko: 공급자가 {0} 값을 결정하지 못했습니다. 예를 들어 행을 새로 만들었거나, {0} 열의 기본값을 사용할 수 없거나, 소비자가 새 {0} 값을 아직 설정하지 않은 경우입니다.
pt_br: O provedor não pôde determinar o valor {0}. Por exemplo, a linha acabou de ser criada, o padrão para a coluna {0} não estava disponível, e o consumido ainda não definiu um novo valor {0}.
ru: Поставщик не смог определить значение {0}. Например, строка только что была создана, значение по умолчанию для столбца {0} не было доступно, а потребитель еще не задал нового значения {0}.
zh_hans: 提供程序无法确定 {0} 值。例如，该行刚刚创建，未提供 {0} 列的默认值，并且使用者尚未设置新 {0} 值。
zh_hant: 提供者無法決定 {0} 值。例如，剛建立資料列，{0} 資料行的預設值無法使用，而消費者尚未設定新 {0} 值。

# OleDb_UnexpectedStatusValue
source: OLE DB Provider returned an unexpected status value of {0}.
de: OLE DB-Anbieter hat unerwarteten Statuswert von {0} zurückgegeben.
es: El proveedor OLE DB devolvió un valor de estado inesperado de {0}.
fr: Le fournisseur OLE DB a retourné une valeur d'état {0} inattendue.
it: Il provider OLE DB ha restituito un valore di stato non previsto: {0}
ja: OLE DB プロバイダーが、予期しない {0} の状態値を返しました。
ko: OLE DB 공급자에서 예기치 않은 상태 코드 {0}을(를) 반환했습니다.
pt_br: Provedor OLE DB retornou um valor de status inesperado de {0}.
ru: Поставщик OLE DB возвратил непредусмотренное значение состояния, {0}.
zh_hans: OLE DB 提供程序返回意外状态值 {0}。
zh_hant: OLE DB Provider 傳回 {0} 的未預期狀態值。

# OleDb_ThreadApartmentState
source: The OleDbDataReader.Read must be used from the same thread on which is was created if that thread's ApartmentState was not ApartmentState.MTA.
de: OleDbDataReader.Read muss im gleichen Thread verwendet werden, in dem sie erstellt wurde, wenn der ApartmentState des Threads nicht ApartmentState.MTA war.
es: OleDbDataReader.Read se debe utilizar desde el mismo subproceso en el que se creó si ApartmentState del subproceso no es ApartmentState.MTA.
fr: OleDbDataReader.Read doit être utilisé à partir du même thread que celui ayant servi à le créer si l'ApartmentState de ce thread n'est pas ApartmentState.MTA.
it: Se l'ApartmentState del thread non è ApartmentState.MTA, è necessario utilizzare OleDbDataReader.Read dal thread in cui è stato creato.
ja: スレッドの ApartmentState が ApartmentState.MTA 出ない場合、OleDbDataReader.Read を作成されたスレッドと同じスレッドから使用しなければなりません。
ko: 해당 스레드의 ApartmentState가 ApartmentState.MTA가 아닌 경우 OleDbDataReader.Read는 이것을 만든 동일한 스레드에서 사용되어야 합니다.
pt_br: O OleDbDataReader.Read deve ser usado a partir do mesmo thread em que foi criado caso ApartmentState desse thread não seja ApartmentState.MTA.
ru: OleDbDataReader.Read должен выполняться в том же потоке, к котором был создан, если значением свойства ApartmentState этого потока не было ApartmentState.MTA.
zh_hans: 如果创建 OleDbDataReader.Read 的线程的 ApartmentState 不是 ApartmentState.MTA，则必须从该线程中使用 OleDbDataReader.Read。
zh_hant: 如果執行緒的 ApartmentState 不是 ApartmentState.MTA，OleDbDataReader.Read 必須在建立其本身的執行緒上使用。

# OleDb_NoErrorMessage
source: Unspecified error: {0}
de: Nicht angegebener Fehler: {0}
es: Error no especificado: {0}
fr: Erreur non spécifiée : {0}
it: Errore non specificato: {0}
ja: 予期しないエラーです : {0}
ko: 알 수 없는 오류입니다. {0}
pt_br: Erro não especificado: {0}
ru: Нераспознанная ошибка: {0}
zh_hans: 未指定的错误: {0}
zh_hant: 未指定的錯誤: {0}

# OleDb_FailedGetDescription
source: IErrorInfo.GetDescription failed with {0}.
de: Fehler {0} in IErrorInfo.GetDescription.
es: Error de IErrorInfo.GetDescription con {0}.
fr: Échec de IErrorInfo.GetDescription avec {0}.
it: IErrorInfo.GetDescription non riuscito con {0}.
ja: IErrorInfo.GetDescription が {0} で 失敗しました。
ko: {0} 때문에 IErrorInfo.GetDescription이 실패했습니다.
pt_br: Falha de IErrorInfo.GetDescription com {0}.
ru: Сбой IErrorInfo.GetDescription с {0}.
zh_hans: IErrorInfo.GetDescription 因 {0} 而失败。
zh_hant: IErrorInfo.GetDescription 因為 {0} 而失敗。

# OleDb_FailedGetSource
source: IErrorInfo.GetSource failed with {0}.
de: Fehler {0} in IErrorInfo.GetSource.
es: Error de IErrorInfo.GetSource con {0}.
fr: Échec de IErrorInfo.GetSource avec {0}.
it: IErrorInfo.GetSource non riuscito con {0}.
ja: IErrorInfo.GetSource が {0} で 失敗しました。
ko: {0} 때문에 IErrorInfo.GetSource가 실패했습니다.
pt_br: Falha de IErrorInfo.GetSource com {0}.
ru: Сбой IErrorInfo.GetSource с {0}.
zh_hans: IErrorInfo.GetSource 因 {0} 而失败。
zh_hant: IErrorInfo.GetSource 因為 {0} 而失敗。

# OleDb_DBBindingGetVector
source: DBTYPE_VECTOR data is not supported by the .NET Framework Data OLE DB Provider(Microsoft.Data.OleDb).
de: DBTYPE_VECTOR-Daten werden vom .NET Framework-OLE DB-Datenanbieter (Microsoft.Data.OleDb) nicht unterstützt.
es: El proveedor de datos .NET Framework para OLE DB (Microsoft.Data.OleDb). no admite los datos de DBTYPE_VECTOR.
fr: Les données DBTYPE_VECTOR ne sont pas prises en charge par le fournisseur de données .NET Framework OLE DB (Microsoft.Data.OleDb).
it: I dati DBTYPE_VECTOR non sono supportati dal provider di dati .NET Framework OLE DB (Microsoft.Data.OleDb).
ja: DBTYPE_VECTOR データは、.NET Framework Data OLE DB Provider(Microsoft.Data.OleDb) によってサポートされていません。
ko: DBTYPE_VECTOR 데이터는 .NET Framework Data OLE DB Provider(Microsoft.Data.OleDb)에서 지원되지 않습니다.
pt_br: Não há suporte para os dados DBTYPE_VECTOR no Provedor de Dados .NET Framework para OLE DB (Microsoft.Data.OleDb).
ru: Поставщик данных .NET Framework для OLE DB (System.Data.OleDb) не поддерживает данные DBTYPE_VECTOR.
zh_hans: .NET Framework OLE DB 数据提供程序(Microsoft.Data.OleDb)不支持 DBTYPE_VECTOR 数据。
zh_hant: .NET Framework Data OLE DB Provider(System.Data.OleDb) 不支援 DBTYPE_VECTOR 資料。

# ADP_InvalidMinMaxPoolSizeValues
source: Invalid min or max pool size values, min pool size cannot be greater than the max pool size.
de: Ungültiger Wert für die minimale oder maximale Poolgröße. Die minimale Poolgröße kann nicht größer als die maximale Poolgröße sein.
es: Valor mínimo o máximo del tamaño de grupo no válido, el tamaño mínimo del grupo no puede ser mayor que el tamaño máximo del grupo.
fr: Valeurs de taille de pool min et max non valides, la taille min ne peut pas être supérieure à la taille max.
it: Valori minimo e massimo delle dimensioni di pool non validi. La dimensione di pool minima deve essere inferiore a quella massima.
ja: プール サイズの最小値または最大値が無効です。最小プール サイズを最大プール サイズより大きい値に設定することはできません。
ko: 풀 크기의 최소값 또는 최대값이 잘못되었습니다. 최소 풀 크기는 최대 풀 크기보다 클 수 없습니다.
pt_br: Valores inválidos de tamanho mínimo e máximo de pool. O tamanho mínimo do pool não pode ser maior do que o tamanho máximo do pool.
ru: Недопустимое значение минимального или максимального размера пула; минимальный размер пула не может быть больше максимального размера пула.
zh_hans: 最小或最大池大小值无效，最小池大小不能大于最大池大小。
zh_hant: 無效的最小或最大共用區大小值，共用區最小值不可以大於共用區最大值。

# ADP_ObsoleteKeyword
source: The '{0}' keyword is obsolete. Use '{1}' instead.
de: Das Schlüsselwort '{0}' ist veraltet. Verwenden Sie stattdessen '{1}'.
es: La palabra clave '{0}' está desusada. Use '{1}'.
fr: Le mot clé '{0}' est obsolète. Utilisez plutôt '{1}'.
it: La parola chiave "{0}" è obsoleta. Al suo posto usare "{1}".
ja: '{0}' は、古いキーワード です。代わりに '{1}' を使用してください。
ko: '{0}' 키워드는 사용되지 않습니다. 대신 '{1}'을(를) 사용하십시오.
pt_br: Palavra-chave '{0}' obsoleta. Em seu lugar, use '{1}'.
ru: Ключевое слово "{0}" является устаревшим. Используйте вместо него "{1}".
zh_hans: “{0}”关键字已过时。请使用“{1}”来代替。
zh_hant: '{0}' 關鍵字已過時。請改用 '{1}'。

# SQL_CannotGetDTCAddress
source: Unable to get the address of the distributed transaction coordinator for the server, from the server. Is DTC enabled on the server?
de: Die Adresse des verteilten Transaktionskoordinators für den Server konnte nicht vom Server abgerufen werden. Wurde DTC auf dem Server aktiviert?
es: No se puede obtener desde el servidor la dirección del coordinador de transacciones distribuidas. ¿DTC está habilitado en el servidor?
fr: Impossible d'obtenir du serveur l'adresse du coordinateur des transactions distribuées du serveur. DTC est-il activé sur le serveur ?
it: Impossibile ottenere dal server l'indirizzo del coordinatore della transazione distribuita per il server. Il DTC è abilitato sul server?
ja: サーバーに対する分散トランザクション コーディネーターのアドレスをサーバーから取得することができません。サーバーで DTC が有効になっているかどうかを確認してください。
ko: 서버에 대한 DTC(Distributed Transaction Coordinator) 주소를 서버로부터 가져올 수 없습니다. 서버에서 DTC를 활성화하시겠습니까?
pt_br: Não é possível obter o endereço do coordenador de transações distribuídas para o servidor, a partir do servidor. O DTC está habilitado no servidor?
ru: Не удалось получить от сервера адрес координатора распределенных транзакций (DTC) для сервера. Убедитесь, что координатор распределенных транзакций (DTC) на сервере включен.
zh_hans: 无法从服务器获取服务器的分布式事务协调程序的地址。服务器上是否已启用 DTC?
zh_hant: 無法自伺服器取得其分散式交易協調器的位址。伺服器上的 DTC 是否已經啟用?

# SQL_InvalidOptionLength
source: The length of the value for the connection parameter <{0}> exceeds the maximum allowed 65535 characters.
de: Die Länge des Werts für den Verbindungsparameter <{0}> überschreitet die maximale Länge von 65535 Zeichen.
es: La longitud del valor para el parámetro de conexión <{0}> supera el máximo permitido de 65535 caracteres.
fr: La longueur de la valeur pour le paramètre de connexion <{0}> dépasse la valeur maximale autorisée de 65 535 caractères.
it: Il valore per il parametro di connessione <{0}> supera la lunghezza massima consentita di 65535 caratteri.
ja: 接続パラメーター <{0}> の値の長さが使用できる最大値 65535 文字を超えています。
ko: 연결 매개 변수 <{0}> 값의 길이가 허용되는 최대 길이인 65535자를 초과합니다.
pt_br: O comprimento do valor do parâmetro de conexão <{0}> excede o máximo permitido de 65535 caracteres.
ru: Длина значения параметра подключения <{0}> превышает предельно допустимую длину в 65 535 знаков.
zh_hans: 连接参数 <{0}> 的值的长度超出了最多 65535 个字符的限制。
zh_hant: 連接參數 <{0}> 的長度值超過所允許 65535 個字元的最大值。

# SQL_InvalidPacketSizeValue
source: Invalid 'Packet Size'. The value must be an integer >= 512 and <= 32768.
de: Ungültiger Packet Size-Wert. Der Wert muss eine ganze Zahl >= 512 und <= 32768 sein.
es: 'Packet Size' no válido. El valor debe ser un entero >= 512 y <= 32768.
fr: 'Packet Size' non valide. La valeur doit être un entier compris entre 512 et 32768.
it: Valore di "Packet Size" non valido. Il valore deve essere un integer >= 512 e <= 32768.
ja: 'Packet Size' が無効です。値は 512 以上 32768 以下の整数でなければなりません。
ko: 'Packet Size'가 잘못되었습니다. 이 값은 512보다 크거나 같고 32768보다 작거나 같은 정수여야 합니다.
pt_br: 'Packet Size' inválido. O valor deve ser um inteiro >= 512 e <= 32768.
ru: Недопустимый "Packet Size". Значение должно быть целым числом в диапазоне от 512 до 32 768 включительно.
zh_hans: “Packet Size”值无效。此值必须是大于等于 512 且小于等于 32768 的整数。
zh_hant: 無效的 'Packet Size' 值。這個值必須是 >= 512 且 <= 32768 的整數。

# SQL_NullEmptyTransactionName
source: Invalid transaction or invalid name for a point at which to save within the transaction.
de: Ungültige Transaktion oder ungültiger Name eines Speicherungspunkts der Transaktion.
es: Transacción o nombre no válido para un punto en el que se va a guardar la transacción.
fr: Transaction non valide ou nom non valide pour un point sur lequel enregistrer dans la transaction.
it: Transazione o nome non valido per un punto della transazione in cui effettuare il salvataggio.
ja: トランザクションが無効か、トランザクション内で保存するポイントの名前が無効です。
ko: 트랜잭션이 잘못되었거나 트랜잭션에 저장할 지점 이름이 잘못되었습니다.
pt_br: Transação inválida ou nome inválido de um ponto da transação para executar salvamento.
ru: Недопустимая транзакция или недопустимое имя для точки сохранения в транзакции.
zh_hans: 事务中要进行保存的点的事务或名称无效。
zh_hant: 交易中儲存點的無效交易或無效名稱。

# SQL_SnapshotNotSupported
source: The {0} enumeration value, {1}, is not supported by SQL Server 7.0 or SQL Server 2000.
de: Der Enumerationswert von {0}, {1}, wird nicht von SQL Server 7.0 oder SQL Server 2000 unterstützt.
es: El valor de enumeración de {0}, {1}, no es compatible con SQL Server 7.0 o SQL Server 2000.
fr: La valeur d'énumération {0}, {1}, n'est pas prise en charge par SQL Server 7.0 ni par SQL Server 2000.
it: Il valore di enumerazione {0}, {1}, non è supportato da SQL Server 7.0 o SQL Server 2000.
ja: {0} 列挙値 {1} は SQL Server 7.0 または SQL Server 2000 ではサポートされていません。
ko: {0} 열거형 값 {1}은(는) SQL Server 7.0 또는 SQL Server 2000에서 지원되지 않습니다.
pt_br: O SQL Server 7.0 ou SQL Server 2000 não dá suporte para o valor de enumeração {0}, {1}.
ru: Значение перечисления {0}, {1}, не поддерживается SQL Server 7.0 и SQL Server 2000.
zh_hans: SQL Server 7.0 或 SQL Server 2000 不支持 {0} 枚举值 {1}。
zh_hant: SQL Server 7.0 或 SQL Server 2000 不支援 {0} 的列舉值 {1}。

# SQL_UserInstanceFailoverNotCompatible
source: User Instance and Failover are not compatible options. Please choose only one of the two in the connection string.
de: Die Optionen 'User Instance' und 'Failover' sind nicht kompatibel. Wählen Sie nur eine der beiden Optionen in der Verbindungszeichenfolge.
es: No se admite utilizar User Instance y Failover. Elija uno de los dos en la cadena de conexión.
fr: User Instance et Failover ne sont pas des options compatibles. Ne choisissez que l'une d'elles dans la chaîne de connexion.
it: User Instance e Failover non sono opzioni compatibili. Scegliere una delle due nella stringa della connessione.
ja: User Instance と Failover は、互換性のないオプションです。接続文字列でどちらか一方のみを選択してください。
ko: User Instance 및 Failover는 호환되지 않는 옵션입니다. 연결 문자열에서 둘 중 하나만 선택해야 합니다.
pt_br: User Instance e Failover não são opções compatíveis. Escolha apenas uma das duas cadeias de conexão.
ru: Параметры User Instance и Failover несовместимы. Используйте в строке подключения только один из них.
zh_hans: User Instance 和 Failover 是不兼容的选项。请在连接字符串中只选择其中一个。
zh_hant: User Instance 和 Failover 為不相容的選項。請在此連接字串中只選擇其中一個。

# SQL_AuthenticationAndIntegratedSecurity
source: Cannot use 'Authentication' with 'Integrated Security'.
de: "Authentication" kann nicht mit "Integrated Security" verwendet werden.
es: No se puede usar 'Authentication' con 'Integrated Security'.
fr: Impossible d'utiliser 'Authentication avec 'Integrated Security'.
it: Non è possibile usare 'Authentication' con 'Integrated Security'.
ja: 'Authentication' と 'Integrated Security' を一緒に使用することはできません。
ko: 'Authentication'을 'Integrated Security'와 함께 사용할 수 없습니다.
pt_br: Não é possível usar "Authentication" com "Integrated Security".
ru: Нельзя использовать 'Authentication' с 'Integrated Security'.
zh_hans: 无法对“Integrated Security”使用“Authentication”。
zh_hant: 無法搭配 'Integrated Security' 使用 'Authentication'。

# SQL_IntegratedWithUserIDAndPassword
source: Cannot use 'Authentication=Active Directory Integrated' with 'User ID', 'UID', 'Password' or 'PWD' connection string keywords.
de: "Authentication=Active Directory Integrated" kann nicht mit Schlüsselwörtern "User ID", "UID", "Password" oder "PWD" für die Verbindungszeichenfolge verwendet werden.
es: No se puede usar 'Authentication=Active Directory Integrated' con las palabras clave de cadena de conexión 'User ID', 'UID', 'Password' o 'PWD'.
fr: Impossible d'utiliser 'Authentication=Active Directory Integrated' avec les mots clés de la chaîne de connexion 'User ID", "UID", "Password" ou "PWD".
it: Non è possibile usare 'Authentication=Active Directory Integrated' con le parole chiave della stringa di connessione 'User ID', 'UID', 'Password' o 'PWD'.
ja: 'Authentication=Active Directory Integrated' と接続文字列キーワード 'User ID'、'UID'、'Password'、'PWD' を一緒に使用することはできません。
ko: 'Authentication=Active Directory Integrated'를 'User ID', 'UID', 'Password' 또는 'PWD' 연결 문자열 키워드와 함께 사용할 수 없습니다.
pt_br: Não é possível usar 'Authentication=Active Directory Integrated' com as palavras-chave da cadeia de conexão 'User ID', 'UID', 'Password' ou 'PWD'.
ru: Нельзя использовать 'Authentication=Active Directory Integrated' с ключевыми словами строки подключения 'User ID', 'UID', 'Password' или 'PWD'.
zh_hans: 无法对“User ID”、“UID”、“Password”或“PWD”连接字符串关键字使用“Authentication=Active Directory Integrated”。
zh_hant: 無法搭配 'User ID'、'UID'、'Password' 或 'PWD' 等連接字串關鍵字使用 'Authentication=Active Directory Integrated'。

# SQL_InteractiveWithUserIDAndPassword
source: Cannot use 'Authentication=Active Directory Interactive' with 'User ID', 'UID', 'Password' or 'PWD' connection string keywords.
de: "Authentication=Active Directory Interactive" kann nicht mit den Schlüsselwörtern "User ID", "UID", "Password" oder "PWD" für die Verbindungszeichenfolge verwendet werden.
es: No se puede usar "Authentication=Active Directory Interactive" con las palabras clave de cadena de conexión "User ID", "UID", "Password" ni "PWD".
fr: Impossible d'utiliser 'Authentication=Active Directory Interactive' avec les mots clés de chaîne de connexion 'User ID', 'UID', 'Password' et 'PWD'.
it: Non è possibile usare 'Authentication=Active Directory Interactive' con le parole chiave della stringa di connessione 'User ID', 'UID', 'Password' o 'PWD'.
ja: 'Authentication=Active Directory Interactive' と接続文字列キーワード 'User ID'、'UID'、'Password'、'PWD' を一緒に使用することはできません。
ko: 'Authentication=Active Directory Interactive'를 'User ID', 'UID', 'Password' 또는 'PWD' 연결 문자열 키워드와 함께 사용할 수 없습니다.
pt_br: Não é possível usar 'Authentication=Active Directory Interactive' com as palavras-chave da cadeia de conexão 'User ID', 'UID', 'Password' ou 'PWD'.
ru: Невозможно использовать "Authentication=Active Directory Interactive" с ключевыми словами строки подключения "User ID", "UID", "Password" или "PWD".
zh_hans: 无法对“User ID”、“UID”、“Password”或“PWD”连接字符串关键字使用“Authentication=Active Directory Interactive”。
zh_hant: 無法搭配 'User ID'、'UID'、'Password' 或 'PWD' 連接字串關鍵字使用 'Authentication=Active Directory Interactive'。
