Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_IncorrectAsyncResult
source: Incorrect async result.
de: Falsches asynchrones Ergebnis.
es: Resultado asíncrono incorrecto.
fr: Le résultat asynchrone est incorrect.
it: Risultato asincrono non corretto.
ja: 非同期の結果が正しくありません。
ko: 비동기 결과가 잘못되었습니다.
pt_br: Resultado de assinc incorreto.
ru: Неверный асинхронный результат.
zh_hans: 异步结果不正确。
zh_hant: 不正確的非同步結果。

# ADP_MissingSelectCommand
source: The SelectCommand property has not been initialized before calling '{0}'.
de: Die SelectCommand-Eigenschaft wurde nicht initialisiert vor dem Aufruf von: '{0}'.
es: No se ha inicializado la propiedad SelectCommand antes de llamar a '{0}'.
fr: La propriété SelectCommand n'a pas été initialisée avant l'appel de '{0}'.
it: Proprietà SelectCommand non inizializzata prima della chiamata a '{0}'.
ja: '{0}' を呼び出す前に、SelectCommand プロパティが初期化されませんでした。
ko: '{0}'을(를) 호출하기 전에 SelectCommand 속성이 초기화되지 않았습니다.
pt_br: A propriedade SelectCommand não foi inicializada antes de chamar '{0}'.
ru: Перед вызовом "{0}" не было инициализировано свойство SelectCommand.
zh_hans: 在调用“{0}”前，SelectCommand 属性尚未初始化。
zh_hant: 呼叫 '{0}' 之前，SelectCommand 屬性尚未初始化。

# ADP_UnwantedStatementType
source: The StatementType {0} is not expected here.
de: Der StatementType {0} wird hier nicht erwartet.
es: No se esperaba aquí el StatementType {0}.
fr: StatementType {0} non attendu ici.
it: StatementType {0} non previsto in questo contesto.
ja: StatementType {0} がここに存在するのは誤りです。
ko: StatementType {0}은(는) 여기에 사용할 수 없습니다.
pt_br: StatementType {0} não é esperado aqui.
ru: StatementType {0} в этом месте не допускается.
zh_hans: 此处不应为 StatementType {0}。
zh_hant: 此處不應出現 StatementType {0}。

# ADP_FillSchemaRequiresSourceTableName
source: FillSchema: expected a non-empty string for the SourceTable name.
de: FillSchema: Es wird eine nicht leere Zeichenfolge als SourceTable-Name erwartet.
es: FillSchema: se esperaba una cadena que contenga datos para el nombre de SourceTable.
fr: FillSchema : chaîne non valide attendue pour le nom SourceTable.
it: FillSchema: prevista stringa non vuota per il nome di SourceTable.
ja: FillSchema: SourceTable 名に空の文字列を指定できません。
ko: FillSchema: SourceTable 이름에는 비어 있지 않은 문자열이 필요합니다.
pt_br: FillSchema: era esperada uma cadeia de caracteres não vazia para o nome de SourceTable.
ru: FillSchema: для имени SourceTable ожидалась непустая строка.
zh_hans: FillSchema: 应当为 SourceTable 名称输入一个非空字符串。
zh_hant: FillSchema: SourceTable 名稱必須是非空白的字串。

# ADP_InvalidMaxRecords
source: The MaxRecords value of {0} is invalid; the value must be >= 0.
de: Der MaxRecords Wert von {0} ist ungültig; der Wert muss >= 0 sein.
es: El valor de MaxRecords {0} no es válido. El valor debe ser >= 0.
fr: La valeur MaxRecords de {0} n'est pas valide ; la valeur doit être >= 0.
it: Valore di MaxRecords non valido: {0}. Il valore deve essere >= 0.
ja: {0} の MaxRecords 値が無効です。値は 0 以上でなければなりません。
ko: MaxRecords 값 {0}이(가) 잘못되었습니다. 값은 0보다 크거나 같아야 합니다.
pt_br: O valor de MaxRecords de {0} é inválido; o valor deve ser >= 0.
ru: Недопустимое значение MaxRecords, {0}; значение должно быть неотрицательным.
zh_hans: {0} 的 MaxRecords 值无效；该值必须大于等于 0。
zh_hant: {0} 的 MaxRecords 值無效。值必須 >= 0。

# ADP_InvalidStartRecord
source: The StartRecord value of {0} is invalid; the value must be >= 0.
de: Der StartRecord-Wert von {0} ist ungültig; der Wert muss >= 0 sein.
es: El valor de StartRecord {0} no es válido. El valor debe ser >= 0.
fr: La valeur StartRecord de {0} n'est pas valide ; la valeur doit être >= 0.
it: Valore di StartRecord non valido: {0}. Il valore deve essere >= 0.
ja: {0} の StartRecord 値が無効です。値は 0 以上でなければなりません。
ko: StartRecord 값 {0}이(가) 잘못되었습니다. 값은 0보다 크거나 같아야 합니다.
pt_br: O valor de StartRecord de {0} é inválido; o valor deve ser >= 0.
ru: Недопустимое значение StartRecord, {0}; значение должно быть неотрицательным.
zh_hans: {0} 的 StartRecord 值无效；该值必须大于等于 0。
zh_hant: {0} 的 StartRecord 值無效。值必須是 >= 0。

# ADP_FillRequiresSourceTableName
source: Fill: expected a non-empty string for the SourceTable name.
de: Fill: Es wird eine nicht leere Zeichenfolge als SourceTable-Name erwartet.
es: Fill: se esperaba una cadena con datos para el nombre de SourceTable.
fr: Fill : chaîne non vide attendue pour le nom SourceTable.
it: Fill: prevista stringa non vuota per il nome di SourceTable.
ja: Fill: SourceTable 名に空の文字列を指定できません。
ko: Fill: SourceTable 이름에는 비어 있지 않은 문자열이 필요합니다.
pt_br: Fill: era esperada uma cadeia de caracteres não vazia para o nome de SourceTable.
ru: Fill: для имени SourceTable ожидалась непустая строка.
zh_hans: Fill: 应当为 SourceTable 名称输入一个非空字符串。
zh_hant: Fill: SourceTable 名稱必須是非空白的字串。

# ADP_FillChapterAutoIncrement
source: Hierarchical chapter columns must map to an AutoIncrement DataColumn.
de: Hierarchische Kapitelspalten müssen zu einer AutoIncrement DataColumn zugeordnet werden.
es: Las columnas de capítulos jerárquicos se deben asignar a un AutoIncrement DataColumn.
fr: Les colonnes des chapitres hiérarchiques doivent mapper AutoIncrement DataColumn.
it: Le colonne del capitolo gerarchico devono essere mappate su una DataColumn AutoIncrement.
ja: 階層チャプター コラムは AutoIncrement DataColumn に割り当てしなければなりません。
ko: 계층적 장의 열은 AutoIncrement DataColumn에 매핑되어야 합니다.
pt_br: Colunas de capítulo hierárquico devem mapear para AutoIncrement DataColumn.
ru: Столбцы иерархических глав должны быть сопоставлены с DataColumn со свойством AutoIncrement.
zh_hans: 分层章节列必须映射到 AutoIncrement DataColumn。
zh_hant: 階層式章節資料行必須對應至 AutoIncrement DataColumn。

# ADP_MissingDataReaderFieldType
source: DataReader.GetFieldType({0}) returned null.
de: DataReader.GetFieldType({0}) gab 'null' zurück.
es: DataReader.GetFieldType({0}) devolvió null.
fr: DataReader.GetFieldType({0}) a retourné la valeur null.
it: DataReader.GetFieldType({0}) ha restituito il valore null.
ja: DataReader.GetFieldType({0}) から null が返されました。
ko: DataReader.GetFieldType({0})에서 null을 반환했습니다.
pt_br: DataReader.GetFieldType({0}) retornou null.
ru: DataReader.GetFieldType({0}) вернул значение null.
zh_hans: DataReader.GetFieldType({0}) 返回了 null。
zh_hant: DataReader.GetFieldType({0}) 已傳回 null。

# ADP_OnlyOneTableForStartRecordOrMaxRecords
source: Only specify one item in the dataTables array when using non-zero values for startRecords or maxRecords.
de: Geben Sie bei der Verwendung von Werten ungleich Null für 'startRecords' oder 'maxRecords' nur ein Element im 'dataTables'-Array an.
es: Especifique sólo un elemento en la matriz dataTables al utilizar valores distintos de cero para startRecords o maxRecords.
fr: Ne spécifiez qu'un seul élément dans le tableau dataTables lors de l'utilisation de valeurs non nulles pour startRecords ou maxRecords.
it: Specificare soltanto un elemento nella matrice dataTables quando si utilizzano valori diversi da zero per startRecords o maxRecords.
ja: startRecords または maxRecords の値に 0 以外を使用するときは、配列 dataTables には項目を 1 つだけ指定してください。
ko: startRecords 또는 maxRecords에 0이 아닌 값을 사용하는 경우 dataTables 배열에서 한 항목만 지정하십시오.
pt_br: Especifique apenas um item na matriz dataTables ao usar valores diferentes de zero para startRecords ou maxRecords.
ru: Указывайте только один элемент в массиве dataTables в случае использования ненулевых значений для startRecords или maxRecords.
zh_hans: 对 startRecords 或 maxRecords 使用非零值时，在 dataTables 数组中只指定一项。
zh_hant: 當使用 startRecords 或 maxRecords 的非零值時，僅指定 dataTables 陣列中的一個項目。

# ADP_UpdateRequiresSourceTable
source: Update unable to find TableMapping['{0}'] or DataTable '{0}'.
de: Update: TableMapping['{0}'] oder DataTable '{0}' kann nicht gefunden werden.
es: Update no puede encontrar TableMapping['{0}'] o DataTable '{0}'.
fr: Impossible pour Update de trouver TableMapping['{0}'] ou DataTable '{0}'.
it: Update non è in grado di trovare TableMapping['{0}'] o DataTable '{0}'.
ja: Update で TableMapping['{0}'] 、または DataTable '{0}' が見つかりませんでした。
ko: Update로 TableMapping['{0}'] 또는 DataTable '{0}'을(를) 찾을 수 없습니다.
pt_br: Update não pode localizar TableMapping['{0}'] ou DataTable '{0}'.
ru: Операции Update не удалось найти TableMapping["{0}"] или DataTable "{0}".
zh_hans: Update 无法找到 TableMapping['{0}'] 或 DataTable“{0}”。
zh_hant: Update 找不到 TableMapping['{0}'] 或 DataTable '{0}'。

# ADP_UpdateRequiresSourceTableName
source: Update: expected a non-empty SourceTable name.
de: Update: Nicht leerer SourceTable-Name erwartet.
es: Update: se esperaba un nombre de SourceTable que contenga datos.
fr: Update : nom SourceTable non vide attendu.
it: Update: previsto un nome SourceTable non vuoto.
ja: Update : 空でない SourceTable 名を指定してください。
ko: Update: 비어 있지 않은 SourceTable 이름이 필요합니다.
pt_br: Update: era esperado um nome de SourceTable não vazio.
ru: Операция Update: ожидалось непустое имя SourceTable.
zh_hans: Update: 应输入非空的 SourceTable 名称。
zh_hant: Update: 必須是非空白的 SourceTable 名稱。

# ADP_MissingTableMappingDestination
source: Missing TableMapping when TableMapping.DataSetTable='{0}'.
de: Fehlende TableMapping wenn TableMapping.DataSetTable='{0}'.
es: Falta TableMapping cuando TableMapping.DataSetTable='{0}'.
fr: TableMapping manquant quand TableMapping.DataSetTable='{0}'.
it: TableMapping mancante per TableMapping.DataSetTable='{0}'.
ja: TableMapping.DataSetTable='{0}' のときに TableMapping が見つかりません。
ko: TableMapping.DataSetTable='{0}'인 TableMapping이 없습니다.
pt_br: TableMapping inexistente quando TableMapping.DataSetTable='{0}'.
ru: Отсутствует TableMapping при TableMapping.DataSetTable="{0}".
zh_hans: 当 TableMapping.DataSetTable=“{0}”时缺少 TableMapping。
zh_hant: 當 TableMapping.DataSetTable='{0}' 時，遺漏 TableMapping。

# ADP_UpdateRequiresCommandClone
source: Update requires the command clone to be valid.
de: Für ein Update ist ein gültiger Befehlsklon erforderlich.
es: Update requiere que el clon del comando sea válido.
fr: Le clone de commande doit être valide pour Update.
it: Update richiede che il duplicato di comando sia valido.
ja: Update ではコマンドの複製が有効である必要があります。
ko: Update하려면 올바른 명령 복제가 필요합니다.
pt_br: Update exige um clone de comando válido.
ru: Для элемента Update требуется действительный клон команды.
zh_hans: Update 要求命令复本是有效的。
zh_hant: Update 需要有效的命令複製。

# ADP_UpdateRequiresCommandSelect
source: Auto SQL generation during Update requires a valid SelectCommand.
de: Die automatische SQL-Generierung erfordert während des Updates einen gültigen SelectCommand.
es: La generación SQL automática durante la operación Update requiere que SelectCommand sea válido.
fr: La génération SQL automatique pendant une Update requiert un SelectCommand valide.
it: La generazione SQL automatica durante un Update richiede un SelectCommand valido.
ja: Update 中の自動 SQL 生成には、有効な SelectCommand が必要です。
ko: Update하는 동안 자동 SQL 생성을 수행하려면 올바른 SelectCommand가 필요합니다.
pt_br: A geração SQL automática durante o Update requer um SelectCommand válido.
ru: Для автоматического создания SQL во время обновления (Update) требуется действительный SelectCommand.
zh_hans: 在 Update 期间自动 SQL 生成要求有效的 SelectCommand。
zh_hant: Update 自動 SQL 產生時需要有效的 SelectCommand。

# ADP_UpdateRequiresCommandInsert
source: Update requires a valid InsertCommand when passed DataRow collection with new rows.
de: Für ein Update ist ein gültiger InsertCommand erforderlich, wenn eine DataRow-Sammlung mit neuen Zeilen weitergegeben wird.
es: Update requiere que InsertCommand sea válido cuando se pasa la colección DataRow con nuevas filas.
fr: Update requiert un InsertCommand valide lors du passage de la collection DataRow avec de nouvelles lignes.
it: Update richiede un InsertCommand valido se la raccolta DataRow viene passata con righe nuove.
ja: Update には、新しい行を含む DataRow コレクションが渡されたとき、有効な InsertCommand が必要です。
ko: 새 행을 포함하여 DataRow 컬렉션을 전달하는 경우 Update하려면 올바른 InsertCommand가 필요합니다.
pt_br: Update exige um InsertCommand válido para transmitir coleção DataRow com novas linhas.
ru: Для элемента Update требуется действительный InsertCommand при передаче коллекции DataRow с новыми строками.
zh_hans: 当传递具有新行的 DataRow 集合时，Update 要求有效的 InsertCommand。
zh_hant: 當傳遞擁有新資料列的 DataRow 集合時，Update 需要有效的 InsertCommand。

# ADP_UpdateRequiresCommandUpdate
source: Update requires a valid UpdateCommand when passed DataRow collection with modified rows.
de: Für ein Update ist ein gültiger UpdateCommand erforderlich, wenn eine DataRow-Sammlung mit modifizierten Zeilen weitergegeben wird.
es: Update requiere que UpdateCommand sea válido cuando se pasa la colección DataRow con filas modificadas.
fr: Update requiert un UpdateCommand valide lors du passage de la collection DataRow avec des lignes modifiées.
it: Update richiede un UpdateCommand valido se la raccolta DataRow viene passata con righe modificate.
ja: 更新には、変更された行を含む DataRow コレクションが渡されたとき、有効な UpdateCommand が必要です。
ko: 수정된 행을 포함하여 DataRow 컬렉션을 전달하는 경우 업데이트하려면 올바른 UpdateCommand가 필요합니다.
pt_br: A atualização requer um UpdateCommand válido para transmitir coleção DataRow com linhas modificadas.
ru: Для обновления требуется действительный UpdateCommand при передаче коллекции DataRow с измененными строками.
zh_hans: 当传递具有已修改行的 DataRow 集合时，更新要求有效的 UpdateCommand。
zh_hant: 當傳遞擁有已修改資料列的 DataRow 集合時，更新需要有效的 UpdateCommand。

# ADP_UpdateRequiresCommandDelete
source: Update requires a valid DeleteCommand when passed DataRow collection with deleted rows.
de: Für ein Update ist ein gültiger DeleteCommand erforderlich, wenn eine DataRow-Sammlung mit gelöschten Zeilen weitergegeben wird.
es: Update requiere que DeleteCommand sea válido cuando se pasa la colección DataRow con filas eliminadas.
fr: Update requiert un DeleteCommand valide lors du passage de la collection DataRow avec des lignes supprimées.
it: Update richiede un DeleteCommand valido se la raccolta DataRow viene passata con righe eliminate.
ja: Update には、削除された行を含む DataRow コレクションが渡されたとき、有効な DeleteCommand が必要です。
ko: 삭제된 행을 포함하여 DataRow 컬렉션을 전달하는 경우 Update하려면 올바른 DeleteCommand가 필요합니다.
pt_br: Update exige um DeleteCommand válido para transmitir coleção DataRow com linhas excluídas.
ru: Для элемента Update требуется действительный DeleteCommand при передаче коллекции DataRow с удаленными строками.
zh_hans: 当传递具有已删除行的 DataRow 集合时，Update 要求有效的 DeleteCommand。
zh_hant: 當傳遞擁有已刪除資料列的 DataRow 集合時，Update 需要有效的 DeleteCommand。

# ADP_UpdateMismatchRowTable
source: DataRow[{0}] is from a different DataTable than DataRow[0].
de: DataRow[{0}] stammt aus einer anderen DataTable als DataRow[0].
es: DataRow[{0}] pertenece a un DataTable diferente a DataRow[0].
fr: DataRow[0] est d'un autre DataTable que DataRow[{0}].
it: DataRow[{0}] proviene da un DataTable diverso da DataRow[0].
ja: DataRow[{0}] は DataRow[0] とは異なる DataTable からのものです。
ko: DataRow[{0}]는 DataRow[0]와 DataTable이 다릅니다.
pt_br: DataRow[{0}] e DataRow[0] são de DataTable diferentes.
ru: DataRow[{0}] принадлежит не тому DataTable, которому принадлежит DataRow[0].
zh_hans: DataRow[{0}] 和 DataRow[0] 来自不同的数据表。
zh_hant: DataRow[{0}] 是從除了 DataRow[0] 以外的其他 DataTable 取得。

# ADP_RowUpdatedErrors
source: RowUpdatedEvent: Errors occurred; no additional is information available.
de: RowUpdatedEvent: Fehler sind aufgetreten, es sind keine zusätzlichen Informationen vorhanden.
es: RowUpdatedEvent: errores; no hay información adicional disponible.
fr: RowUpdatedEvent : des erreurs se sont produites ; aucune information supplémentaire n'est disponible.
it: Errori in RowUpdatedEvent. Nessuna informazione aggiuntiva disponibile.
ja: RowUpdatedEvent : エラーが発生しました。エラーの詳細情報はありません。
ko: RowUpdatedEvent: 오류가 발생했습니다. 추가 정보가 없습니다.
pt_br: RowUpdatedEvent: ocorreram erros; nenhuma informação adicional disponível.
ru: RowUpdatedEvent: ошибки. Дополнительные сведения отсутствуют.
zh_hans: RowUpdatedEvent: 发生错误；未提供更多的信息。
zh_hant: RowUpdatedEvent: 已經發生錯誤。沒有其他可用的資訊。

# ADP_RowUpdatingErrors
source: RowUpdatingEvent: Errors occurred; no additional is information available.
de: RowUpdatingEvent: Fehler sind aufgetreten, es sind keine zusätzlichen Informationen vorhanden.
es: RowUpdatingEvent: errores; no hay información adicional disponible.
fr: RowUpdatingEvent : des erreurs se sont produites ; aucune information supplémentaire n'est disponible.
it: Errori in RowUpdatingEvent. Nessuna informazione aggiuntiva disponibile.
ja: RowUpdatingEvent : エラーが発生しました。エラーの詳細情報はありません。
ko: RowUpdatingEvent: 오류가 발생했습니다. 추가 정보가 없습니다.
pt_br: RowUpdatingEvent: ocorreram erros; nenhuma informação adicional disponível.
ru: RowUpdatingEvent: ошибки. Дополнительные сведения отсутствуют.
zh_hans: RowUpdatingEvent: 发生错误；未提供更多的信息。
zh_hant: RowUpdatingEvent: 已經發生錯誤。沒有其他可用的資訊。

# ADP_ResultsNotAllowedDuringBatch
source: When batching, the command's UpdatedRowSource property value of UpdateRowSource.FirstReturnedRecord or UpdateRowSource.Both is invalid.
de: Bei der Batchverarbeitung ist der Wert der UpdatedRowSource-Eigenschaft von UpdateRowSource.FirstReturnedRecord oder UpdateRowSource.Both ungültig.
es: Durante el procesamiento por lotes, se ha detectado que el valor de propiedad de UpdatedRowSource de UpdateRowSource.FirstReturnedRecord o UpdateRowSource.Both del comando no es válido.
fr: Dans un traitement par lots, la valeur de la propriété UpdatedRowSource de la commande pour UpdateRowSource.FirstReturnedRecord ou pour UpdateRowSource.Both n'est pas valide.
it: Durante l'esecuzione di batch, il valore UpdateRowSource.FirstReturnedRecord oppure UpdateRowSource.Both della proprietà UpdatedRowSource del comando non è valido.
ja: バッチ処理をする場合、コマンドの UpdateRowSource.FirstReturnedRecord または UpdateRowSource.Both の UpdatedRowSource プロパティの値は無効です。
ko: 일괄 처리할 때 UpdateRowSource.FirstReturnedRecord 또는 UpdateRowSource.Both에 대한 명령의 UpdatedRowSource 속성 값이 잘못되었습니다.
pt_br: No loteamento, o valor de propriedade do comando UpdatedRowSource de UpdateRowSource.FirstReturnedRecord ou UpdateRowSource.Both é inválido.
ru: Недействительное значение свойства UpdatedRowSource (UpdateRowSource.FirstReturnedRecord или UpdateRowSource.Both) для команды в процессе пакетирования.
zh_hans: 进行批处理时，命令的 UpdatedRowSource 属性值 UpdateRowSource.FirstReturnedRecord 或 UpdateRowSource.Both 无效。
zh_hant: 當批次作業時，命令的 UpdateRowSource.FirstReturnedRecord 或 UpdateRowSource.Both 的 UpdatedRowSource 屬性值無效。

# ADP_UpdateConcurrencyViolation_Update
source: Concurrency violation: the UpdateCommand affected {0} of the expected {1} records.
de: Parallelitätsverletzung: Der UpdateCommand hat sich auf {0} der erwarteten {1} Datensätze ausgewirkt.
es: Infracción de simultaneidad: UpdateCommand afectó a {0} de los {1} registros esperados.
fr: Violation de l'accès concurrentiel : UpdateCommand a affecté {0} des enregistrements {1} attendus.
it: Violazione di concorrenza: UpdateCommand ha modificato {0} dei {1} record previsti.
ja: 同時実行違反 : UpdateCommand によって、処理予定の {1} レコードのうち {0} 件が処理されました。
ko: 동시성 위반: 필요한 {1} 레코드 중 UpdateCommand의 영향을 받는 {0}이(가) 없습니다.
pt_br: Violação de concorrência: UpdateCommand afetou {0} dos registros {1} esperados.
ru: Нарушение параллелизма: UpdateCommand затронула {0} из ожидаемых {1} записей.
zh_hans: 违反并发性: UpdateCommand 影响了预期 {1} 条记录中的 {0} 条。
zh_hant: 並行違規: UpdateCommand 已經影響必須是 {1} 記錄的 {0}。

# ADP_UpdateConcurrencyViolation_Delete
source: Concurrency violation: the DeleteCommand affected {0} of the expected {1} records.
de: Parallelitätsverletzung: Der DeleteCommand hat sich auf {0} der erwarteten {1} Datensätze ausgewirkt.
es: Infracción de simultaneidad: DeleteCommand afectó a {0} de los {1} registros esperados.
fr: Violation de l'accès concurrentiel : DeleteCommand a affecté {0} des enregistrements {1} attendus.
it: Violazione di concorrenza: DeleteCommand ha modificato {0} dei {1} record previsti.
ja: 同時実行違反 : DeleteCommand によって、処理予定の {1} レコードのうち {0} 件が処理されました。
ko: 동시성 위반: 필요한 {1} 레코드 중 DeleteCommand의 영향을 받는 {0}이(가) 없습니다.
pt_br: Violação de concorrência: DeleteCommand afetou {0} dos registros {1} esperados.
ru: Нарушение параллелизма: DeleteCommand затронула {0} из ожидаемых {1} записей.
zh_hans: 违反并发性: DeleteCommand 影响了预期 {1} 条记录中的 {0} 条。
zh_hant: 並行違規: DeleteCommand 已經影響必須是 {1} 記錄的 {0}。

# ADP_UpdateConcurrencyViolation_Batch
source: Concurrency violation: the batched command affected {0} of the expected {1} records.
de: Parallelitätsverletzung: der Batchbefehl hat sich auf {0} der erwarteten {1} Datensätze ausgewirkt.
es: Infracción de simultaneidad: el comando por lotes afectó a {0} de los {1} registros esperados.
fr: Violation de l'accès concurrentiel : la commande automatisée a affecté {0} des enregistrements {1} attendus.
it: Violazione di concorrenza: il comando in batch ha modificato {0} dei {1} record previsti.
ja: 同時実行違反 : バッチ処理されたコマンドによって、処理予定の {1} レコードのうち {0} 件が処理されました。
ko: 동시성 위반: 필요한 {1} 레코드 중 일괄 처리된 명령의 영향을 받는 {0}이(가) 없습니다.
pt_br: Violação de concorrência: o comando loteado afetou {0} dos {1} registros esperados.
ru: Нарушение параллелизма: пакетная команда затронула {0} из ожидаемых {1} записей.
zh_hans: 违反并发性: 成批命令影响了预期 {1} 条记录中的 {0} 条。
zh_hant: 並行違規: 批次作業的命令已經影響必須是 {1} 記錄的 {0}。

# ADP_InvalidCommandTimeout
source: Invalid CommandTimeout value {0}; the value must be >= 0.
de: Ungültiger CommandTimeout-Wert {0}; der Wert muss >= 0 sein.
es: Valor de CommandTimeout {0} no válido. El valor debe ser >= 0.
fr: Valeur CommandTimeout {0} non valide ; la valeur doit être >= 0.
it: Valore di CommandTimeout non valido: {0}. Il valore deve essere >= 0.
ja: CommandTimeout 値 {0} が無効です。値は 0 以上でなければなりません。
ko: CommandTimeout 값 {0}이(가) 잘못되었습니다. 값은 0보다 크거나 같아야 합니다.
pt_br: Valor {0} de CommandTimeout inválido; o valor deve ser >= 0.
ru: Недопустимое значение CommandTimeout {0}; значение должно быть >= 0.
zh_hans: 无效的 CommandTimeout 值 {0}；该值必须大于等于 0。
zh_hant: 無效的 CommandTimeout 值 {0}。值必須是 >= 0。

# ADP_UninitializedParameterSize
source: {1}[{0}]: the Size property has an invalid size of 0.
de: {1}[{0}]: die Size-Eigenschaft hat den ungültigen Wert 0.
es: {1}[{0}]: la propiedad Size tiene un tamaño no válido de 0.
fr: {1}[{0}] : la propriété Size a une taille non valide, 0.
it: {1}[{0}]: la proprietà Size ha una dimensione 0 non valida.
ja: '{1}[{0}]: Size プロパティのサイズが 0 です。これは無効です。
ko: {1}[{0}]: Size 속성의 크기 0은 잘못되었습니다.
pt_br: {1}[{0}]: a propriedade Size tem um tamanho inválido de 0.
ru: {1}[{0}]: Свойство Size имеет недопустимый размер 0.
zh_hans: {1}[{0}]: Size 属性具有无效大小值 0。
zh_hant: {1}[{0}]: Size 屬性的大小 0 無效。

# ADP_PrepareParameterType
source: {0}.Prepare method requires all parameters to have an explicitly set type.
de: Die {0}.Prepare-Methode erfordert, dass für alle Parameter explizit ein Typ festgelegt wird.
es: El método {0}.Prepare requiere que todos los parámetros tengan un tipo establecido de forma explícita.
fr: La méthode {0}.Prepare requiert que tous les paramètres aient un type défini explicitement.
it: Il metodo {0}.Prepare richiede l'impostazione esplicita del tipo per tutti i parametri.
ja: {0}.Prepare メソッドは、パラメーターはすべて明示的に設定された型を持つことを要求します。
ko: {0}.Prepare 메서드에는 모든 매개 변수의 형식을 명시적으로 설정해야 합니다.
pt_br: O método {0}.Prepare exige que todos os parâmetros tenham um tipo explicitamente definido.
ru: Для метода {0}.Prepare требуется, чтобы для всех параметров был явно указан тип.
zh_hans: {0}.Prepare 方法要求所有参数具有显式设置的类型。
zh_hant: {0}.Prepare 方法需要所有的參數都明確地設定型別。
