Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_InternalProviderError
source: Internal .NET Framework Data Provider error {0}.
de: Interner .NET Framework-Datenanbieterfehler {0}.
es: Error interno de .NET Framework Data Provider {0}.
fr: Erreur interne du fournisseur de données .NET Framework {0}.
it: Errore interno del provider di dati .NET Framework {0}.
ja: .NET Framework Data Provider の内部エラー {0} です。
ko: 내부 .NET Framework Data Provider 오류 {0}입니다.
pt_br: Erro interno do Provedor de Dados .NET Framework {0}.
ru: Внутренняя ошибка {0} поставщика данных .NET Framework.
zh_hans: 内部 .NET Framework 数据提供程序错误 {0}。
zh_hant: 內部 .NET Framework Data Provider 錯誤 {0}。

# ADP_NoQuoteChange
source: The QuotePrefix and QuoteSuffix properties cannot be changed once an Insert, Update, or Delete command has been generated.
de: Die Eigenschaften 'QuotePrefix' und 'QuoteSuffix' können nicht geändert werden, wenn Insert, Update oder Delete generiert wurde.
es: Las propiedades QuotePrefix y QuoteSuffix no se pueden cambiar una vez que genera un comando Insert, Update o Delete.
fr: Les propriétés QuotePrefix et QuoteSuffix ne peuvent pas être changées lorsqu'une commande Insert, Update ou Delete a été générée.
it: Impossibile modificare le proprietà QuotePrefix e QuoteSuffix dopo la generazione di un comando Insert, Update o Delete.
ja: QuotePrefix および QuoteSuffix プロパティは、Insert、Update または Delete コマンドが一度生成されると、もはや変更できません。
ko: Insert, Update 또는 Delete 명령이 생성된 후에는 QuotePrefix 및 QuoteSuffix 속성을 변경할 수 없습니다.
pt_br: As propriedades QuotePrefix e QuoteSuffix não podem ser alteradas depois que um comando Insert, Update ou Delete é gerado.
ru: Невозможно изменить свойства QuotePrefix и QuoteSuffix после того, как создана команда Insert, Update или Delete.
zh_hans: 生成了 Insert、Update 或 Delete 命令后，QuotePrefix 和 QuoteSuffix 属性就无法更改。
zh_hant: 一旦 Insert、Update 或 Delete 等命令產生後，就無法變更 QuotePrefix 和 QuoteSuffix 屬性。

# ADP_MissingSourceCommand
source: The DataAdapter.SelectCommand property needs to be initialized.
de: Die Eigenschaft 'DataAdapter.SelectCommand' muss initialisiert werden.
es: Necesita inicializar la propiedad DataAdapter.SelectCommand.
fr: La propriété DataAdapter.SelectCommand doit être initialisée.
it: È necessario inizializzare la proprietà DataAdapter.SelectCommand.
ja: DataAdapter.SelectCommand プロパティを初期化する必要があります。
ko: DataAdapter.SelectCommand 속성을 초기화해야 합니다.
pt_br: É necessário inicializar a propriedade DataAdapter.SelectCommand.
ru: Требуется инициализировать свойство DataAdapter.SelectCommand.
zh_hans: DataAdapter.SelectCommand 属性需要初始化。
zh_hant: 必須初始化 DataAdapter.SelectCommand 屬性。

# ADP_MissingSourceCommandConnection
source: The DataAdapter.SelectCommand.Connection property needs to be initialized;
de: Die Eigenschaft DataAdapter.SelectCommand.Connection muss initialisiert werden.
es: Necesita inicializar la propiedad DataAdapter.SelectCommand.Connection;
fr: La propriété DataAdapter.SelectCommand.Connection doit être initialisée ;
it: La proprietà DataAdapter.SelectCommand.Connection deve essere inizializzata.
ja: DataAdapter.SelectCommand.Connection プロパティは初期化する必要があります。
ko: DataAdapter.SelectCommand.Connection 속성을 초기화해야 합니다.
pt_br: É necessário inicializar a propriedade DataAdapter.SelectCommand.Connection;
ru: Требуется инициализировать свойство DataAdapter.SelectCommand.Connection;
zh_hans: DataAdapter.SelectCommand.Connection 属性需要初始化；
zh_hant: 必須初始化 DataAdapter.SelectCommand.Connection 屬性;

# ADP_InvalidMultipartNameQuoteUsage
source: {0} "{1}", incorrect usage of quotes.
de: {0} "{1}", falsche Verwendung von Anführungszeichen.
es: {0} "{1}", uso incorrecto de comillas.
fr: {0} "{1}", utilisation incorrecte de guillemets.
it: {0} "{1}", uso incorretto delle virgolette.
ja: {0} "{1}"。引用符の使い方に誤りがあります。
ko: {0} "{1}", 따옴표 사용이 잘못되었습니다.
pt_br: {0} "{1}", uso incorreto de aspas.
ru: {0} "{1}", неправильное использование кавычек.
zh_hans: {0} "{1}"，引号的用法不正确。
zh_hant: {0} "{1}"，引號的用法不正確。

# ADP_InvalidMultipartNameToManyParts
source: {0} "{1}", the current limit of "{2}" is insufficient.
de: {0} "{1}", der aktuelle Grenzwert von "{2}" ist unzureichend.
es: {0} "{1}", el límite actual de "{2}" es insuficiente.
fr: {0} "{1}", la limite actuelle de "{2}" est insuffisante.
it: {0} "{1}", il limite corrente di "{2}" è insufficiente.
ja: {0} "{1}"。現在の制限値 "{2}" は十分ではありません。
ko: {0} "{1}", 현재 한도 "{2}"이(가) 부족합니다.
pt_br: {0} "{1}", o limite atual de "{2}" é insuficiente.
ru: {0} "{1}", недостаточное текущее предельное значение "{2}".
zh_hans: {0} "{1}"，当前对“{2}”的限制不够。
zh_hant: {0} "{1}"，"{2}" 目前的限制不足。

# SQL_BulkCopyDestinationTableName
source: SqlBulkCopy.WriteToServer failed because the SqlBulkCopy.DestinationTableName is an invalid multipart name
de: Fehler bei 'SqlBulkCopy.WriteToServer'. 'SqlBulkCopy.DestinationTableName' ist ein ungültiger mehrteiliger Name.
es: Fallo de SqlBulkCopy.WriteToServer porque SqlBulkCopy.DestinationTableName es un nombre de varias partes no válido.
fr: Échec de SqlBulkCopy.WriteToServer car SqlBulkCopy.DestinationTableName est un nom en plusieurs parties non valide
it: SqlBulkCopy.WriteToServer non riuscito perché SqlBulkCopy.DestinationTableName è un nome a più parti non valido
ja: SqlBulkCopy.DestinationTableName は無効なマルチパート名のため、SqlBulkCopy.WriteToServer が失敗しました。
ko: SqlBulkCopy.DestinationTableName이 잘못된 multipart 이름이어서 SqlBulkCopy.WriteToServer에 실패했습니다.
pt_br: O SqlBulkCopy.WriteToServer falhou, pois o SqlBulkCopy.DestinationTableName é um nome composto inválido
ru: Сбой SqlBulkCopy.WriteToServer, поскольку SqlBulkCopy.DestinationTableName является недействительным составным именем.
zh_hans: SqlBulkCopy.WriteToServer 失败，因为 SqlBulkCopy.DestinationTableName 是无效的多部分名称
zh_hant: SqlBulkCopy.WriteToServer 已經失敗，因為 SqlBulkCopy.DestinationTableName 是無效的多部名稱

# SQL_TDSParserTableName
source: Processing of results from SQL Server failed because of an invalid multipart name
de: Fehler bei der Verarbeitung von SQL Server-Ergebnissen aufgrund eines ungültigen mehrteiligen Namens.
es: Fallo al procesar los resultados de SQL Server por un nombre de varias partes no válido.
fr: Échec du traitement des résultats provenant de SQL Server à cause d'un nom en plusieurs parties non valide
it: Elaborazione dei risultati da SQL Server fallita a causa di un nome a più parti non valido
ja: マルチパート名が無効なため、SQL Server からの結果を処理することができませんでした。
ko: multipart 이름이 잘못되어 SQL Server 결과를 처리하지 못했습니다.
pt_br: O processamento de resultados do SQL Server falhou devido a um nome composto inválido
ru: Сбой обработки полученных с сервера SQL Server результатов из-за недопустимого составного имени.
zh_hans: 因为无效的多部分名称，处理来自 SQL Server 的结果失败
zh_hant: 由於某個無效的多部名稱，故無法處理來自 SQL Server 的結果

# SQL_UDTTypeName
source: SqlParameter.UdtTypeName is an invalid multipart name
de: 'SqlParameter.UdtTypeName' ist ein ungültiger mehrteiliger Name.
es: SqlParameter.UdtTypeName no es un nombre de varias partes válido
fr: SqlParameter.UdtTypeName est un nom en plusieurs parties non valide
it: SqlParameter.UdtTypeName è un nome a più parti non valido
ja: SqlParameter.UdtTypeName は、無効なマルチパート名です。
ko: SqlParameter.UdtTypeName은 잘못된 multipart 이름입니다.
pt_br: SqlParameter.UdtTypeName é um nome composto inválido
ru: SqlParameter.UdtTypeName является недействительным составным именем.
zh_hans: SqlParameter.UdtTypeName 是无效的多部分名称
zh_hant: SqlParameter.UdtTypeName 是無效的多部名稱

# SQL_TypeName
source: SqlParameter.TypeName is an invalid multipart name
de: SqlParameter.TypeName ist ein ungültiger mehrteiliger Name.
es: SqlParameter.TypeName no es un nombre de varias partes válido
fr: SqlParameter.TypeName est un nom en plusieurs parties non valide
it: SqlParameter.TypeName è un nome a più parti non valido
ja: SqlParameter.TypeName が無効なマルチパート名です
ko: SqlParameter.TypeName은 잘못된 multipart 이름입니다.
pt_br: O SqlParameter.TypeName é um nome com várias partes inválido
ru: SqlParameter.TypeName является недопустимым именем, состоящим из нескольких частей
zh_hans: SqlParameter.TypeName 是无效的多部分名称
zh_hant: SqlParameter.TypeName 是無效的多部名稱

# SQL_SqlCommandCommandText
source: SqlCommand.DeriveParameters failed because the SqlCommand.CommandText property value is an invalid multipart name
de: Fehler bei 'SqlCommand.DeriveParameters'. Der Wert der 'SqlCommand.CommandText'-Eigenschaft ist ein ungültiger mehrteiliger Name.
es: Fallo en SqlCommand.DeriveParameters, el valor de la propiedad SqlCommand.CommandText es un nombre de varias partes no válido.
fr: Échec de SqlCommand.DeriveParameters car la valeur de la propriété SqlCommand.CommandText est un nom en plusieurs parties non valide
it: SqlCommand.DeriveParameters fallito perché il valore di proprietà SqlCommand.CommandText è un nome a più parti non valido
ja: SqlCommand.CommandText プロパティの値が無効なマルチパート名のため、SqlCommand.DeriveParameters が失敗しました。
ko: SqlCommand.CommandText 속성 값이 잘못된 multipart 이름이어서 SqlCommand.DeriveParameters에 실패했습니다.
pt_br: O SqlCommand.DeriveParameters falhou, pois o valor da propriedade SqlCommand.CommandText é um nome composto inválido
ru: Сбой SqlCommand.DeriveParameters из-за того, что значение свойства SqlCommand.CommandText является недействительным составным именем.
zh_hans: SqlCommand.DeriveParameters 失败，因为 SqlCommand.CommandText 属性值是无效的多部分名称
zh_hant: SqlCommand.DeriveParameters 已失敗，因為 SqlCommand.CommandText 屬性值為無效的多部名稱。

# ODBC_ODBCCommandText
source: OdbcCommandBuilder.DeriveParameters failed because the OdbcCommand.CommandText property value is an invalid multipart name
de: Fehler bei 'OdbcCommandBuilder.DeriveParameters'. Der Wert der 'OdbcCommand.CommandText'-Eigenschaft ist ein ungültiger mehrteiliger Name.
es: Fallo en OdbcCommandBuilder.DeriveParameters porque el valor de propiedad OdbcCommand.CommandText es un nombre de varias partes no válido.
fr: Échec de OdbcCommandBuilder.DeriveParameters car la valeur de la propriété OdbcCommand.CommandText est un nom en plusieurs parties non valide
it: OdbcCommandBuilder.DeriveParameters fallito perché il valore di proprietà OdbcCommand.CommandText è un nome a più parti non valido
ja: OdbcCommand.CommandText プロパティの値が無効なマルチパート名のため、OdbcCommandBuilder.DeriveParameters が失敗しました。
ko: OdbcCommand.CommandText 속성 값이 잘못된 multipart 이름이어서 OdbcCommandBuilder.DeriveParameters에 실패했습니다.
pt_br: O OdbcCommandBuilder.DeriveParameters falhou, pois o valor da propriedade OdbcCommand.CommandText é um nome composto inválido
ru: Сбой OdbcCommandBuilder.DeriveParameters из-за того, что значение свойства OdbcCommand.CommandText является недействительным составным именем.
zh_hans: OdbcCommandBuilder.DeriveParameters 失败，因为 OdbcCommand.CommandText 属性值是无效的多部分名称
zh_hant: OdbcCommandBuilder.DeriveParameters 已失敗，因為 OdbcCommand.CommandText 屬性值為無效的多部名稱。

# OLEDB_OLEDBCommandText
source: OleDbCommandBuilder.DeriveParameters failed because the OleDbCommandBuilder.CommandText property value is an invalid multipart name
de: Fehler bei 'OleDbCommandBuilder.DeriveParameters'. Der Wert der 'OleDbCommandBuilder.CommandText'-Eigenschaft ist ein ungültiger mehrteiliger Name.
es: Fallo en OleDbCommandBuilder.DeriveParameters porque el valor de propiedad OleDbCommandBuilder.CommandText es un nombre de varias partes no válido
fr: Échec de OleDbCommandBuilder.DeriveParameters car la valeur de la propriété OleDbCommandBuilder.CommandText est un nom en plusieurs parties non valide
it: OleDbCommandBuilder.DeriveParameters fallito perché il valore di proprietà OleDbCommandBuilder.CommandText è un nome a più parti non valido
ja: OleDbCommandBuilder.CommandText プロパティの値が無効なマルチパート名のため、OleDbCommandBuilder.DeriveParameters が失敗しました。
ko: OleDbCommandBuilder.CommandText 속성 값이 잘못된 multipart 이름이어서 OleDbCommandBuilder.DeriveParameters에 실패했습니다.
pt_br: O OleDbCommandBuilder.DeriveParameters falhou, pois o valor da propriedade OleDbCommandBuilder.CommandText é um nome composto inválido
ru: Сбой OleDbCommandBuilder.DeriveParameters из-за того, что значение свойства OleDbCommandBuilder.CommandText является недействительным составным именем.
zh_hans: OleDbCommandBuilder.DeriveParameters 失败，因为 OleDbCommandBuilder.CommandText 属性值是无效的多部分名称
zh_hant: OleDbCommandBuilder.DeriveParameters 已失敗，因為 OleDbCommandBuilder.CommandText 屬性值為無效的多部名稱。

# SQLMSF_FailoverPartnerNotSupported
source: Connecting to a mirrored SQL Server instance using the MultiSubnetFailover connection option is not supported.
de: Die Verbindung mit einer gespiegelten SQL Server-Instanz unter Verwendung der MultiSubnetFailover-Verbindungsoption wird nicht unterstützt.
es: No se admite la conexión a una instancia de SQL Server reflejada mediante la opción de conexión MultiSubnetFailover.
fr: La connexion à une instance de SQL Server mise en miroir à l'aide de l'option de connexion MultiSubnetFailover n'est pas prise en charge.
it: La connessione a un'istanza di SQL Server con mirroring utilizzando l'opzione di connessione MultiSubnetFailover non è supportata.
ja: ミラー化された SQL Server インスタンスへの MultiSubnetFailover 接続オプションを使用した接続はサポートされていません。
ko: MultiSubnetFailover 연결 옵션을 사용하여 미러된 SQL Server 인스턴스에 연결이 지원되지 않습니다.
pt_br: Não há suporte para a conexão de uma instância espelhada do SQL Server usando a opção de conexão MultiSubnetFailover.
ru: Подключение к зеркальному экземпляру SQL Server с использованием параметра MultiSubnetFailover не поддерживается.
zh_hans: 不支持使用 MultiSubnetFailover 连接选项连接到镜像的 SQL Server 实例。
zh_hant: 不支援使用 MultiSubnetFailover 連接選項連接到鏡像的 SQL Server 執行個體。

# ADP_ColumnSchemaExpression
source: The column mapping from SourceColumn '{0}' failed because the DataColumn '{1}' is a computed column.
de: Die Spaltenzuordnung von SourceColumn '{0}' ist fehlgeschlagen, da die DataColumn '{1}' ist berechnete Spalte ist.
es: Error en la asignación de columna SourceColumn '{0}' porque DataColumn '{1}' es una columna calculada.
fr: Le mappage de colonnes de SourceColumn '{0}' a échoué car le DataColumn '{1}' est une colonne calculée.
it: Impossibile eseguire il mapping dalla SourceColumn '{0}' perché la DataColumn '{1}' è una colonna calcolata.
ja: DataColumn '{1}' は計算列であるため、SourceColumn '{0}' からの列マップは失敗しました。
ko: DataColumn '{1}'이(가) 계산 열이므로 SourceColumn '{0}'에서의 열 매핑에 실패했습니다.
pt_br: Falha no mapeamento de coluna de SourceColumn '{0}' porque DataColumn '{1}' é uma coluna calculada.
ru: Сбой сопоставления столбцов из SourceColumn "{0}" из-за того, что DataColumn "{1}" является вычисляемым столбцом.
zh_hans: 来自 SourceColumn“{0}”的列映射失败，原因在于 DataColumn“{1}”是计算所得的列。
zh_hant: 由於 DataColumn '{1}' 是一個計算資料行，所以無法從 SourceColumn '{0}' 進行資料行對應。

# ADP_ColumnSchemaMismatch
source: Inconvertible type mismatch between SourceColumn '{0}' of {1} and the DataColumn '{2}' of {3}.
de: Nicht konvertierbarer Typenkonflikt zwischen SourceColumn '{0}' von {1} und DataColumn '{2}' von {3}.
es: Falta de coincidencia entre los tipos que no se pueden convertir SourceColumn '{0}' de {1} y DataColumn '{2}' de {3}.
fr: Incompatibilité de type ne pouvant pas être converti entre SourceColumn '{0}' de {1} et DataColumn '{2}' de {3}.
it: Impossibile eseguire la conversione. Il tipo della proprietà SourceColumn "{0}" di {1} non corrisponde a quello della proprietà DataColumn "{2}" di {3}.
ja: SourceColumn '{1}' の '{0}' と {3} の DataColumn '{2}' の間に変換不可能な型の不一致があります。
ko: {1}의 SourceColumn '{0}'과(와) {3}의 DataColumn '{2}'의 유형이 일치하지 않습니다.
pt_br: Tipos não conversíveis incompatíveis entre SourceColumn '{0}' de {1} e DataColumn '{2}' de {3}.
ru: Не поддающееся преобразованию несоответствие типов между SourceColumn "{0}" из {1} и DataColumn "{2}" из {3}.
zh_hans: {1} 的 SourceColumn“{0}”和 {3} 的 DataColumn“{2}”之间无法转换的类型不匹配。
zh_hant: {1} 的 SourceColumn '{0}' 與 {3} 的 DataColumn '{2}' 之間發生不可轉換類型不符的問題。

# ADP_ColumnSchemaMissing1
source: Missing the DataColumn '{0}' for the SourceColumn '{2}'.
de: DataColumn '{0}' für SourceColumn '{2}' ist nicht vorhanden.
es: Falta DataColumn '{0}' para SourceColumn '{2}'.
fr: DataColumn '{0}' manquant pour SourceColumn '{2}'.
it: DataColumn '{0}' mancante per la SourceColumn '{2}'.
ja: SourceColumn '{2}' の DataColumn '{0}' が見つかりません。
ko: SourceColumn '{2}'에 DataColumn '{0}'이(가) 없습니다.
pt_br: DataColumn '{0}' de SourceColumn '{2}' inexistente.
ru: Отсутствует DataColumn "{0}" для данного SourceColumn "{2}".
zh_hans: 缺少 SourceColumn“{2}”的 DataColumn“{0}”。
zh_hant: 遺漏 SourceColumn '{2}' 的 DataColumn '{0}'。

# ADP_ColumnSchemaMissing2
source: Missing the DataColumn '{0}' in the DataTable '{1}' for the SourceColumn '{2}'.
de: DataColumn '{0}' in der DataTable '{1}' für SourceColumn '{2}' ist nicht vorhanden.
es: Falta DataColumn '{0}' en DataTable '{1}' para SourceColumn '{2}'.
fr: DataColumn '{0}' manquant dans DataTable '{1}' pour SourceColumn '{2}'.
it: DataColumn '{0}' mancante nella DataTable '{1}' per la SourceColumn '{2}'.
ja: SourceColumn '{2}' の DataTable '{1}' に DataColumn '{0}' が見つかりません。
ko: SourceColumn '{2}'의 DataTable '{1}'에 DataColumn '{0}'이(가) 없습니다.
pt_br: DataColumn '{0}' em DataTable '{1}' de SourceColumn '{2}' inexistente.
ru: В DataTable "{1}" отсутствует DataColumn "{0}" для данного SourceColumn "{2}".
zh_hans: DataTable“{1}”中缺少 SourceColumn“{2}”的 DataColumn“{0}”。
zh_hant: 在 DataTable '{1}' 中遺漏 SourceColumn '{2}' 的 DataColumn '{0}'。

# ADP_InvalidSourceColumn
source: SourceColumn is required to be a non-empty string.
de: SourceColumn muss eine nicht leere Zeichenfolge sein.
es: SourceColumn no puede ser una cadena vacía.
fr: SourceColumn doit être une chaîne non vide.
it: SourceColumn deve essere una stringa non vuota.
ja: SourceColumn には空でない文字列が必要です。
ko: SourceColumn에는 비어 있지 않은 문자열이 필요합니다.
pt_br: É necessário que SourceColumn seja uma cadeia de caracteres não vazia.
ru: Значение SourceColumn не должно быть пустой строкой.
zh_hans: SourceColumn 应为非空字符串。
zh_hant: SourceColumn 必須是非空白字串。

# ADP_MissingColumnMapping
source: Missing SourceColumn mapping for '{0}'.
de: Fehlende SourceColumn-Zuordnung für '{0}'.
es: Falta la asignación de SourceColumn '{0}'.
fr: Mappage SourceColumn manquant pour '{0}'.
it: Mapping di SourceColumn mancante per '{0}'.
ja: '{0}' の SourceColumn マップが見つかりません。
ko: '{0}'에 대한 SourceColumn 매핑이 없습니다.
pt_br: Mapeamento de SourceColumn inexistente para '{0}'.
ru: Отсутствует сопоставление SourceColumn для "{0}".
zh_hans: 缺少“{0}”的 SourceColumn 映射。
zh_hant: 遺漏 '{0}' 的 SourceColumn 對應。

# ADP_NotSupportedEnumerationValue
source: The {0} enumeration value, {1}, is not supported by the {2} method.
de: Der Enumerationswert von {0}, {1}, wird von der Methode {2} nicht unterstützt.
es: El valor de enumeración de {0}, {1}, no es compatible con el método {2}.
fr: La valeur d'énumération {0}, {1}, n'est pas prise en charge par la méthode {2}.
it: Il valore {1} dell'enumerazione {0} non è supportato dal metodo {2}.
ja: {0} 列挙値 {1} は、{2} メソッドではサポートされていません。
ko: {0} 열거형 값 {1}은(는) {2} 메서드에서 지원되지 않습니다.
pt_br: O método {2} não dá suporte ao valor de enumeração de {0}, {1}.
ru: Значение перечисления {0}, {1}, не поддерживается методом {2}.
zh_hans: {2} 方法不支持 {0} 枚举值 {1}。
zh_hant: {2} 方法不支援 {0} 的列舉值 {1}。

# ODBC_NotSupportedEnumerationValue
source: The {0} enumeration value, {1}, is not supported by the .NET Framework Odbc Data Provider.
de: Der Enumerationswert für {0} ({1}) wird vom .NET Framework-ODBC-Datenanbieter nicht unterstützt.
es: El proveedor de datos Odbc de .NET Framework no admite el valor de enumeración de {0}, {1}.
fr: La valeur d'énumération {0}, {1}, n'est pas prise en charge par le fournisseur de données .NET Framework ODBC.
it: Il valore di enumerazione di {0}, {1}, non è supportato dal provider di dati .NET Framework Odbc.
ja: {0} の列挙値 {1} は、.NET Framework Odbc データ プロバイダーではサポートされていません。
ko: {0} 열거형 값 {1}은(는) .NET Framework Odbc Data Provider에서 지원되지 않습니다.
pt_br: O Provedor de Dados .NET Framework para ODBC não dá suporte ao valor de enumeração {0}, {1}.
ru: Поставщик данных .NET Framework для ODBC не поддерживает значение перечисления {0} "{1}".
zh_hans: .NET Framework Odbc 数据提供程序不支持 {0} 枚举值 {1}。
zh_hant: .NET Framework Odbc Data Provider 不支援 {0} 列舉值 {1}。

# OLEDB_NotSupportedEnumerationValue
source: The {0} enumeration value, {1}, is not supported by the .NET Framework OleDb Data Provider.
de: Der Enumerationswert für {0} ({1}) wird vom .NET Framework-OLEDB-Datenanbieter nicht unterstützt.
es: El proveedor de datos .NET Framework para OleDb no admite el valor de enumeración de {0}, {1}.
fr: La valeur d'énumération {0}, {1}, n'est pas prise en charge par le fournisseur de données .NET Framework OLEDB.
it: Il valore di enumerazione di {0}, {1}, non è supportato dal provider di dati .NET Framework OleDb.
ja: {0} の列挙値 {1} は、.NET Framework OleDb データ プロバイダーではサポートされていません。
ko: {0} 열거형 값 {1}은(는) .NET Framework OleDb Data Provider에서 지원되지 않습니다.
pt_br: O Provedor de Dados .NET Framework para OLEDB não dá suporte ao valor de enumeração {0}, {1}.
ru: Поставщик данных .NET Framework для OLE DB не поддерживает значение перечисления {0} "{1}".
zh_hans: .NET Framework OleDb 数据提供程序不支持 {0} 枚举值 {1}。
zh_hant: .Net Framework OleDb Data Provider 不支援 {0} 列舉值 {1}。

# SQL_NotSupportedEnumerationValue
source: The {0} enumeration value, {1}, is not supported by the .NET Framework SqlClient Data Provider.
de: Der Enumerationswert für {0} ({1}) wird vom .NET Framework-SqlClient-Datenanbieter nicht unterstützt.
es: El proveedor de datos SqlClient de .Net Framework no admite el valor de enumeración de {0}, {1}.
fr: La valeur d'énumération {0}, {1}, n'est pas prise en charge par le fournisseur de données .NET Framework SqlClient.
it: Il valore di enumerazione di {0}, {1}, non è supportato dal provider di dati .NET Framework SqlClient.
ja: {0} の列挙値 {1} は、.NET Framework SqlClient データ プロバイダーではサポートされていません。
ko: {0} 열거형 값 {1}은(는) .NET Framework SqlClient Data Provider에서 지원되지 않습니다.
pt_br: O Provedor de Dados .NET Framework para SqlClient não dá suporte ao valor de enumeração {0}, {1}.
ru: Поставщик данных .NET Framework для SQL Server (SqlClient) не поддерживает значение перечисления {0} "{1}".
zh_hans: .NET Framework SqlClient 数据提供程序不支持 {0} 枚举值 {1}。
zh_hant: .NET Framework SqlClient Data Provider 不支援 {0} 列舉值 {1}。

# ADP_ComputerNameEx
source: Unable to retrieve the ComputerNameDnsFullyQualified, {0}.
de: 'ComputerNameDnsFullyQualified', {0}, kann nicht abgerufen werden.
es: No se puede recuperar ComputerNameDnsFullyQualified, {0}.
fr: Impossible d'extraire le nom complet ComputerNameDnsFullyQualified, {0}.
it: Impossibile recuperare ComputerNameDnsFullyQualified, {0}.
ja: ComputerNameDnsFullyQualified を取得することができません。{0}。
ko: ComputerNameDnsFullyQualified, {0}을(를) 검색할 수 없습니다.
pt_br: Não foi possível recuperar ComputerNameDnsFullyQualified, {0}.
ru: Не удалось извлечь ComputerNameDnsFullyQualified, {0}.
zh_hans: 无法检索 ComputerNameDnsFullyQualified {0}。
zh_hant: 無法擷取 ComputerNameDnsFullyQualified，{0}。

# ADP_MissingTableSchema
source: Missing the '{0}' DataTable for the '{1}' SourceTable.
de: Fehlende '{0}' DataTable für die '{1}' SourceTable.
es: Falta '{0}' DataTable para '{1}' SourceTable.
fr: DataTable '{0}' manquant pour le SourceTable '{1}'.
it: DataTable '{0}' mancante per la SourceTable '{1}'.
ja: '{1}' SourceTable の '{0}' DataTable が見つかりません。
ko: '{1}' SourceTable에 대한 '{0}' DataTable이 없습니다.
pt_br: DataTable '{0}' inexistente para SourceTable '{1}'.
ru: Для SourceTable "{1}" отсутствует DataTable "{0}".
zh_hans: 缺少“{1}”SourceTable 的“{0}”DataTable。
zh_hant: 遺漏 '{1}' SourceTable 的 '{0}' DataTable。

# ADP_InvalidSourceTable
source: SourceTable is required to be a non-empty string
de: SourceTable muss eine nicht leere Zeichenfolge sein.
es: Es necesario que SourceTable no sea una cadena vacía
fr: SourceTable doit être une chaîne non vide
it: SourceTable deve essere una stringa non vuota.
ja: SourceTable には空でない文字列が必要です。
ko: SourceTable에는 비어 있지 않은 문자열이 필요합니다.
pt_br: É necessário que SourceTable seja uma cadeia de caracteres não vazia
ru: Значение SourceTable не должно быть пустой строкой
zh_hans: SourceTable 应为非空字符串
zh_hant: SourceTable 必須為非空白字串
