Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_InvalidCustomKeyStoreProviderName
source: Invalid key store provider name '{0}'. '{1}' prefix is reserved for system key store providers.
de: Ungültiger Name des Schlüsselspeicheranbieters '{0}'. Das Präfix '{1}' ist für Systemschlüsselspeicheranbieter reserviert.
es: Nombre de proveedor de almacenamiento de claves no válido "{0}". El prefijo "{1}" está reservado para los proveedores de almacenamiento de claves de sistema.
fr: Le nom de fournisseur de magasins de clés « {0} » n’est pas valide. Le préfixe « {1} » est réservé aux fournisseurs de magasins de clés système.
it: Il nome '{0}' del provider dell'archivio chiavi non è valido. Il prefisso '{1}' è riservato per i provider dell'archivio chiavi di sistema.
ja: キー ストア プロバイダー名 '{0}' が無効です。'{1}' プレフィックスは、システム キー ストア プロバイダー用に予約されています。
ko: 키 저장소 공급자 이름 '{0}'이(가) 잘못되었습니다. '{1}' 접두사는 시스템 키 저장소 공급자용으로 예약되어 있습니다.
pt_br: Nome do provedor de armazenamento de chaves inválido: '{0}'. O prefixo '{1}' é um nome reservado a provedores de repositório de chaves do sistema.
ru: Недопустимое имя поставщика хранилища ключей "{0}". Префикс "{1}" зарезервирован для поставщиков хранилища ключей системы.
zh_hans: 密钥存储提供程序名“{0}”无效。“{1}”前缀是保留给系统密钥存储提供程序用的。
zh_hant: 金鑰存放區提供者名稱 '{0}' 無效。前置詞 '{1}' 已保留供系統金鑰存放區提供者使用。

# TCE_NullProviderValue
source: Null reference specified for key store provider '{0}'. Expecting a non-null value.
de: Nullverweis für Schlüsselspeicheranbieter '{0}' angegeben. Es wird ein anderer Wert als NULL erwartet.
es: Referencia nula especificada para el proveedor de almacenamiento de claves "{0}". Se espera un valor no nulo.
fr: Une référence null a été spécifiée pour le fournisseur de magasins de clés « {0} ». Valeur non null attendue.
it: È stato specificato un riferimento Null per il provider dell'archivio chiavi '{0}'. È previsto un valore non Null.
ja: キー ストア プロバイダー '{0}' に Null 参照が指定されています。 Null 以外の値が必要です。
ko: 키 저장소 공급자 '{0}'에 대해 null 참조가 지정되었습니다. Null이 아닌 값이 필요합니다.
pt_br: Referência nula especificada para o provedor de armazenamento de chaves '{0}'. Esperado um valor não nulo.
ru: Указана пустая ссылка для поставщика хранилища ключей "{0}". Ожидается значение, отличное от Null.
zh_hans: 为密钥存储提供程序“{0}”指定的引用为 null。应是非 null 值。
zh_hant: 為金鑰存放區提供者 '{0}' 指定了 Null 參考。應為非 Null 的值。

# TCE_EmptyProviderName
source: Invalid key store provider name specified. Key store provider names cannot be null or empty.
de: Ungültiger Name des Schlüsselspeicheranbieters angegeben. Name des Schlüsselspeicheranbieters darf nicht NULL oder leer sein.
es: Nombre de proveedor de almacenamiento de claves no válido especificado. Los nombres de los proveedores de almacenamiento de claves no pueden ser nulos ni estar vacíos.
fr: Le nom du fournisseur de magasins de clés spécifié n’est pas valide. Le nom du fournisseur de magasins de clés ne peut pas être vide ou avoir la valeur null.
it: Il nome del provider dell'archivio chiavi specificato non è valido. I nomi di provider di archivio chiavi non possono essere Null o vuoti.
ja: 指定されたキー ストア プロバイダー名が無効です。キー ストア プロバイダー名を Null または空にすることはできません。
ko: 잘못된 키 저장소 공급자 이름이 지정되었습니다. 키 저장소 공급자 이름은 null이거나 비워 둘 수 없습니다.
pt_br: Nome do provedor de armazenamento de chaves especificado inválido. Nomes de provedor de armazenamento de chaves não podem ser nulos ou vazios.
ru: Указано недействительное имя поставщика хранилища ключей. Имена поставщиков хранилища ключей не могут иметь значение Null или быть пустыми.
zh_hans: 指定的密钥存储提供程序名无效。密钥存储提供程序名不能为 null 或空。
zh_hant: 指定了無效的金鑰存放區提供者名稱。金鑰存放區提供者名稱不能是 Null 或空白。

# TCE_SqlCommand_ColumnEncryptionSetting
source: Column encryption setting for the command. Overrides the connection level default.
de: Spaltenverschlüsselungseinstellung für den Befehl. Setzt den Standardwert auf Verbindungsebene außer Kraft.
es: Valor de cifrado de columnas para el comando. Anula el nivel de conexión predeterminado.
fr: Paramètre de chiffrement de colonne pour la commande. Remplace la valeur par défaut du niveau de connexion.
it: Impostazione di crittografia di colonna per il comando. Sostituisce l'impostazione predefinita del livello di connessione.
ja: コマンドの列暗号化設定です。接続レベルの既定を上書きします。
ko: 명령에 대한 열 암호화 설정입니다. 연결 수준 기본값을 재정의합니다.
pt_br: Configuração de criptografia da coluna para o comando. Substitui o padrão do nível de conexão.
ru: Параметр шифрования столбца для команды. Переопределяет уровень подключения по умолчанию.
zh_hans: 命令的列加密设置。替代连接级别默认设置。
zh_hant: 命令的資料行加密設定。會覆寫連線等級預設值。

# TCE_DbConnectionString_ColumnEncryptionSetting
source: Default column encryption setting for all the commands on the connection.
de: Standardverschlüsselungseinstellung für alle Befehle in der Verbindung.
es: Valor de cifrado de columnas predeterminado para todos los comandos de la conexión.
fr: Paramètre de chiffrement de colonne par défaut pour toutes les commandes sur la connexion.
it: Impostazione di crittografia di colonna predefinita per tutti i comandi della connessione.
ja: 接続上のすべてのコマンドの既定の列暗号化設定です。
ko: 연결에서 모든 명령에 대한 기본 열 암호화 설정입니다.
pt_br: Configuração de criptografia de coluna padrão para todos os comandos na conexão.
ru: Параметр шифрования столбца по умолчанию для всех команд подключения.
zh_hans: 用于连接上的所有命令的默认列加密设置。
zh_hant: 連線中所有命令的預設資料行加密設定。

# TCE_SqlParameter_ForceColumnEncryption
source: Forces parameter to be encrypted before sending sensitive data to server.
de: Erzwingt, dass Parameter verschlüsselt werden, bevor vertrauliche Daten an den Server gesendet werden.
es: Fuerza el cifrado del parámetro antes de enviar información confidencial al servidor.
fr: Force le chiffrement du paramètre avant l’envoi de données sensibles vers le serveur.
it: Forza la crittografia del parametro prima dell'invio di dati sensibili al server.
ja: 機密性の高いデータをサーバーに送信する前にパラメーターを強制的に暗号化する。
ko: 중요한 데이터를 서버에 보내기 전에 매개 변수를 강제로 암호화합니다.
pt_br: Força a criptografia do parâmetro antes do envio de dados sensíveis ao servidor.
ru: Выполняет принудительное шифрование параметра перед отправкой конфиденциальных данных на сервер.
zh_hans: 在向服务器发送敏感数据前强制对参数进行加密。
zh_hant: 傳送敏感性資料至伺服器之前，強制加密參數。

# TCE_SqlConnection_TrustedColumnMasterKeyPaths
source: Dictionary object containing SQL Server names and their trusted column master key paths.
de: Wörterbuchobjekt, das SQL Server-Namen und deren vertrauenswürdige Spaltenhauptschlüsselpfade enthalten.
es: El objeto de diccionario con nombres de SQL Server y sus rutas de clave maestras de columna de confianza.
fr: Objet Dictionary contenant les noms SQL Server et leurs chemins d’accès de clé principale de colonne approuvés.
it: Oggetto Dictionary che contiene i nomi di SQL Server e i relativi percorsi di chiave master di colonna attendibili.
ja: SQL Server 名を格納しているディクショナリ オブジェクトと信頼された列マスター キーのパス。
ko: SQL Server 이름과 해당하는 신뢰할 수 있는 열 마스터 키 경로가 포함된 사전 개체입니다.
pt_br: Objeto de dicionário contendo nomes SQL Server e seus caminhos confiáveis de chave mestra da coluna.
ru: Объект словаря, содержащий имена серверов SQL Server и пути к их доверенным главным ключам столбцов.
zh_hans: 包含 SQL Server 名称的字典对象及其信任的列的主密钥路径。
zh_hant: 包含 SQL Server 名稱及其信任的資料行主要金鑰路徑的字典物件。

# SQLROR_RecursiveRoutingNotSupported
source: Two or more redirections have occurred. Only one redirection per login is allowed.
de: Mindestens zwei Umleitungen sind aufgetreten. Es ist nur eine Umleitung pro Anmeldung zulässig.
es: Aparecen dos o más redireccionamientos. Solo se permite un redireccionamiento por inicio de sesión.
fr: Deux redirections ou plus se sont produites. Seule une redirection par connexion est autorisée.
it: Si sono verificati due o più reindirizzamenti. È consentito un solo reindirizzamento per account di accesso.
ja: 2 回以上のリダイレクトが発生しました。リダイレクトは 1 回のログインにつき 1 回だけ実行できます。
ko: 둘 이상의 리디렉션이 발생했습니다. 로그인당 하나의 리디렉션만 허용됩니다.
pt_br: Dois ou mais redirecionamentos ocorreram. É permitido somente um redirecionamento por logon.
ru: Перенаправление выполнено два или более раза. Для одного имени входа поддерживается только одно перенаправление.
zh_hans: 出现了两个或多个重定向。每次登录只允许一个重定向。
zh_hant: 已發生兩次以上的重新導向。每次登入僅允許一次重新導向。

# SQLROR_FailoverNotSupported
source: Connecting to a mirrored SQL Server instance using the ApplicationIntent ReadOnly connection option is not supported.
de: Die Verbindungsoption "ApplicationIntent ReadOnly" wird nicht unterstützt, wenn eine Verbindung mit einer gespiegelten SQL Server-Instanz hergestellt wird.
es: No se admite la conexión a una instancia de SQL Server reflejada mediante la opción de conexión ApplicationIntent ReadOnly.
fr: La connexion à une instance SQL Server en miroir à l'aide de l'option de connexion ApplicationIntent ReadOnly n'est pas prise en charge.
it: La connessione a un'istanza di SQL Server con mirroring mediante l'opzione ApplicationIntent ReadOnly non è supportata.
ja: ApplicationIntent ReadOnly 接続オプションを使用して SQL Server のミラー化されたインスタンスに接続することはできません。
ko: ApplicationIntent ReadOnly 연결 옵션을 사용하여 미러된 SQL Server 인스턴스에 연결할 수 없습니다.
pt_br: Não há suporte para a operação conectar com uma instância espelhada do SQL Server usando ApplicationIntent ReadOnly.
ru: Соединение с зеркальным экземпляром SQL Server с параметром ApplicationIntent, установленным в значение ReadOnly, не поддерживается.
zh_hans: 不支持使用 ApplicationIntent ReadOnly 连接选项连接到镜像的 SQL Server 实例。
zh_hant: 不支援使用 ApplicationIntent ReadOnly 連接選項連接到 SQL Server 鏡像執行個體。

# SQLROR_UnexpectedRoutingInfo
source: Unexpected routing information received.
de: Unerwartete Routinginformationen empfangen.
es: Se ha recibido información de enrutamiento inesperada.
fr: Informations de routage inattendues reçues.
it: Ricevute informazioni di routing impreviste.
ja: 予期しないルーティング情報を受信しました。
ko: 예기치 않은 라우팅 정보가 수신되었습니다.
pt_br: Informações de roteamento inesperadas recebidas.
ru: Получены непредвиденные сведения о маршрутизации.
zh_hans: 收到了意外的路由信息。
zh_hant: 收到未預期的路由資訊。

# SQLROR_InvalidRoutingInfo
source: Invalid routing information received.
de: Ungültige Routinginformationen empfangen.
es: Se recibió información de enrutamiento no válida.
fr: Informations de routage non valides reçues.
it: Ricevute informazioni di routing non valide.
ja: 無効なルーティング情報を受信しました。
ko: 잘못된 라우팅 정보가 수신되었습니다.
pt_br: Informações de roteamento inválidas recebidas.
ru: Получены недопустимые данные маршрутизации.
zh_hans: 收到了无效的路由信息。
zh_hant: 收到無效的路由資訊。

# SQLROR_TimeoutAfterRoutingInfo
source: Server provided routing information, but timeout already expired.
de: Es wurden Routinginformationen vom Server empfangen, aber das Timeout ist bereits abgelaufen.
es: El servidor proporcionó información de enrutamiento, pero ya ha caducado el tiempo de espera.
fr: Serveur fourni des informations de routage, mais déjà expiration du délai.
it: Il server ha fornito le informazioni di routing, ma il timeout era già scaduto.
ja: サーバーからルーティング情報が提供されましたが、既にタイムアウトしています。
ko: 서버에서 라우팅 정보를 제공했지만 이미 제한 시간이 만료되었습니다.
pt_br: O servidor forneceu informações de roteamento, mas já o tempo limite expirou.
ru: Сервер предоставил сведения о маршрутизации, но время ожидания уже истекло.
zh_hans: 服务器提供了路由信息，但超时时间已到。
zh_hant: 伺服器提供了路由資訊，但已超過逾時的設定。

# SQLCR_InvalidConnectRetryCountValue
source: Invalid ConnectRetryCount value (should be 0-255).
de: Ungültiger ConnectRetryCount-Wert (muss im Bereich 0-255 liegen).
es: Valor de ConnectRetryCount no válido (debe estar entre 0 y 255).
fr: Valeur non valide de ConnectRetryCount (doit être comprise entre 0 et 255).
it: Valore ConnectRetryCount non valido (previsto 0-255).
ja: 無効な ConnectRetryCount 値です (有効な値は 0 ～ 255)。
ko: ConnectRetryCount 값이 잘못되었습니다(0-255 사이 값이어야 함).
pt_br: Valor de ConnectRetryCount inválido (deve ser entre 0 e 255).
ru: Недопустимое значение ConnectRetryCount (должно быть от 0 до 255).
zh_hans: ConnectRetryCount 值无效(应该是 0-255)。
zh_hant: 無效的 ConnectRetryCount 值 (應為 0-255)。

# SQLCR_InvalidConnectRetryIntervalValue
source: Invalid ConnectRetryInterval value (should be 1-60).
de: Ungültiger ConnectRetryInterval-Wert (muss im Bereich 1-60 liegen).
es: Valor de ConnectRetryInterval no válido (debe estar entre 1 y 60).
fr: Valeur non valide de ConnectRetryInterval (doit être comprise entre 1 et 60).
it: Valore ConnectRetryInterval non valido (previsto 1-60).
ja: 無効な ConnectRetryInterval 値です (有効な値は 1 ～ 60)。
ko: ConnectRetryInterval 값이 잘못되었습니다(1-60 사이 값이어야 함).
pt_br: Valor de ConnectRetryInterval inválido (deve ser entre 1 e 60).
ru: Недопустимое значение ConnectRetryInterval (должно быть от 1 до 60).
zh_hans: ConnectRetryInterval 值无效(应该是 1-60)。
zh_hant: 無效的 ConnectRetryInterval 值 (應為 1-60)。

# SQLCR_NextAttemptWillExceedQueryTimeout
source: Next reconnection attempt will exceed query timeout. Reconnection was terminated.
de: Der nächste Versuch, die Verbindung wiederherzustellen, wird das Abfragetimeout überschreiten. Die Verbindungswiederherstellung wurde beendet.
es: El próximo intento de reconexión superará el tiempo de espera de la consulta. La reconexión finalizó.
fr: La tentative de reconnexion suivant dépassera le délai de requête. La reconnexion a été interrompue.
it: Durante il successivo tentativo di riconnessione verrà superato il timeout query. Riconnessione terminata.
ja: 次の再接続の試行はクエリ タイムアウトを超過します。再接続は終了しました。
ko: 다음 다시 연결 시도가 쿼리 제한 시간을 초과합니다. 다시 연결이 종료되었습니다.
pt_br: A próxima tentativa de reconexão excederá o tempo limite da consulta. A reconexão foi terminada.
ru: Следующая попытка переподключения превысит время ожидания запроса. Переподключение прервано.
zh_hans: 下一次重新连接尝试将超过查询超时限制。已终止重新连接。
zh_hant: 下一次嘗試連接將超過查詢逾時。已終止重新連接。

# SQLCR_EncryptionChanged
source: The server did not preserve SSL encryption during a recovery attempt, connection recovery is not possible.
de: Die SSL-Verschlüsselung wurde während eines Wiederherstellungsversuchs vom Server nicht beibehalten; die Verbindung kann nicht wiederhergestellt werden.
es: El servidor no conservó el cifrado SSL durante un intento de recuperación; no es posible recuperar la conexión.
fr: Le serveur n'a pas conservé le chiffrement SSL pendant une tentative de récupération. La récupération de la connexion est impossible.
it: Il server non ha mantenuto la crittografia SSL durante un tentativo di ripristino. Impossibile eseguire il ripristino della connessione.
ja: 回復の試行中、SSL 暗号化をサーバーが保持しませんでした。接続を回復できません。
ko: 복구를 시도하는 동안 서버에서 SSL 암호화를 유지하지 못해 연결을 복구할 수 없습니다.
pt_br: O servidor não preservou a criptografia SSL durante uma tentativa de recuperação; a recuperação da conexão não é possível.
ru: Сервер не сохранил SSL-шифрование при попытке восстановления, восстановление соединения невозможно.
zh_hans: 服务器未保留恢复尝试期间的 SSL 加密，无法恢复连接。
zh_hant: 伺服器未保留復原嘗試期間的 SSL 加密，無法進行連接復原。

# SQLCR_TDSVestionNotPreserved
source: The server did not preserve the exact client TDS version requested during a recovery attempt, connection recovery is not possible.
de: Die genaue TDS-Version des Clients, die bei einem Wiederherstellungsversuch angefordert wurde, konnte vom Server nicht beibehalten werden; die Verbindung kann nicht wiederhergestellt werden.
es: El servidor no conservó la versión exacta del TDS cliente solicitada durante un intento de recuperación; no es posible recuperar la conexión.
fr: Le serveur n'a pas conservé la version TDS cliente exacte demandée pendant une tentative de récupération. La récupération de la connexion est impossible.
it: Il server non ha mantenuto l'esatta versione TDS del client richiesta durante un tentativo di ripristino. Impossibile eseguire il ripristino della connessione.
ja: 回復の試行中、要求された正確なクライアントの TDS のバージョンをサーバーが保持しませんでした。接続を回復できません。
ko: 복구를 시도하는 동안 서버에서 요청된 정확한 클라이언트 TDS 버전을 유지하지 못해 연결을 복구할 수 없습니다.
pt_br: O servidor não preservou a versão TDS de cliente exata solicitada durante uma tentativa de recuperação; a recuperação da conexão não é possível.
ru: Сервер не сохранил точную версию TDS клиента, запрошенную в ходе попытки восстановления. Восстановление соединения невозможно.
zh_hans: 服务器未保留尝试恢复过程中请求的确切的客户端 TDS 版本，无法恢复连接。
zh_hant: 伺服器未保留復原嘗試期間所要求的確切用戶端 TDS 版本，無法進行連接復原。

# SQLCR_AllAttemptsFailed
source: The connection is broken and recovery is not possible. The client driver attempted to recover the connection one or more times and all attempts failed. Increase the value of ConnectRetryCount to increase the number of recovery attempts.
de: Die Verbindung ist unterbrochen und eine Wiederherstellung ist nicht möglich. Der Clienttreiber hat ein oder mehrere Male versucht, die Verbindung wiederherzustellen, aber alle Versuche sind fehlgeschlagen. Erhöhen Sie den Wert von ConnectRetryCount, um die Anzahl der Wiederherstellungsversuche zu erhöhen.
es: La conexión se interrumpió y la recuperación no es posible. El controlador cliente intentó recuperar la conexión una o más veces, pero todos los intentos generaron error. Aumente el valor de ConnectRetryCount para aumentar el número de intentos de recuperación.
fr: La connexion est interrompue et la récupération n'est pas possible. Le pilote du client a tenté de rétablir la connexion une fois ou plus et toutes les tentatives ont échoué. Augmentez la valeur de ConnectRetryCount pour augmenter le nombre de tentatives de récupération.
it: La connessione è interrotta e non è possibile ripristinarla. Il driver client ha tentato una o più volte di ripristinare la connessione, ma tutti i tentativi non sono riusciti. Aumentare il valore di ConnectRetryCount per incrementare il numero di tentativi di ripristino.
ja: 接続が中断されたため復元できません。クライアント ドライバーは接続の復元を 1 回以上試みましたが、すべての試行は失敗しました。ConnectRetryCount の値を増やして、復元の試行回数を増やしてください。
ko: 연결이 끊겼고 복구할 수 없습니다. 클라이언트 드라이버에서 한 번 이상 연결을 복구하려고 했지만 모두 실패했습니다. 복원 시도 횟수를 늘리려면 ConnectRetryCount 값을 높이십시오.
pt_br: A conexão foi interrompida e a recuperação não é possível. O driver do cliente tentou recuperar a conexão uma ou mais vezes e houve falha em todas as tentativas. Aumente o valor de ConnectRetryCount para aumentar o número de tentativas de recuperação.
ru: Произошел разрыв подключения и восстановление невозможно. Драйвер клиента предпринял один или несколько раз попытку восстановить подключение, но все они не удались. Увеличьте значение ConnectRetryCount, чтобы увеличить количество попыток восстановления.
zh_hans: 连接已断开，且无法恢复。客户端驱动程序尝试了一次或多次恢复连接，所有尝试均已失败。请增加 ConnectRetryCount 的值，以增加尝试恢复的次数。
zh_hant: 連接中斷而且無法復原。用戶端驅動程式一或多次嘗試復原連接且所有嘗試都失敗。增加 ConnectRetryCount 的值以增加嘗試還原的次數。

# SQLCR_UnrecoverableServer
source: The connection is broken and recovery is not possible. The connection is marked by the server as unrecoverable. No attempt was made to restore the connection.
de: Die Verbindung ist unterbrochen und eine Wiederherstellung ist nicht möglich. Die Verbindung wurde vom Server als nicht wiederherstellbar markiert. Es wurde nicht versucht, die Verbindung wiederherzustellen.
es: La conexión se interrumpió y la recuperación no es posible. El servidor marcó la conexión como no recuperable. No se realizó ningún intento para restaurar la conexión.
fr: La connexion est interrompue et la récupération n'est pas possible. La connexion est marquée par le serveur comme irrécupérable. Aucune tentative n'a été faite pour rétablir la connexion.
it: La connessione è interrotta e non è possibile ripristinarla. La connessione è contrassegnata dal server come irrecuperabile. Nessun tentativo di ripristino della connessione effettuato.
ja: 接続が中断されたため復元できません。接続はサーバーによって復元不可能とマークされました。接続を復元する試行は行われません。
ko: 연결이 끊겼고 복구할 수 없습니다. 서버에서 연결이 복구될 수 없다고 표시됩니다. 연결 복구를 시도하지 않았습니다.
pt_br: A conexão foi interrompida e a recuperação não é possível. A conexão foi marcada pelo servidor como não recuperável. Nenhuma tentativa foi feita para restaurar a conexão.
ru: Сервер считается подключение невосстанавливаемым. Попытки восстановления подключения не предпринимались.
zh_hans: 连接已断开，且无法恢复。服务器已将该连接标记为不可恢复。未尝试恢复访连接。
zh_hant: 連接中斷而且無法復原。伺服器已將連接標示為無法復原。未執行嘗試還原連接。

# SQLCR_UnrecoverableClient
source: The connection is broken and recovery is not possible. The connection is marked by the client driver as unrecoverable. No attempt was made to restore the connection.
de: Die Verbindung ist unterbrochen und eine Wiederherstellung ist nicht möglich. Die Verbindung wurde vom Clienttreiber als nicht wiederherstellbar markiert. Es wurde nicht versucht, die Verbindung wiederherzustellen.
es: La conexión se interrumpió y la recuperación no es posible. El controlador cliente marcó la conexión como no recuperable. No se realizó ningún intento para restaurar la conexión.
fr: La connexion est interrompue et la récupération n'est pas possible. La connexion est marquée par le pilote du client comme irrécupérable. Aucune tentative n'a été faite pour rétablir la connexion.
it: La connessione è interrotta e non è possibile ripristinarla. La connessione è contrassegnata dal client come irrecuperabile. Nessun tentativo di ripristino della connessione effettuato.
ja: 接続が中断されたため復元できません。接続はクライアント ドライバーによって復元不可能とマークされました。接続を復元する試行は行われません。
ko: 연결이 끊겼고 복구할 수 없습니다. 클라이언트 드라이버에서 연결이 복구될 수 없다고 표시됩니다. 연결 복구를 시도하지 않았습니다.
pt_br: A conexão foi interrompida e a recuperação não é possível. A conexão foi marcada pelo driver do cliente como não recuperável. Nenhuma tentativa foi feita para restaurar a conexão.
ru: Произошел разрыв подключения и восстановление невозможно. Драйвер клиента считается подключение невосстанавливаемым. Попытки восстановления подключения не предпринимались.
zh_hans: 连接已断开，且无法恢复。客户端已将该连接标记为不可恢复。未尝试恢复访连接。
zh_hant: 連接中斷而且無法復原。用戶端驅動程式已將連接標示為無法復原。未嘗試還原連接。

# SQLCR_NoCRAckAtReconnection
source: The server did not acknowledge a recovery attempt, connection recovery is not possible.
de: Ein Wiederherstellungsversuch wurde vom Server nicht bestätigt; die Verbindung kann nicht wiederhergestellt werden.
es: El servidor no reconoció un intento de recuperación; no es posible recuperar la conexión.
fr: Le serveur n'a pas accepté une tentative de récupération. La récupération de la connexion est impossible.
it: Tentativo di ripristino non riconosciuto dal server. Impossibile eseguire il ripristino della connessione.
ja: サーバーが回復の試行を認めませんでした。接続を回復できません。
ko: 서버에서 복구 시도를 인식하지 못해 연결을 복구할 수 없습니다.
pt_br: O servidor não reconheceu uma tentativa de recuperação; a recuperação da conexão não é possível.
ru: Сервер не подтвердил попытку восстановления, восстановление соединения невозможно.
zh_hans: 服务器未收到恢复尝试，无法恢复连接。
zh_hant: 伺服器未認可復原嘗試，無法進行連接復原。

# DbConnectionString_PoolBlockingPeriod
source: Defines the blocking period behavior for a connection pool.
de: Definiert das Verhalten im Blockierungszeitraum für einen Verbindungspool.
es: Define el comportamiento del período de bloqueo para un grupo de conexiones.
fr: Définit le comportement de la période de blocage pour un pool de connexions.
it: Consente di definire il comportamento del periodo di blocco per un pool di connessioni.
ja: 接続プールのためのブロック期間ビヘイビアーを定義します。
ko: 연결 풀에 대한 차단 기간 동작을 정의합니다.
pt_br: Define o comportamento de período de bloqueio para um pool de conexões.
ru: Задает поведение периода блокировки для пула подключений.
zh_hans: 定义针对连接池的暂停时段行为。
zh_hant: 為連接集區定義封鎖期間行為。

# TCE_SqlConnection_ColumnEncryptionQueryMetadataCacheEnabled
source: Defines whether query metadata caching is enabled.
de: Definiert, ob das Zwischenspeichern von Abfragemetadaten aktiviert ist.
es: Define si está habilitado el almacenamiento en caché de los metadatos de consulta.
fr: Définit si la mise en cache des métadonnées de requête est activée.
it: Consente di definire se la memorizzazione nella cache dei metadati della query è abilitata.
ja: クエリ メタデータ キャッシュが有効であるかどうかを定義します。
ko: 쿼리 메타데이터 캐싱을 사용하는지를 정의합니다.
pt_br: Define se o cache de metadados de consulta está habilitado.
ru: Определяет, включено ли кэширование метаданных запросов.
zh_hans: 定义是否启用查询元数据缓存。
zh_hant: 定義是否啟用查詢中繼資料快取。
