Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_InvalidMixedUsageOfSecureAndClearCredential
source: Cannot use Credential with UserID, UID, Password, or PWD connection string keywords.
de: Credential kann nicht mit den Schlüsselwörtern für Verbindungszeichenfolgen "UserID", "UID", "Password" oder "PWD" verwendet werden.
es: No se pueden utilizar Credential con UserID, UID, Password o palabras clave de cadena de PWD.
fr: Impossible d'utiliser de Credential avec les mots-clés de chaîne de connexion UserID, UID, Password ou PWD.
it: Impossibile utilizzare Credential con le parole chiave per la stringa di connessione UserID, UID, Password o PWD.
ja: UserID、UID、Password、または PWD の接続文字列キーワードを含む Credential は使用できません。
ko: UserID, UID, Password 또는 PWD 연결 문자열 키워드가 포함된 Credential을 사용할 수 없습니다.
pt_br: Não é possível usar a Credential com as palavras-chave de cadeia de conexão UserID, UID, Password, ou PWD.
ru: Нельзя использовать слово Credential с ключевыми словами строки соединения UserID, UID, Password или PWD.
zh_hans: 无法使用含有 UserID、UID、Password 或 PWD 连接字符串关键字的 Credential。
zh_hant: 無法將 Credential 與 UserID、UID、Password 或 PWD 連接字串關鍵字搭配使用。

# ADP_InvalidMixedUsageOfSecureCredentialAndIntegratedSecurity
source: Cannot use Credential with Integrated Security connection string keyword.
de: Credential kann nicht mit dem Schlüsselwort für Verbindungszeichenfolgen "Integrated Security" verwendet werden.
es: No se pueden utilizar Credential con la palabra clave de cadena de conexión de Integrated Security.
fr: Impossible d'utiliser de Credential avec le mot-clé de chaîne de connexion de Integrated Security.
it: Impossibile utilizzare Credential con la parola chiave per la stringa di connessione Integrated Security.
ja: Integrated Security 接続文字列キーワードを含む Credential は使用できません。
ko: Integrated Security 연결 문자열 키워드가 포함된 Credential을 사용할 수 없습니다.
pt_br: Não é possível usar a Credential com palavra-chave de cadeia de conexão de Integrated Security.
ru: Нельзя использовать слово Credential с ключевым словом строки соединения Integrated Security.
zh_hans: 无法使用含有 Integrated Security 连接字符串关键字的 Credential。
zh_hant: 無法將 Credential 與 Integrated Security 連接字串關鍵字搭配使用。

# ADP_InvalidMixedUsageOfSecureCredentialAndContextConnection
source: Cannot use Credential with Context Connection keyword.
de: Credential kann nicht mit dem Schlüsselwort "Context Connection" verwendet werden.
es: No se pueden utilizar Credential con la palabra clave de Context Connection.
fr: Impossible d'utiliser de Credential avec le mot clé de Context Connection.
it: Impossibile utilizzare Credential con la parola chiave Context Connection.
ja: Context Connection キーワードを含む Credential は使用できません。
ko: Context Connection 키워드가 포함된 Credential을 사용할 수 없습니다.
pt_br: Não é possível usar a Credential com palavra-chave de Context Connection.
ru: Нельзя использовать слово Credential с ключевым словом Context Connection.
zh_hans: 无法使用含有 Context Connection 关键字的 Credential。
zh_hant: 無法將 Credential 與 Context Connection 關鍵字搭配使用。

# ADP_InvalidMixedUsageOfAccessTokenAndUserIDPassword
source: Cannot set the AccessToken property if 'UserID', 'UID', 'Password', or 'PWD' has been specified in connection string.
de: AccessToken-Eigenschaft kann nicht festgelegt werden, wenn 'UserID', 'UID', 'Password' oder 'PWD' in der Verbindungszeichenfolge angegeben wurde.
es: No se puede establecer la propiedad AccessToken si en la cadena de conexión se han especificado "UserID", "UID", "Password" o "PWD".
fr: Impossible de définir la propriété AccessToken si « UserID », « UID », « Password » ou « PWD » a été spécifié dans la chaîne de connexion.
it: Non è possibile impostare la proprietà AccessToken se nella stringa di connessione è stato specificato 'UserID', 'UID', 'Password' o 'PWD'.
ja: 接続文字列で 'UserID'、'UID'、'Password'、または 'PWD' が指定されている場合は、AccessToken プロパティを設定できません。
ko: 연결 문자열에서 'UserID', 'UID', 'Password' 또는 'PWD'를 지정한 경우 AccessToken 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade AccessToken se 'UserID', 'UID', 'Password' ou 'PWD' tiver sido especificado na cadeia de conexão.
ru: Невозможно задать свойство AccessToken, если в строке подключения указаны ключевые слова "UserID", "UID", "Password" или "PWD".
zh_hans: 如果在连接字符串中指定了 "UserID"、"UID"、"Password" 或 "PWD"，则无法设置 AccessToken 属性。
zh_hant: 如果連接字串中指定了 'UserID'、'UID'、'Password' 或 'PWD'，就無法設定 AccessToken 屬性。

# ADP_InvalidMixedUsageOfAccessTokenAndIntegratedSecurity
source: Cannot set the AccessToken property if the 'Integrated Security' connection string keyword has been set to 'true' or 'SSPI'.
de: AccessToken-Eigenschaft kann nicht festgelegt werden, wenn das Schlüsselwort für Verbindungszeichenfolgen 'Integrated Security' auf 'true' oder 'SSPI' gesetzt wurde.
es: No se puede establecer la propiedad AccessToken si la palabra clave de la cadena de conexión "Integrated Security" se ha establecido en "true" o "SSPI".
fr: Impossible de définir la propriété AccessToken si le mot clé de chaîne de connexion « Integrated Security » a la valeur « true » ou « SSPI ».
it: Non è possibile impostare la proprietà AccessToken se la parola chiave della stringa di connessione 'Integrated Security' è stata impostata su 'true' o 'SSPI'.
ja: 'Integrated Security' 接続文字列キーワードが 'true' または 'SSPI' に設定されている場合は、AccessToken プロパティを設定できません。
ko: 'Integrated Security' 연결 문자열 키워드가 'true' 또는 'SSPI'로 설정된 경우 AccessToken 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade AccessToken se a palavra-chave da cadeia de conexão 'Integrated Security' estiver sido definida para 'true' ou 'SSPI'.
ru: Невозможно задать свойство AccessToken, если для ключевого слова строки подключения "Integrated Security" заданы значения "true" или "SSPI".
zh_hans: 如果 "Integrated Security" 连接字符串关键字设置为 "true" 或 "SSPI"，则无法设置 AccessToken 属性。
zh_hant: 如果 'Integrated Security' 連接字串關鍵字已設為 'true' 或 'SSPI'，就無法設定 AccessToken 屬性。

# ADP_InvalidMixedUsageOfAccessTokenAndContextConnection
source: Cannot set the AccessToken property with the 'Context Connection' keyword.
de: AccessToken-Eigenschaft kann nicht mit dem Schlüsselwort 'Context Connection' festgelegt werden.
es: No se puede establecer la propiedad AccessToken con la palabra clave "Context Connection".
fr: Impossible de définir la propriété AccessToken avec le mot clé « Context Connection ».
it: Non è possibile impostare la proprietà AccessToken con la parola chiave 'Context Connection'.
ja: 'Context Connection' キーワードを含む AccessToken プロパティは設定できません。
ko: 'Context Connection' 키워드를 사용하여 AccessToken 속성을 지정할 수 없습니다.
pt_br: Não é possível definir a propriedade AccessToken com a palavra-chave 'Context Connection'.
ru: Невозможно задать свойство AccessToken с ключевым словом "Context Connection".
zh_hans: 无法设置使用 "Context Connection" 关键字的 AccessToken 属性。
zh_hant: 無法使用 'Context Connection' 關鍵字設定 AccessToken 屬性。

# ADP_InvalidMixedUsageOfAccessTokenAndCredential
source: Cannot set the AccessToken property if the Credential property is already set.
de: AccessToken-Eigenschaft kann nicht festgelegt werden, wenn bereits die Credential-Eigenschaft festgelegt wurde.
es: No se puede establecer la propiedad AccessToken si la propiedad Credential ya está establecida.
fr: Impossible de définir la propriété AccessToken si la propriété Credential est déjà définie.
it: Non è possibile impostare la proprietà AccessToken se la proprietà Credential è già impostata.
ja: Credential プロパティが既に設定されている場合は、AccessToken プロパティを設定できません。
ko: Credential 속성이 이미 설정된 경우 AccessToken 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade AccessToken se a propriedade Credential já estiver definida.
ru: Невозможно задать свойство AccessToken, если свойство Credential уже задано.
zh_hans: 如果已设置 Credential 属性，则无法设置 AccessToken 属性。
zh_hant: 如果已設定 Credential 屬性，就無法設定 AccessToken 屬性。

# ADP_InvalidMixedUsageOfCredentialAndAccessToken
source: Cannot set the Credential property if the AccessToken property is already set.
de: Credential-Eigenschaft kann nicht festgelegt werden, wenn bereits die AccessToken-Eigenschaft festgelegt wurde.
es: No se puede establecer la propiedad Credential si la propiedad AccessToken ya está establecida.
fr: Impossible de définir la propriété Credential si la propriété AccessToken est déjà définie.
it: Non è possibile impostare la proprietà Credential se la proprietà AccessToken è già impostata.
ja: AccessToken プロパティが既に設定されている場合は、Credential プロパティを設定できません。
ko: AccessToken 속성이 이미 설정된 경우 Credential 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade Credential se a propriedade AccessToken já tiver sido definida.
ru: Невозможно задать свойство Credential, если свойство AccessToken уже задано.
zh_hans: 如果已设置 AccessToken 属性，则无法设置 Credential 属性。
zh_hant: 如果已設定 AccessToken 屬性，就無法設定 Credential 屬性。

# ADP_InvalidMixedUsageOfAccessTokenAndAuthentication
source: Cannot set the AccessToken property if 'Authentication' has been specified in the connection string.
de: AccessToken-Eigenschaft kann nicht festgelegt werden, wenn 'Authentication' in der Verbindungszeichenfolge festgelegt wurde.
es: No se puede establecer la propiedad AccessToken si se ha especificado "Authentication" en la cadena de conexión.
fr: Impossible de définir la propriété AccessToken si « Authentication » a été spécifié dans la chaîne de connexion.
it: Non è possibile impostare la proprietà AccessToken se nella stringa di connessione è stato specificato 'Authentication'.
ja: 接続文字列で 'Authentication' が指定されている場合は、AccessToken プロパティを設定できません。
ko: 연결 문자열에서 'Authentication'을 지정한 경우 AccessToken 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade AccessToken se 'Authentication' tiver sido especificado na cadeia de conexão.
ru: Невозможно задать свойство AccessToken, если в строке подключения указано ключевое слово "Authentication".
zh_hans: 如果在连接字符串中指定了 "Authentication"，则无法设置 AccessToken 属性。
zh_hant: 如果連接字串中指定了 'Authentication'，就無法設定 AccessToken 屬性。

# ADP_MustBeReadOnly
source: {0} must be marked as read only.
de: {0} muss als schreibgeschützt markiert sein.
es: {0} debe marcarse como de solo lectura.
fr: {0} doit être marqué en lecture seule.
it: {0} deve essere contrassegnato come di sola lettura.
ja: {0} は読み取り専用として設定されている必要があります。
ko: {0}은(는) 읽기 전용으로 표시되어야 합니다.
pt_br: {0} deve ser marcado como somente leitura.
ru: Элемент {0} должен быть помечен как доступный только для чтения.
zh_hans: {0} 必须标记为只读。
zh_hant: {0} 必須標示為唯讀。

# DataCategory_Data
source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
ru: Данные
zh_hans: 数据
zh_hant: 資料

# DataCategory_Update
source: Update
de: Aktualisieren
es: Actualizar
fr: Mise à jour
it: Aggiornamento
ja: 更新
ko: 업데이트
pt_br: Atualizar
ru: Обновление
zh_hans: 更新
zh_hant: 更新

# DbCommand_CommandTimeout
source: Time to wait for command to execute.
de: Wartezeit bis zur Ausführung des Befehls.
es: Tiempo de espera hasta que se ejecute el comando.
fr: Durée de l'attente de l'exécution de la commande.
it: Tempo di attesa per l'esecuzione del comando.
ja: コマンドが実行するまでの待ち時間です。
ko: 명령이 실행될 때까지 기다리는 시간입니다.
pt_br: Tempo de espera até execução do comando.
ru: Время ожидания выполнения команды.
zh_hans: 等待执行命令的时间。
zh_hant: 等待執行命令的時間。

# DbConnection_State
source: The ConnectionState indicating whether the connection is open or closed.
de: Der ConnectionState, der angibt, ob die Verbindung offen oder geschlossen ist.
es: ConnectionState que indica si la conexión está abierta o cerrada.
fr: Le ConnectionState indiquant si la connexion est ouverte ou fermée.
it: ConnectionState indicante se la connessione è aperta o chiusa.
ja: 接続中であるか切断されているかを示す ConnectionState です。
ko: 연결 여부를 나타내는 ConnectionState입니다.
pt_br: ConnectionState que indica se a conexão está aberta ou fechada.
ru: ConnectionState, указывающий, открыто или закрыто подключение.
zh_hans: ConnectionState，指示连接是打开的还是关闭的。
zh_hant: ConnectionState 表示連接為開啟或關閉。

# DbConnection_StateChange
source: Event triggered when the connection changes state.
de: Das Ereignis, das ausgelöst wird, wenn der Verbindungsstatus geändert wird.
es: Evento que se desencadena cuando la conexión cambia el estado.
fr: Événement déclenché lorsque l'état de la connexion change.
it: Evento generato quando cambia lo stato della connessione.
ja: 接続が状態を変更するときにイベントが発生します。
ko: 연결 상태가 변경될 때 이벤트가 트리거됩니다.
pt_br: Evento disparado quando o estado da conexão é alterado.
ru: Событие создается при изменении состояния подключения.
zh_hans: 当连接更改状态时触发的事件。
zh_hant: 當連接狀態變更時觸發的事件。

# DbParameter_DbType
source: The parameter generic type.
de: Der generische Parametertyp.
es: Tipo de parámetro genérico.
fr: Le type generic du paramètre.
it: Il tipo generico del parametro.
ja: パラメーターの一般的な型です。
ko: 매개 변수의 일반적인 형식입니다.
pt_br: Tipo genérico do parâmetro.
ru: Общий тип параметра.
zh_hans: 参数一般类型。
zh_hant: 參數的泛用型別。

# DbParameter_Direction
source: Input, output, or bidirectional parameter.
de: Eingabe-, Ausgabe- oder bidirektionaler Parameter.
es: Entrada, salida o parámetro bidireccional.
fr: Paramètre d'entrée, de sortie ou bidirectionnel.
it: Parametro di input, di output o bidirezionale.
ja: 入力、出力、または入出力のパラメーター。
ko: 입력, 출력 또는 양방향 매개 변수입니다.
pt_br: Parâmetro de entrada, de saída ou bidirecional.
ru: Входной, выходной или двунаправленный параметр.
zh_hans: 输入、输出或双向参数。
zh_hant: 輸入、輸出或雙向參數。

# DbParameter_IsNullable
source: a design-time property used for strongly typed code-generation.
de: Eine DesignTime-Eigenschaft wird zur Codegenerierung mit starker Typisierung verwendet.
es: propiedad de tiempo de diseño que se usa para generar código fuertemente tipado.
fr: une propriété au moment du design utilisée pour la génération de code fortement typé.
it: proprietà ora design utilizzata per generazione di codici fortemente marcata.
ja: 厳密に型指定されたコード生成に使用されるデザイン タイムのプロパティです。
ko: 강력한 형식의 코드 생성에 사용되는 디자인 타임 속성입니다.
pt_br: uma propriedade da fase de design usada para geração de código com rigidez de tipos.
ru: свойство, используемое для создания кода со строгой типизацией.
zh_hans: 用于生成强类型代码的设计时属性。
zh_hant: 對強型別的程式碼產生使用了設計階段的屬性。

# DbParameter_Offset
source: Offset in variable length data types.
de: Offset in Datentypen variabler Länge.
es: Desplazamiento en tipos de datos de longitud variable.
fr: Offset dans les types de données de longueur variable.
it: Offset dei tipi di dati a lunghezza variabile.
ja: 可変長データ型のオフセットです。
ko: 가변 길이 데이터 형식의 오프셋입니다.
pt_br: Deslocamento em tipos de dados de comprimento variável.
ru: Смещение в типах данных переменной длины.
zh_hans: 可变长度数据类型中的偏移量。
zh_hant: 可變長度資料型別中的位移。

# DbParameter_ParameterName
source: Name of the parameter.
de: Name des Parameters.
es: Nombre del parámetro.
fr: Nom du paramètre.
it: Nome del parametro.
ja: パラメーターの名前です。
ko: 매개 변수의 이름입니다.
pt_br: Nome do parâmetro.
ru: Имя параметра.
zh_hans: 参数的名称。
zh_hant: 參數的名稱。

# DbParameter_Size
source: Size of variable length data types (string & arrays).
de: Größe von Datentypen mit variabler Länge (Zeichenfolge & Arrays).
es: Tamaño de tipos de datos de longitud variable (cadena y matrices).
fr: Taille des types de données de longueur variable (chaîne & tableaux).
it: Dimensione dei tipi di dati a lunghezza variabile (stringhe e matrici).
ja: 可変長データ型 (文字列および配列) のサイズ。
ko: 가변 길이 데이터 형식(문자열 및 배열)의 크기입니다.
pt_br: Tamanho dos tipos de dados de comprimento variável (cadeia de caracteres e matrizes).
ru: Размер типов данных переменной длины (строки и массивы).
zh_hans: 可变长度数据类型(字符串和数组)。
zh_hant: 可變長度資料類型 (字串與陣列) 的大小。(& )

# DbParameter_SourceColumn
source: When used by a DataAdapter.Update, the source column name that is used to find the DataSetColumn name in the ColumnMappings. This is to copy a value between the parameter and a data row.
de: Bei Verwendung durch DataAdapter.Update der Quellspaltenname, der zum Suchen nach dem DataSetColumn-Namen in den ColumnMappings verwendet wird. Dient zum Kopieren eines Werts zwischen dem Parameter und einer Datenzeile.
es: Cuando lo utiliza DataAdapter.Update, el nombre de la columna de origen utilizado para encontrar el nombre de DataSetColumn en ColumnMappings. Copia un valor entre el parámetro y una fila de datos.
fr: Lorsqu'il est utilisé par un DataAdapter.Update, correspond au nom de la colonne source utilisé pour rechercher le nom DataSetColumn dans ColumnMappings. Sert à copier une valeur entre le paramètre et une ligne de données.
it: Se utilizzato da DataAdapter.Update, indica il nome della colonna di origine utilizzato per trovare il nome di DataSetColumn negli elementi ColumnMappings. Consente di copiare un valore tra il parametro e una riga di dati.
ja: DataAdapter.Update で使用するときに ColumnMappings の DataSetColumn 名の検索に使用する、基になる列の名前。これは、パラメーターとデータ行の間で値をコピーするためのものです。
ko: DataAdapter.Update에서 사용하는 경우 ColumnMappings에서 DataSetColumn 이름을 찾는 데 사용되는 원본 열 이름입니다. 매개 변수와 데이터 행 간의 값을 복사하는 데 사용됩니다.
pt_br: Quando usado por um DataAdapter.Update, é o nome da coluna de origem usada para localizar o nome de DataSetColumn em ColumnMappings. Serve para copiar um valor entre o parâmetro e uma linha de dados.
ru: При использовании в DataAdapter.Update имя исходного столбца, применяемого для поиска имени DataSetColumn в ColumnMappings. Это необходимо для копирования значения между параметром и строкой данных.
zh_hans: 在由 DataAdapter.Update 使用时，是用于在 ColumnMappings 中查找 DataSetColumn 名称的源列名。这将在参数与数据行之间复制值。
zh_hant: 由 DataAdapter.Update 使用時，用以在 ColumnMappings 中尋找 DataSetColumn 名稱的來源資料行名稱。此值由參數與資料列之間複製而來。

# DbParameter_SourceVersion
source: When used by a DataAdapter.Update (UpdateCommand only), the version of the DataRow value that is used to update the data source.
de: Bei Verwendung durch ein DataAdapter.Update (nur UpdateCommand) ist dies die Version des DataRow-Werts, der zum Update der Datenquelle verwendet wird.
es: Cuando lo usa DataAdapter.Update (sólo UpdateCommand), versión del valor DataRow que se usa para actualizar el origen de los datos.
fr: Lorsqu'elle est utilisée par un DataAdapter.Update (uniquement UpdateCommand), correspond à la version de la valeur DataRow qui est utilisée pour mettre à jour la source de données.
it: Se utilizzato da DataAdapter.Update (solo UpdateCommand), indica la versione del valore DataRow utilizzato per aggiornare l'origine dati.
ja: DataAdapter.Update (UpdateCommand のみ) で使用するときにデータ ソースの更新に使用する、DataRow 値のバージョン。
ko: DataAdapter.Update(UpdateCommand 전용)에서 사용하는 경우 데이터 원본을 업데이트하는 데 사용되는 DataRow 값의 버전입니다.
pt_br: Quando usado por um DataAdapter.Update (somente UpdateCommand), é a versão do valor DataRow usado para atualizar a fonte de dados.
ru: При использовании в DataAdapter.Update (только команда UpdateCommand) версия значения DataRow, применяемого для обновления источника данных.
zh_hans: 由 DataAdapter.Update (仅 UpdateCommand)使用时，用于更新数据源的 DataRow 值的版本。
zh_hant: 由 DataAdapter.Update (只有 UpdateCommand) 使用時，用以更新資料來源的 DataRow 值版本。

# DbParameter_SourceColumnNullMapping
source: When used by DataAdapter.Update, the parameter value is changed from DBNull.Value into (Int32)1 or (Int32)0 if non-null.
de: Bei Verwendung durch DataAdapter.Update wird der Parameterwert von DBNull.Value in (Int32)1 oder (Int32)0, falls nicht Null, geändert.
es: Cuando lo utiliza DataAdapter.Update, el valor del parámetro cambia de DBNull.Value a (Int32)1 o (Int32)0 si no es nulo.
fr: Lorsqu'elle est utilisée par DataAdapter.Update, la valeur de paramètre DBNull.Value est remplacée par (Int32)1 ou par (Int32)0 si elle n'est pas null.
it: Se utilizzato da un DataAdapter.Update, il valore del parametro viene modificato da DBNull.Value in (Int32)1 o (Int32)0 se diverso da null.
ja: DataAdapter.Update が使用する場合、Null 値でなければ、パラメーター値は DBNull.Value から (Int32)1 または (Int32)0 に変更されます。
ko: DataAdapter.Update에서 사용하는 경우 매개 변수 값이 Null이 아니면 DBNull.Value에서 (Int32)1 또는 (Int32)0으로 변경됩니다.
pt_br: Quando usado por DataAdapter.Update, o valor do parâmetro é alterado de DBNull.Value para (Int32)1 ou (Int32)0 se for não nulo.
ru: При использовании в DataAdapter.Update значение параметра изменяется с DBNull.Value на (Int32)1 или (Int32)0, если определено.
zh_hans: 在 DataAdapter.Update 使用时，参数值由 DBNull.Value 更改为(Int32)1 或(Int32)0 (如果非空)。
zh_hant: 由 DataAdapter.Update 使用時，參數值會由 DBNull.Value 變更為 (Int32)1 或 (Int32)0 (若為非 Null)。

# DbParameter_Value
source: Value of the parameter.
de: Wert des Parameters.
es: Valor del parámetro.
fr: Valeur du paramètre.
it: Valore del parametro.
ja: パラメーターの値です。
ko: 매개 변수 값입니다.
pt_br: Valor do parâmetro.
ru: Значение параметра.
zh_hans: 参数值。
zh_hant: 參數值。

# MDF_QueryFailed
source: Unable to build the '{0}' collection because execution of the SQL query failed. See the inner exception for details.
de: Die Sammlung '{0}' kann nicht erstellt werden, da die SQL-Abfrage fehlgeschlagen ist. Weitere Informationen finden Sie in der inneren Ausnahme.
es: No se puede compilar la colección '{0}' debido a un error en la ejecución de la consulta SQL. Vea la excepción interna para obtener detalles.
fr: Impossible de créer la collection '{0}' car l'exécution de la requête SQL a échoué. Pour plus de détails, consultez l'exception interne.
it: Impossibile compilare la raccolta "{0}". Esecuzione della query SQL non riuscita. Per ulteriori informazioni, vedere l'eccezione interna.
ja: SQL クエリの実行に失敗したため、'{0}' コレクションをビルドできません。詳細については、内部例外を参照してください。
ko: SQL 쿼리를 실행하지 못했으므로 '{0}' 컬렉션을 작성할 수 없습니다. 자세한 내용은 내부 예외를 참조하십시오.
pt_br: Não é possível criar a coleção '{0}' porque houve falha na execução da consulta SQL. Consulte a exceção interna para obter detalhes.
ru: Не удается создать коллекцию "{0}", потому что произошел сбой запроса SQL. Дополнительные сведения см. во внутреннем исключении.
zh_hans: 因为执行 SQL 查询失败，所以无法生成“{0}”集合。有关详细信息，请参见内部异常。
zh_hant: 無法建置 '{0}' 集合，因為 SQL 查詢執行失敗。請參閱內部例外狀況以取得詳細資訊。

# MDF_TooManyRestrictions
source: More restrictions were provided than the requested schema ('{0}') supports.
de: Es wurden mehr Einschränkungen bereitgestellt, als das angeforderte Schema ('{0}') unterstützt.
es: Se han proporcionado más restricciones de las admitidas por el esquema solicitado ('{0}').
fr: Un nombre de restrictions supérieur au nombre de restrictions pris en charge par le schéma demandé ('{0}') a été fourni.
it: Sono state fornite più restrizioni di quante ne possa supportare lo schema richiesto ("{0}").
ja: 要求されたスキーマ ('{0}') がサポートしているよりも多くの制約が指定されています。
ko: 요청한 스키마('{0}')가 지원하는 것보다 더 많은 제한이 지정되었습니다.
pt_br: Foram fornecidas mais restrições do que o suportado pelo esquema solicitado ('{0}').
ru: Указано больше ограничений, чем поддерживается затребованной схемой ("{0}").
zh_hans: 除必需的架构(“{0}”)支持外，还提供了更多的限制。
zh_hant: 提供的限制超過必要的結構描述 ('{0}') 所能支援的。

# MDF_InvalidRestrictionValue
source: '{2}' is not a valid value for the '{1}' restriction of the '{0}' schema collection.
de: '{2}' ist kein gültiger Wert für die Einschränkung '{1}' der Schema-Sammlung '{0}'.
es: '{2}' no es un valor válido para la restricción '{1}' de la colección de esquemas '{0}'.
fr: '{2}' n'est pas une valeur valide pour la restriction '{1}' de la collection de schémas '{0}'.
it: "{2}" non è un valore valido per la restrizione "{1}" della raccolta di schemi "{0}".
ja: '{2}' は、'{0}' スキーマ コレクションの '{1}' 制約としては無効な値です。
ko: '{2}'은(는) '{0}' 스키마 컬렉션의 '{1}' 제한에 올바른 값이 아닙니다.
pt_br: '{2}' não é um valor válido para a restrição '{1}' da coleção de esquemas '{0}'.
ru: "{2}" не является действительным значением для ограничения "{1}" коллекции схемы "{0}".
zh_hans: 对于“{0}”架构集合的“{1}”限制，“{2}”不是有效值。
zh_hant: '{2}' 不是 '{0}' 結構描述集合中 '{1}' 限制的有效值。

# MDF_UndefinedCollection
source: The requested collection ({0}) is not defined.
de: Die angeforderte Sammlung ({0}) ist nicht definiert.
es: La colección solicitada ({0}) no está definida.
fr: La collection demandée ({0}) n'est pas définie.
it: La raccolta richiesta ({0}) non è definita.
ja: 要求されたコレクション ({0}) は定義されていません。
ko: 요청한 컬렉션({0})이 정의되지 않았습니다.
pt_br: Coleção solicitada ({0}) não definida.
ru: Затребованная коллекция ({0}) не определена.
zh_hans: 请求的集合({0})未定义。
zh_hant: 未定義必要的集合 ({0})。
