Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_PrepareParameterSize
source: {0}.Prepare method requires all variable length parameters to have an explicitly set non-zero Size.
de: Die {0}.Prepare-Methode erfordert, dass für alle variablen Längenparameter explizit eine nicht-Null-Size festgelegt wird.
es: El método {0}.Prepare requiere que todos los parámetros de longitud variable tengan un valor distinto de cero explícitamente establecido para Size.
fr: La méthode {0}.Prepare requiert que tous les paramètres de longueur variable aient une valeur Size explicitement définie différente de zéro.
it: Il metodo {0}.Prepare richiede l'impostazione esplicita di Size diversa da zero per tutti i parametri di lunghezza variabile.
ja: {0}.Prepare メソッドは、可変長のパラメーターはすべて明示的に設定された non-zero Size を持つことを要求します。
ko: {0}.Prepare 메서드에는 모든 가변 길이 매개 변수의 크기를 0이 아닌 Size로 명시적으로 설정해야 합니다.
pt_br: O método {0}.Prepare exige que todos os parâmetros de comprimento variável tenham um valor Size não nulo explicitamente definido.
ru: Для метода {0}.Prepare требуется, чтобы всем параметрам переменной длины был в явном виде присвоен ненулевой Size.
zh_hans: {0}.Prepare 方法要求所有可变长度参数具有显式设置的非零“Size”。
zh_hant: {0}.Prepare 方法需要所有的可變長度參數明確設定為非零的 Size。

# ADP_PrepareParameterScale
source: {0}.Prepare method requires parameters of type '{1}' have an explicitly set Precision and Scale.
de: Die {0}.Prepare-Methode erfordert, dass für Parameter des Typs '{1}' Precision und Scale explizit festgelegt ist.
es: El método {0}.Prepare requiere que los parámetros de tipo '{1}' tengan valores de Precision y Scale explícitamente establecidos.
fr: La méthode {0}.Prepare requiert que les paramètres de type '{1}' aient des valeurs Precision et Scale explicitement définies.
it: Il metodo {0}.Prepare richiede l'impostazione esplicita di Scale e Precision per i parametri di tipo '{1}'.
ja: {0}.Prepare メソッドは明示的に設定された Precision および Scale を持つ型 '{1}' のパラメーターが必要です。
ko: {0}.Prepare 메서드에는 Precision 및 Scale이 명시적으로 설정된 '{1}' 형식의 매개 변수가 필요합니다.
pt_br: O método {0}.Prepare exige que parâmetros do tipo '{1}' tenham Precision e Scale explicitamente definidos.
ru: Для метода {0}.Prepare требуется, чтобы для параметров типа "{1}" были в явном виде заданы Precision и Scale.
zh_hans: {0}.Prepare 方法要求“{1}”类型的参数具有显式设置的“Precision”和“Scale”。
zh_hant: {0}.Prepare 方法必須使用型別為 '{1}' 且已明確設定 Precision 和 Scale 的參數。

# ADP_MismatchedAsyncResult
source: Mismatched end method call for asyncResult. Expected call to {0} but {1} was called instead.
de: Nicht übereinstimmender Aufruf zum Beenden der Methode für asyncResult. Erwartet wurde der Aufruf von {0}, stattdessen wurde {1} aufgerufen.
es: Llamada de método final no coincide para asyncResult. Se esperaba una llamada a {0} pero se llamó a {1} en su lugar.
fr: Appel de la méthode End incompatible avec asyncResult. Appel de {0} attendu, mais c'est la méthode {1} qui a été appelée.
it: Chiamata non corrispondente al metodo di fine per asyncResult. Era prevista una chiamata a {0} ma è stato chiamato {1}.
ja: asyncResult の end メソッド呼び出しが適切ではありません。{0} を呼び出す必要がありますが、{1} が呼び出されました。
ko: asyncResult에 대한 end 메서드 호출이 일치하지 않습니다. {0}을(를) 호출해야 하는데 {1}이(가) 호출되었습니다.
pt_br: Chamada de método final para asyncResult incompatível. Era esperada camada de {0}, mas {1} foi chamado.
ru: Вызов несоответствующего завершающего метода для asyncResult. Ожидался вызов {0}, но был вызван {1}.
zh_hans: 为 asyncResult 调用了不匹配的 end 方法。应调用 {0}，但实际调用的是 {1}。
zh_hant: 不相符的 asyncResult 結束方法呼叫。必須要呼叫 {0} 卻呼叫 {1}。

# ADP_ClosedConnectionError
source: Invalid operation. The connection is closed.
de: Ungültige Operation. Die Verbindung ist geschlossen.
es: Operación no válida; se ha terminado la conexión.
fr: Opération non valide. La connexion est fermée.
it: Operazione non valida. La connessione è chiusa.
ja: 操作が無効です。接続は閉じています。
ko: 잘못된 작업입니다. 연결이 닫혔습니다.
pt_br: Operação inválida. A conexão está fechada.
ru: Недопустимая операция. Подключение закрыто.
zh_hans: 无效操作。连接被关闭。
zh_hant: 作業無效。已經關閉連接。

# ADP_ConnectionIsDisabled
source: The connection has been disabled.
de: Die Verbindung wurde deaktiviert.
es: Se ha deshabilitado la conexión.
fr: La connexion a été désactivée.
it: La connessione è stata disattivata
ja: 接続が無効にされています。
ko: 연결이 비활성화되었습니다.
pt_br: A conexão foi desabilitada.
ru: Подключение отключено.
zh_hans: 连接已被禁用。
zh_hant: 連接已停用。

# ADP_LocalTransactionPresent
source: Cannot enlist in the transaction because a local transaction is in progress on the connection. Finish local transaction and retry.
de: Eintrag in der Transaktion fehlgeschlagen, da für die Verbindung gerade eine lokale Transaktion durchgeführt wird. Beenden Sie die lokale Transaktion, und wiederholen Sie den Vorgang.
es: No se puede dar de alta en la transacción porque hay una transacción local en curso durante la conexión. Finalice la transacción local e inténtelo de nuevo.
fr: Inscription impossible dans la transaction car une transaction locale est en cours sur la connexion. Terminez la transaction locale et réessayez.
it: Impossibile inserire la transazione nell'elenco. È in corso una transazione locale sulla connessione. Terminare la transazione locale e riprovare.
ja: 接続上でローカル トランザクションが実行中のため、トランザクションに参加できません。ローカル トランザクションを終了して、再試行してください。
ko: 로컬 트랜잭션이 연결 중이기 때문에 트랜잭션에 참여할 수 없습니다. 로컬 트랜잭션을 끝낸 후 다시 시도하십시오.
pt_br: Não é possível se inscrever na transação, pois uma transação local está em andamento na conexão. Conclua a transação local e tente novamente.
ru: Невозможно включить в транзакцию, т.к. через данное подключение выполняется локальная транзакция. Завершите локальную транзакцию и повторите попытку.
zh_hans: 无法登记在事务中，因为连接上正在执行某个本地事务。请完成本地事务，然后重试。
zh_hant: 無法在交易中登記，因為本機交易正在連線上進行。請完成本機交易然後再試一次。

# ADP_TransactionPresent
source: Connection currently has transaction enlisted. Finish current transaction and retry.
de: Für die Verbindung ist gegenwärtig eine Transaktion eingetragen. Beenden Sie die aktuelle Transaktion, und versuchen Sie es erneut.
es: La conexión tiene actualmente dada de alta una transacción. Termine dicha transacción y vuelva a intentarlo.
fr: La connexion comporte actuellement une transaction inscrite. Terminez la transaction en cours et réessayez.
it: La connessione ha una transazione correntemente inserita nell'elenco. Completare la transazione corrente e riprovare.
ja: 接続には現在参加しているトランザクションがあります。現在のトランザクションを終了して、再試行してください。
ko: 현재 연결이 트랜잭션에 참여했습니다. 현재 트랜잭션을 끝낸 후 다시 시도하십시오.
pt_br: A conexão atualmente tem transação inscrita. Conclua a transação atual e tente novamente.
ru: Для этого подключения транзакция уже внесена в список. Завершите текущую транзакцию и повторите попытку.
zh_hans: 连接当前已登记事务。请完成当前事务，然后重试。
zh_hant: 目前的連接中已有編列的交易。請完成目前的交易並重試。

# ADP_EmptyDatabaseName
source: Database cannot be null, the empty string, or string of only whitespace.
de: Datenbank kann nicht Null, eine leere Zeichenfolge oder eine Zeichenfolge aus Leerzeichen sein.
es: La base de datos no puede ser nula, la cadena no puede estar vacía o no puede constar solamente de espacios en blanco.
fr: La base de données ne peut pas être null, une chaîne vide ou une chaîne exclusivement composée d'espaces.
it: Database non può essere null, una stringa vuota o una stringa di soli spazi.
ja: データベースを Null、空の文字列またはスペースのみを含む文字列にすることはできません。
ko: 데이터베이스는 Null, 빈 문자열 또는 공백으로만 구성된 문자열일 수 없습니다.
pt_br: Banco de dados não pode ser nulo, cadeia de caracteres vazia ou cadeia de caracteres contendo apenas espaços em branco.
ru: База данных не может быть пустой, не может являться пустой строкой или строкой, заполненной только пробелами или знаками табуляции.
zh_hans: 数据库不能为空、空字符串或仅由空白组成的字符串。
zh_hant: 資料庫不能是 Null、空字串或只有空白字元的字串。

# ADP_DatabaseNameTooLong
source: The argument is too long.
de: Das Argument ist zu lang.
es: El argumento es demasiado largo.
fr: L'argument est trop long.
it: L'argomento è troppo lungo.
ja: 引数が長すぎます。
ko: 인수가 너무 깁니다.
pt_br: O argumento é muito longo.
ru: Слишком длинный аргумент.
zh_hans: 参数太长。
zh_hant: 引數太長。

# ADP_InvalidConnectTimeoutValue
source: Invalid 'Connect Timeout' value which must be an integer >= 0.
de: Ungültiger 'Connect Timeout'-Wert. Der Wert muss eine ganze Zahl >= 0 sein.
es: Valor de 'Connect Timeout' no válido, debe ser un número entero >= 0.
fr: Valeur 'Connect Timeout' non valide qui doit être un entier >= 0.
it: Valore di 'Connect Timeout' non valido. Il valore deve essere un integer >= 0.
ja: Connect Timeout' の値が無効です。値は、0 以上の整数値でなければなりません。
ko: 'Connect Timeout' 값이 잘못되었습니다. 이 값은 0보다 크거나 같은 정수여야 합니다.
pt_br: Valor 'Connect Timeout' inválido; o valor deve ser um número inteiro >= 0.
ru: Недопустимое значение "времени ожидания подключения" Connect Timeout. Оно должно быть целым неотрицательным числом.
zh_hans: “Connect Timeout”值无效，该值必须是大于等于 0 的整数。
zh_hant: 無效的 'Connect Timeout' 值，這個值必須是 >= 0 的整數。

# ADP_InvalidSourceBufferIndex
source: Invalid source buffer (size of {0}) offset: {1}
de: Ungültiger Quellpufferoffset (Größe von {0}): {1}
es: Desplazamiento del búfer de origen (tamaño de {0}) no válido: {1}
fr: Mémoire tampon source non valide (taille de {0}) offset : {1}
it: Offset buffer di origine (dimensione {0}) non valido: {1}
ja: ソース バッファー (サイズ {0}) オフセットが無効です : {1}
ko: 소스 버퍼(크기: {0}) 오프셋이 잘못되었습니다. {1}
pt_br: Deslocamento de buffer de origem inválido (tamanho de {0}): {1}
ru: Недопустимое смещение в исходном буфере (размер: {0}): {1}
zh_hans: 无效的源缓冲区(大小为 {0})偏移量: {1}
zh_hant: 無效的來源緩衝區 ({0} 的大小) 位移: {1}

# ADP_InvalidDestinationBufferIndex
source: Invalid destination buffer (size of {0}) offset: {1}
de: Ungültiger Zielpufferoffset (Größe von {0}): {1}
es: Desplazamiento del búfer de destino (tamaño de {0}) no válido: {1}
fr: Mémoire tampon de destination non valide (taille de {0}) offset : {1}
it: Offset buffer di destinazione (dimensione {0}) non valido: {1}
ja: ターゲット バッファー (サイズ {0}) オフセット : {1} が無効です。
ko: 대상 버퍼(크기: {0}) 오프셋이 잘못되었습니다. {1}
pt_br: Deslocamento de buffer de destino inválido (tamanho de {0}): {1}
ru: Недопустимое смещение в конечном буфере (размер: {0}): {1}
zh_hans: 无效的目标缓冲区(大小为 {0})偏移量: {1}
zh_hant: 無效的目的緩衝區 ({0} 的大小) 位移: {1}

# ADP_DataReaderNoData
source: No data exists for the row/column.
de: Keine Daten für die Zeile/Spalte.
es: No hay ningún dato disponible para la fila o columna.
fr: Aucune donnée n'existe pour la ligne/colonne.
it: Nessun dato esistente per la riga/colonna.
ja: 行および列にデータが存在しません。
ko: 행/열에 대한 데이터가 없습니다.
pt_br: Não existem dados para a linha ou coluna.
ru: Отсутствуют данные для строки или столбца.
zh_hans: 不存在此行/列的数据。
zh_hant: 資料列/資料行沒有資料。

# ADP_NumericToDecimalOverflow
source: The numerical value is too large to fit into a 96 bit decimal.
de: Der numerische Wert ist zu groß, um in eine Dezimalzahl mit 96 Bits zu passen.
es: El valor numérico es demasiado grande para ajustarlo a un valor decimal de 96 bits.
fr: La valeur numérique est trop élevée pour tenir dans un décimal à 96 bits.
it: Il valore numerico non è contenibile in un numero decimale a 96 bit.
ja: この数値は 10 進数の 96 ビットに適合させるには大きすぎます。
ko: 숫자 값이 너무 커서 96비트 10진수에 맞지 않습니다.
pt_br: Valor numérico muito grande para um decimal de 96 bits.
ru: Численное значение не умещается в 96-разрядном десятичном числе.
zh_hans: 枚举值太大，不能适应 96 位十进制。
zh_hant: 數值太大，超過 96 位元小數。

# ADP_StreamClosed
source: Invalid attempt to {0} when stream is closed.
de: Ungültiger Versuch, zu {0}, da der Stream bereits geschlossen wurde.
es: Intento de {0} no válido cuando está cerrada la secuencia.
fr: Tentative non valide de {0} lorsque le flux est fermé.
it: Tentativo non valido di {0} con flusso chiuso.
ja: ストリームが閉じているときに {0} を実行しようとしましたが無効です。
ko: 스트림이 닫혀 있으면 {0}을(를) 수행할 수 없습니다.
pt_br: Tentativa inválida de {0} quando o fluxo estava fechado.
ru: Недопустимая попытка {0} при закрытом потоке.
zh_hans: 流关闭时 {0} 的尝试无效。
zh_hant: 當資料流關閉時嘗試 {0} 無效。

# ADP_InvalidSeekOrigin
source: Specified SeekOrigin value is invalid.
de: Der angegebene SeekOrigin-Wert ist ungültig.
es: El valor SeekOrigin especificado no es válido.
fr: La valeur de SeekOrigin spécifiée n'est pas valide.
it: Il valore specificato per SeekOrigin non è valido.
ja: 指定した SeekOrigin の値は無効です。
ko: 지정한 SeekOrigin 값이 잘못되었습니다.
pt_br: Valor de SeekOrigin especificado é inválido.
ru: Указанное значение SeekOrigin недействительно.
zh_hans: 指定的 SeekOrigin 值无效。
zh_hant: 指定的 SeekOrigin 值無效。

# ADP_DynamicSQLJoinUnsupported
source: Dynamic SQL generation is not supported against multiple base tables.
de: Dynamische SQL-Generierung wird gegen mehrere Basistabellen nicht unterstützt.
es: La generación SQL dinámica no es compatible con varias tablas de base.
fr: La génération SQL dynamique n'est pas prise en charge pour plusieurs tables de base.
it: Generazione SQL dinamica non supportata per più tabelle di base.
ja: 複数のベース テーブルに対する動的 SQL の生成はサポートされません。
ko: 여러 기본 테이블에 대해서는 동적 SQL 생성이 지원되지 않습니다.
pt_br: Não há suporte para geração SQL dinâmica em várias tabelas base.
ru: Динамическое создание SQL для нескольких базовых таблиц не поддерживается.
zh_hans: 对于多个基表不支持动态 SQL 生成。
zh_hant: 多個基底資料表不支援動態 SQL 產生。

# ADP_DynamicSQLNoTableInfo
source: Dynamic SQL generation is not supported against a SelectCommand that does not return any base table information.
de: Dynamische SQL-Generierung wird für einen SelectCommand, der keine Basistabelleninformationen zurückgibt, nicht unterstützt.
es: La generación SQL dinámica no es compatible con SelectCommand, que no devuelve ninguna información de tabla base.
fr: La génération SQL dynamique n'est pas prise en charge pour un SelectCommand qui ne retourne pas des informations de table de base.
it: Generazione SQL dinamica non supportata per un SelectCommand che non restituisce informazioni di tabelle di base.
ja: 動的 SQL 生成は、ベース テーブル情報を返さない SelectCommand に対してサポートされていません。
ko: 기본 테이블 정보를 반환하지 않는 SelectCommand에 대해서는 동적 SQL 생성이 지원되지 않습니다.
pt_br: Não há suporte para geração SQL dinâmica em SelectCommand que não retorna informações sobre uma tabela base.
ru: Динамическое создание SQL не поддерживается для SelectCommand, не возвращающего никакой информации о базовой таблице.
zh_hans: 对于不返回任何基表信息的 SelectCommand 不支持动态 SQL 生成。
zh_hant: 沒有傳回任何基底資料表資訊的 SelectCommand 不支援動態 SQL 產生。

# ADP_DynamicSQLNoKeyInfoDelete
source: Dynamic SQL generation for the DeleteCommand is not supported against a SelectCommand that does not return any key column information.
de: Dynamische SQL-Generierung für den DeleteCommand wird nicht für einen SelectCommand unterstützt, der keine Schlüsselspalteninformationen zurückgibt.
es: La generación SQL dinámica para DeleteCommand no es compatible con SelectCommand, que no devuelve ninguna información sobre columnas clave.
fr: La génération SQL dynamique de DeleteCommand n'est pas prise en charge pour un SelectCommand qui ne retourne pas des informations de colonne clé.
it: Generazione SQL dinamica per DeleteCommand non supportata per un SelectCommand che non restituisce informazioni di colonne chiave.
ja: DeleteCommand の動的 SQL 生成は、キー列情報を返さない SelectCommand に対してはサポートされていません。
ko: 키 열 정보를 반환하지 않는 SelectCommand에 대해서는 DeleteCommand에 대한 동적 SQL 생성이 지원되지 않습니다.
pt_br: Não há suporte para geração SQL dinâmica para DeleteCommand em SelectCommand que não retorna informações importantes de coluna.
ru: Динамическое создание SQL для DeleteCommand не поддерживается для SelectCommand, не возвращающей никаких сведений о столбце ключей.
zh_hans: 对于不返回任何键列信息的 SelectCommand，不支持 DeleteCommand 的动态 SQL 生成。
zh_hant: 不會傳回任何重要資料行資訊的 SelectCommand 不支援 DeleteCommand 動態 SQL 的產生。

# ADP_DynamicSQLNoKeyInfoUpdate
source: Dynamic SQL generation for the UpdateCommand is not supported against a SelectCommand that does not return any key column information.
de: Dynamische SQL-Generierung für den UpdateCommand wird nicht für einen SelectCommand unterstützt, der keine Schlüsselspalteninformationen zurückgibt.
es: La generación SQL dinámica para UpdateCommand no es compatible con SelectCommand, que no devuelve ninguna información sobre columnas clave.
fr: La génération SQL dynamique de UpdateCommand n'est pas prise en charge pour un SelectCommand qui ne retourne pas des informations de colonne clé.
it: Generazione SQL dinamica per UpdateCommand non supportata per un SelectCommand che non restituisce informazioni di colonne chiave.
ja: UpdateCommand の動的 SQL 生成は、キー列情報を返さない SelectCommand に対してはサポートされていません。
ko: 키 열 정보를 반환하지 않는 SelectCommand에 대해서는 UpdateCommand에 대한 동적 SQL 생성이 지원되지 않습니다.
pt_br: Não há suporte para geração SQL dinâmica para UpdateCommand em SelectCommand que não retorne informações importantes de coluna.
ru: Динамическое создание SQL для UpdateCommand не поддерживается для SelectCommand, не возвращающей никаких сведений о столбце ключей.
zh_hans: 对于不返回任何键列信息的 SelectCommand，不支持 UpdateCommand 的动态 SQL 生成。
zh_hant: 不會傳回任何重要資料行資訊的 SelectCommand 不支援 UpdateCommand 動態 SQL 的產生。

# ADP_DynamicSQLNoKeyInfoRowVersionDelete
source: Dynamic SQL generation for the DeleteCommand is not supported against a SelectCommand that does not contain a row version column.
de: Die dynamische SQL-Generierung für den 'DeleteCommand' wird für einen 'SelectCommand', der keine Zeilenversionsspalte enthält, nicht unterstützt.
es: La generación SQL dinámica para DeleteCommand no es compatible con SelectCommand que no contiene columna de versión de fila.
fr: La génération SQL dynamique de DeleteCommand n'est pas prise en charge pour un SelectCommand qui ne contient pas de colonne version de ligne.
it: Generazione SQL dinamica per DeleteCommand non supportata per un SelectCommand che non contiene una colonna con versione a righe.
ja: DeleteCommand の動的 SQL 生成は、行バージョンの列を含まない SelectCommand に対してはサポートされていません。
ko: 행 버전 정보를 표시한 열을 포함하지 않는 SelectCommand에 대해서는 DeleteCommand에 대한 동적 SQL 생성이 지원되지 않습니다.
pt_br: Não há suporte para geração SQL dinâmica para DeleteCommand em SelectCommand que não contenha uma coluna de versão de linha.
ru: Динамическое создание SQL для DeleteCommand не поддерживается для SelectCommand, не содержащей столбца, в котором указаны версии строк.
zh_hans: 对于没有行版本列的 SelectCommand，不支持 DeleteCommand 的动态 SQL 生成。
zh_hant: 當 SelectCommand 不包含資料列版本資料行時，DeleteCommand 的動態 SQL 產生便不受支援。

# ADP_DynamicSQLNoKeyInfoRowVersionUpdate
source: Dynamic SQL generation for the UpdateCommand is not supported against a SelectCommand that does not contain a row version column.
de: Die dynamische SQL-Generierung für den 'UpdateCommand' wird für einen 'SelectCommand', der keine Zeilenversionsspalte enthält, nicht unterstützt.
es: La generación Dynamic SQL para UpdateCommand no es compatible con SelectCommand que no contiene columna de versión de fila.
fr: La génération SQL dynamique de UpdateCommand n'est pas prise en charge pour un SelectCommand qui ne contient pas de colonne version de ligne.
it: Generazione SQL dinamica per UpdateCommand non supportata per un SelectCommand che non contiene una colonna con versione a righe.
ja: UpdateCommand の動的 SQL 生成は、行バージョンの列を含まない SelectCommand に対してはサポートされていません。
ko: 행 버전 정보를 표시한 열을 포함하지 않는 SelectCommand에 대해서는 UpdateCommand에 대한 동적 SQL 생성이 지원되지 않습니다.
pt_br: Não há suporte para geração SQL dinâmica para UpdateCommand em SelectCommand que não contenha uma coluna de versão de linha.
ru: Динамическое создание SQL для UpdateCommand не поддерживается для SelectCommand, не содержащей столбца, в котором указаны версии строк.
zh_hans: 对于没有行版本列的 SelectCommand，不支持 UpdateCommand 的动态 SQL 生成。
zh_hant: 當 SelectCommand 不包含資料列版本資料行時，UpdateCommand 的動態 SQL 產生便不受支援。

# ADP_DynamicSQLNestedQuote
source: Dynamic SQL generation not supported against table names '{0}' that contain the QuotePrefix or QuoteSuffix character '{1}'.
de: Die dynamische SQL-Generierung wird für Tabellennamen '{0}', die das QuotePrefix- oder QuoteSuffix-Zeichen '{1}' enthalten, nicht unterstützt.
es: La generación SQL dinámica no es compatible con nombres de tablas '{0}' que contengan el carácter '{1}' de QuotePrefix o QuoteSuffix.
fr: La génération SQL dynamique n'est pas prise en charge pour les noms de table '{0}' qui contiennent le caractère QuotePrefix ou QuoteSuffix '{1}'.
it: Generazione SQL dinamica non supportata per nomi di tabella "{0}" che contengono il carattere "{1}" nella proprietà QuotePrefix o QuoteSuffix.
ja: QuotePrefix または QuoteSuffix 文字 '{1}' を含むテーブル名 '{0}' は、動的 SQL 生成のサポートの対象になっていません。
ko: QuotePrefix 또는 QuoteSuffix 문자 '{1}'을(를) 포함하는 테이블 이름 '{0}'에 대해서는 동적 SQL 생성이 지원되지 않습니다.
pt_br: Não há suporte para geração SQL dinâmica em nomes de tabela '{0}' que contenham o caractere QuotePrefix ou QuoteSuffix '{1}'.
ru: Динамическое создание SQL не поддерживается для имен таблиц "{0}", содержащих знак QuotePrefix или QuoteSuffix "{1}".
zh_hans: 对于包含 QuotePrefix 或 QuoteSuffix 字符“{1}”的表名称“{0}”，不支持动态 SQL 生成。
zh_hant: 內含 QuotePrefix 或 QuoteSuffix 字元 '{1}' 的資料表名稱 '{0}' 不支援動態 SQL 的產生。

# ADP_NonSequentialColumnAccess
source: Invalid attempt to read from column ordinal '{0}'. With CommandBehavior.SequentialAccess, you may only read from column ordinal '{1}' or greater.
de: Ungültiger Versuch, aus der Spaltenordinalzahl '{0}' zu lesen. Mit CommandBehavior.SequentialAccess kann nur aus der Spaltenordinalzahl '{1}' oder größer gelesen werden.
es: Intento no válido de leer el índice de columna '{0}'. Con CommandBehavior.SequentialAccess, solo se puede leer un índice de columna igual a '{1}' o mayor.
fr: Tentative non valide de lecture du numéro de colonne '{0}'. Avec CommandBehavior.SequentialAccess, vous ne pouvez lire qu'à partir du numéro de colonne '{1}' ou supérieur.
it: Tentativo non valido di leggere dall'ordinale di colonna "{0}". Con CommandBehavior.SequentialAccess è possibile leggere solo a partire dall'ordinale di colonna "{1}".
ja: 列番号 '{0}' から読み取ろうとしました。これは無効な処理です。CommandBehavior.SequentialAccess を使う場合、序数値 '{1}' 以上の列からのみ読み取ることができます。
ko: 열 서수 '{0}'에서 읽으려고 했습니다. CommandBehavior.SequentialAccess를 사용하는 경우 열 서수 '{1}' 이상에서만 읽을 수 있습니다.
pt_br: Tentativa inválida de leitura do ordinal de coluna '{0}'. Com CommandBehavior.SequentialAccess, só é possível ler do ordinal de coluna '{1}' ou maior.
ru: Недопустимая попытка считывания из столбца с порядковым номером "{0}". С помощью CommandBehavior.SequentialAccess считывание разрешено только из столбцов с порядковым номером "{1}" и выше.
zh_hans: 读取列序号“{0}”的尝试无效。通过 CommandBehavior.SequentialAccess 只能读取“{1}”或更大的列序号。
zh_hant: 嘗試讀取資料行序數 '{0}' 無效。使用 CommandBehavior.SequentialAccess 時，您只能讀取大於或等於資料行序數 '{1}' 的值。

# ADP_InvalidDateTimeDigits
source: Data type '{0}' can not be formatted as a literal because it has an invalid date time digits.
de: Der Datentyp '{0}' kann nicht als Literal formatiert werden, da er ungültige Stellen für Datum/Uhrzeit aufweist.
es: No se puede dar formato al tipo de datos '{0}' como literal porque tiene dígitos de fecha y hora no válidos.
fr: Le type de données '{0}' ne peut pas adopter le format littéral car sa valeur de date et d'heure n'est pas valide.
it: Impossibile formattare il tipo di dati "{0}" come rappresentazione formale perché presenta cifre di data/ora non valide.
ja: 無効な日付と時刻の数字が指定されているため、データ型 '{0}' をリテラルとしてフォーマットできません。
ko: 데이터 형식 '{0}'은(는) 날짜/시간 자릿수가 잘못되었기 때문에 리터럴 형식으로 지정할 수 없습니다.
pt_br: Tipo de dados '{0}' não pode ser formatado como literal pois tem dígitos de data e hora inválidos.
ru: Тип данных "{0}" не может быть отформатирован в качестве литерала, поскольку имеет недопустимые разряды даты и времени.
zh_hans: 数据类型“{0}”包含无效的日期时间数字，不能格式化为文本。
zh_hant: 資料型別 '{0}' 無法組成為文字，因為包含無效的日期時間數字。
