Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataSet_DefaultInRowChangingEventException
source: Operation not supported in the RowChanging event.
de: Operation wird innerhalb des RowChanging-Ereignisses nicht unterstützt.
es: Operación no compatible en el evento RowChanging.
fr: Opération non prise en charge dans l'événement RowChanging.
it: Operazione non supportata nell'evento RowChanging.
ja: RowChanging イベントではサポートされない操作です。
ko: RowChanging 이벤트에서는 작업이 지원되지 않습니다.
pt_br: Operação não tem suporte no evento RowChanging.
ru: Операция не поддерживается в событии RowChanging.
zh_hans: RowChanging 事件中不支持操作。
zh_hant: 不支援在 RowChanging 事件中操作。

# DataSet_DefaultInvalidConstraintException
source: Invalid constraint.
de: Ungültige Einschränkung.
es: Restricción no válida.
fr: Contrainte non valide.
it: Vincolo non valido.
ja: 制約が無効です。
ko: 제약 조건이 잘못되었습니다.
pt_br: Restrição inválida.
ru: Недействительное ограничение.
zh_hans: 无效的约束。
zh_hant: 無效的條件約束。

# DataSet_DefaultMissingPrimaryKeyException
source: Missing primary key.
de: Fehlender Primärschlüssel.
es: Falta la clave principal.
fr: Clé primaire manquante.
it: Chiave primaria mancante.
ja: 主キーがありません。
ko: 기본 키가 없습니다.
pt_br: Chave primária ausente.
ru: Отсутствует первичный ключ.
zh_hans: 缺少主键。
zh_hant: 遺失的主索引鍵。

# DataSet_DefaultNoNullAllowedException
source: Null not allowed.
de: Null nicht zulässig.
es: No se permite el valor Null.
fr: Valeur Null non autorisée.
it: Valore Null non consentito.
ja: Null は許可されていません。
ko: Null이 허용되지 않습니다.
pt_br: Null não permitido.
ru: Значения Null не допускаются.
zh_hans: 不允许 Null。
zh_hant: 不允許 Null。

# DataSet_DefaultReadOnlyException
source: Column is marked read only.
de: Spalte ist als schreibgeschützt markiert.
es: La columna está marcada como de solo lectura.
fr: Colonne indiquée en lecture seule.
it: La colonna è di sola lettura.
ja: 列は読み取り専用としてマークされています。
ko: 열이 읽기 전용으로 표시되어 있습니다.
pt_br: Coluna marcada como somente leitura.
ru: Столбец доступен только для чтения.
zh_hans: 列被标记为只读。
zh_hant: 資料行已標示為唯讀。

# DataSet_DefaultRowNotInTableException
source: Row not found in table.
de: Zeile in Tabelle nicht gefunden.
es: No se encuentra la fila en la tabla.
fr: Ligne introuvable dans la table.
it: Riga non trovata nella tabella.
ja: テーブルに行がありません。
ko: 테이블에 행이 없습니다.
pt_br: Linha não localizada na tabela.
ru: Строка в таблице не найдена.
zh_hans: 在表中找不到行。
zh_hant: 資料表中找不到資料列。

# DataSet_DefaultVersionNotFoundException
source: Version not found.
de: Version nicht gefunden.
es: No se puede encontrar la versión.
fr: Version introuvable.
it: Versione non trovata.
ja: バージョンが見つかりません。
ko: 버전을 찾을 수 없습니다.
pt_br: Versão não encontrada.
ru: Версия не найдена.
zh_hans: 找不到版本。
zh_hant: 找不到版本。

# Load_ReadOnlyDataModified
source: ReadOnly Data is Modified.
de: ReadOnly-Daten wurden geändert.
es: Los datos ReadOnly se han modificado.
fr: Les données ReadOnly ont été modifiées.
it: ReadOnly Data è Modified.
ja: ReadOnly データが変更されています。
ko: ReadOnly 데이터가 수정됩니다.
pt_br: Dados ReadOnly modificados.
ru: Изменены данные ReadOnly, доступные только для чтения.
zh_hans: 修改了 ReadOnly 数据。
zh_hant: 已修改 ReadOnly 資料。

# DataTableReader_InvalidDataTableReader
source: DataTableReader is invalid for current DataTable '{0}'.
de: DataTableReader ist für die aktuelle DataTable '{0}' ungültig.
es: DataTableReader no es válido para la tabla DataTable '{0}' actual.
fr: DataTableReader non valide pour le DataTable '{0}' actuel.
it: DataTableReader non valido per la DataTable "{0}" corrente.
ja: DataTableReader は、現在の DataTable '{0}' に対しては無効です。
ko: DataTableReader가 현재 DataTable '{0}'에 사용할 수 없습니다.
pt_br: DataTableReader inválido para DataTable '{0}' atual.
ru: Недействительный DataTableReader для текущей DataTable "{0}".
zh_hans: 当前 DataTable“{0}”的 DataTableReader 无效。
zh_hant: DataTableReader 對目前的 DataTable '{0}' 無效。

# DataTableReader_SchemaInvalidDataTableReader
source: Schema of current DataTable '{0}' in DataTableReader has changed, DataTableReader is invalid.
de: Das Schema der aktuellen DataTable '{0}' in DataTableReader hat sich geändert. DataTableReader ist ungültig.
es: Se ha cambiado el esquema de la DataTable actual '{0}' en DataTableReader; DataTableReader no es válido.
fr: Le schéma du DataTable '{0}' actuel de DataTableReader a été modifié, DataTableReader n'est pas valide.
it: Lo schema della DataTable "{0}" corrente in DataTableReader è cambiato. DataTableReader non è valido.
ja: DataTableReader に保持されている DataTable '{0}' のスキーマは変更されています。DataTableReader は無効です。
ko: DataTableReader에 있는 현재 DataTable '{0}'의 스키마가 변경되었으며 DataTableReader가 잘못되었습니다.
pt_br: Esquema de DataTable '{0}' atual em DataTableReader alterado, DataTableReader é inválido.
ru: Схема текущей DataTable "{0}" в DataTableReader изменилась; DataTableReader недействителен.
zh_hans: DataTableReader 中的当前 DataTable“{0}”的架构已更改，DataTableReader 无效。
zh_hant: 在 DataTableReader 中的目前 DataTable '{0}' 結構描述已經變更，DataTableReader 無效。

# DataTableReader_CannotCreateDataReaderOnEmptyDataSet
source: DataTableReader Cannot be created. There is no DataTable in DataSet.
de: DataTableReader kann nicht erstellt werden. Es gibt keine DataTable im DataSet.
es: No se puede crear DataTableReader. No hay DataTable en DataSet.
fr: Impossible de créer DataTableReader. DataSet ne contient aucun DataTable.
it: Impossibile creare DataTableReader. Nessuna DataTable presente nel DataSet.
ja: DataTableReader を作成できません。DataSet に DataTable がありません。
ko: DataTableReader를 만들 수 없습니다. DataSet에 DataTable이 없습니다.
pt_br: DataTableReader não pode ser criado. Não há DataTable em DataSet.
ru: Невозможно создать DataTableReader. В DataSet нет DataTable.
zh_hans: 无法创建 DataTableReader。DataSet 中没有 DataTable。
zh_hant: 無法建立 DataTableReader。DataSet 中沒有 DataTable。

# DataTableReader_DataTableReaderArgumentIsEmpty
source: Cannot create DataTableReader. Argument is Empty.
de: DataTableReader kann nicht erstellt werden. Argument ist leer.
es: No se puede crear DataTableReader. El argumento está vacío.
fr: Impossible de créer DataTableReader. L'argument est vide.
it: Impossibile creare DataTableReader. L'argomento è vuoto.
ja: DataTableReader を作成できません。引数が空です。
ko: DataTableReader를 만들 수 없습니다. 인수가 비어 있습니다.
pt_br: Não é possível criar DataTableReader. Argumento vazio.
ru: Не удается создать DataTableReader. Пустой аргумент.
zh_hans: 无法创建 DataTableReader。参数为空。
zh_hant: 無法建立 DataTableReader。引數為空。

# DataTableReader_ArgumentContainsNullValue
source: Cannot create DataTableReader. Arguments contain null value.
de: DataTableReader kann nicht erstellt werden. Argumente enthalten null-Wert.
es: No se puede crear DataTableReader. Los argumentos contienen el valor null.
fr: Impossible de créer DataTableReader. Les arguments contiennent la valeur null.
it: Impossibile creare DataTableReader. Gli argomenti contengono valori null.
ja: DataTableReader を作成できません。引数に null 値が保持されています。
ko: DataTableReader를 만들 수 없습니다. 인수에 null 값이 있습니다.
pt_br: Não é possível criar DataTableReader. Argumentos contêm valor null.
ru: Не удается создать DataTableReader. Аргументы содержат значение null.
zh_hans: 无法创建 DataTableReader。参数包含 null 值。
zh_hant: 無法建立 DataTableReader。引數包含 null。

# DataTableReader_InvalidRowInDataTableReader
source: Current DataRow is either in Deleted or Detached state.
de: Die aktuelle DataRow hat entweder den Status Deleted' oder 'Detached'.
es: El estado de la DataRow actual es Deleted o Detached.
fr: Le DataRow actuel porte l'état Deleted ou Detached.
it: Lo stato della raccolta DataRow corrente è Deleted o Detached.
ja: 現在の DataRow の状態は Deleted であるか Detached です。
ko: 현재 DataRow가 Deleted 상태이거나 Detached 상태입니다.
pt_br: DataRow atual em estado Deleted ou Detached.
ru: Текущий элемент DataRow находится в состоянии Deleted или Detached.
zh_hans: 当前 DataRow 的状态不是为 Deleted 就是为 Detached。
zh_hant: Current DataRow 是 Deleted 或 Detached 狀態。

# DataTableReader_DataTableCleared
source: Current DataTable '{0}' is empty. There is no DataRow in DataTable.
de: Aktuelle DataTable '{0}' ist leer. Es gibt keine DataRow in der DataTable.
es: La tabla DataTable '{0}' actual está vacía. No hay DataRow en DataTable.
fr: Le DataTable actuel '{0}' est vide. DataTable ne contient aucun DataRow.
it: DataTable "{0}" corrente vuota. Nessun DataRow presente in DataTable.
ja: 現在の DataTable '{0}' は空です。DataTable に DataRow がありません。
ko: 현재 DataTable '{0}'이(가) 비어 있습니다. DataTable에 DataRow가 없습니다.
pt_br: DataTable '{0}' atual está vazia. Não há DataRow em DataTable.
ru: Текущая DataTable "{0}" пуста. В DataTable нет DataRow.
zh_hans: 当前 DataTable“{0}”为空。DataTable 中没有 DataRow。
zh_hant: 目前的 DataTable '{0}' 為空。DataTable 中沒有 DataRow。

# RbTree_InvalidState
source: DataTable internal index is corrupted: '{0}'.
de: Der interne DataTable-Index ist beschädigt: '{0}'.
es: El índice interno de DataTable está dañado: '{0}'.
fr: L'index interne DataTable est endommagé : '{0}'.
it: Indice interno di DataTable corrotto: "{0}".
ja: DataTable の内部インデックスが破損しています。'{0}'
ko: DataTable 내부 인덱스가 손상되었습니다: '{0}'.
pt_br: O índice interno DataTable está corrompido: '{0}'.
ru: Поврежден внутренний индекс DataTable: "{0}".
zh_hans: DataTable 内部索引已损坏:“{0}”。
zh_hant: DataTable 內部索引已經毀損: '{0}'。

# RbTree_EnumerationBroken
source: Collection was modified; enumeration operation might not execute.
de: Die Sammlung wurde geändert; möglicherweise wurde die Enumeration nicht ausgeführt.
es: Se modificó la colección; puede que no se ejecute la operación de enumeración.
fr: La collection a été modifiée ; l'opération d'énumération risque de ne pas s'exécuter.
it: La raccolta è stata modificata; impossibile eseguire l'operazione di enumerazione.
ja: コレクションが修正されました。列挙操作が実行されない可能性があります。
ko: 컬렉션이 수정되었습니다. 열거 작업이 실행되지 않았을 수 있습니다.
pt_br: A coleção foi modificada. Talvez a operação de enumeração não seja executada.
ru: Коллекция изменена, возможно операция перечисления не будет выполнена.
zh_hans: 集合已修改；枚举操作可能无法执行。
zh_hant: 集合已經修改; 列舉作業可能無法執行。

# NamedSimpleType_InvalidDuplicateNamedSimpleTypeDelaration
source: Simple type '{0}' has already be declared with different '{1}'.
de: Der einfache Typ '{0}' wurde bereits mit unterschiedlichem/r '{1}' deklariert.
es: Se ha declarado el tipo simple '{0}' con otro '{1}'.
fr: Le type simple '{0}' a déjà été déclaré avec une autre valeur '{1}'.
it: Il tipo semplice '{0}' è già stato dichiarato con un elemento '{1}' diverso.
ja: 単純型 '{0}' は既に別の '{1}' を使用して宣言されています。
ko: 단순 유형 '{0}'이(가) 다른 '{1}'(으)로 이미 선언되었습니다.
pt_br: O tipo '{0}' simples já foi declarado com '{1}' diferente.
ru: Простой тип "{0}" уже определен с другим "{1}".
zh_hans: 简单类型“{0}”已使用不同的“{1}”进行声明。
zh_hant: 已使用不同的 '{1}' 來宣告簡單型別 '{0}'。

# DataDom_Foliation
source: Invalid foliation.
de: Ungültige Paginierung.
es: Intercalación no válida.
fr: Foliation non valide.
it: Foliazione non valida.
ja: foliation が無効です。
ko: foliation이 잘못되었습니다.
pt_br: Foliação inválida.
ru: Недопустимая нумерация.
zh_hans: 无效的编页。
zh_hant: 無效的葉項。

# DataDom_TableNameChange
source: Cannot change the table name once the associated DataSet is mapped to a loaded XML document.
de: Der Tabellenname kann nicht geändert werden, wenn der verknüpfte DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se puede cambiar el nombre de la tabla una vez que DataSet asociado está asignado a un documento XML cargado.
fr: Impossible de changer le nom de la table une fois que le DataSet associé est mappé à un document XML chargé.
it: Impossibile modificare il nome della tabella una volta che il DataSet associato è stato mappato a un documento XML caricato.
ja: テーブル名に関連付けられた DataSet が読み込まれた XML ドキュメントに割り当てられた後は、このテーブル名を変更できません。
ko: 연결된 DataSet이 로드된 XML 문서에 매핑된 후에는 테이블 이름을 변경할 수 없습니다.
pt_br: Não será possível alterar o nome da tabela depois que o DataSet associado for mapeado para um documento XML carregado.
ru: Невозможно изменить имя таблицы, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要相关的 DataSet 被映射到加载的 XML 文档中，就不能更改该表名称。
zh_hant: 一旦關聯的 DataSet 對應至載入的 XML 文件時，就無法變更資料表名稱。

# DataDom_TableNamespaceChange
source: Cannot change the table namespace once the associated DataSet is mapped to a loaded XML document.
de: Der Tabellennamespace kann nicht geändert werden, wenn der verknüpfte DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se puede cambiar el espacio de nombres de la tabla una vez que el DataSet asociado está asignado a un documento XML cargado.
fr: Impossible de changer l'espace de noms de la table une fois que le DataSet associé est mappé à un document XML chargé.
it: Impossibile modificare lo spazio dei nomi della tabella una volta che il DataSet associato è stato mappato a un documento XML caricato.
ja: テーブル名前空間に関連付けられた DataSet が読み込まれた XML ドキュメントに割り当てられた後は、このテーブル名前空間を変更できません。
ko: 연결된 DataSet이 로드된 XML 문서에 매핑된 후에는 테이블 네임스페이스를 변경할 수 없습니다.
pt_br: Não será possível alterar o espaço para nome da tabela depois que o DataSet associado for mapeado para um documento XML carregado.
ru: Невозможно изменить пространство имен таблицы, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要相关的 DataSet 被映射到加载的 XML 文档中，就不能更改该表命名空间。
zh_hant: 一旦關聯的 DataSet 對應至載入的 XML 文件時，就無法變更資料表命名空間。

# DataDom_ColumnNameChange
source: Cannot change the column name once the associated DataSet is mapped to a loaded XML document.
de: Der Spaltenname kann nicht geändert werden, wenn der verknüpfte DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se puede cambiar el nombre de la columna una vez que el DataSet asociado está asignado a un documento XML cargado.
fr: Impossible de changer le nom de la colonne une fois que le DataSet associé est mappé à un document XML chargé.
it: Impossibile modificare il nome della colonna dopo che il DataSet associato è stato mappato a un documento XML caricato.
ja: 列名に関連付けられた DataSet が、読み込まれた XML ドキュメントに割り当てられた後は、この列名を変更できません。
ko: 연결된 DataSet이 로드된 XML 문서에 매핑된 후에는 열 이름을 변경할 수 없습니다.
pt_br: Não será possível alterar o nome da coluna depois que o DataSet associado for mapeado para um documento XML carregado.
ru: Невозможно изменить имя столбца, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要相关的 DataSet 被映射到加载的 XML 文档中，就不能更改该列名称。
zh_hant: 一旦關聯的 DataSet 對應至載入的 XML 文件時，就無法變更資料行名稱。

# DataDom_ColumnNamespaceChange
source: Cannot change the column namespace once the associated DataSet is mapped to a loaded XML document.
de: Der Spaltennamespace kann nicht geändert werden, wenn der verknüpfte DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se puede cambiar el espacio de nombres de la columna una vez que la DataSet asociada está asignada a un documento XML cargado.
fr: Impossible de changer l'espace de noms de la colonne une fois que le DataSet associé est mappé à un document XML chargé.
it: Impossibile modificare lo spazio dei nomi della colonna dopo che il DataSet associato è stato mappato a un documento XML caricato.
ja: 列名前空間に関連付けられた DataSet が、読み込まれた XML ドキュメントに割り当てられた後は、この列名前空間を変更できません。
ko: 연결된 DataSet이 로드된 XML 문서에 매핑된 후에는 열 네임스페이스를 변경할 수 없습니다.
pt_br: Não será possível alterar o espaço para nome da coluna depois que o DataSet associado for mapeado para um documento XML carregado.
ru: Невозможно изменить пространство имен столбца, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要相关的 DataSet 被映射到加载的 XML 文档中，就不能更改列命名空间。
zh_hant: 一旦關聯的 DataSet 對應至載入的 XML 文件時，就無法變更資料行命名空間。

# DataDom_ColumnMappingChange
source: Cannot change the ColumnMapping property once the associated DataSet is mapped to a loaded XML document.
de: Die ColumnMapping-Eigenschaft kann nicht mehr geändert werden, nachdem das verknüpfte DataSet dem geladenen XML-Dokument zugeordnet wurde.
es: No se puede cambiar la propiedad ColumnMapping una vez que el DataSet asociado se asigne a un documento XML cargado.
fr: Impossible de changer la propriété ColumnMapping une fois que le DataSet associé est mappé à un document XML chargé.
it: Impossibile modificare la proprietà ColumnMapping dopo che il DataSet associato è stato mappato su un documento XML.
ja: 関連付けられた DataSet が、読み込まれた XML ドキュメントに割り当てられた後に ColumnMapping プロパティを変更できません。
ko: 연결된 DataSet이 로드된 XML 문서에 매핑된 후에는 ColumnMapping 속성을 변경할 수 없습니다.
pt_br: Não será possível alterar a propriedade ColumnMapping depois que o DataSet associado for mapeado para um documento XML carregado.
ru: Невозможно изменить свойство ColumnMapping, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 关联的 DataSet 映射到已加载的 XML 文档后，就不能更改 ColumnMapping 属性。
zh_hant: 一旦關聯的 DataSet 對應至載入的 XML 文件時，就無法變更 ColumnMapping 屬性。

# DataDom_TableColumnsChange
source: Cannot add or remove columns from the table once the DataSet is mapped to a loaded XML document.
de: Spalten der Tabelle können nicht mehr hinzugefügt oder entfernt werden, sobald das DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se puede agregar o eliminar columnas de la tabla una vez que el DataSet está asignado a un documento XML cargado.
fr: Impossible d'ajouter ou de supprimer des colonnes à partir de la table une fois que le DataSet est mappé à un document XML chargé.
it: Impossibile aggiungere o rimuovere colonne dalla tabella dopo che il DataSet è stato mappato a un documento XML caricato.
ja: DataSet が読み込まれた XML ドキュメントに割り当てられた後に、テーブルの列を追加または削除することはできません。
ko: DataSet이 로드된 XML 문서에 매핑된 후에는 테이블에서 열을 추가하거나 제거할 수 없습니다.
pt_br: Não será possível adicionar ou remover colunas da tabela depois que o DataSet for mapeado para um documento XML carregado.
ru: Невозможно добавить или удалить столбцы таблицы, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要 DataSet 被映射到加载的 XML 文档中，就不能在该表中添加或移除列。
zh_hant: 一旦 DataSet 對應至載入的 XML 文件時，就無法從資料表加入或移除資料行。

# DataDom_DataSetTablesChange
source: Cannot add or remove tables from the DataSet once the DataSet is mapped to a loaded XML document.
de: Tabellen des DataSets können nicht mehr hinzugefügt oder entfernt werden, sobald das DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se pueden agregar o eliminar tablas de DataSet una vez que está asignada a un documento XML cargado.
fr: Impossible d'ajouter ou de supprimer des tables du DataSet une fois que le DataSet est mappé à un document XML chargé.
it: Impossibile aggiungere o rimuovere tabelle dal DataSet dopo che è stato mappato a un documento XML caricato.
ja: DataSet が読み込まれた XML ドキュメントに割り当てられた後に、DataSet のテーブルを追加または除することはできません。
ko: DataSet이 로드된 XML 문서에 매핑된 후에는 DataSet에서 테이블을 추가하거나 제거할 수 없습니다.
pt_br: Não será possível alterar o nome do DataSet depois que ele for mapeado para um documento XML carregado.
ru: Невозможно добавить или удалить таблицы из DataSet, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要 DataSet 被映射到加载的 XML 文档中，就不能在该 DataSet 中添加或移除表。
zh_hant: 一旦 DataSet 對應至載入的 XML 文件時，就無法從 DataSet 加入或移除資料表。

# DataDom_DataSetNestedRelationsChange
source: Cannot add, remove, or change Nested relations from the DataSet once the DataSet is mapped to a loaded XML document.
de: Geschachtelte Beziehungen des DataSets können nicht mehr hinzugefügt, entfernt, oder geändert werden, sobald das DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se pueden agregar, eliminar o cambiar relaciones anidadas de DataSet una vez que está asignada a un documento XML cargado.
fr: Impossible d'ajouter, de supprimer ou de changer des relations imbriquées à partir du DataSet une fois que le DataSet est mappé à un document XML chargé.
it: Impossibile aggiungere, rimuovere o modificare le relazioni Nested del DataSet dopo che questo è stato mappato a un documento XML caricato.
ja: DataSet が読み込まれた XML ドキュメントに割り当てられた後に、入れ子にされたデータセットのリレーションシップを追加、削除、または変更することはできません。
ko: DataSet이 로드된 XML 문서에 매핑된 후에는 DataSet에서 중첩 관계를 추가, 제거 또는 변경할 수 없습니다.
pt_br: Não será possível alterar o nome do DataSet depois que ele for mapeado para um documento XML carregado.
ru: Невозможно добавить, удалить или изменить вложенное отношение в DataSet, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要 DataSet 被映射到加载的 XML 文档中，就不能在该 DataSet 中添加、移除或更改嵌套的关系。
zh_hant: 資料集對應至載入的 XML 文件後，就無法從 DataSet 加入、移除或變更巢狀關聯。

# DataDom_DataSetNull
source: The DataSet parameter is invalid. It cannot be null.
de: Der DataSet-Parameter ist ungültig. Er darf nicht 'null' sein.
es: El parámetro DataSet no es válido. No puede ser null.
fr: Le paramètre DataSet n'est pas valide. Il ne peut pas être null.
it: Parametro di DataSet non valido. Non può essere null.
ja: DataSet パラメーターが無効です。null にすることはできません。
ko: DataSet 매개 변수가 잘못되었습니다. 이 매개 변수는 null일 수 없습니다.
pt_br: O parâmetro DataSet é inválido. Ele não pode ser null.
ru: Недопустимый параметр DataSet. Он не может иметь значение null.
zh_hans: 该 DataSet 参数无效。它不能为 null。
zh_hant: DataSet 參數無效。它不可為 null。

# DataDom_DataSetNameChange
source: Cannot change the DataSet name once the DataSet is mapped to a loaded XML document.
de: Der DataSet-Name kann nicht geändert werden, wenn der DataSet einem geladenen XML-Dokument zugeordnet ist.
es: No se puede cambiar el nombre de DataSet una vez que está asignada a un documento XML cargado.
fr: Impossible de changer le nom DataSet une fois que le DataSet est mappé à un document XML chargé.
it: Impossibile modificare il nome del DataSet dopo che questo è stato mappato a un documento XML caricato.
ja: DataSet が読み込まれた XML ドキュメントに割り当てられた後は DataSet 名を変更できません。
ko: DataSet이 로드된 XML 문서에 매핑된 후에는 DataSet 이름을 변경할 수 없습니다.
pt_br: Não será possível alterar o nome do DataSet depois que ele for mapeado para um documento XML carregado.
ru: Невозможно изменить имя DataSet, когда соответствующий DataSet сопоставлен загруженному документу XML.
zh_hans: 只要 DataSet 被映射到加载的 XML 文档中，就不能更改 DataSet 的名称。
zh_hant: 一旦 DataSet 對應至載入的 XML 文件時，就無法變更 DataSet 名稱。

# DataDom_CloneNode
source: This type of node cannot be cloned: {0}.
de: Dieser Knotentyp kann nicht geklont werden: {0}.
es: No se puede clonar este tipo de nodo: {0}.
fr: Ce type de noeud ne peut pas être cloné : {0}.
it: Impossibile duplicare questo tipo di nodo: {0}.
ja: この種類のノードは複製できません : {0}
ko: 이 형식의 노드를 복제할 수 없습니다. {0}
pt_br: O tipo do nó não pode ser clonado: {0}.
ru: Невозможно клонировать узел этого типа. {0}.
zh_hans: 此节点类型不能克隆: {0}。
zh_hant: 無法複製這種類型的節點: {0}。

# DataDom_MultipleLoad
source: Cannot load XmlDataDocument if it already contains data. Please use a new XmlDataDocument.
de: XmlDataDocument kann nicht geladen werden, wenn es bereits Daten enthält. Verwenden Sie ein neues XmlDataDocument.
es: No se puede cargar XmlDataDocument si ya contiene datos. Utilice un nuevo XmlDataDocument.
fr: Impossible de charger XmlDataDocument s'il contient déjà des données. Utilisez un nouveau XmlDataDocument.
it: Impossibile caricare XmlDataDocument se contiene già dati. Utilizzare una nuova classe XmlDataDocument.
ja: XmlDataDocument が既にデータを含んでいる場合はこの XmlDataDocument を読み込めません。新しい XmlDataDocument を使ってください。
ko: XmlDataDocument에 이미 데이터가 포함되어 있는 경우 로드할 수 없습니다. 새 XmlDataDocument를 사용하십시오.
pt_br: Não é possível carregar XmlDataDocument caso ele já contenha dados. Use um novo XmlDataDocument.
ru: Невозможно загрузить XmlDataDocument, если он уже содержит данные. Используйте новый XmlDataDocument.
zh_hans: 如果 XmlDataDocument 已经包含数据，则无法加载。请使用新的 XmlDataDocument。
zh_hant: 如果 XmlDataDocument 已經包含資料，就無法載入它。請使用新的 XmlDataDocument。
