Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ForeignKeyRelatedTableDescr
source: Indicates the child table of this constraint.
de: Gibt die untergeordnete Tabelle dieser Einschränkung an.
es: Indica la columnas secundaria de esta restricción.
fr: Indique la table enfant de cette contrainte.
it: Indica la tabella figlio del vincolo.
ja: この制約の子テーブルを示します。
ko: 이 제약 조건의 자식 테이블을 나타냅니다.
pt_br: Indica a tabela filho desta restrição.
ru: Указывает дочернюю таблицу для этого ограничения.
zh_hans: 指示此约束的子表。
zh_hant: 為此條件約束的子資料表。

# KeyConstraintColumnsDescr
source: Indicates the columns of this constraint.
de: Gibt die Spalten dieser Einschränkung an.
es: Indica las columnas de esta restricción.
fr: Indique les colonnes de cette contrainte.
it: Indica le colonne di questo vincolo.
ja: この制約の列を示します。
ko: 이 제약 조건의 열을 나타냅니다.
pt_br: Indica as colunas desta restrição.
ru: Указывает столбцы для этого ограничения.
zh_hans: 指示此约束的列。
zh_hant: 表示這個條件約束的資料行。

# KeyConstraintIsPrimaryKeyDescr
source: Indicates if this constraint is a primary key.
de: Gibt an, ob die Einschränkung ein Primärschlüssel ist.
es: Indica si esta restricción es de tipo PRIMARY KEY.
fr: Indique si cette contrainte est une clé primaire.
it: Indica se il vincolo è una chiave primaria.
ja: この制約がプライマリ キーかどうかを示します。
ko: 이 제약 조건이 기본 키인지 여부를 나타냅니다.
pt_br: Indica se esta restrição é uma chave primária.
ru: Указывает, является ли это ограничение первичным ключом.
zh_hans: 指示此约束是否是主键。
zh_hant: 表示此條件約束是否為主索引鍵。

# ConstraintNameDescr
source: Indicates the name of this constraint.
de: Gibt den Namen dieser Einschränkung an.
es: Indica el nombre de esta restricción.
fr: Indique le nom de cette contrainte.
it: Indica il nome del vincolo.
ja: この制約の名前を示します。
ko: 이 제약 조건의 이름을 나타냅니다.
pt_br: Indica o nome desta restrição.
ru: Указывает имя этого ограничения.
zh_hans: 指示此约束的名称。
zh_hant: 表示此條件約束的名稱。

# ConstraintTableDescr
source: Indicates the table of this constraint.
de: Gibt die Tabelle dieser Einschränkung an.
es: Indica la tabla de esta restricción.
fr: Indique la table de cette contrainte.
it: Indica la tabella del vincolo.
ja: この制約のテーブルを示します。
ko: 이 제약 조건의 테이블을 나타냅니다.
pt_br: Indica a tabela desta restrição.
ru: Указывает таблицу для этого ограничения.
zh_hans: 指示此约束的表。
zh_hant: 表示此條件約束的表格。

# DataColumnAllowNullDescr
source: Indicates whether null values are allowed in this column.
de: Gibt an, ob in dieser Spalte null-Werte erlaubt sind.
es: Indica si esta columna puede tener valores null.
fr: Indique si des valeurs null sont autorisées dans cette colonne.
it: Indica se sono consentiti valori null nella colonna.
ja: この列で Null を指定できるかどうかを示します。
ko: 이 열에 null 값을 사용할 수 있는지 여부를 나타냅니다.
pt_br: Indica se valores nulos são permitidos na coluna.
ru: Указывает, допускаются ли в этом столбце значения null.
zh_hans: 指示此列中是否允许包含 null 值。
zh_hant: 指示這個資料行中是否允許 null 值。

# DataColumnAutoIncrementDescr
source: Indicates whether the column automatically increments itself for new rows added to the table. The type of this column must be Int16, Int32, or Int64.
de: Gibt an, ob die Spalte automatisch neue Zeilen, die zur Spalte hinzugefügt wurden, inkrementiert. Der Typ der Spalte muss Int16, Int32 oder Int64 sein.
es: Indica si la columna se incrementa automáticamente con nuevas filas agregadas a la tabla. La columna debe ser de tipo Int16, Int32, o Int64.
fr: Indique si la colonne s'incrémente automatiquement pour les lignes ajoutées à la table. Le type de cette colonne doit être Int16, Int32 ou Int64.
it: Indica se il valore della colonna viene incrementato automaticamente quando si aggiungono nuove righe alla tabella. La colonna deve essere di tipo Int16, Int32 o Int64.
ja: テーブルに新たに追加された行に対して列が自動的にインクリメントするかどうかを示します。この列の型は、Int16、Int32 または Int64 でなければなりません。
ko: 테이블에 새 행이 추가되는 경우 해당 열이 자동으로 증가하는지 여부를 나타냅니다. 열 형식은 Int16, Int32 또는 Int64여야 합니다.
pt_br: Indica se a coluna se incrementa automaticamente com novas linhas adicionadas à tabela. O tipo desta coluna deve ser Int16, Int32 ou Int64.
ru: Указывает, увеличиваются ли значения в столбце автоматически при добавлении в таблицу новых строк. Этот столбец должен иметь тип Int16, Int32 или Int64.
zh_hans: 指示对于添加到该表的新行，该列是否自动递增。该列的类型必须是 Int16、Int32 或 Int64。
zh_hant: 表示針對要加入資料表的資料列，資料行是否自動累加本身。這個資料行的型別必須為 Int16、Int32 或 Int64。

# DataColumnAutoIncrementSeedDescr
source: Indicates the starting value for an AutoIncrement column.
de: Gibt den Startwert einer AutoIncrement-Spalte an.
es: Indica el valor inicial de la columna AutoIncrement.
fr: Indique la valeur de départ pour une colonne AutoIncrement.
it: Indica il valore iniziale di una colonna AutoIncrement.
ja: AutoIncrement 列の開始値を示します。
ko: AutoIncrement 열의 시작 값을 나타냅니다.
pt_br: Indica o valor inicial para uma coluna AutoIncrement.
ru: Указывает начальное значение для столбца AutoIncrement.
zh_hans: 指示 AutoIncrement 列的起始值。
zh_hant: 表示 AutoIncrement 資料行的起始值。

# DataColumnAutoIncrementStepDescr
source: Indicates the increment used by an AutoIncrement column.
de: Gibt die Schrittweite an, die von der AutoIncrement-Spalte verwendet wird.
es: Indica el incremento utilizado por la columna AutoIncrement.
fr: Indique l'incrément utilisé par une colonne AutoIncrement.
it: Indica l'incremento utilizzato da una colonna AutoIncrement.
ja: AutoIncrement 列で使用されるインクリメントを示します。
ko: AutoIncrement 열에서 사용하는 증분을 나타냅니다.
pt_br: Indica o incremento usado por uma coluna AutoIncrement.
ru: Указывает приращение, используемое в столбце AutoIncrement.
zh_hans: 指示 AutoIncrement 列所使用的增量。
zh_hant: 表示 AutoIncrement 資料行所使用的累加方式。

# DataColumnCaptionDescr
source: Indicates the default user-interface caption for this column.
de: Gibt die standardmäßige Schnittstellenbeschriftung für diese Spalte an.
es: Indica la leyenda predeterminada de la interfaz de usuario de esta columna.
fr: Indique la légende interface utilisateur par défaut pour cette colonne.
it: Indica l'etichetta di interfaccia predefinita della colonna.
ja: この列の、既定のユーザー インターフェイス タイトルを示します。
ko: 이 열의 기본 사용자 인터페이스 캡션을 나타냅니다.
pt_br: Indica a legenda da interface de usuário padrão para esta coluna.
ru: Указывает для этого столбца заголовок интерфейса пользователя по умолчанию.
zh_hans: 指示该列的默认用户界面标题。
zh_hant: 表示這個資料行的預設使用者介面標題。

# DataColumnColumnNameDescr
source: Indicates the name used to look up this column in the Columns collection of a DataTable.
de: Gibt den Namen an, der zum Suchen dieser Spalte in der Columns-Sammlung einer DataTable verwendet wurde.
es: Indica el nombre utilizado para buscar esta columna en la colección Columns de DataTable.
fr: Indique le nom utilisé pour rechercher cette colonne dans la collection Columns d'un DataTable.
it: Indica il nome usato per cercare questa colonna nella raccolta Columns di un oggetto DataTable.
ja: DataTable の列コレクションでこの列を検索するために使用される名前を示します。
ko: DataTable의 Columns 컬렉션에서 이 열을 찾는 데 사용되는 이름을 나타냅니다.
pt_br: Indica o nome usado para pesquisar esta coluna na coleção Columns de uma DataTable.
ru: Указывает имя, используемое для поиска этого столбца в коллекции столбцов из таблицы данных.
zh_hans: 指示用于在 DataTable 的列集合中查找此列的名称。
zh_hant: 表示在 DataTable 的 Columns 集合中用來查詢這個資料行的名稱。

# DataColumnDataTableDescr
source: Returns the DataTable to which this column belongs.
de: Gibt die DataTable zurück, zu der diese Spalte gehört.
es: Devuelve la tabla DataTable a la que pertenece esta columna.
fr: Retourne le DataTable auquel appartient cette colonne.
it: Restituisce la DataTable a cui appartiene questa colonna.
ja: この列が属する DataTable を返します。
ko: 이 열이 속해 있는 DataTable을 반환합니다.
pt_br: Retorna a DataTable à qual esta coluna pertence.
ru: Возвращает DataTable, которому принадлежит этот столбец.
zh_hans: 返回此列所属的 DataTable。
zh_hant: 傳回至這個資料行所屬的 DataTable。

# DataColumnDataTypeDescr
source: Indicates the type of data stored in this column.
de: Gibt den Datentyp an, der in dieser Spalte gespeichert wird.
es: Indica el tipo de datos almacenados en esta columna.
fr: Indique le type de données stockées dans cette colonne.
it: Indica il tipo di dati memorizzati in questa colonna.
ja: この列に保存されたデータの型を示します。
ko: 이 열에 저장된 데이터 형식을 나타냅니다.
pt_br: Indica o tipo dos dados armazenados na coluna.
ru: Указывает тип данных, хранящихся в этом столбце.
zh_hans: 指示在此列中存储的数据的类型。
zh_hant: 表示儲存在這個資料行中的資料類型。

# DataColumnDefaultValueDescr
source: Indicates the default column value used when adding new rows to the table.
de: Gibt den Standardspaltenwert an, der beim Hinzufügen von neuen Spalten zur Tabelle verwendet wird.
es: Indica el valor predeterminado de la columna utilizado al agregar nuevas filas a la tabla.
fr: Indique la valeur de la colonne par défaut utilisée lors de l'ajout de lignes à la table.
it: Indica il valore predefinito che assume la colonna quando si aggiungono nuove righe alla tabella.
ja: 新しい行をテーブルに追加するときに使う既定の列値を示します。
ko: 테이블에 새 행을 추가할 때 사용되는 기본 열 값을 나타냅니다.
pt_br: Indica o valor de coluna padrão usado ao serem adicionadas novas linhas à tabela.
ru: Указывает для столбца значение по умолчанию при добавлении строк в таблицу.
zh_hans: 指示向表中添加新行时所使用的默认列值。
zh_hant: 表示當加入新資料列至資料表時所使用的預設資料行值。

# DataColumnExpressionDescr
source: Indicates the value that this column computes for each row based on other columns instead of taking user input.
de: Gibt den Wert an, den diese Spalte für alle Zeilen basierend auf anderen Spalten anstatt der Benutzereingabe berechnet.
es: Indica el valor que esta columna calcula para cada fila basándose en otras columnas en vez de tener en cuenta la acción del usuario.
fr: Indique la valeur calculée par cette colonne pour chaque ligne à partir d'autres colonnes plutôt qu'à partir de l'entrée de l'utilisateur.
it: Indica il valore che questa colonna calcola per ciascuna riga derivandolo dai valori di altre colonne invece di utilizzare l'input dell'utente.
ja: この列が、ユーザー入力を取り込まずに、ほかの列に基づいて各行の計算した値を示します。
ko: 사용자가 직접 입력하는 대신 다른 열의 각 행에 대해 이 열에서 계산하는 값을 나타냅니다.
pt_br: Indica o valor calculado por esta coluna para cada linha com base em outras colunas em vez de obter entrada do usuário.
ru: Указывает значение, вычисляемое для каждой строки этого столбца на основе значений в других столбцах вместо ввода значения пользователем).
zh_hans: 指示该列根据其他列(而不是采用用户输入)为每行计算的值。
zh_hant: 表示這個資料行會根據其他的資料行來計算其每一個資料列的值，而不使用使用者的輸入。

# DataColumnMappingDescr
source: Indicates how this column persists in XML: as an attribute, element, simple content node, or nothing.
de: Gibt an, wie diese Spalte in XML beibehalten wird: als Attribut, Element, einfacher Textknoten oder überhaupt nicht.
es: Indica cómo persiste esta columna en XML: como atributo, elemento, nodo de contenido simple o nada.
fr: Indique comment cette colonne persiste en XML : en tant qu'attribut, élément, noeud de contenu simple ou rien.
it: Indica la modalità di persistenza di questa colonna nell'XML: attributo, elemento, nodo di contenuto semplice o nessuna.
ja: この列が XML 内に属性、要素、シンプル コンテンツ ノード、またはとして永続するか、あるいは永続しないかを示します。
ko: 이 열이 XML에서 특성, 요소, 단순 콘텐츠 노드로 지속되는지 또는 아무 것도 아닌지 나타냅니다.
pt_br: Indica como esta coluna é mantida no XML: como um atributo, elemento, nó de conteúdo simples ou nada.
ru: Указывает, как этот столбец сохраняется в XML: как атрибут, как элемент, как узел с простым содержимым или не сохраняется.
zh_hans: 指示该列如何保持在 XML 中: 作为特性、元素、简单文本节点还是无定义。
zh_hant: 表示這個資料行保存在 XML 中的方法: 當作屬性、元素、簡單內容節點，或無。

# DataColumnNamespaceDescr
source: Indicates the XML uri for elements or attributes stored in this column.
de: Gibt die XML-URI für Elemente oder Attribute an, die in dieser Spalte gespeichert sind.
es: Indica el identificador uri de XML para elementos o atributos almacenados en esta columna.
fr: Indique l'URI XML pour les éléments ou les attributs stockés dans cette colonne.
it: Indica l'URI XML per elementi o attributi archiviati in questa colonna.
ja: この列に格納される要素または属性の XML URI を示します。
ko: 이 열에 저장된 요소 또는 특성에 대한 XML URI를 나타냅니다.
pt_br: Indica o uri de XML para elementos ou atributos armazenados nesta coluna.
ru: Указывает URI XML для элементов или атрибутов, хранящихся в этом столбце.
zh_hans: 指示此列中存储的元素或特性的 XML URI。
zh_hant: 表示這個資料行中所儲存元素或屬性的 XML URI。

# DataColumnPrefixDescr
source: Indicates the Prefix used for this DataColumn in xml representation.
de: Gibt das Prefix an, das für diese DataColumn in der xml-Darstellung verwendet wird.
es: Indica el Prefix utilizado para esta DataColumn en la representación xml.
fr: Indique le Prefix utilisé pour ce DataColumn en représentation xml.
it: Indica Prefix utilizzato per questa DataColumn nella rappresentazione xml.
ja: xml 表現で、この DataColumn に使われる Prefix を示します。
ko: 이 DataColumn에 사용된 Prefix를 xml 표현으로 나타냅니다.
pt_br: Indica o Prefix usado para esta DataColumn na representação xml.
ru: Указывает префикс Prefix, используемый для этого DataColumn в представлении xml .
zh_hans: 指示 xml 表示形式中用于此 DataColumn 的 Prefix。
zh_hant: 表示這個 DataColumn 在 xml 表示法中所使用的 Prefix。

# DataColumnOrdinalDescr
source: Indicates the index of this column in the Columns collection.
de: Gibt den Index dieser Spalte in der Columns-Sammlung an.
es: Indica el índice de esta columna en la colección de Columns.
fr: Indique l'index de cette colonne dans la collection Columns.
it: Indica l'indice che identifica questa colonna nella raccolta Columns.
ja: Columns コレクションにおけるこの列のインデックスを示します。
ko: Columns 컬렉션에 있는 이 열의 인덱스를 나타냅니다.
pt_br: Indica o índice desta coluna na coleção Columns.
ru: Указывает индекс этого столбца в коллекции столбцов Columns.
zh_hans: 指示 Columns 集合中此列的索引。
zh_hant: 表示在 Columns 集合中這個資料行的索引。

# DataColumnReadOnlyDescr
source: Indicates whether this column allows changes once a row has been added to the table.
de: Gibt an, ob diese Spalte Änderungen zulässt, nachdem eine Zeile zu der Tabelle hinzugefügt wurde.
es: Indica si esta columna permite realizar cambios una vez agregada la fila a la tabla.
fr: Indique si cette colonne peut être modifiée une fois qu'une ligne a été ajoutée à la table.
it: Indica se questa colonna consente le modifiche dopo che è stata aggiunta una riga alla tabella.
ja: 行がテーブルに追加された後にこの列を変更できるかどうかを示します。
ko: 테이블에 행이 추가된 후 이 열에서 변경할 수 있는지 여부를 나타냅니다.
pt_br: Indica se esta coluna permitirá alterações depois que uma linha for adicionada à tabela.
ru: Указывает, допускаются ли изменения в этом столбце при добавлении в таблицу строки.
zh_hans: 指示向表中添加一行后此列是否允许更改。
zh_hant: 表示一旦將資料列加入資料表後，這個資料行是否允許變更。

# DataColumnUniqueDescr
source: Indicates whether this column should restrict its values in the rows of the table to be unique.
de: Gibt an, ob diese Spalte die Werte in den Zeilen der Tabelle auf eindeutige Werte einschränken sollte.
es: Indica si esta columna debe restringir los valores en las filas de la tabla para ser únicos.
fr: Indique si cette colonne doit limiter ses valeurs dans les lignes de la table afin d'être unique.
it: Indica se in questa colonna occorre impostare restrizioni sui valori contenuti nelle diverse righe della tabella affinché siano univoci.
ja: 列の値がテーブルの行内で一意になるように制限するかどうかを示します。
ko: 이 열에서 테이블 행의 값을 고유한 값으로 제한할지 여부를 나타냅니다.
pt_br: Indica se a coluna deve restringir que os valores nas linhas da tabela sejam únicos.
ru: Указывает, должны ли значения в строках этого столбца в данной таблице быть уникальными.
zh_hans: 指示此列是否应将其在表行中的值限制为唯一的。
zh_hant: 表示這個資料行是否應在資料表的資料行中限制其值必須為唯一。

# DataColumnMaxLengthDescr
source: Indicates the maximum length of the value this column allows.
de: Gibt die maximale Länge des in dieser Spalte zulässigen Werts an.
es: Indica la longitud máxima del valor que permite esta columna.
fr: Indique la longueur maximale de la valeur autorisée dans cette colonne.
it: Indica la lunghezza massima del valore che può essere inserito in questa colonna.
ja: この列に許可された長さの最大値を示します。
ko: 이 열에 허용되는 값의 최대 길이를 나타냅니다.
pt_br: Indica o comprimento máximo do valor permitido pela coluna.
ru: Указывает максимальную длину значения, которая допустима для этого столбца.
zh_hans: 指示此列所允许的值的最大长度。
zh_hant: 表示這個資料行允許長度的最大值。

# DataColumnDateTimeModeDescr
source: Indicates DateTimeMode of this DataColumn.
de: Gibt den DateTimeMode dieser DataColumn an.
es: Indica el DateTimeMode de esta DataColumn.
fr: Indique le DateTimeMode de cette propriété DataColumn.
it: Indica il DateTimeMode di questa DataColumn.
ja: この DataColumn の DateTimeMode を示します。
ko: 이 DataColumn의 DateTimeMode를 나타냅니다.
pt_br: Indica o DateTimeMode dessa DataColumn.
ru: Указывает DateTimeMode этого DataColumn.
zh_hans: 指示此 DataColumn 的 DateTimeMode。
zh_hant: 表示此 DataColumn 的 DateTimeMode。

# DataViewAllowDeleteDescr
source: Indicates whether this DataView and the user interface associated with it allows deletes.
de: Gibt an, ob diese DataView und die damit verbundene Schnittstelle Löschvorgänge zulassen.
es: Indica si DataView y la interfaz de usuario asociada permiten realizar eliminaciones.
fr: Indique si ce DataView et l'interface utilisateur associée permettent les suppressions.
it: Indica se questo DataView e l'interfaccia utente ad esso associata consentono le eliminazioni.
ja: この DataView と、関連するユーザー インターフェイスが削除できるかどうかを示します。
ko: 이 DataView 및 관련된 사용자 인터페이스에서 삭제할 수 있는지 여부를 나타냅니다.
pt_br: Indica se este DataView e a interface do usuário associada a ele permitem exclusões.
ru: Указывает, разрешено ли удаление для этого DataView и связанного с ним интерфейса пользователя.
zh_hans: 指示此 DataView 以及与之关联的用户界面是否允许删除。
zh_hant: 表示這個 DataView 和它關聯的使用者介面是否允許刪除。

# DataViewAllowEditDescr
source: Indicates whether this DataView and the user interface associated with it allows edits.
de: Gibt an, ob diese DataView und die damit verbundene Schnittstelle Bearbeitungsvorgänge zulassen.
es: Indica si DataView y la interfaz de usuario asociada permiten editar.
fr: Indique si ce DataView et l'interface utilisateur associée permettent les modifications.
it: Indica se questo DataView e l'interfaccia utente ad esso associata consentono le modifiche.
ja: この DataView と、関連するユーザー インターフェイスが編集できるかどうかを示します。
ko: 이 DataView 및 관련된 사용자 인터페이스에서 편집할 수 있는지 여부를 나타냅니다.
pt_br: Indica se este DataView e a interface do usuário associada a ele permitem edições.
ru: Указывает, разрешено ли редактирование для этого DataView и связанного с ним интерфейса пользователя.
zh_hans: 指示此 DataView 以及与之关联的用户界面是否允许编辑。
zh_hant: 表示這個 DataView 和它關聯的使用者介面是否允許編輯。

# DataViewAllowNewDescr
source: Indicates whether this DataView and the user interface associated with it allows new rows to be added.
de: Gibt an, ob diese DataView und die damit verbundene Schnittstelle das Hinzufügen von neuen Zeilen zulassen.
es: Indica si DataView y la interfaz de usuario asociada permiten agregar nuevas filas.
fr: Indique si ce DataView et l'interface utilisateur associée permettent l'ajout de nouvelles lignes.
it: Indica se questo DataView e l'interfaccia utente ad esso associata consentono l'aggiunta di righe.
ja: この DataView と、関連するユーザー インターフェイスに新しい行を追加できるかどうかを示します。
ko: 이 DataView 및 관련된 사용자 인터페이스에서 새 행을 추가할 수 있는지 여부를 나타냅니다.
pt_br: Indica se este DataView e a interface do usuário associada a ele permitem a adição de novas linhas.
ru: Указывает, разрешено ли добавление новых строк для этого DataView и связанного с ним интерфейса пользователя.
zh_hans: 指示此 DataView 以及与之关联的用户界面是否允许添加新行。
zh_hant: 表示這個 DataView 和它關聯的使用者介面是否允許加入新資料列。

# DataViewCountDescr
source: Returns the number of items currently in this view.
de: Gibt die Anzahl der Elemente zurück, die sich momentan in dieser Sicht befinden.
es: Devuelve el número de elementos actuales en esta vista.
fr: Retourne le nombre d'éléments actuellement dans cette vue.
it: Restituisce il numero di elementi presenti in questa vista.
ja: 現在このビューで表示されている項目の数を返します。
ko: 현재 이 뷰에 있는 항목 수를 반환합니다.
pt_br: Retorna o número de itens atualmente neste modo de exibição.
ru: Возвращает текущее число элементов в этом представлении.
zh_hans: 返回此视图中当前的项数。
zh_hant: 傳回目前在這個檢視表中的項目數目。

# DataViewDataViewManagerDescr
source: This returns a pointer to back to the DataViewManager that owns this DataSet (if any).
de: Gibt einen Zeiger an den DataViewManager zurück, der den DataSet besitzt (falls vorhanden).
es: Devuelve un puntero para volver a DataViewManager al que pertenece este DataSet (si hay alguno).
fr: Un pointeur est retourné au DataViewManager qui possède ce DataSet (éventuel).
it: Restituisce un puntatore al DataViewManager proprietario del DataSet (se esiste).
ja: これにより、この DataSet を所有する DataViewManager にポインターを返します。
ko: 이 DataSet이 있을 경우 이를 소유하는 DataViewManager에 포인터를 반환합니다.
pt_br: Isso retorna um ponteiro ao DataViewManager que detém a propriedade deste DataSet (se houver algum).
ru: Возвращает указатель назад на DataViewManager, которому принадлежит этот DataSet (если есть).
zh_hans: 这使指针返回到拥有此 DataSet 的 DataViewManager (如果有)。
zh_hant: 這會傳回一個指標到擁有這個 DataSet (如果有的話) 的 DataViewManager。

# DataViewIsOpenDescr
source: Indicates whether the view is open.
de: Gibt an, ob die Sicht geöffnet ist.
es: Indica si una vista está abierta.
fr: Indique si la vue est ouverte.
it: Indica se la vista è aperta.
ja: ビューが開かれているかどうかを示します。
ko: 뷰가 열려 있는지 여부를 나타냅니다.
pt_br: Indica se este modo de exibição está aberto.
ru: Указывает, открыто ли это представление.
zh_hans: 指示此视图是否处于打开状态。
zh_hant: 表示檢視表是否為開啟。

# DataViewRowFilterDescr
source: Indicates an expression used to filter the data returned by this DataView.
de: Gibt einen Ausdruck an, der verwendet wird, um die Daten zu filtern, die von dieser DataView zurückgegeben werden.
es: Indica una expresión utilizada para filtrar los datos devueltos por DataView.
fr: Indique une expression utilisée pour filtrer les données retournées par ce DataView.
it: Indica un'espressione utilizzata per filtrare i dati restituiti da questo DataView.
ja: この DataView によって返されたデータのフィルターに使われる式です。
ko: 이 DataView에서 반환된 데이터를 필터링하는 데 사용되는 식을 나타냅니다.
pt_br: Indica uma expressão usada para filtrar os dados retornados por este DataView.
ru: Указывает выражение, используемое для фильтрации данных, возвращаемых этим DataView.
zh_hans: 指示用于筛选此 DataView 返回的数据的表达式。
zh_hant: 表示用來篩選這個 DataView 傳回資料的運算式。

# DataViewRowStateFilterDescr
source: Indicates the versions of data returned by this DataView.
de: Gibt die Versionen der Daten an, die von dieser DataView zurückgegeben werden.
es: Indica las versiones de datos devueltos por DataView.
fr: Indique les versions des données retournées par ce DataView.
it: Indica le versioni dei dati restituiti da questo DataView.
ja: この DataView によって返されたデータのバージョンを示します。
ko: 이 DataView에서 반환된 데이터의 버전을 나타냅니다.
pt_br: Indica as versões dos dados retornados por este DataView.
ru: Указывает версии данных, возвращаемых этим DataView.
zh_hans: 指示此 DataView 返回的数据的版本。
zh_hant: 表示由這個 DataView 傳回的資料版本。

# DataViewSortDescr
source: Indicates the names of the column and the order in which data is returned by this DataView.
de: Gibt die Namen der Spalten und die Reihenfolge an, in der Daten von dieser DataView zurückgegeben werden.
es: Indica los nombres de la columna y el orden en el que DataView devuelve los datos.
fr: Indique les noms de la colonne et l'ordre dans lequel les données sont retournées par ce DataView.
it: Indica i nomi della colonna e l'ordine in cui vengono restituiti i dati da questo DataView.
ja: この DataView によって返されたデータの順序と列の名前を示します。
ko: 이 DataView에서 반환하는 데이터의 순서와 열의 이름을 나타냅니다.
pt_br: Indica os nomes da coluna e a ordem em que os dados são retornados por este DataView.
ru: Указывает имена столбцов и порядок возвращения данных этим DataView.
zh_hans: 指示列的名称和此 DataView 返回数据时所采用的顺序。
zh_hant: 表示由這個 DataView 傳回資料的資料行名稱與排列順序。
