Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataConstraint_ViolationValue
source: Column '{0}' is constrained to be unique. Value '{1}' is already present.
de: Die Spalte '{0}' hat die Einschränkung, dass sie eindeutig sein muss. Der Wert '{1}' ist bereits vorhanden.
es: La columna '{0}' está restringida para ser única. Ya está presente el valor '{1}'.
fr: La colonne '{0}' doit être unique. La valeur '{1}' est déjà présente.
it: La colonna '{0}' deve contenere valori univoci. Il valore '{1}' è già presente.
ja: 列 '{0}' は一意であるように制約されています。値 '{1}' は既に存在します。
ko: '{0}' 열은 고유 값을 가지도록 제약되어 있습니다. 값 '{1}'은(는) 이미 있습니다.
pt_br: A coluna '{0}' está restrita a conter valores exclusivos. O valor '{1}' já existe.
ru: На столбец "{0}" наложено ограничение по уникальности. Значение "{1}" уже имеется.
zh_hans: 列“{0}”被约束为是唯一的。值“{1}”已存在。
zh_hant: 資料行 '{0}' 被限制為唯一。值 '{1}' 已經存在。

# DataConstraint_NotInTheTable
source: Constraint '{0}' does not belong to this DataTable.
de: Die Einschränkung '{0}' gehört nicht zu dieser DataTable.
es: La restricción '{0}' no pertenece a esta DataTable.
fr: La contrainte '{0}' n'appartient pas à ce DataTable.
it: Il vincolo '{0}' non appartiene a questa DataTable.
ja: 制約 '{0}' はこの DataTable に属していません。
ko: 제약 조건 '{0}'이(가) 이 DataTable에 속하지 않습니다.
pt_br: A restrição '{0}' não pertence a esta DataTable.
ru: Ограничение "{0}" не принадлежит этому DataTable.
zh_hans: 约束“{0}”不属于此 DataTable。
zh_hant: 條件約束 '{0}' 不屬於這個 DataTable。

# DataConstraint_OutOfRange
source: Cannot find constraint {0}.
de: Die Einschränkung {0} wurde nicht gefunden.
es: No se puede encontrar la restricción {0}.
fr: Impossible de trouver la contrainte {0}.
it: Impossibile trovare il vincolo {0}.
ja: 制約 {0} が見つかりません。
ko: {0} 제약 조건을 찾을 수 없습니다.
pt_br: Não é possível encontrar a restrição {0}.
ru: Невозможно найти ограничение {0}.
zh_hans: 无法找到约束 {0}。
zh_hant: 找不到條件約束 {0}。

# DataConstraint_Duplicate
source: Constraint matches constraint named {0} already in collection.
de: Die Einschränkung stimmt mit der Einschränkung {0} überein, die sich bereits in der Sammlung befindet.
es: Esta restricción coincide con la restricción denominada {0}, que ya está en la colección.
fr: La contrainte correspond à la contrainte appelée {0} qui se trouve déjà dans la collection.
it: Il vincolo corrisponde al vincolo {0} già presente nella raccolta.
ja: {0} という制約に一致する制約が既にコレクションに存在します。
ko: 이름이 {0}인 제약 조건과 일치하는 제약 조건이 컬렉션에 이미 있습니다.
pt_br: Restrição corresponde à restrição chamada {0} que já existe na coleção.
ru: Данное ограничение идентично ограничению с именем {0}, которое уже имеется в коллекции.
zh_hans: 约束与集合中已有的名为 {0} 的约束匹配。
zh_hant: 條件約束符合集合中名為 {0} 的條件約束。

# DataConstraint_DuplicateName
source: A Constraint named '{0}' already belongs to this DataTable.
de: Eine Constraint mit dem Namen '{0}' gehört bereits zu dieser DataTable.
es: La Constraint denominada '{0}' ya pertenece a esta DataTable.
fr: Une Constraint appelée '{0}' appartient déjà à ce DataTable.
it: Un Constraint denominato '{0}' appartiene già a questo DataTable.
ja: '{0}' という Constraint は既にこの DataTable に属しています。
ko: 이름이 '{0}'인 Constraint가 이 DataTable에 이미 속해 있습니다.
pt_br: Uma Constraint nomeada '{0}' já pertence a esta DataTable.
ru: Ограничение Constraint с именем "{0}" уже принадлежит этому DataTable.
zh_hans: 名为“{0}”的 Constraint 已属于此 DataTable。
zh_hant: 名稱為 '{0}' 的 Constraint 已經屬於這個 DataTable。

# DataConstraint_UniqueViolation
source: These columns don't currently have unique values.
de: Diese Spalten haben momentan keine eindeutigen Werte.
es: Estas columnas no tienen valores únicos actualmente.
fr: Ces colonnes n'ont pas actuellement de valeurs uniques.
it: Queste colonne non contengono valori univoci.
ja: これらの列には現在一意の値が含まれていません。
ko: 이 열에는 현재 고유 값이 없습니다.
pt_br: Estas colunas não têm valores exclusivos no momento.
ru: Эти столбцы в данный момент не содержат уникальных значений.
zh_hans: 这些列当前不具有唯一值。
zh_hant: 這些資料行目前沒有唯一的值。

# DataConstraint_ForeignTable
source: These columns don't point to this table.
de: Diese Spalten zeigen nicht auf diese Tabelle.
es: Estas columnas no señalan a esta tabla.
fr: Ces colonnes ne pointent pas vers cette table.
it: Queste colonne non puntano a questa tabella.
ja: これらの列はこのテーブルをポイントしていません。
ko: 해당 열이 이 테이블을 가리키지 않습니다.
pt_br: Estas colunas não apontam para esta tabela.
ru: Эти столбцы не указывают на данную таблицу.
zh_hans: 这些列不指向此表。
zh_hant: 這些資料行沒有指向這個資料表。

# DataConstraint_ParentValues
source: This constraint cannot be enabled as not all values have corresponding parent values.
de: Diese Einschränkung kann nicht aktiviert werden, da nicht alle Werte entsprechende übergeordnete Werte besitzen.
es: No se puede habilitar esta restricción ya que todos los valores no tienen los valores primarios correspondientes.
fr: Cette contrainte ne peut pas être activée, car toutes les valeurs n'ont pas de valeurs parentes correspondantes.
it: Impossibile attivare questo vincolo. Non tutti i valori hanno valori padre corrispondenti.
ja: 対応する親の値が指定されてない値があるため、この制約を有効にできません。
ko: 모든 값이 각각 대응하는 부모 값을 갖지 않으므로 이 제약 조건을 사용할 수 없습니다.
pt_br: Esta restrição não pode ser ativada porque nem todos os valores possuem valores pai correspondentes.
ru: Невозможно включить это ограничение, т.к. не все значения имеют соответствующие родительские значения.
zh_hans: 不能启用此约束，因为不是所有的值都具有相应的父值。
zh_hant: 無法啟用這個條件約束，因為不是所有值都有相對應的父值。

# DataConstraint_AddFailed
source: This constraint cannot be added since ForeignKey doesn't belong to table {0}.
de: Diese Einschränkung kann nicht hinzugefügt werden, da ForeignKey nicht zu Tabelle {0} gehört.
es: No se puede agregar esta restricción porque ForeignKey no pertenece a la tabla {0}.
fr: Cette contrainte ne peut pas être ajoutée, car ForeignKey n'appartient pas à la table {0}.
it: Impossibile aggiungere il vincolo, perché ForeignKey non appartiene alla tabella {0}.
ja: ForeignKey がテーブル {0} に属していないため、この制約を追加できません。
ko: ForeignKey가 {0} 테이블에 속하지 않으므로 이 제약 조건을 추가할 수 없습니다.
pt_br: Esta restrição não pode ser adicionada porque ForeignKey não pertence à tabela {0}.
ru: Невозможно добавить это ограничение, т.к. ForeignKey не принадлежит таблице {0}.
zh_hans: 不能添加此约束，因为 ForeignKey 不属于表 {0}。
zh_hant: 無法加入這個條件約束，因為 ForeignKey 不屬於資料表 {0}。

# DataConstraint_RemoveFailed
source: Cannot remove a constraint that doesn't belong to this table.
de: Eine Einschränkung, die nicht zu dieser Tabelle gehört, kann nicht entfernt werden.
es: No se puede eliminar una restricción que no pertenece a esta tabla.
fr: Impossible de supprimer une contrainte qui n'appartient pas à cette table.
it: Impossibile rimuovere un vincolo che non appartiene a questa tabella.
ja: このテーブルに属していない制約を削除することはできません。
ko: 이 테이블에 속하지 않는 제약 조건은 제거할 수 없습니다.
pt_br: Não é possível remover uma restrição que não pertence a esta tabela.
ru: Невозможно удалить ограничение, не принадлежащее этой таблице.
zh_hans: 不能移除不属于该表的约束。
zh_hant: 無法移除不屬於這個資料表的條件約束。

# DataConstraint_NeededForForeignKeyConstraint
source: Cannot remove unique constraint '{0}'. Remove foreign key constraint '{1}' first.
de: Die eindeutige Einschränkung '{0}' kann nicht entfernt werden. Entfernen Sie zuerst die Fremdschlüsseleinschränkung '{1}'.
es: No se puede eliminar la restricción UNIQUE '{0}'. Elimine primero la restricción FOREIGN KEY '{1}'.
fr: Impossible de supprimer la contrainte unique '{0}'. Supprimez d'abord la contrainte de clé étrangère '{1}'.
it: Non è possibile rimuovere il vincolo univoco '{0}'. Rimuovere prima il vincolo '{1}' della chiave esterna.
ja: 一意性制約 '{0}' を削除できません。外部キー制約 '{1}' を最初に削除してください。
ko: UNIQUE 제약 조건 '{0}'을(를) 제거할 수 없습니다. 먼저 외래 키 제약 조건 '{1}'을(를) 제거하십시오.
pt_br: Não é possível remover restrição exclusiva '{0}'. Remova primeiro a restrição de chave estrangeira '{1}'.
ru: Невозможно переместить уникальное ограничение "{0}". Сначала удалите ограничение внешнего ключа "{1}".
zh_hans: 无法删除唯一约束“{0}”。首先删除外键约束“{1}”。
zh_hant: 無法移除唯一的條件約束 '{0}'。請先移除外部索引鍵條件約束 '{1}'。

# DataConstraint_CascadeDelete
source: Cannot delete this row because constraints are enforced on relation {0}, and deleting this row will strand child rows.
de: Diese Zeile kann nicht gelöscht werden, da für die Beziehung {0} Einschränkungen erzwungen werden, und das Löschen dieser Zeile untergeordnete Zeilen freilegen würde.
es: No se puede eliminar esta fila porque las restricciones están forzando la relación {0}, y si se elimina esta fila, las filas secundarias se deshabilitarán.
fr: Impossible de supprimer cette ligne, car les contraintes sont appliquées sur la relation {0}. La suppression de cette ligne rendra les lignes enfants orphelines.
it: Impossibile rimuovere questa colonna. I vincoli imposti sulla relazione {0} comporterebbero ripercussioni sulle righe figlio.
ja: 制約がリレーションシップ {0} で適用され、この行を削除すると子行が孤立するため、この行を削除できません。
ko: {0} 관계에 제약 조건이 적용되어 있으므로 이 행을 삭제할 수 없습니다. 삭제하면 자식 행이 고립됩니다.
pt_br: Não é possível excluir esta linha porque as restrições são aplicadas na relação {0}. A exclusão desta linha deixará as linhas filho desamparadas.
ru: Невозможно удалить эту строку, т.к. на отношение {0} наложены ограничения, и удаление этой строки вызовет конфликты в дочерних строках.
zh_hans: 不能删除此行，原因是约束在关系 {0} 上是强制的，并且删除此行将影响子行。
zh_hant: 無法刪除這個資料列，因為在關聯 {0} 上強制使用條件約束，而且刪除這個資料列將影響子資料列。

# DataConstraint_CascadeUpdate
source: Cannot make this change because constraints are enforced on relation {0}, and changing this value will strand child rows.
de: Diese Änderung kann nicht durchgeführt werden, da für die Beziehung {0} Einschränkungen erzwungen werden und durch Ändern dieses Wertes untergeordnete Zeilen freigelegt werden.
es: No se puede realizar este cambio porque las restricciones están forzando la relación {0}, y si se cambia este valor, las filas secundarias se deshabilitarán.
fr: Impossible d'apporter cette modification, car les contraintes sont appliquées sur la relation {0}. La modification de cette valeur rendra les lignes enfants orphelines.
it: Impossibile effettuare questa modifica. I vincoli imposti sulla relazione {0} comporterebbero ripercussioni sulle righe figlio.
ja: 制約がリレーションシップ {0} で適用され、この値を変更すると子行が孤立するため、変更できません。
ko: {0} 관계에 제약 조건이 적용되어 있으므로 변경할 수 없습니다. 이 값을 변경하면 자식 행이 고립됩니다.
pt_br: Não é possível fazer esta alteração porque as restrições são aplicadas na relação {0}. A alteração deste valor deixará as linhas filho desamparadas.
ru: Невозможно выполнить это изменение, т.к. на отношение {0} наложены ограничения, и изменение этого значения вызовет конфликты в дочерних строках.
zh_hans: 不能进行此更改，原因是约束在关系 {0} 上是强制的，并且更改此值将影响子行。
zh_hant: 無法進行這項變更，因為在關聯 {0} 上強制使用條件約束，而且變更這個值將影響子資料列。

# DataConstraint_ClearParentTable
source: Cannot clear table {0} because ForeignKeyConstraint {1} enforces constraints and there are child rows in {2}.
de: Die Tabelle {0} kann nicht gelöscht werden, da ForeignKeyConstraint {1} Einschränkungen erzwingt und sich untergeordnete Zeilen in {2} befinden.
es: No se puede borrar la tabla {0} porque ForeignKeyConstraint {1} fuerza las restricciones y hay filas secundarias en {2}.
fr: Impossible d'effacer la table {0}, car ForeignKeyConstraint {1} applique les contraintes et {2} contient des lignes enfants.
it: Impossibile cancellare la tabella {0}. I vincoli imposti da ForeignKeyConstraint {1} comporterebbero ripercussioni sulle righe figlio in {2}.
ja: ForeignKeyConstraint {1} によって制約が実行され、{2} に子行が存在するため、テーブル {0} を消去できません。
ko: ForeignKeyConstraint {1}(으)로 제약 조건을 적용하고 {2}에 자식 행이 있으므로 {0} 테이블을 지울 수 없습니다.
pt_br: Não é possível limpar a tabela {0} porque ForeignKeyConstraint {1} aplica restrições e existem linhas filho em {2}.
ru: Невозможно очистить таблицу {0}, т.к. ForeignKeyConstraint {1} налагает ограничения и в {2} содержатся дочерние строки.
zh_hans: 不能清除表 {0}，原因是 ForeignKeyConstraint {1} 强制约束，并且在 {2} 中有子行。
zh_hant: 無法清除資料表 {0}，因為 ForeignKeyConstraint {1} 強制使用條件約束，而且在 {2} 中有子資料列。

# DataConstraint_ForeignKeyViolation
source: ForeignKeyConstraint {0} requires the child key values ({1}) to exist in the parent table.
de: Für ForeignKeyConstraint {0} müssen die untergeordneten Schlüsselwerte ({1}) in der übergeordneten Tabelle vorhanden sein.
es: ForeignKeyConstraint {0} requiere que los valores clave secundarios ({1}) existan en la tabla primaria.
fr: ForeignKeyConstraint {0} a besoin des valeurs de clé enfant ({1}) dans la table parente.
it: ForeignKeyConstraint {0} richiede l'esistenza dei valori delle chiavi figlio ({1}) nella tabella padre.
ja: ForeignKeyConstraint {0} には親テーブルに存在している子キー値 ({1}) が必要です。
ko: ForeignKeyConstraint {0}을(를) 사용하려면 자식 키 값({1})이 부모 테이블에 있어야 합니다.
pt_br: ForeignKeyConstraint {0} exige que valores de chave filho ({1}) existam na tabela pai.
ru: Для ForeignKeyConstraint {0} требуется, чтобы в родительской таблице присутствовали значения дочерних ключей ({1}).
zh_hans: ForeignKeyConstraint {0} 要求在父表中存在子键值({1})。
zh_hant: ForeignKeyConstraint {0} 需要子索引鍵值 ({1}) 存在於父資料表。

# DataConstraint_BadObjectPropertyAccess
source: Property not accessible because '{0}'.
de: Auf die Eigenschaft kann nicht zugegriffen werden, da: '{0}'.
es: No se puede obtener acceso a la propiedad por la siguiente razón '{0}'.
fr: Propriété inaccessible, car '{0}'.
it: Proprietà non accessibile. '{0}'.
ja: 以下の理由によりプロパティにアクセスできません : '{0}'
ko: '{0}' 때문에 속성에 액세스할 수 없습니다.
pt_br: Propriedade não acessível porque '{0}'.
ru: Свойство недоступно, т.к. "{0}".
zh_hans: 无法访问属性，因为“{0}”。
zh_hant: 無法存取屬性，因為 '{0}'。

# DataConstraint_RemoveParentRow
source: Cannot remove this row because it has child rows, and constraints on relation {0} are enforced.
de: Diese Zeile kann nicht entfernt werden, da sie untergeordnete Zeilen enthält, und Einschränkungen für die Beziehung {0} erzwungen werden.
es: No se puede eliminar esta fila porque tiene filas secundarias, y las restricciones en la relación {0} están forzadas.
fr: Impossible de supprimer cette ligne, car elle a des lignes enfants et les contraintes sur la relation {0} sont appliquées.
it: Questa riga ha righe figlio. Impossibile rimuoverla per l'esistenza di vincoli sulla relazione {0}.
ja: この行を削除できません。この行には子行が含まれており、リレーションシップ {0} の制約が適用されます。
ko: 이 행은 자식 행을 포함하고 {0} 관계에 제약 조건이 적용되므로 제거할 수 없습니다.
pt_br: Não é possível remover esta linha porque ela possui linhas filho, e as restrições na relação {0} são aplicadas.
ru: Невозможно удалить эту строку, т.к. она имеет дочерние строки и на отношение {0} наложены ограничения.
zh_hans: 不能移除此行，原因是它具有子行，并且关系 {0} 上的约束是强制的。
zh_hant: 無法移除這個資料列，因為它擁有子資料列，而且強制使用關聯 {0} 上的條件約束。

# DataConstraint_AddPrimaryKeyConstraint
source: Cannot add primary key constraint since primary key is already set for the table.
de: Die Primärschlüsseleinschränkung kann nicht hinzugefügt werden, da der Primärschlüssel für die Tabelle bereits festgelegt wurde.
es: No se puede agregar una restricción PRIMARY KEY porque ya se estableció una clave principal para la tabla.
fr: Impossible d'ajouter une contrainte de clé primaire, car la clé primaire est déjà définie pour la table.
it: Impossibile aggiungere vincoli per la chiave primaria, perché la chiave primaria è già impostata per la tabella.
ja: 主キーは既にテーブルで設定されているので、主キーの制約を追加できません。
ko: 이 테이블에 기본 키가 이미 설정되어 있으므로 기본 키 제약 조건을 추가할 수 없습니다.
pt_br: Não é possível adicionar restrição de chave primária porque já foi definida uma chave primária para a tabela.
ru: Невозможно добавить ограничение для первичного ключа, т.к. для этой таблицы уже назначен первичный ключ.
zh_hans: 已经为该表设置了主键，因此无法添加主键约束。
zh_hant: 由於已設定該資料表的主索引鍵，所以無法再加入主索引鍵條件約束。

# DataConstraint_CantAddConstraintToMultipleNestedTable
source: Cannot add constraint to DataTable '{0}' which is a child table in two nested relations.
de: Die Einschränkung kann nicht zu DataTable '{0}' hinzugefügt werden, bei der es sich um eine untergeordnete Tabelle in zwei geschachtelten Beziehungen handelt.
es: No se puede añadir restricción a DataTable '{0}' que es una tabla secundaria en dos relaciones anidadas.
fr: Impossible d'ajouter une contrainte à DataTable '{0}' qui est une table enfant dans deux relations imbriquées.
it: Impossibile aggiungere un vincolo a DataTable '{0}' che è una tabella figlia con due relazioni annidate.
ja: 入れ子になった 2 つのリレーションシップでは、子テーブルである DataTable '{0}' に制約を追加することはできません。
ko: 두 개의 중첩 관계에서 자식 테이블인 DataTable '{0}'에 제약 조건을 추가할 수 없습니다.
pt_br: Não é possível adicionar restrição a DataTable '{0}', que é tabela filha em duas relações aninhadas.
ru: Не удалось добавить ограничение к DataTable "{0}", которая является дочерней таблицей в двух вложенных отношениях.
zh_hans: 不能将约束添加到作为两个嵌套关系中的子表的 DataTable“{0}”。
zh_hant: 無法對 DataTable '{0}' 新增約束，它是巢狀關聯的子資料表。

# DataKey_TableMismatch
source: Cannot create a Key from Columns that belong to different tables.
de: Für Spalten, die zu unterschiedlichen Tabellen gehören, kann kein Schlüssel erstellt werden.
es: No se puede crear una clave a partir de columnas que pertenecen a diferentes tablas.
fr: Impossible de créer une clé à partir de colonnes qui appartiennent à des tables différentes.
it: Impossibile creare una chiave da colonne appartenenti a tabelle diverse.
ja: 異なるテーブルに属する列からキーを作成することはできません。
ko: 다른 테이블에 속해 있는 열에서 키를 만들 수 없습니다.
pt_br: Não é possível criar uma chave de colunas que pertençam a tabelas diferentes.
ru: Невозможно создать ключ из столбцов, принадлежащих разным таблицам.
zh_hans: 不能根据属于多个不同表的列来创建键。
zh_hant: 無法從屬於不同資料表的資料行建立索引鍵。

# DataKey_NoColumns
source: Cannot have 0 columns.
de: Die Anzahl der Spalten kann nicht 0 sein.
es: No puede tener 0 columnas.
fr: Impossible d'avoir 0 colonne.
it: Impossibile avere 0 colonne.
ja: 0 個の列を指定することはできません。
ko: 0개의 열을 가질 수 없습니다.
pt_br: Não é possível ter 0 coluna.
ru: Число столбцов не может равняться 0.
zh_hans: 不能没有列。
zh_hant: 無法擁有 0 個資料行。

# DataKey_TooManyColumns
source: Cannot have more than {0} columns.
de: Mehr als {0} Spalten sind unzulässig.
es: No puede haber más de {0} columnas.
fr: Impossible d'avoir plus de {0} colonnes.
it: Impossibile avere più di {0} colonne.
ja: {0} 列を超える列を指定することはできません。
ko: {0}개가 넘는 열을 가질 수 없습니다.
pt_br: Não é possível ter mais de {0} colunas.
ru: Число столбцов не может превышать {0}.
zh_hans: 包含的列不能超过 {0} 个。
zh_hant: 無法擁有超過 {0} 個資料行。

# DataKey_DuplicateColumns
source: Cannot create a Key when the same column is listed more than once: '{0}'
de: Ein Schlüssel kann nicht erstellt werden, wenn dieselbe Spalte mehrmals aufgeführt wird: '{0}'
es: No se puede crear una clave cuando la misma columna aparece más de una vez: '{0}'
fr: Impossible de créer une clé lorsque la même colonne est répertoriée plusieurs fois : '{0}'
it: Impossibile creare una chiave quando la stessa colonna è elencata più di una volta: '{0}'
ja: 同じ列が 2 つ以上リストにある場合はキーを作成できません : '{0}'
ko: 동일한 열이 두 번 이상 나열된 경우 키를 만들 수 없습니다. '{0}'
pt_br: Não é possível criar uma chave quando a mesma coluna estiver listada mais de uma vez: '{0}'
ru: Невозможно создать ключ, когда один столбец участвует в перечислении несколько раз. "{0}"
zh_hans: 当同一个列被列出不只一次时，不能创建键:“{0}”
zh_hant: 當相同資料行列出多次時，無法建立索引鍵: '{0}'

# DataKey_RemovePrimaryKey
source: Cannot remove unique constraint since it's the primary key of a table.
de: Die eindeutige Einschränkung kann nicht entfernt werden, da sie der Primärschlüssel einer Tabelle ist.
es: No se puede eliminar una restricción UNIQUE porque es la clave principal de la tabla.
fr: Impossible de supprimer une contrainte unique, car il s'agit de la clé primaire d'une table.
it: Impossibile rimuovere il vincolo univoco perché è la chiave primaria di una tabella.
ja: テーブルの主キーであるため、一意性制約を削除できません。
ko: UNIQUE 제약 조건은 테이블의 기본 키이므로 제거할 수 없습니다.
pt_br: Não é possível remover restrição exclusiva porque ela é a chave primária de uma tabela.
ru: Невозможно удалить ограничение по уникальности, т.к. оно образует первичный ключ таблицы.
zh_hans: 唯一约束是表的主键，因此不能移除。
zh_hant: 無法移除唯一的條件約束，因為它是資料表的主索引鍵。

# DataKey_RemovePrimaryKey1
source: Cannot remove unique constraint since it's the primary key of table {0}.
de: Die eindeutige Einschränkung kann nicht entfernt werden, da sie der Primärschlüssel der Tabelle {0} ist.
es: No se puede eliminar una restricción UNIQUE porque es la clave principal de la tabla {0}.
fr: Impossible de supprimer une contrainte unique, car il s'agit de la clé primaire d'une table {0}.
it: Impossibile rimuovere il vincolo univoco perché è la chiave primaria della tabella {0}.
ja: テーブル {0} の主キーであるため、一意性制約を削除できません。
ko: UNIQUE 제약 조건은 {0} 테이블의 기본 키이므로 제거할 수 없습니다.
pt_br: Não é possível remover restrição exclusiva porque ela é a chave primária da tabela {0}.
ru: Невозможно удалить ограничение по уникальности, т.к. оно образует первичный ключ таблицы {0}.
zh_hans: 唯一约束是表 {0} 的主键，因此不能移除。
zh_hant: 無法移除唯一的條件約束，因為它是資料表 {0} 的主索引鍵。

# DataRelation_ColumnsTypeMismatch
source: Parent Columns and Child Columns don't have type-matching columns.
de: Übergeordnete Spalten und untergeordnete Spalten haben keine Spalten mit Typübereinstimmung.
es: Las columnas primarias y las columnas secundarias no tienen columnas que coincidan.
fr: Les types des colonnes parentes et des colonnes enfants ne correspondent pas.
it: Le colonne padre e le colonne figlio presentano tabelle di tipo non corrispondente.
ja: 親列および子列に型が一致する列が含まれていません。
ko: 부모 열과 자식 열에 형식이 일치하는 열이 없습니다.
pt_br: As colunas pai e filho não têm colunas de tipo correspondente.
ru: Среди родительских столбцов и дочерних столбцов отсутствуют столбцы совпадающих типов.
zh_hans: 父列和子列不具有类型匹配的列。
zh_hant: 父資料行和子資料行沒有型別相符的資料行。

# DataRelation_KeyColumnsIdentical
source: ParentKey and ChildKey are identical.
de: ParentKey und ChildKey sind identisch.
es: ParentKey y ChildKey son idénticos.
fr: ParentKey et ChildKey sont identiques.
it: ParentKey e ChildKey sono identiche.
ja: ParentKey と ChildKey が同一です。
ko: ParentKey와 ChildKey가 동일합니다.
pt_br: ParentKey e ChildKey são idênticos.
ru: ParentKey и ChildKey совпадают.
zh_hans: ParentKey 和 ChildKey 完全相同。
zh_hant: ParentKey 和 ChildKey 相同。

# DataRelation_KeyLengthMismatch
source: ParentColumns and ChildColumns should be the same length.
de: ParentColumns und ChildColumns sollten dieselbe Länge haben.
es: ParentColumns y ChildColumns deben tener la misma longitud.
fr: ParentColumns et ChildColumns doivent avoir la même longueur.
it: La lunghezza di ParentColumns e ChildColumns deve essere uguale.
ja: ParentColumns と ChildColumns は同じ長さでなければなりません。
ko: ParentColumns와 ChildColumns의 길이는 동일해야 합니다.
pt_br: ParentColumns e ChildColumns devem ter o mesmo comprimento.
ru: ParentColumns и ChildColumns должны иметь одинаковую длину.
zh_hans: ParentColumns 和 ChildColumns 的长度应当相同。
zh_hant: ParentColumns 和 ChildColumns 的長度必須相同。

# DataRelation_KeyZeroLength
source: ParentColumns and ChildColumns must not be zero length.
de: ParentColumns und ChildColumns dürfen nicht die Länge null haben.
es: ParentColumns y ChildColumns no pueden tener una longitud que sea cero.
fr: ParentColumns et ChildColumns ne doivent pas avoir une longueur égale à zéro.
it: La lunghezza di ParentColumns e ChildColumns deve essere diversa da zero.
ja: ParentColumns と ChildColumns の長さを 0 にすることはできません。
ko: ParentColumns과 ChildColumns의 길이는 0이 아니어야 합니다.
pt_br: ParentColumns e ChildColumns devem ter comprimento zero.
ru: ParentColumns и ChildColumns должны иметь ненулевую длину.
zh_hans: ParentColumns 和 ChildColumns 的长度不能为零。
zh_hant: ParentColumns 和 ChildColumns 的長度不可為零。

# DataRelation_ForeignRow
source: The row doesn't belong to the same DataSet as this relation.
de: Die Zeile gehört nicht zum selben DataSet wie diese Beziehung.
es: La fila no pertenece al mismo DataSet que la relación.
fr: La ligne n'appartient pas au même DataSet que cette relation.
it: La riga non appartiene allo stesso DataSet di questa relazione.
ja: この行は、このリレーションシップと同じ DataSet に属していません。
ko: 행이 이 관계와 동일한 DataSet에 속하지 않습니다.
pt_br: A linha não pertence ao mesmo DataSet que esta relação.
ru: Данная строка и это отношение принадлежат разным DataSet.
zh_hans: 该行不属于与此关系相同的 DataSet。
zh_hant: 資料列和這個關聯不屬於相同的 DataSet。
