Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_UnknownColumnEncryptionAlgorithm
source: Encryption algorithm '{0}' for the column in the database is either invalid or corrupted. Valid algorithms are: {1}.
de: Verschlüsselungsalgorithmus '{0}' für die Spalte der Datenbank ist ungültig oder beschädigt. Gültige Algorithmen sind: {1}.
es: El algoritmo de cifrado "{0}" de la columna en la base de datos no es válido o está corrupto. Los algoritmos válidos son: {1}.
fr: L’algorithme de chiffrement « {0} » de la colonne dans la base de données est non valide ou endommagé. Les algorithmes valides sont : {1}.
it: L'algoritmo di crittografia '{0}' per la colonna nel database non è valido oppure è danneggiato. Gli algoritmi validi sono: {1}.
ja: データベース内の列の暗号化アルゴリズム '{0}' が無効か破損しています。有効なアルゴリズムは {1} です。
ko: 데이터베이스의 열에 대한 암호화 알고리즘 '{0}'이(가) 잘못되었거나 손상되었습니다. 유효한 알고리즘은 {1}입니다.
pt_br: O algoritmo de criptografia '{0}' para a coluna no banco de dados é inválido ou está corrompido. Algoritmos válidos são: {1}.
ru: Алгоритм шифрования "{0}" для столбца в базе данных недопустим или поврежден. Допустимые алгоритмы: {1}.
zh_hans: 数据库中的列的加密算法“{0}”无效或已损坏。有效算法是: {1}。
zh_hant: 資料庫中資料行的加密演算法 '{0}' 無效或已損毀。有效的演算法為: {1}。

# TCE_UnknownColumnEncryptionAlgorithmId
source: Encryption algorithm id '{0}' for the column in the database is either invalid or corrupted. Valid encryption algorithm ids are: {1}.
de: Verschlüsselungsalgorithmus-ID '{0}' für die Spalte der Datenbank ist ungültig oder beschädigt. Gültige Verschlüsselungsalgorithmus-IDs sind: {1}.
es: El identificador de algoritmo de cifrado "{0}" de la columna en la base de datos no es válido o está dañado. Los identificadores de algoritmos válidos son: {1}.
fr: L’ID d’algorithme de chiffrement « {0} » de la colonne dans la base de données n’est pas valide ou est endommagé. Les ID d’algorithme de chiffrement valides sont : {1}.
it: L'ID dell'algoritmo di crittografia '{0}' specificato per la colonna nel database non è valido oppure è danneggiato. Gli ID di algoritmi di crittografia validi sono: {1}.
ja: データーベースの列の暗号化アルゴリズム ID '{0}' が無効か破損しています。有効な暗号化アルゴリズム ID は {1} です。
ko: 데이터베이스의 열에 대한 암호화 알고리즘 ID '{0}'이(가) 잘못되었거나 손상되었습니다. 유효한 암호화 알고리즘 ID는 {1}입니다.
pt_br: A ID do algoritmo de criptografia '{0}' para a coluna no banco de dados é inválida ou está corrompida. IDs de algoritmos válidos são: {1}.
ru: Идентификатор алгоритма шифрования "{0}" для столбца в базе данных недопустим или поврежден. Допустимые идентификаторы алгоритма шифрования: {1}.
zh_hans: 数据库中的列的加密算法 ID“{0}”无效或已损坏。有效算法 ID 是: {1}。
zh_hant: 資料庫中資料行的加密演算法識別碼 '{0}' 無效或已損毀。有效的加密演算法識別碼為: {1}。

# TCE_UnsupportedNormalizationVersion
source: Normalization version '{0}' received from {2} is not supported. Valid normalization versions are: {1}.
de: Normalisierungsversion '{0}', die von {2} erhalten wurde, ist ungültig oder beschädigt. Gültige Normalisierungsversionen sind: {1}.
es: La versión de normalización "{0}" recibida de {2} no es compatible. Las versiones de normalización válidas son: {1}.
fr: La version de normalisation « {0} » reçue de {2} n'est pas prise en charge. Les versions de normalisation valides sont : {1}.
it: La versione di normalizzazione '{0}' ricevuta da {2} non è supportata. Le versioni di normalizzazione valide sono: {1}.
ja: {2} から受け取った正規化バージョン '{0}' はサポートされていません。有効な正規化バージョンは {1} です。
ko: {2}에서 받은 정규화 버전 '{0}'이(가) 지원되지 않습니다. 유효한 정규화 버전은 {1}입니다.
pt_br: A versão de normalização '{0}' recebida do {2} não tem suporte. Versões de normalização válidas são: {1}.
ru: Версия нормализации "{0}", полученная от {2}, не поддерживается. Допустимые версии нормализации: {1}.
zh_hans: 不支持从 {2} 收到的规范化版本“{0}”。有效规范化版本是: {1}。
zh_hant: 不支援從 {2} 收到的正規化版本 '{0}'。有效的正規化版本為: {1}。

# TCE_UnrecognizedKeyStoreProviderName
source: Failed to decrypt a column encryption key. Invalid key store provider name: '{0}'. A key store provider name must denote either a system key store provider or a registered custom key store provider. Valid system key store provider names are: {1}. Valid (currently registered) custom key store provider names are: {2}. Please verify key store provider information in column master key definitions in the database, and verify all custom key store providers used in your application are registered properly.
de: Fehler beim Entschlüsseln eines Spaltenverschlüsselungsschlüssels. Ungültiger Name des Schlüsselspeicheranbieters: '{0}'. Der Name eines Schlüsselspeicheranbieters muss entweder einen Systemschlüsselspeicheranbieter oder einen registrierten benutzerdefinierten Schlüsselspeicheranbieter bezeichnen. Gültige Systemschlüsselspeicheranbieternamen sind: {1}. Gültige (derzeit registrierte) benutzerdefinierte Schlüsselspeicheranbieternamen sind: {2}. Prüfen Sie die Daten zu den Schlüsselspeicheranbietern in der Spalte mit den Hauptschlüsseldefinitionen in der Datenbank, und stellen Sie sicher, dass alle benutzerdefinierten Schlüsselspeicheranbieter, die in der Anwendung verwendet werden, korrekt registriert sind.
es: Error al descifrar una clave de cifrado de columnas. Nombre de proveedor de almacenamiento de claves no válido: "{0}". El nombre del proveedor de almacenamiento de claves debe denotar un proveedor de almacenamiento de claves de sistema o un proveedor de almacenamiento de claves personalizadas registrado. Los nombres de proveedores de almacenamiento de claves del sistema válidos son: {1}. Los nombres de proveedores de almacenamiento de claves personalizados válidos (registrados actualmente) son: {2}. Compruebe la información del proveedor de almacenamiento de claves en las definiciones de claves maestras de columnas de la base de datos y verifique que todos los proveedores de almacenamiento de claves personalizadas usados en la aplicación se han registrado correctamente.
fr: Échec du déchiffrement d’une clé de chiffrement de colonne. Nom de fournisseur de magasins de clés non valide : « {0} ». Un nom de fournisseur de magasins de clés doit désigner soit un fournisseur de magasins de clés système, soit un fournisseur de magasins de clés personnalisé inscrit. Les noms de fournisseurs de magasins de clés système valides sont : {1}. Les noms de fournisseurs de magasins de clés personnalisés (actuellement inscrits) valides sont : {2}. Vérifiez les informations de fournisseur de magasins de clés dans les définitions de clé principale de colonne dans la base de données. De même, vérifiez que tous les fournisseurs de magasins de clés personnalisés utilisés dans votre application sont correctement inscrits.
it: Non è stato possibile decrittografare una chiave di crittografia di colonna. Il nome del provider dell'archivio chiavi '{0}' non è valido. Un nome di provider dell'archivio chiavi deve indicare un provider dell'archivio chiavi di sistema oppure uno personalizzato registrato. I nomi dei provider dell'archivio chiavi di sistema validi sono: {1}. I nomi dei provider dell'archivio chiavi personalizzati attualmente registrati sono: {2}. Verificare le informazioni sul provider dell'archivio chiavi nelle definizioni di chiave master di colonna nel database; verificare inoltre che tutti i provider dell'archivio chiavi personalizzati usati nell'applicazione siano registrati correttamente.
ja: 列暗号化キーを暗号化解除できませんでした。キー ストア プロバイダー名 '{0}' が無効です。キー ストア プロバイダー名は、システム キー ストア プロバイダーまたは登録されたカスタム キー ストア プロバイダーを表している必要があります。有効なシステム キー ストア プロバイダー名は {1} です。有効な (現時点で登録済みの) カスタム キー ストア プロバイダー名は {2} です。データベースにある列マスター キー定義のキー ストア プロバイダー情報を確認し、アプリケーションで使用されているすべてのカスタム キー ストア プロバイダーが正しく登録されていることを確認してください。
ko: 열 암호화 키의 암호를 해독하지 못했습니다. 키 저장소 공급자 이름 '{0}'이(가) 잘못되었습니다. 키 저장소 공급자 이름은 시스템 키 저장소 공급자나 등록된 사용자 지정 키 저장소 공급자를 나타내야 합니다. 유효한 시스템 키 저장소 공급자 이름은 {1}입니다. 유효한(현재 등록된) 사용자 지정 키 저장소 공급자 이름은 {2}입니다. 데이터베이스의 열 마스터 키 정의에서 키 저장소 공급자 정보를 확인하고 응용 프로그램에서 사용된 모든 사용자 지정 키 저장소 공급자가 올바로 등록되어 있는지 확인하세요.
pt_br: Falha ao descriptografar uma chave de criptografia da coluna. Nome do provedor de repositório de chaves inválido: '{0}'. Um nome de provedor de repositório de chaves deve indicar um provedor de repositório de chaves do sistema ou um provedor de repositório de chaves personalizado registrado. Nomes de provedor válidos são: {1}. Nomes de provedor de repositório de chaves válidos (atualmente registrados) são: {2}. Verifique as informações do provedor de repositório de chaves nas definições de chave mestra de coluna no banco de dados e verifique se todos os provedores de repositório de chaves personalizados usados em seu aplicativo estão registrados corretamente.
ru: Не удалось расшифровать ключ шифрования столбца. Недопустимое имя поставщика хранилища ключей: "{0}". Имя поставщика хранилища ключей должно указывать на поставщика хранилища ключей системы или на зарегистрированного пользовательского поставщика хранилища ключей. Допустимые имена поставщиков хранилища ключей системы: {1}. Допустимые (зарегистрированные в настоящее время) имена пользовательских поставщиков хранилища ключей: {2}. Проверьте сведения о поставщике хранилища ключей в определениях главного ключа столбца в базе данных, а также убедитесь, что все пользовательские поставщики хранилища ключей, которые используются в вашем приложении, зарегистрированы надлежащим образом.
zh_hans: 未能解密列加密密钥。密钥存储提供程序名无效: {0}。密钥存储提供程序名必须表示系统密钥存储提供程序或已注册的自定义密钥存储提供程序。有效的系统密钥存储提供程序名是: {1}。有效的(当前已注册的)自定义密钥存储提供程序名是: {2}。请验证数据库中列主密钥定义中的密钥存储提供程序信息，并验证应用程序中使用的所有自定义密钥存储提供程序是否都正确注册。
zh_hant: 無法解密資料行加密金鑰。金鑰存放區提供者名稱無效: '{0}'。金鑰存放區提供者名稱必須代表系統金鑰存放區提供者或已登錄的自訂金鑰存放區提供者。有效的系統金鑰存放區提供者名稱為: {1}。有效 (目前已登錄) 的自訂金鑰存放區提供者名稱為: {2}。請確認資料庫中資料行主要金鑰定義中的金鑰存放區提供者資訊，並確認應用程式中的所有自訂金鑰存放區提供者，均已正確登錄。

# TCE_KeyDecryptionFailedCertStore
source: Failed to decrypt a column encryption key using key store provider: '{0}'. The last 10 bytes of the encrypted column encryption key are: '{1}'.
de: Fehler beim Entschlüsseln eines Spaltenverschlüsselungsschlüssels mithilfe des folgenden Schlüsselspeicheranbieters: '{0}'. Die letzten 10 Bytes des verschlüsselten Spaltenverschlüsselungsschlüssels sind: '{1}'.
es: Error al descifrar una clave de cifrado de columna mediante el proveedor de almacenamiento de claves: "{0}". Los 10 últimos bytes de la clave de cifrado de columna cifrada son: '{1}'.
fr: Échec du déchiffrement d’une clé de chiffrement de colonne à l’aide du fournisseur de magasins de clés « {0} ». Les 10 derniers octets de la clé de chiffrement de colonne chiffrée sont : « {1} ».
it: Non è stato possibile decrittografare una chiave di crittografia di colonna con il provider dell'archivio chiavi: '{0}'. Gli ultimi 10 byte della chiave di crittografia di colonna crittografata sono: '{1}'.
ja: キー ストア プロバイダー '{0}' を使用して列暗号化キーを暗号化解除できませんでした。暗号化された列暗号化キーの最後の 10 バイトは '{1}' です。
ko: 키 저장소 공급자 '{0}'을(를) 사용하여 열 암호화 키의 암호를 해독하지 못했습니다. 암호화된 열 암호화 키의 마지막 10바이트는 '{1}'입니다.
pt_br: Falha ao descriptografar uma chave de criptografia de coluna usando o provedor de repositório de chaves: '{0}'. Os últimos 10 bytes da chave de criptografia da coluna criptografada são: '{1}'.
ru: Не удалось расшифровать ключ шифрования столбца с помощью поставщика хранилища ключей: "{0}". Последние 10 байт ключа шифрования для зашифрованного столбца: "{1}".
zh_hans: 未能使用密钥存储提供程序解密列加密密钥: {0}。加密的列加密密钥的最后 10 个字节是“{1}”。
zh_hant: 無法使用金鑰存放區提供者 '{0}' 解密資料行加密金鑰。加密資料行的加密金鑰前 10 個位元組為: '{1}'。

# TCE_UntrustedKeyPath
source: Column master key path '{0}' received from server '{1}' is not a trusted key path.
de: Der Pfad des Spaltenhauptschlüssels '{0}', der vom Server '{1}' empfangen wurde, ist kein vertrauenswürdiger Schlüsselpfad.
es: La ruta de clave maestra de columna "{0}" recibida del servidor "{1}" no es una ruta de clave de confianza.
fr: Le chemin d’accès de clé principale de colonne « {0} » reçu du serveur « {1} » n’est pas un chemin d’accès de clé approuvé.
it: Il percorso di chiave master di colonna '{0}' ricevuto dal server '{1}' non è attendibile.
ja: サーバー '{1}' から受け取った列マスター キーのパス '{0}' は、信頼されたキーのパスではありません。
ko: '{1}' 서버에서 받은 열 마스터 키 경로 '{0}'이(가) 신뢰할 수 있는 키 경로가 아닙니다.
pt_br: O caminho da chave mestra de coluna '{0}' recebido do servidor '{1}' não é um caminho de chave confiável.
ru: Путь к главному ключу столбца "{0}", полученный от сервера "{1}", не является действительным путем ключа.
zh_hans: 从服务器“{1}”收到的列主密钥路径“{0}”不是受信任的密钥路径。
zh_hant: 從伺服器 '{1}' 收到的資料行主要金鑰路徑 '{0}' 不是信任的金鑰路徑。

# TCE_KeyDecryptionFailed
source: Failed to decrypt a column encryption key using key store provider: '{0}'. Verify the properties of the column encryption key and its column master key in your database. The last 10 bytes of the encrypted column encryption key are: '{1}'.
de: Fehler beim Entschlüsseln eines Spaltenverschlüsselungsschlüssels mithilfe des folgenden Schlüsselspeicheranbieters: '{0}'. Überprüfen Sie die Eigenschaften des Spaltenverschlüsselungsschlüssels und des Spaltenhauptschlüssels in der Datenbank. Die letzten 10 Bytes des verschlüsselten Spaltenverschlüsselungsschlüssels sind: '{1}'.
es: Error al descifrar una clave de cifrado de columna mediante el proveedor de almacenamiento de claves: "{0}". Verifique las propiedades de la clave de cifrado de columna y su clave maestra de columna en la base de datos. Los 10 últimos bytes de la clave de cifrado de columna cifrada son: '{1}'.
fr: Échec du déchiffrement d’une clé de chiffrement de colonne à l’aide du fournisseur de magasins de clés « {0} ». Vérifiez les propriétés de la clé de chiffrement de colonne et sa clé principale de colonne dans votre base de données. Les 10 derniers octets de la clé de chiffrement de colonne chiffrée sont : « {1} ».
it: Non è stato possibile decrittografare una chiave di crittografia di colonna con il provider dell'archivio chiavi: '{0}'. Verificare le proprietà della chiave di crittografia di colonna e la relativa chiave master di colonna nel database. Gli ultimi 10 byte della chiave di crittografia di colonna crittografata sono: '{1}'.
ja: キー ストア プロバイダー '{0}' を使用して列暗号化キーを暗号化解除できませんでした。データーベースにある列暗号化キーのプロパティと列マスター キーを確認してください。暗号化された列暗号化キーの最後の 10 バイトは '{1}' です。
ko: 키 저장소 공급자 '{0}'을(를) 사용하여 열 암호화 키의 암호를 해독하지 못했습니다. 데이터베이스에서 열 암호화 키 및 해당하는 열 마스터 키의 속성을 확인하세요. 암호화된 열 암호화 키의 마지막 10바이트는 '{1}'입니다.
pt_br: Falha ao descriptografar uma chave de criptografia da coluna usando o provedor de repositório de chave: '{0}'. Verifique as propriedades da chave de criptografia da coluna e sua chave mestra de coluna em seu banco de dados. Os últimos 10 bytes da chave de criptografia da coluna criptografada são: '{1}'.
ru: Не удалось расшифровать ключ шифрования столбца с помощью поставщика хранилища ключей: "{0}". Проверьте свойства ключа шифрования столбца и его главный ключ столбца в базе данных. Последние 10 байт ключа шифрования для зашифрованного столбца: "{1}".
zh_hans: 未能使用密钥存储提供程序解密列加密密钥: {0}。请验证数据库中列加密密钥及其列主密钥的属性。加密的列加密密钥的最后 10 个字节是“{1}”。
zh_hant: 無法使用金鑰存放區提供者 '{0}' 解密資料行加密金鑰。請確認資料庫中資料行加密金鑰及其資料行主要金鑰的屬性。加密資料行的加密金鑰前 10 個位元組為: '{1}'。

# TCE_UnsupportedDatatype
source: Encryption and decryption of data type '{0}' is not supported.
de: Die Verschlüsselung und Entschlüsselung des Datentyps '{0}' wird nicht unterstützt.
es: El cifrado y descifrado de tipo de datos "{0}" no es compatible.
fr: Le chiffrement et le déchiffrement du type de données « {0} » ne sont pas pris en charge.
it: La crittografia e la decrittografia del tipo di dati '{0}' non sono supportate.
ja: データ型 '{0}' の暗号化と暗号化解除はサポートされていません。
ko: 데이터 형식 '{0}'의 암호화와 암호 해독은 지원되지 않습니다.
pt_br: Não há suporte para a criptografia e a descriptografia do tipo de dados '{0}'.
ru: Шифрование и расшифровка типа данных "{0}" не поддерживается.
zh_hans: 不支持数据类型“{0}”的加密和解密。
zh_hant: 不支援資料類型 '{0}' 的加密及解密。

# TCE_DecryptionFailed
source: Decryption failed. The last 10 bytes of the encrypted column encryption key are: '{0}'. The first 10 bytes of ciphertext are: '{1}'.
de: Fehler beim Entschlüsseln. Die letzten 10 Bytes des verschlüsselten Spaltenverschlüsselungsschlüssels sind: '{0}'. Die ersten 10 Bytes des Chiffretexts sind: '{1}'.
es: Se produjo un error durante el descifrado. Los últimos 10 bytes de la clave de cifrado de columna cifrada son: "{0}". Los primeros 10 bytes de texto cifrado son: "{1}".
fr: Échec du chiffrement. Les 10 derniers octets de la clé de chiffrement de colonne chiffrée sont : « {0} ». Les 10 premiers octets du texte de chiffrement sont : « {1} ».
it: Decrittografia non riuscita. Gli ultimi 10 byte della chiave di crittografia di colonna crittografata sono: '{0}'. I primi 10 byte del testo crittografato sono: '{1}'.
ja: 暗号化解除に失敗しました。暗号化された列暗号化キーの最後の 10 バイトは '{0}' です。暗号化テキストの最初の 10 バイトは '{1}' です。
ko: 암호를 해독하지 못했습니다. 암호화된 열 암호화 키의 마지막 10바이트는 '{0}'입니다. 암호 텍스트의 처음 10바이트는 '{1}'입니다.
pt_br: Falha de descriptografia. Os últimos 10 bytes da chave de criptografia da coluna criptografada são: '{0}'. Os primeiros 10 bytes de texto cifrado são: '{1}'.
ru: Сбой расшифровки. Последние 10 байт ключа шифрования зашифрованного столбца: "{0}". Первые 10 байт зашифрованных данных: "{1}".
zh_hans: 解密失败。加密列的加密密钥的最后 10 个字节是: {0}。密码文本的前 10 个字节是: {1}。
zh_hant: 加密失敗。加密資料行加密金鑰的最後 10 個位元組為: '{0}'。加密文字的前 10 個位元組為: '{1}'。

# TCE_ExceptionWhenGeneratingEnclavePackage
source: Error encountered while generating package to be sent to enclave. Error message: {0}
de: Fehler beim Generieren des Pakets zum Senden an Enclave. Fehlermeldung: {0}
es: Error al generar el paquete para enviarlo al enclave. Mensaje de error: {0}
fr: Erreur rencontrée durant la génération du package à envoyer à l'enclave. Message d'erreur : {0}
it: Si è verificato un errore durante la generazione del pacchetto da inviare all'enclave. Messaggio di errore: {0}
ja: エンクレーブに送信するパッケージを生成中にエラーが発生しました。エラー メッセージ: {0}
ko: enclave로 전송될 패키지를 생성하는 동안 오류가 발생했습니다. 오류 메시지: {0}
pt_br: Erro encontrado ao gerar o pacote a ser enviado ao enclave. Mensagem de erro: {0}
ru: Произошла ошибка при создании пакета для отправки в анклав. Сообщение об ошибке: {0}
zh_hans: 生成要发送到 enclave 的包时出错。错误消息: {0}
zh_hant: 產生要傳送至 enclave 的套件時發生錯誤。錯誤訊息: {0}

# TCE_InvalidKeyIdUnableToCastToUnsignedShort
source: Internal Error. The given key id '{0}' is not valid. Error occurred when converting the key id to unsigned short. Error Message: {1}
de: Interner Fehler. Die angegebene Schlüssel-ID "{0}" ist ungültig. Fehler beim Konvertieren der Schlüssel-ID in "unsigned short". Fehlermeldung: {1}
es: Error interno. El identificador de clave especificado "{0}" no es válido. Error al convertir el identificador de clave en un valor corto sin firmar. Mensaje de error: {1}
fr: Erreur interne. L'ID de clé spécifié '{0}' est non valide. Une erreur s'est produite durant la conversion de l'ID de clé en entier court non signé. Message d'erreur : {1}
it: Errore interno. L'ID chiave specificato '{0}' non è valido. Si è verificato un errore durante la conversione dell'ID chiave in Unsigned Short. Messaggio di errore: {1}
ja: 内部エラーです。指定されたキー ID '{0}' が無効です。キー ID を unsigned short に変換するときにエラーが発生しました。エラー メッセージ: {1}
ko: 내부 오류가 발생했습니다. 지정된 키 ID '{0}'이(가) 잘못되었습니다. 키 ID를 부호 없는 short로 변환할 때 오류가 발생했습니다. 오류 메시지: {1}
pt_br: Erro Interno. A id da chave fornecida '{0}' não é válida. Ocorreu um erro ao converter a id da chave para curto sem sinal. Mensagem de Erro: {1}
ru: Внутренняя ошибка. Указанный идентификатор ключа "{0}" недопустим. Произошла ошибка при преобразовании идентификатора ключа в короткое беззнаковое целое число. Сообщение об ошибке: {1}
zh_hans: 出现内部错误。给定的密钥 ID“{0}”无效。将密钥 ID 转换为无符号短整型时出错。错误消息: {1}
zh_hant: 內部錯誤。指定的金鑰識別碼 '{0}' 無效。將金鑰識別碼轉換成不帶正負號的簡短整數時發生錯誤。錯誤訊息: {1}

# TCE_InvalidDatabaseIdUnableToCastToUnsignedInt
source: Internal Error. The given database id '{0}' is not valid. Error occurred when converting the database id to unsigned int. Error Message: {1}
de: Interner Fehler. Die angegebene Datenbank-ID "{0}" ist ungültig. Fehler beim Konvertieren der Datenbank-ID in "unsigned int". Fehlermeldung: {1}
es: Error interno. El identificador de base de datos especificado "{0}" no es válido. Error al convertir el identificador de base de datos en un valor entero sin firmar. Mensaje de error: {1}
fr: Erreur interne. L'ID de base de données spécifié '{0}' est non valide. Une erreur s'est produite durant la conversion de l'ID de base de données en entier non signé. Message d'erreur : {1}
it: Errore interno. L'ID database specificato '{0}' non è valido. Si è verificato un errore durante la conversione dell'ID database in Unsigned Integer. Messaggio di errore: {1}
ja: 内部エラーです。指定したデータベース ID '{0}' が無効です。データベース ID を unsigned int に変換するときにエラーが発生しました。エラー メッセージ: {1}
ko: 내부 오류가 발생했습니다. 지정된 데이터베이스 ID '{0}'이(가) 잘못되었습니다. 데이터베이스 ID를 부호 없는 정수로 변환할 때 오류가 발생했습니다. 오류 메시지: {1}
pt_br: Erro Interno. A id do banco de dados fornecida '{0}' não é válida. Ocorreu um erro ao converter a ID do banco de dados para o int sem sinal. Mensagem de Erro: {1}
ru: Внутренняя ошибка. Указанный идентификатор базы данных "{0}" недопустим. Произошла ошибка при преобразовании идентификатора базы данных в беззнаковое целое число. Сообщение об ошибке: {1}
zh_hans: 出现内部错误。给定的数据库 ID“{0}”无效。将数据库 ID 转换为无符号整数时出错。错误消息: {1}
zh_hant: 內部錯誤。指定的資料庫識別碼 '{0}' 無效。將資料庫識別碼轉換成不帶正負號的整數時發生錯誤。錯誤訊息: {1}

# TCE_InvalidAttestationParameterUnableToConvertToUnsignedInt
source: Invalid attestation parameters specified by the enclave provider for enclave type '{0}'. Error occurred when converting the value '{1}' of parameter '{2}' to unsigned int. Error Message: {3}
de: Der Enclave-Anbieter hat ungültige Nachweisparameter für den Enclave-Typ "{0}" angegeben. Fehler beim Konvertieren des Werts "{1}" von Parameter "{2}" in "unsigned int". Fehlermeldung: {3}
es: Parámetros de atestación no válidos especificados por el proveedor de enclave para el tipo de enclave "{0}". Error al convertir el valor "{1}" del parámetro "{2}" en un valor entero sin firmar. Mensaje de error: {3}
fr: Paramètres d'attestation non valides spécifiés par le fournisseur d'enclave pour le type d'enclave '{0}'. Une erreur s'est produite durant la conversion de la valeur '{1}' du paramètre '{2}' en entier non signé. Message d'erreur : {3}
it: I parametri di attestazione specificati dal provider di enclave per il tipo di enclave '{0}' non sono validi. Si è verificato un errore durante la conversione del valore '{1}' del parametro '{2}' in Unsigned Integer. Messaggio di errore: {3}
ja: エンクレーブ プロバイダーによってエンクレーブ型 '{0}' に指定された構成証明パラメーターが無効です。パラメーター '{2}' の値 '{1}' を unsigned int に変換しているときにエラーが発生しました。エラー メッセージ: {3}
ko: enclave 형식 '{0}'에 대해 enclave 공급자가 지정한 증명 매개 변수가 잘못되었습니다. 매개 변수 '{2}'의 값 '{1}'을(를) 부호 없는 정수로 변환하는 중 오류가 발생했습니다. 오류 메시지: {3}
pt_br: Parâmetros do atestado inválidos especificados pelo provedor de enclave para o tipo de enclave '{0}'. Ocorreu um erro ao converter o valor '{1}' do parâmetro '{2}' para int sem sinal. Mensagem de Erro: {3}
ru: Поставщик анклава указал недопустимые параметры аттестации для типа анклава "{0}". Произошла ошибка при преобразовании значения "{1}" параметра "{2}" в беззнаковое целое число. Сообщение об ошибке: {3}
zh_hans: Enclave 提供程序为 enclave 类型“{0}”指定的证明参数无效。将参数“{2}”的值“{1}”转换为无符号整数时出错。错误消息: {3}
zh_hant: enclave 提供者為 enclave 類型 '{0}' 指定的證明參數無效。將參數 '{2}' 的值 '{1}' 轉換成不帶正負號的整數時發生錯誤。錯誤訊息: {3}
