Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataStorage_ProblematicChars
source: The DataSet Xml persistency does not support the value '{0}' as Char value, please use Byte storage instead.
de: Die DataSet Xml-Persistenz unterstützt den Wert '{0}' nicht als Char-Wert. Verwenden Sie stattdessen den Byte-Speicher.
es: La persistencia DataSet Xml no admite el valor '{0}' como valor Char; utilice el almacenamiento de Byte en su lugar.
fr: La persistance Xml DataSet ne prend pas en charge la valeur '{0}' en tant que valeur Char, utilisez plutôt le stockage Byte.
it: La persistenza DataSet Xml non supporta il valore '{0}' come Char. Utilizzare un archivio Byte.
ja: DataSet Xml 持続性は、値 '{0}' を Char 値としてサポートしません。Byte ストレージを使用してください。
ko: DataSet Xml 지속성은 '{0}' 값을 Char 값으로 지원하지 않습니다. Byte 저장소를 대신 사용하세요.
pt_br: A persistência DataSet Xml não dá suporte para o valor '{0}' como valor Char. Em seu lugar, use armazenamento em Byte.
ru: Режим хранения Xml DataSet не поддерживает значение "{0}" как значение типа Char, используйте хранилище данных типа Byte.
zh_hans: DataSet Xml 持久性不支持值“{0}”为 Char 值，请改用 Byte 存储。
zh_hant: DataSet Xml 永續性不支援值 '{0}' 當作 Char 值，請改用 Byte 存放區。

# DataStorage_SetInvalidDataType
source: Type of value has a mismatch with column type
de: Der Typ des Werts stimmt nicht mit dem Spaltentyp überein
es: El tipo de valor no coincide con el tipo de columna
fr: Le type de valeur ne correspond pas au type de colonne
it: Il tipo di valore non è conforme al tipo di colonna
ja: 値の型が列の型と合いません。
ko: 값의 유형이 열 유형과 일치하지 않습니다.
pt_br: Tipo de valor incompatível com tipo de coluna
ru: Тип значения не соответствует типу столбца.
zh_hans: 值类型与列类型不匹配
zh_hant: 值型別與資料行類型不符

# DataStorage_IComparableNotDefined
source: Type '{0}' does not implement IComparable interface. Comparison cannot be done.
de: Der Typ '{0}' implementiert nicht die IComparable-Schnittstelle. Es erfolgt kein Vergleich.
es: El tipo '{0}' no implementa la interfaz IComparable. No se puede realizar la comparación.
fr: Le type '{0}' n'implémente pas l'interface IComparable. Comparaison impossible.
it: Il tipo "{0}" non implementa l'interfaccia IComparable. Impossibile eseguire il confronto.
ja: 型 '{0}' には IComparable インターフェイスは実装されていません。比較を実行できません。
ko: 유형 '{0}'이(가) IComparable 인터페이스를 구현하지 않습니다. 비교를 완료할 수 없습니다.
pt_br: Tipo '{0}' não implementa interface IComparable. Não é possível fazer comparação.
ru: Тип "{0}" не содержит реализации интерфейса IComparable. Сравнение невозможно.
zh_hans: 类型“{0}”不实现 IComparable 接口。无法进行比较。
zh_hant: 型別 '{0}' 無法實作 IComparable 介面。無法完成比較。

# DataView_SetFailed
source: Cannot set {0}.
de: {0} kann nicht festgelegt werden.
es: No se puede establecer {0}.
fr: Impossible de définir {0}.
it: Impossibile impostare {0}.
ja: {0} を設定できません。
ko: {0}을(를) 설정할 수 없습니다.
pt_br: Não é possível definir {0}.
ru: Невозможно задать {0}.
zh_hans: 不能设置 {0}。
zh_hant: 無法設定 {0}。

# DataView_SetDataSetFailed
source: Cannot change DataSet on a DataViewManager that's already the default view for a DataSet.
de: Ein DataSet kann in DataViewManager nicht geändert werden, wenn diese bereits die Standardsicht eines DataSets ist.
es: No se puede cambiar DataSet en DataViewManager, ya que es la vista predeterminada de DataSet.
fr: Impossible de changer DataSet dans un DataViewManager qui est déjà la vue par défaut d'un DataSet.
it: Impossibile modificare DataSet su un DataViewManager che è già la vista predefinita di un DataSet.
ja: 既に DataSet の既定ビューになっている DataViewManager で DataSet を変更することはできません。
ko: 이미 DataSet의 기본 뷰인 DataViewManager에서는 DataSet을 변경할 수 없습니다.
pt_br: Não é possível alterar DataSet em um DataViewManager que já é o modo de exibição padrão de um DataSet.
ru: Невозможно изменить DataSet для DataViewManager, который уже является представлением по умолчанию для DataSet.
zh_hans: 不能在已成为 DataSet 默认视图的 DataViewManager 上更改 DataSet。
zh_hant: 無法在已經是 DataSet 預設檢視表的 DataViewManager 上變更 DataSet。

# DataView_SetRowStateFilter
source: RowStateFilter cannot show ModifiedOriginals and ModifiedCurrents at the same time.
de: RowStateFilter kann nicht gleichzeitig ModifiedOriginals und ModifiedCurrents anzeigen.
es: No se pueden mostrar RowStateFilter, ModifiedOriginals y ModifiedCurrents a la vez.
fr: RowStateFilter ne peut afficher ModifiedOriginals et ModifiedCurrents à la fois.
it: RowStateFilter non può mostrare ModifiedOriginals e ModifiedCurrents contemporaneamente.
ja: RowStateFilter で、ModifiedOriginals と ModifiedCurrents を同時に表示することはできません。
ko: RowStateFilter는 ModifiedOriginals와 ModifiedCurrents를 동시에 표시할 수 없습니다.
pt_br: RowStateFilter não pode mostrar ModifiedOriginals e ModifiedCurrents ao mesmo tempo.
ru: RowStateFilter не может одновременно отображать версии данных ModifiedOriginals и ModifiedCurrents.
zh_hans: RowStateFilter 不能同时显示 ModifiedOriginals 和 ModifiedCurrents。
zh_hant: RowStateFilter 無法同時顯示 ModifiedOriginals 和 ModifiedCurrents。

# DataView_SetTable
source: Cannot change Table property on a DefaultView or a DataView coming from a DataViewManager.
de: Die Table-Eigenschaft kann in einer DefaultView oder einer DataView, die aus einem DataViewManager stammt, nicht geändert werden.
es: No se puede cambiar la propiedad Table en DefaultView o DataView que proviene de DataViewManager.
fr: Impossible de changer la propriété Table dans un DefaultView ou un DataView provenant d'un DataViewManager.
it: Impossibile modificare la proprietà Table su un DefaultView o un DataView di un DataViewManager.
ja: DataViewManager の DefaultView または DataView で Table プロパティを変更することはできません。
ko: DataViewManager에서 파생되는 DefaultView 또는 DataView에서 Table 속성을 변경할 수 없습니다.
pt_br: Não é possível alterar a propriedade Table em um DefaultView ou um DataView oriundo de um DataViewManager.
ru: Невозможно изменить свойство Table для DefaultView или для DataView, считанного из DataViewManager.
zh_hans: 不能在 DefaultView 或来自 DataViewManager 的 DataView 上更改 Table 属性。
zh_hant: 無法在 DefaultView 或來自 DataViewManager 的 DataView 上變更 Table 屬性。

# DataView_CanNotSetDataSet
source: Cannot change DataSet property once it is set.
de: Die Eigenschaft 'DataSet' kann nicht geändert werden, nachdem sie festgelegt wurde.
es: No se puede cambiar la propiedad DataSet una vez establecida.
fr: Impossible de changer la propriété DataSet une fois qu'elle a été définie.
it: Impossibile modificare la proprietà DataSet dopo che è stata impostata.
ja: 設定された DataSet プロパティを変更することはできません。
ko: DataSet 속성을 설정한 후에는 다시 변경할 수 없습니다.
pt_br: Não é possível alterar a propriedade DataSet depois que ela é definida.
ru: После задания свойства DataSet его невозможно изменить.
zh_hans: DataSet 属性一旦设置便无法更改。
zh_hant: 一旦設定 DataSet 屬性之後就無法變更。

# DataView_CanNotUseDataViewManager
source: DataSet must be set prior to using DataViewManager.
de: DataSet muss vor der Verwendung von DataViewManager festgelegt werden.
es: Es necesario establecer DataSet antes de utilizar DataViewManager.
fr: DataSet doit être défini avant d'utiliser DataViewManager.
it: DataSet deve essere impostata prima dell'utilizzo di DataViewManager.
ja: DataViewManager を使う前に DataSet を設定しなければなりません。
ko: DataViewManager를 사용하기 전에 DataSet을 설정해야 합니다.
pt_br: DataSet deve ser definido antes de usar DataViewManager.
ru: Перед использованием DataViewManager требуется задать DataSet.
zh_hans: 在使用 DataViewManager 前必须设置 DataSet。
zh_hant: 在使用 DataViewManager 之前，必須先設定 DataSet。

# DataView_CanNotSetTable
source: Cannot change Table property once it is set.
de: Die Eigenschaft 'Table' kann nicht geändert werden, nachdem sie festgelegt wurde.
es: No se puede cambiar la propiedad Table una vez establecida.
fr: Impossible de changer la propriété Table une fois qu'elle a été définie.
it: Impossibile modificare la proprietà Table dopo che è stata impostata.
ja: 設定された Table プロパティを変更することはできません。
ko: Table 속성을 설정한 후에는 다시 변경할 수 없습니다.
pt_br: Não é possível alterar a propriedade Table depois que ela é definida.
ru: После задания свойства Table его невозможно изменить.
zh_hans: Table 属性一旦设置便无法更改。
zh_hant: 一旦設定 Table 屬性之後就無法變更。

# DataView_CanNotUse
source: DataTable must be set prior to using DataView.
de: DataTable muss vor der Verwendung von DataView festgelegt werden.
es: Es necesario establecer DataTable antes de utilizar DataView.
fr: DataTable doit être défini avant d'utiliser DataView.
it: DataTable deve essere impostata prima dell'utilizzo di DataView.
ja: DataView を使う前に DataTable を設定しなければなりません。
ko: DataView를 사용하기 전에 DataTable을 설정해야 합니다.
pt_br: DataTable deve ser definida antes de usar DataView.
ru: Перед использованием DataView требуется задать DataTable.
zh_hans: 在使用 DataView 前必须设置 DataTable。
zh_hant: 在使用 DataView 之前，必須先設定 DataTable。

# DataView_CanNotBindTable
source: Cannot bind to DataTable with no name.
de: Bindung an unbenannte DataTable nicht möglich.
es: No se puede enlazar a DataTable sin un nombre.
fr: Impossible d'effectuer une liaison à DataTable sans nom.
it: Impossibile eseguire l'associazione a DataTable senza nome.
ja: 名前のない DataTable にはバインドできません。
ko: 이름이 없는 DataTable에 바인딩할 수 없습니다.
pt_br: Não é possível associar a uma DataTable sem nome.
ru: Невозможно выполнить привязку к DataTable без имени.
zh_hans: 无法绑定到没有名称的 DataTable。
zh_hant: 無法繫結至沒有名稱的 DataTable。

# DataView_SetIListObject
source: Cannot set an object into this list.
de: Ein Objekt kann dieser List nicht hinzugefügt werden.
es: No se puede establecer un objeto en esta lista.
fr: Impossible de définir un objet dans cette liste.
it: Impossibile impostare un oggetto in questo elenco.
ja: オブジェクトをこの一覧に設定できません。
ko: 이 목록에 개체를 설정할 수 없습니다.
pt_br: Não é possível definir um objeto nesta lista.
ru: Невозможно поместить объект в этот список.
zh_hans: 不能将一个对象设置到此列表中。
zh_hant: 無法設定物件至這個清單。

# DataView_AddNewNotAllowNull
source: Cannot call AddNew on a DataView where AllowNew is false.
de: AddNew kann nicht für eine DataView aufgerufen werden, für die AllowNew auf False gesetzt ist.
es: No se puede llamar a AddNew en DataView cuando AllowNew es igual a false.
fr: Impossible d'appeler AddNew dans un DataView lorsque AllowNew a la valeur false.
it: Impossibile chiamare AddNew su un DataView in cui AllowNew è false.
ja: AllowNew が False のときに DataView で AddNew を呼び出すことはできません。
ko: AllowNew가 false인 경우 DataView에서 AddNew를 호출할 수 없습니다.
pt_br: Não é possível chamar AddNew em um DataView em que AllowNew é false.
ru: Невозможно вызвать AddNew для DataView, в котором AllowNew имеет значение false (ложь).
zh_hans: 不能对 AllowNew 为假的 DataView 调用 AddNew。
zh_hant: 當 AllowNew 為 False 時，無法在 DataView 上呼叫 AddNew。

# DataView_NotOpen
source: DataView is not open.
de: DataView ist nicht geöffnet.
es: DataView no está abierto.
fr: DataView n'est pas ouvert.
it: DataView non aperto.
ja: DataView が開かれていません。
ko: DataView가 열려 있지 않습니다.
pt_br: DataView não está aberto.
ru: DataView не открыт.
zh_hans: DataView 未打开。
zh_hant: DataView 未開啟。

# DataView_CreateChildView
source: The relation is not parented to the table to which this DataView points.
de: Die Beziehung ist der Tabelle, auf diese DataView zeigt, nicht übergeordnet.
es: Esta relación no es primaria de la tabla a la que señala DataView.
fr: La relation n'est pas apparentée à la table vers laquelle ce DataView pointe.
it: La relazione non interessa la tabella a cui fa riferimento questo DataView.
ja: リレーションシップがこの DataView がポイントするテーブルの親になっていません。
ko: 이 관계는 DataView가 가리키는 테이블로부터 생성된 것이 아닙니다.
pt_br: A relação não é pai da tabela para a qual este DataView aponta.
ru: Отношение не назначено родительским для таблицы, на которую указывает этот DataView.
zh_hans: 该关系不是此 DataView 指向的表的父关系。
zh_hant: 關聯不是這個 DataView 指向資料表的父項。

# DataView_CanNotDelete
source: Cannot delete on a DataSource where AllowDelete is false.
de: Löschvorgang für DataSource ist nicht möglich, wenn AllowDelete auf 'false' gesetzt ist.
es: No se puede eliminar en DataSource cuando AllowDelete es igual a false.
fr: Impossible de supprimer dans un DataSource lorsque AllowDelete a la valeur false.
it: Impossibile effettuare un'eliminazione su un DataSource in cui AllowDelete è false.
ja: AllowDelete が false のときに DataSource で削除することはできません。
ko: AllowDelete가 false인 경우 DataSource에서 삭제할 수 없습니다.
pt_br: Não é possível excluir em uma DataSource em que AllowDelete é false.
ru: Невозможно выполнить удаление для DataSource, в ктором AllowDelete имеет значение false (ложь).
zh_hans: 不能对 AllowDelete 为 false 的 DataSource 执行删除。
zh_hant: 當 AllowDelete 為 false 時，無法在 DataSource 上刪除。

# DataView_CanNotEdit
source: Cannot edit on a DataSource where AllowEdit is false.
de: Eine DataSource kann nicht bearbeitet werden, wenn AllowEdit auf 'false' gesetzt ist.
es: No se puede editar en DataSource cuando AllowEdit es igual a false.
fr: Impossible de modifier dans un DataSource lorsque AllowEdit a la valeur false.
it: Impossibile effettuare una modifica su un DataSource in cui AllowEdit è false.
ja: AllowEdit が false のとき、DataSource を編集することはできません。
ko: AllowEdit이 false인 경우 DataSource에서 편집할 수 없습니다.
pt_br: Não é possível editar em uma DataSource em que AllowEdit é false.
ru: Невозможно выполнить редактирование для DataSource, в котором AllowEdit имеет значение false (ложь).
zh_hans: 不能对 AllowEdit 为 false 的 DataSource 进行编辑。
zh_hant: 當 AllowEdit 為 false 時，無法在 DataSource 上編輯。

# DataView_GetElementIndex
source: Index {0} is either negative or above rows count.
de: Der Index {0} ist entweder negativ oder über der Gesamtanzahl der Zeilen.
es: El índice {0} es negativo o superior al recuento de filas.
fr: L'index {0} est négatif ou supérieur au nombre de lignes.
it: L'indice {0} è negativo oppure superiore al totale delle righe.
ja: インデックス {0} は負の値であるか、行カウントの合計よりも小さい値です。
ko: 인덱스 {0}이(가) 음수이거나 행 개수보다 큽니다.
pt_br: O índice {0} é negativo ou está acima da contagem de linhas.
ru: Индекс {0} отрицательный или превышает общее число строк.
zh_hans: 索引 {0} 不是为负数，就是大于行数。
zh_hant: 索引 {0} 不是一個負數值，也不會超過資料列總數。

# DataView_AddExternalObject
source: Cannot add external objects to this list.
de: Externe Objekte können nicht zur Liste hinzugefügt werden.
es: No se pueden agregar objetos externos a esta lista.
fr: Impossible d'ajouter des objets externes à cette liste.
it: Impossibile aggiungere oggetti esterni all'elenco.
ja: 外部オブジェクトをこの一覧に追加できません。
ko: 이 목록에 외부 개체를 추가할 수 없습니다.
pt_br: Não é possível adicionar objetos externos a esta lista.
ru: Невозможно добавить в этот список внешние объекты.
zh_hans: 不能将外部对象添加到此列表。
zh_hant: 無法加入外部物件至這個清單。

# DataView_CanNotClear
source: Cannot clear this list.
de: Diese Liste kann nicht gelöscht werden.
es: No se puede borrar esta lista.
fr: Impossible d'effacer cette liste.
it: Impossibile cancellare questo elenco.
ja: この一覧をクリアできません。
ko: 이 목록을 지울 수 없습니다.
pt_br: Não é possível limpar a lista.
ru: Невозможно очистить этот список.
zh_hans: 不能清除此列表。
zh_hant: 無法清除這個清單。

# DataView_InsertExternalObject
source: Cannot insert external objects to this list.
de: Externe Objekte können nicht in diese List eingefügt werden.
es: No se pueden insertar objetos externos en esta lista.
fr: Impossible d'insérer des objets externes dans cette liste.
it: Impossibile inserire oggetti esterni nell'elenco.
ja: 外部オブジェクトをこの一覧に挿入することはできません。
ko: 이 목록에 외부 개체를 삽입할 수 없습니다.
pt_br: Não é possível inserir objetos externos na lista.
ru: Невозможно вставить в этот список внешние объекты.
zh_hans: 不能将外部对象插入此列表。
zh_hant: 無法插入外部物件至這個清單。

# DataView_RemoveExternalObject
source: Cannot remove objects not in the list.
de: Objekt, die sich nicht in der Liste befinden, können nicht entfernt werden.
es: No se pueden eliminar objetos que no estén en la lista.
fr: Impossible de supprimer des objets qui ne sont pas dans la liste.
it: Impossibile rimuovere oggetti non presenti nell'elenco.
ja: 一覧にないオブジェクトを削除できません。
ko: 목록에 없는 개체를 제거할 수 없습니다.
pt_br: Não é possível remover objetos que não estejam na lista.
ru: Невозможно удалить объекты, отсутствующие в этом списке.
zh_hans: 不能移除列表中没有的对象。
zh_hant: 無法移除不在清單中的物件。

# DataROWView_PropertyNotFound
source: {0} is neither a DataColumn nor a DataRelation for table {1}.
de: {0} ist keine DataColumn oder DataRelation für die Tabelle {1}.
es: {0} no es DataColumn ni DataRelation para la tabla {1}.
fr: {0} n'est pas un DataColumn ou un DataRelation pour la table {1}.
it: {0} non è né una DataColumn, né una DataRelation per la tabella {1}.
ja: {0} は、テーブル {1} の DataColumn でも DataRelation でもありません。
ko: {0}은(는) {1} 테이블의 DataColumn 또는 DataRelation이 아닙니다.
pt_br: {0} não é uma DataColumn nem uma DataRelation da tabela {1}.
ru: {0} не является для таблицы {1} ни DataColumn, ни DataRelation.
zh_hans: {0} 既不是表 {1} 的 DataColumn 也不是 DataRelation。
zh_hant: {0} 既不是資料表 {1} 的 DataColumn，也不是該資料表的 DataRelation。

# Range_Argument
source: Min ({0}) must be less than or equal to max ({1}) in a Range object.
de: In einem Range-Objekt muss Min ({0}) kleiner oder gleich max ({1}) sein.
es: El valor de Min ({0}) debe ser inferior o igual al valor de max ({1}) en un objeto Range.
fr: Min ({0}) doit être inférieur ou égal à max ({1}) dans un objet Range.
it: Min ({0}) deve essere minore o uguale a max ({1}) in un oggetto Range.
ja: Range オブジェクトの Min ({0}) は、 max ({1}) 以下でなければなりません。
ko: Range 개체에서 Min({0})은 max({1})보다 작거나 같아야 합니다.
pt_br: Min ({0}) deve ser menor ou igual ao max ({1}) em um objeto Range.
ru: В объекте Range минимум Min {0}) должен быть меньше или равен максимуму max ({1}).
zh_hans: 在 Range 对象中，Min ({0})必须小于或等于 max ({1})。
zh_hant: 在 Range 物件中，Min ({0}) 必須小於或等於 max ({1})。

# Range_NullRange
source: This is a null range.
de: Dies ist ein null-Bereich.
es: Hay un intervalo null.
fr: Il s'agit d'une plage null.
it: Intervallo null.
ja: 範囲が null です。
ko: 범위가 null입니다.
pt_br: Este é um intervalo null.
ru: Является неопределенным диапазоном null.
zh_hans: 这是 null 范围。
zh_hant: 這是 null 範圍。

# RecordManager_MinimumCapacity
source: MinimumCapacity must be non-negative.
de: MinimumCapacity darf nicht negativ sein.
es: El campo de MinimumCapacity no puede ser negativo.
fr: MinimumCapacity ne doit pas être négatif.
it: MinimumCapacity non può essere negativa.
ja: MinimumCapacity は負でない値でなければなりません。
ko: MinimumCapacity는 음수가 아니어야 합니다.
pt_br: MinimumCapacity deve ser não negativo.
ru: Значение MinimumCapacity должно быть неотрицательным.
zh_hans: MinimumCapacity 必须是非负的。
zh_hant: MinimumCapacity 必須為非負數。

# CodeGen_InvalidIdentifier
source: Cannot generate identifier for name '{0}'.
de: Der Bezeichner für den Namen "{0}" kann nicht generiert werden.
es: No se puede generar el identificador para el nombre '{0}'.
fr: Impossible de générer l'identificateur pour le nom '{0}'.
it: Impossibile generare l'identificatore per il nome '{0}'.
ja: 名前 '{0}' のための識別子を生成できません。
ko: 이름 '{0}'에 대한 식별자를 생성할 수 없습니다.
pt_br: Não é possível gerar identificador para o nome '{0}'.
ru: Не удается создать идентификатор для имени "{0}".
zh_hans: 无法为名称“{0}”生成标识符。
zh_hant: 無法產生名稱 '{0}' 的識別項。

# CodeGen_DuplicateTableName
source: There is more than one table with the same name '{0}' (even if namespace is different).
de: Es sind mehrere Tabellen mit demselben Namen '{0}' (wenngleich in verschiedenen Namespaces) vorhanden.
es: Hay más de una tabla con el mismo nombre '{0}' (aunque el espacio de nombres sea diferente).
fr: Plusieurs tables portent le même nom '{0}' (même si l'espace de noms est différent).
it: Ci sono più tabelle con lo stesso nome "{0}" (anche se lo spazio dei nomi è diverso).
ja: '{0}' という名前のテーブルが複数あります (名前空間は異なる場合があります)。
ko: 네임스페이스는 다르지만 이름이 '{0}'인 테이블이 둘 이상 있습니다.
pt_br: Existe mais de uma tabela com o mesmo nome '{0}' (mesmo se o espaço para nome for diferente).
ru: Имеется несколько таблиц с именем "{0}" (даже если пространства имен отличаются).
zh_hans: 存在多个具有相同名称“{0}”的表(虽然命名空间不同)。
zh_hant: 超過一個資料表使用相同的名稱 '{0}' (即使命名空間不同)。

# CodeGen_TypeCantBeNull
source: Column '{0}': Type '{1}' cannot be null.
de: Spalte {0}: Typ {1} darf nicht NULL sein.
es: La columna '{0}': Type '{1}' no puede ser null.
fr: Colonne '{0}' : Le type '{1}' ne peut pas être null.
it: Colonna '{0}': il tipo '{1}' non può essere null.
ja: 列 '{0}': 型 '{1}' を Null にすることはできません。
ko: 열 '{0}': 형식 '{1}'은(는) null일 수 없습니다.
pt_br: Coluna '{0}': tipo '{1}' não pode ser nulo.
ru: Столбец "{0}": тип "{1}" не может иметь значение null.
zh_hans: 列“{0}”: 类型“{1}”不能为 null。
zh_hant: 資料行 '{0}': 類型 '{1}' 不可以是 null。

# CodeGen_NoCtor0
source: Column '{0}': Type '{1}' does not have parameterless constructor.
de: Spalte '{0}': Typ '{1}' hat keinen parameterlosen Konstruktor.
es: La columna '{0}': tipo '{1}' no tiene un constructor sin parámetros.
fr: Colonne '{0}' : le type '{1}' n'a pas de constructeur sans paramètre.
it: Colonna '{0}': il tipo '{1}' non ha costruttore senza parametri.
ja: 列 '{0}': 型 '{1}' にはパラメーターなしのコンストラクターがありません。
ko: 열 '{0}': 형식 '{1}'에 매개 변수 없는 생성자가 없습니다.
pt_br: Coluna '{0}': tipo'{1}' não tem construtor sem parâmetros.
ru: Столбец "{0}": Тип "{1}" не имеет беспараметрического конструктора.
zh_hans: 列“{0}”: 类型“{1}”没有无参数构造函数。
zh_hant: 資料行 '{0}': 型別 '{1}' 沒有無參數的建構函式。

# CodeGen_NoCtor1
source: Column '{0}': Type '{1}' does not have constructor with string argument.
de: Spalte '{0}': Typ '{1}' hat keinen Konstruktor mit einem Zeichenfolgenargument.
es: La columna '{0}': tipo '{1}' no tiene un constructor con un argumento de cadena.
fr: Colonne '{0}' : le type '{1}' n'a pas de constructeur avec un argument string.
it: Colonna '{0}': il tipo '{1}' non ha costruttore con argomento stringa.
ja: 列 '{0}': 型 '{1}' には文字列引数を持つコンストラクターがありません。
ko: 열 '{0}': 형식 '{1}'에 문자열 인수를 사용하는 생성자가 없습니다.
pt_br: Coluna '{0}': tipo '{1}' não tem construtor com argumento de cadeia de caracteres.
ru: Столбец "{0}": Тип "{1}" не имеет конструктора со строковым аргументом.
zh_hans: 列“{0}”: 类型“{1}”没有带字符串参数的构造函数。
zh_hant: 資料行 '{0}': 型別 '{1}' 沒有包含字串引數的建構函式。

# SqlConvert_ConvertFailed
source: Cannot convert object of type '{0}' to object of type '{1}'.
de: Ein Objekt vom Typ "{0}" kann nicht in ein Objekt vom Typ "{1}" konvertiert werden.
es: No se puede convertir el objeto de tipo '{0}' al objeto de tipo '{1}'.
fr: Impossible de convertir l'objet de type « {0} » en objet de type « {1} ».
it: Non è possibile convertire oggetti di tipo '{0}' in oggetti di tipo '{1}'.
ja: 型 '{0}' のオブジェクトを型 '{1}' のオブジェクトに変換できません。
ko: '{0}' 유형의 개체를 '{1}' 유형의 개체로 변환할 수 없습니다.
pt_br: Não é possível converter o objeto do tipo '{0}' em objeto do tipo '{1}'.
ru: Нельзя преобразовать объект типа "{0}" в объект типа "{1}".
zh_hans: 无法将类型为“{0}”的对象转换成类型为“{1}”的对象。
zh_hant: 無法將類型 '{0}' 的物件轉換為類型 '{1}' 的物件。

# DataSet_DefaultDataException
source: Data Exception.
es: Exception de Data.
fr: Exception Data.
ja: Data Exception が発生しました。
ru: Исключение данных Data Exception.

# DataSet_DefaultConstraintException
source: Constraint Exception.
es: Exception de Constraint.
fr: Exception Constraint.
ja: Constraint Exception が発生しました。
ru: Исключение ограничения Constraint Exception.

# DataSet_DefaultDeletedRowInaccessibleException
source: Deleted rows inaccessible.
de: Zugriff auf gelöschte Zeilen nicht möglich.
es: No se tiene acceso a filas eliminadas.
fr: Lignes supprimées inaccessibles.
it: Righe eliminate inaccessibili.
ja: 削除された行にはアクセスできません。
ko: 삭제된 행에 액세스할 수 없습니다.
pt_br: Linhas excluídas inacessíveis.
ru: Удаленные строки недоступны.
zh_hans: 已删除的行不可访问。
zh_hant: 無法存取已刪除的資料列。

# DataSet_DefaultDuplicateNameException
source: Duplicate name not allowed.
de: Doppelte Namen nicht zulässig.
es: No se permiten nombres duplicados.
fr: Nom dupliqué non autorisé.
it: Nome duplicato non consentito.
ja: 重複した名前は許可されていません。
ko: 중복 이름을 사용할 수 없습니다.
pt_br: Nome duplicado não permitido.
ru: Повторяющиеся имена запрещены.
zh_hans: 不允许重名。
zh_hant: 不允許重複的名稱。
