Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DbConnectionString_Pooling
source: When true, the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
de: Falls wahr, wird das Verbindungsobjekt aus dem entsprechenden Pool entnommen oder, falls erforderlich, erstellt und dem entsprechenden Pool hinzugefügt.
es: Cuando el valor es true, el objeto de conexión se obtiene del grupo apropiado, o si es necesario, se crea y agrega al grupo apropiado.
fr: Lorsque la valeur est true, l'objet Connection est extrait du pool correspondant ou, si nécessaire, est créé et ajouté au pool approprié.
it: Se il valore è true, l'oggetto di connessione viene prelevato dal pool appropriato oppure, se necessario, viene creato e aggiunto al pool appropriato.
ja: True の場合、接続オブジェクトが適切なプールから取得されるか、または、必要に応じて接続オブジェクトが作成され、適切なプールに追加されます。
ko: true이면 해당 풀에서 연결 개체를 끌어 오거나 필요한 경우 연결 개체를 만들어 해당 풀에 추가합니다.
pt_br: Quando for verdadeiro, o objeto de conexão será obtido do pool apropriado ou, se necessário, será criado e adicionado ao pool apropriado.
ru: Когда true (истина), то объект подключения извлекается из соответствующего пула или, в случае необходимости, создается и добавляется в соответствующий пул.
zh_hans: 如果为 True，该连接对象将从相应的池中退出，如有必要，会创建连接对象并添加到相应的池中。
zh_hant: 當 True 時，會從適當的集區中描繪連接物件，或必要時，將連接物件建立或新增至適當的集區中。

# DbConnectionString_Replication
source: Used by SQL Server in Replication.
de: Wird von SQL Server bei der Replikation verwendet.
es: Utilizado por SQL Server en la replicación.
fr: Utilisé par SQL Server lors de la réplication.
it: Utilizzato da SQL Server nella replica.
ja: レプリケーション時に SQL Server によって使用されます。
ko: 복제에서 SQL Server가 사용합니다.
pt_br: Usado pelo SQL Server na duplicação.
ru: Используется SQL Server для репликации.
zh_hans: 由 SQL Server 用于复制。
zh_hant: 在複寫時供 SQL Server 使用。

# DbConnectionString_TransactionBinding
source: Indicates binding behavior of connection to a System.Transactions Transaction when enlisted.
de: Gibt das Bindungsverhalten der Verbindung mit einer 'System.Transactions'-Transaktion an, sofern eingetragen.
es: Indica el comportamiento de conexión de enlace a una transacción System.Transactions cuando está se da de alta.
fr: Indique un comportement de liaison de la connexion à une transaction System.Transactions dans le cas d'une inscription.
it: Indica il comportamento dell'associazione della connessione a una transazione System.Transactions se inserita nell'elenco.
ja: System.Transactions Transaction への接続の、参加時のバインド動作を示します。
ko: 등록 시 연결 동작을 System.Transactions 트랜잭션에 연결함을 나타냅니다.
pt_br: Indica comportamento de associação de conexão para um System.Transactions Transaction quando inscrito.
ru: Указывает поведение привязки для соединения с транзакцией System.Transactions при наличии прикрепления.
zh_hans: 指示登记后连接到 System.Transactions 事务的绑定行为。
zh_hant: 代表交易編列時，System.Transactions 交易之連接的繫結行為。

# DbConnectionString_TrustServerCertificate
source: When true (and encrypt=true), SQL Server uses SSL encryption for all data sent between the client and server without validating the server certificate.
de: Falls wahr (und 'encrypt=true'), verwendet SQL Server SSL-Verschlüsselung für alle zwischen Client und Server gesendeten Daten, ohne das Serverzertifikat zu validieren
es: Cuando es true (y encrypt=true), SQL Server usa el cifrado SSL para todos los datos enviados entre el cliente y el servidor sin validar el certificado del servidor.
fr: Lorsque sa valeur est true (et encrypt=true), SQL Server utilise le cryptage SSL pour toutes les données échangées entre le client et le serveur sans validation du certificat de ce dernier.
it: Se il valore è true (e encrypt=true), SQL Server utilizza la crittografia SSL per tutti i dati inviati tra il client e il server senza convalidare il certificato del server.
ja: True の場合 (および encrypt=true)、SQL Server は、サーバー認証を検証せずにクライアントとサーバーの間で送信されるすべてのデータに対し、SSL 暗号化を使用します。
ko: true(및 encrypt=true)인 경우 SQL Server는 서버 인증서의 유효성을 검사하지 않고 클라이언트와 서버 간에 전송된 모든 데이터에 대해 SSL 암호화를 사용합니다.
pt_br: Se for true (e encrypt=true), o SQL Server usará criptografia SSL para todos os dados enviados entre cliente e servidor sem validar o certificado do servidor.
ru: Когда true (истина) и encrypt=true, то SQL Server использует шифрование SSL для всех данных, которые пересылаются между клиентом и сервером, не проверяя сертификат сервера.
zh_hans: 如果为 true (并且 encrypt=true)，SQL Server 将对客户端和服务器之间发送的所有数据使用 SSL 加密，而不验证服务器证书。
zh_hant: 為 True 時 (且 encrypt=true)，表示 SQL Server 為所有在用戶端和伺服器之間傳送的資料使用 SSL 加密，且不驗證伺服器憑證。

# DbConnectionString_TypeSystemVersion
source: Indicates which server type system the provider will expose through the DataReader.
de: Gibt an, welches Servertypsystem der Provider über den DataReader offen legt.
es: Indica qué sistema de tipo de servidor expondrá el proveedor a través de DataReader.
fr: Indique quel système de type serveur le fournisseur va exposer via le DataReader.
it: Indica quale sistema di tipi di server il provider esporrà mediante il DataReader.
ja: DataReader を通してプロバイダーが公開するサーバー タイプのシステムを示します。
ko: 공급자가 DataReader를 통해 노출할 서버 유형 시스템을 나타냅니다.
pt_br: Indica que sistema de tipo de servidor o provedor vai expor por meio do DataReader.
ru: Указывает серверную систему, которую поставщик будет представлять через DataReader
zh_hans: 指示提供程序将通过 DataReader 公开的服务器类型系统。
zh_hant: 表示提供者透過 DataReader 顯示的系統型別系統將是何者。

# DbConnectionString_UserID
source: Indicates the user ID to be used when connecting to the data source.
de: Gibt die Benutzer-ID an, die beim Herstellen einer Verbindung mit der Datenquelle verwendet wird.
es: Indica el Id. de usuario que se utilizará al conectarse con el origen de datos.
fr: Indique l'identificateur d'utilisateur à utiliser lors de la connexion à la source de données.
it: Indica l'ID utente da utilizzare per la connessione all'origine dati.
ja: データ ソースへの接続時に使用するユーザー ID を示します。
ko: 데이터 원본 연결에 사용할 사용자 ID를 나타냅니다.
pt_br: Indica a ID de usuário a ser usada na conexão com a fonte de dados.
ru: Показывает идентификатор пользователя, применяемый для соединения с источником данных.
zh_hans: 指示连接到数据源时使用的用户 ID。
zh_hant: 指出連接資料來源時要使用的密碼。

# DbConnectionString_UserInstance
source: Indicates whether the connection will be re-directed to connect to an instance of SQL Server running under the user's account.
de: Gibt an, ob die Verbindung umgeleitet wird, um eine Verbindung mit einer SQL Server-Instanz herzustellen, die unter dem Konto des Benutzers ausgeführt wird.
es: Indica si la conexión se redireccionará para conectarla a una instancia de SQL Server que funciona bajo la cuenta del usuario.
fr: Indique si la connexion va être redirigée pour une connexion à une instance de SQL Server exécutée sous le compte de l'utilisateur.
it: Indica se la connessione verrà reindirizzata per connettersi a un istanza di SQL Server eseguita dall'account utente.
ja: ユーザーのアカウントを使用して実行されている SQL Server のインスタンスに接続するために、接続がリダイレクトされるかどうかを示します。
ko: 연결을 리디렉션하여 사용자 계정으로 실행 중인 SQL Server 인스턴스에 연결할지 여부를 나타냅니다.
pt_br: Indica se a conexão será redirecionada para conectar a uma instância do SQL Server em execução na conta do usuário.
ru: Указывает, будет ли подключение перенаправляться к экземпляру SQL Server, который запущен с помощью учетной записи пользователя.
zh_hans: 指示是否将连接重定向，以连接到在该用户帐户下运行的 SQL Server 实例。
zh_hant: 表示連結是否將重新導向至執行於使用者帳號下的某個 SQL Server 執行個體。

# DbConnectionString_WorkstationID
source: The name of the workstation connecting to SQL Server.
de: Der Name der Arbeitsstation, die sich mit SQL Server verbindet.
es: Nombre de la estación de trabajo que se conecta a SQL Server.
fr: Nom de la station de travail se connectant à SQL Server.
it: Nome della workstation che si connette a SQL Server.
ja: SQL Server に接続しているワークステーションの名前です。
ko: SQL Server에 연결하는 워크스테이션의 이름입니다.
pt_br: O nome da estação de trabalho conectando o SQL Server.
ru: Имя рабочей станции, которая устанавливает подключение к SQL Server.
zh_hans: 连接到 SQL Server 的工作站的名称。
zh_hant: 連接至 SQL Server 的工作站名稱。

# DbConnectionString_ApplicationIntent
source: Declares the application workload type when connecting to a server.
de: Deklariert den Workloadtyp der Anwendung beim Herstellen einer Verbindung mit einem Server.
es: Declara el tipo de carga de trabajo de la aplicación cuando se conecta a un servidor.
fr: Déclare le type de charge de travail d'application lorsque vous vous connectez à un serveur.
it: Dichiara il tipo di carico di lavoro dell'applicazione per la connessione a un server.
ja: サーバーに接続するときにアプリケーションのワークロードの種類を宣言します。
ko: 서버에 연결할 때 응용 프로그램 작업 형식을 선언합니다.
pt_br: Declara o tipo de carga de trabalho do aplicativo durante a conexão com um servidor.
ru: Объявляет тип рабочей нагрузки приложения при соединении с сервером.
zh_hans: 连接到服务器时声明应用程序工作负荷类型。
zh_hant: 在連接到伺服器時宣告應用程式工作負載類型。

# DbConnectionString_ConnectRetryCount
source: Number of attempts to restore connection.
de: Anzahl der Versuche, die Verbindung wiederherzustellen.
es: Número de intentos para restaurar la conexión.
fr: Nombre de tentatives pour rétablir la connexion.
it: Numero di tentativi di ripristino della connessione.
ja: 接続を復元するための試行回数です。
ko: 연결 복구 시도 횟수입니다.
pt_br: Número de tentativas para restaurar a conexão.
ru: Число попыток восстановления подключения.
zh_hans: 尝试恢复连接的次数。
zh_hant: 每秒嘗試還原連接的次數。

# DbConnectionString_ConnectRetryInterval
source: Delay between attempts to restore connection.
de: Verzögerung zwischen den Versuchen, die Verbindung wiederherzustellen.
es: Retraso entre intentos para restaurar la conexión.
fr: Délai entre les tentatives de rétablir la connexion.
it: Ritardo tra tentativi di ripristino della connessione.
ja: 接続を復元するための試行間の遅延です。
ko: 연결 복구 시도 간 지연 시간입니다.
pt_br: Atraso entre as tentativas para restaurar a conexão.
ru: Задержка между попытками восстановления подключения.
zh_hans: 尝试恢复连接
zh_hant: 嘗試還原連接之間的延遲。

# DbConnectionString_Authentication
source: Specifies the method of authenticating with SQL Server.
de: Legt die Methode der Authentifzierung mit SQL Server fest.
es: Especifica el método de autenticación con SQL Server.
fr: Spécifie la méthode d'authentification avec SQL Server.
it: Specifica il metodo di autenticazione con SQL Server.
ja: SQL Server での認証方法を指定します。
ko: SQL Server로 인증하는 방법을 지정합니다.
pt_br: Especifica o método de autenticação no SQL Server.
ru: Указывает метод проверки подлинности с SQL Server.
zh_hans: 指定对 SQL Server 进行身份验证的方法。
zh_hant: 指定使用 SQL Server 的驗證方法。

# DbConnectionString_Certificate
source: Specified client certificate for authenticating with SQL Server.
de: Das angegebene Clientzertifikat für die Authentifizierung bei SQL Server.
es: Certificado de cliente especificado para la autenticación con SQL Server.
fr: Certificat client spécifié pour l'authentification auprès de SQL Server.
it: Certificato client specificato per l'autenticazione con SQL Server.
ja: SQL Server で認証するために指定されたクライアント証明書。
ko: SQL Server 인증을 위해 지정된 클라이언트 인증서입니다.
pt_br: Certificado do cliente especificado para autenticação no SQL Server.
ru: Указанный сертификат клиента для проверки подлинности в SQL Server.
zh_hans: 指定的客户端证书，用于通过 SQL Server 进行身份验证。
zh_hant: 用以向 SQL Server 驗證的指定用戶端憑證。

# OdbcConnection_ConnectionString
source: Information used to connect to a Data Source.
de: Informationen, die zum verbinden mit einer Datenquelle verwendet werden.
es: Información utilizada para conectarse al origen de datos.
fr: Les informations utilisées pour connecter une source de données.
it: Informazioni utilizzate per la connessione a un DataSource.
ja: データ ソースへの接続に使われる情報です。
ko: 데이터 원본에 연결하는 데 사용되는 정보입니다.
pt_br: Informações usadas para conectar a uma Fonte de Dados.
ru: Информация, используемая для подключения к источнику данных.
zh_hans: 用于连接到数据源的信息。
zh_hant: 用來連接至資料來源的資訊。

# OdbcConnection_ConnectionTimeout
source: Current connection timeout value, not settable in the ConnectionString.
de: Der aktuelle Zeitüberschreitungswert der Verbindung kann nicht in ConnectionString festgelegt werden.
es: Valor actual de tiempo de espera de conexión, no se puede establecer en ConnectionString.
fr: Valeur du délai d'attente de la connexion actuelle, non définissable dans ConnectionString.
it: Valore di timeout della connessione attuale, non impostabile nella proprietà ConnectionString.
ja: ConnectionString 内では設定できない現在の接続タイムアウト値です。
ko: ConnectionString에서 설정할 수 없는 현재 연결 시간 제한 값입니다.
pt_br: Valor atual de tempo limite da conexão não pode ser definido em ConnectionString.
ru: Время ожидания текущего подключения; не может задаваться в ConnectionString.
zh_hans: 当前连接超时值，不可在 ConnectionString 中设置。
zh_hant: 目前的連接逾時值，無法於 ConnectionString 中設定。

# OdbcConnection_Database
source: Current data source catalog value, 'Database=X' in the connection string.
de: Aktueller Datenquellenkatalog-Wert, 'Database=X' in der Verbindungszeichenfolge.
es: Valor del catálogo del origen de datos actual, 'Database=X' en la cadena de conexión.
fr: Valeur du catalogue de la source de données actuelle, 'Database=X' dans la chaîne de connexion.
it: Valore del catalogo dell'origine dati attuale. 'Database=X' nella stringa di connessione.
ja: 現在のデータ ソース カタログ値は、接続文字列内の 'Database=X' です。
ko: 연결 문자열에서 현재 데이터 원본 카탈로그 값입니다('Database=X').
pt_br: Valor de catálogo da fonte de dados atual, 'Database=X' na cadeia de conexão.
ru: Значение каталога текущего источника данных, "Database=X" в строке подключения.
zh_hans: 当前数据源目录值，连接字符串中的“Database=X”。
zh_hant: 目前的資料來源目錄值，即為連接字串中的 'Database=X'。

# OdbcConnection_DataSource
source: Current data source, 'Server=X' in the connection string.
de: Aktuelle Datenquelle 'Server=X' in der Verbindungszeichenfolge.
es: Origen de datos actuales, 'Server=X' en la cadena de conexión.
fr: Source de données actuelle, 'Server=X' dans la chaîne de connexion.
it: Origine dati corrente. 'Server=X' nella stringa di connessione.
ja: 接続文字列の現在のデータ ソースは'Server=X' です。
ko: 연결 문자열에서 현재 데이터 원본입니다('Server=X').
pt_br: Fonte de dados atual, 'Server=X' na cadeia de conexão.
ru: Текущий источник данных, "Server=X" в строке подключения.
zh_hans: 当前数据源，连接字符串中的“Server=X”。
zh_hant: 目前的資料來源，即為連接字串中的 'Server=X'。

# OdbcConnection_Driver
source: Current ODBC driver.
de: Aktueller ODBC-Treiber.
es: Controlador ODBC actual
fr: Pilote ODBC actif.
it: Driver ODBC attuale.
ja: 現在の ODBC ドライバーです。
ko: 현재 ODBC 드라이버입니다.
pt_br: Driver ODBC atual.
ru: Текущий драйвер ODBC.
zh_hans: 当前 ODBC 驱动程序。
zh_hant: 目前所使用的 ODBC 驅動程式。

# OdbcConnection_ServerVersion
source: Version of the product accessed by the ODBC Driver.
de: Produktversion, auf die vom ODBC-Treiber zugegriffen wird.
es: El controlador ODBC ha obtenido acceso a la versión del producto.
fr: Version du produit auquel accède le fournisseur ODBC.
it: Versione del prodotto a cui accede il driver ODBC.
ja: ODBC ドライバーによってアクセスされる製品のバージョンです。
ko: ODBC 드라이버에서 액세스하는 제품의 버전입니다.
pt_br: Versão do produto acessado pelo driver ODBC.
ru: Версия продукта, к которому производит доступ драйвер ODBC.
zh_hans: ODBC 驱动程序访问的产品的版本。
zh_hant: ODBC 驅動程式所存取的產品版本。

# OleDbConnection_ConnectionString
source: Information used to connect to a Data Source.
de: Informationen, die zum verbinden mit einer Datenquelle verwendet werden.
es: Información utilizada para conectarse al origen de datos.
fr: Les informations utilisées pour connecter une source de données.
it: Informazioni utilizzate per la connessione a un DataSource.
ja: データ ソースへの接続に使われる情報です。
ko: 데이터 원본에 연결하는 데 사용되는 정보입니다.
pt_br: Informações usadas para conectar a uma Fonte de Dados.
ru: Информация, используемая для подключения к источнику данных.
zh_hans: 用于连接到数据源的信息。
zh_hant: 用來連接至資料來源的資訊。

# OleDbConnection_ConnectionTimeout
source: Current connection timeout value, 'Connect Timeout=X' in the ConnectionString.
de: Aktueller Verbindungstimeout-Wert, 'Connect Timeout=X' in ConnectionString.
es: Valor actual de tiempo de espera de conexión, 'Connect Timeout=X' en la cadena de conexión (ConnectionString).
fr: Valeur du délai d'attente de la connexion actuelle, 'Connect Timeout=X' dans le ConnectionString.
it: Valore di timeout della connessione corrente. 'Connect Timeout=X' in ConnectionString.
ja: 現在の接続 timeout 値、ConnectionString 内の 'Connect Timeout=X' です。
ko: ConnectionString에서 현재 연결 시간 제한 값입니다('Connect Timeout=X').
pt_br: Valor de tempo limite da conexão atual, 'Connect Timeout=X' em ConnectionString.
ru: Время ожидания текущего подключения; "Connect Timeout=X" в ConnectionString.
zh_hans: 当前连接超时值，ConnectionString 中的“Connect Timeout=X”。
zh_hant: 目前連接的逾時值，即為 ConnectionString 中的 'Connect Timeout=X'。

# OleDbConnection_Database
source: Current data source catalog value, 'Initial Catalog=X' in the connection string.
de: Aktueller Datenquellenkatalog-Wert, 'Initial Catalog=X' in der Verbindungszeichenfolge.
es: Valor del catálogo del origen de datos actual, 'Initial Catalog=X' en la cadena de conexión.
fr: Valeur du catalogue de la source de données actuelle, 'Initial Catalog=X' dans la chaîne de connexion.
it: Valore del catalogo dell'origine dati corrente. 'Initial Catalog=X' nella stringa di connessione.
ja: 現在のデータ ソース カタログ値、接続文字列の中の 'Initial Catalog=X' です。
ko: 연결 문자열에서 현재 데이터 원본 카탈로그 값입니다('Initial Catalog=X').
pt_br: Valor de catálogo da fonte de dados atual, 'Initial Catalog=X' na cadeia de conexão.
ru: Значение каталога текущего источника данных, "Initial Catalog=X", в строке подключения.
zh_hans: 当前数据源目录值，连接字符串中的“Initial Catalog=X”。
zh_hant: 目前的資料來源目錄值，即為連接字串中的 'Initial Catalog=X'。

# OleDbConnection_DataSource
source: Current data source, 'Data Source=X' in the connection string.
de: Aktuelle Datenquelle, 'Data Source=X' in der Verbindungszeichenfolge.
es: Origen de datos actual, 'Data Source=X' en la cadena de conexión.
fr: Source de données actuelle, 'Data Source=X' dans la chaîne de connexion.
it: Origine dati corrente. 'Data Source=X' nella stringa di connessione.
ja: 接続文字列の中の現在のデータ ソース 'Data Source=X'。
ko: 연결 문자열에서 현재 데이터 원본입니다('Data Source=X').
pt_br: Fonte de dados atual, 'Data Source=X' na cadeia de conexão.
ru: Текущий источник данных, "Data Source=X", в строке подключения.
zh_hans: 当前数据源，连接字符串中的“Data Source=X”。
zh_hant: 目前的資料來源，即為連接字串中的 'Data Source=X'。

# OleDbConnection_Provider
source: Current OLE DB provider ProgID, 'Provider=X' in the connection string.
de: Aktuelle OLE DB-Provider-ProgID, 'Provider=X' in der Verbindungszeichenfolge.
es: ProgID del proveedor OLE DB actual, 'Provider=X' en la cadena de conexión.
fr: ProgID du fournisseur OLE DB actuel, 'Provider=X' dans la chaîne de connexion.
it: ProgID del provider OLE DB corrente. "Provider=X" nella stringa di connessione.
ja: 接続文字列の中の現在の OLE DB プロバイダー ProgID 'Provider=X'。
ko: 연결 문자열에서 현재 OLE DB 공급자 ProgID입니다('Provider=X').
pt_br: ProgID do provedor OLE DB atual, 'Provider=X' na cadeia de conexão.
ru: Текущий идентификатор ProgID поставщика OLE DB, "Provider=X" в строке подключения.
zh_hans: 连接字符串中，当前 OLE DB 提供程序的 ProgID “Provider=X”。
zh_hant: 目前的 OLE DB 提供者 ProgID，即為連接字串中的 'Provider=X'。

# OleDbConnection_ServerVersion
source: Version of the product accessed by the OLE DB Provider.
de: Produktversion, auf die vom OLE DB-Provider zugegriffen wird.
es: El proveedor OLE DB ha obtenido acceso a la versión del producto.
fr: Version du produit auquel accède le fournisseur OLE DB.
it: Versione del prodotto a cui accede il provider OLE DB.
ja: OLE DB プロバイダーによってアクセスされる製品のバージョンです。
ko: OLE DB 공급자에서 액세스하는 제품의 버전입니다.
pt_br: Versão do produto acessado pelo provedor OLE DB.
ru: Версия продукта, к которому производит доступ поставщик OLE DB.
zh_hans: OLE DB 提供程序访问的产品的版本。
zh_hant: OLE DB Provider 所存取的產品版本。

# SqlConnection_AccessToken
source: Access token to use for authentication.
de: Zugriffs-Token zur Verwendung bei der Authentifizierung.
es: Token de acceso para usar en la autenticación.
fr: Jeton d’accès à utiliser pour l’authentification.
it: Token di accesso da usare per l'autenticazione.
ja: 認証に使用するアクセス トークンです。
ko: 인증에 사용할 액세스 토큰입니다.
pt_br: Token de acesso para usar para autenticação.
ru: Токен доступа, который следует использовать для аутентификации.
zh_hans: 要用于身份验证的访问令牌。
zh_hant: 驗證要用的存取金鑰。

# SqlConnection_Asynchronous
source: State of connection, synchronous or asynchronous. 'Asynchronous Processing=x' in the connection string.
de: Status der Verbindung: synchron oder asynchron. 'Asynchronous Processing=x' in der Verbindungszeichenfolge.
es: Estado de la conexión, sincrónica o asincrónica. 'Asynchronous Processing=x' en la cadena de conexión.
fr: État de la connexion (synchrone ou asynchrone). La fonctionnalité 'Asynchronous Processing=x' est utilisée dans la chaîne de connexion.
it: Stato della connessione, sincrona o asincrona. "Asynchronous Processing=x" nella stringa di connessione.
ja: 接続の状態 (同期であるか非同期であるか) です。接続文字列内では、'Asynchronous Processing=x' で表されます。
ko: 연결, 동기 또는 비동기 작업의 상태입니다. 연결 문자열에서 'Asynchronous Processing=x'입니다.
pt_br: Estado de conexão, síncrono ou assíncrono. ' Asynchronous Processing=x ' na cadeia de conexão.
ru: Состояние подключения (синхронное или асинхронное). "Asynchronous Processing=x" в строке подключения.
zh_hans: 连接状态、同步或异步。连接字符串中“Asynchronous Processing=x”。
zh_hant: 連接、同步或非同步的狀態。即為連接字串中的 'Asynchronous Processing=x'。

# SqlConnection_Replication
source: Information used to connect for replication.
de: Informationen, die verwendet werden, um eine Verbindung für die Replikation herzustellen.
es: Información utilizada para conexión de replicación.
fr: Informations utilisées pour la connexion en vue de la réplication.
it: Informazioni utilizzate per eseguire la connessione per la replica.
ja: レプリケーション時の接続に使われる情報です。
ko: 연결하는 데 사용되는 복제에 대한 정보입니다.
pt_br: Informações usadas para estabelecer conexão para replicação.
ru: MILSCHK SS: Incorrect term. Please change as follows: Данные, использующиеся при подключении для репликации.
zh_hans: 用于连接进行复制的信息。
zh_hant: 用於複寫連接的資訊。

# SqlConnection_ConnectionString
source: Information used to connect to a DataSource, such as 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'.
de: Informationen zum Verbinden mit einer DataSource; z.B. 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'.
es: Información utilizada para conectar con DataSource, como 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'.
fr: Informations utilisées pour la connexion à une DataSource, par exemple 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'.
it: Informazioni utilizzate per effettuare la connessione a un DataSource, quali 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'.
ja: 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI' などのように、DataSource への接続に使われる情報です。
ko: 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'와 같이 DataSource에 연결하는 데 사용되는 정보입니다.
pt_br: Informações usadas para conectar-se a DataSource, como 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'.
ru: Информация, используемая для подключения к DataSource, например, "Data Source=x;Initial Catalog=x;Integrated Security=SSPI".
zh_hans: 连接到 DataSource 时所用的信息，例如“Data Source=x;Initial Catalog=x;Integrated Security=SSPI”。
zh_hant: 用來連接至 DataSource 的資訊，例如 'Data Source=x;Initial Catalog=x;Integrated Security=SSPI'。
