Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_InvalidFormatValue
source: The value can not be formatted as a literal of the requested type.
de: Der Wert kann nicht als Literal des angeforderten Typs formatiert werden.
es: No se puede dar formato al valor como literal del tipo solicitado.
fr: La valeur ne peut pas adopter le format littéral du type demandé.
it: Impossibile formattare il valore come una rappresentazione formale del tipo richiesto.
ja: この値は、要求したデータ型のリテラルとしてフォーマットできません。
ko: 요청한 형식의 리터럴로 값의 형식을 지정할 수 없습니다.
pt_br: O valor não pode ser formatado como um literal do tipo requerido.
ru: Значение не может быть отформатировано в качестве литерала требуемого типа.
zh_hans: 该值无法格式化为请求类型的文本。
zh_hant: 值無法組成必要型別的文字。

# ADP_InvalidMaximumScale
source: Data type '{0}' can not be formatted as a literal because it has an invalid maximum scale.
de: Der Datentyp '{0}' kann nicht als Literal formatiert werden, da er eine ungültige maximale Dezimalstellenanzahl aufweist.
es: No se puede dar formato al tipo de datos '{0}' como literal porque tiene una escala máxima no válida.
fr: Le type de données '{0}' ne peut pas adopter le format littéral car son échelle maximale n'est pas valide.
it: Impossibile formattare il tipo di dati "{0}" come rappresentazione formale perché ha una scala massima non valida.
ja: 無効な最大スケールがデータ型 '{0}' に含まれているため、これをリテラルとしてフォーマットすることはできません。
ko: 데이터 형식 '{0}'은(는) 최대 소수 자릿수가 잘못되었기 때문에 리터럴로 형식을 지정할 수 없습니다.
pt_br: Tipo de dados '{0}' não pode ser formatado como literal pois tem escalação máxima inválida.
ru: Тип данных "{0}" не может быть отформатирован в качестве литерала, поскольку имеет недопустимый максимальный масштаб.
zh_hans: 数据类型“{0}”包含无效的最大小数位数，不能格式化为文本。
zh_hant: 資料型別 '{0}' 無法組成文字，因為包含無效的小數位數上限。

# ADP_LiteralValueIsInvalid
source: The literal value provided is not a valid literal for the data type '{0}'.
de: Der angegebene Literalwert ist kein gültiges Literal für den Datentyp '{0}'.
es: El valor literal proporcionado no es un literal válido para el tipo de datos '{0}'.
fr: La valeur littérale fournie n'est pas valide pour le type de données '{0}'.
it: Il valore letterale fornito non è una rappresentazione formale valida per il tipo di dati "{0}".
ja: 指定されたリテラル値は、データ型 '{0}' のリテラルとしては無効です。
ko: 지정한 리터럴 값은 데이터 유형 '{0}'에 적합하지 않은 리터럴입니다.
pt_br: O valor literal fornecido não é um literal válido para o tipo de dados '{0}'.
ru: Указанное значение константы недопустимо для типа данных "{0}".
zh_hans: 提供的文本值不是数据类型“{0}”的有效文本。
zh_hant: 提供的文字值不是資料型別 '{0}' 的有效文字。

# ADP_EvenLengthLiteralValue
source: '{0}':The length of the literal value must be even.
de: '{0}':Die Länge des Literalwerts muss gerade sein.
es: '{0}':La longitud del valor literal debe ser par.
fr: '{0}' : la longueur de la valeur littérale doit être paire.
it: "{0}":la lunghezza del valore letterale deve essere pari.
ja: '{0}': リテラル値の長さは偶数である必要があります。
ko: '{0}': 리터럴 값의 길이는 짝수여야 합니다.
pt_br: '{0}':O comprimento do valor literal deve ser uniforme.
ru: "{0}":длина значения литерала должна быть четным значением.
zh_hans: “{0}”: 文本值的长度必须为偶数。
zh_hant: '{0}':文字值的長度必須均等。

# ADP_HexDigitLiteralValue
source: '{0}':The literal value must be a string with hexadecimal digits
de: '{0}':Der Literalwert muss eine Zeichenfolge mit hexadezimalen Stellen sein
es: '{0}':El valor literal debe ser una cadena con dígitos hexadecimales
fr: '{0}' : la valeur littérale doit être une chaîne composée de chiffres hexadécimaux
it: "{0}":il valore letterale deve essere una stringa con cifre esadecimali
ja: '{0}': リテラル値は 16 進数表記の文字列である必要があります。
ko: '{0}': 리터럴 값은 16진수의 문자열이어야 합니다.
pt_br: '{0}':O valor literal deve ser uma cadeia de caracteres com dígitos hexadecimais
ru: "{0}":значением литерала должна быть строка шестнадцатеричных цифр
zh_hans: “{0}”: 文本值必须是十六进制数字的字符串
zh_hant: '{0}':文字值必須是十六進位的字串。

# ADP_QuotePrefixNotSet
source: {0} requires open connection when the quote prefix has not been set.
de: {0} erfordert eine geöffnete Verbindung, wenn das Anführungspräfix nicht festgelegt wurde.
es: {0} requiere una conexión abierta cuando no se ha establecido el prefijo de cita.
fr: {0} nécessite une connexion ouverte lorsque le préfixe de guillemet n'a pas été défini.
it: {0} richiede una connessione aperta se non è stata impostata la virgoletta di prefisso.
ja: 引用符で囲まれたプレフィックスが設定されていない場合、{0} には開かれている接続が必要です。
ko: 따옴표 접두사를 설정하지 않은 경우 {0}을(를) 사용하려면 연결이 열려 있어야 합니다.
pt_br: {0} requer conexão aberta quando o prefixo de aspas não tiver sido definido.
ru: Если не указан префикс с кавычками, то для {0} требуется открытое подключение.
zh_hans: 未设置引号前缀时，{0} 要求已打开的连接。
zh_hant: 當尚未設定引號前置詞時，{0} 需要開啟的連接。

# ADP_UnableToCreateBooleanLiteral
source: Can not determine the correct boolean literal values. Boolean literals can not be created.
de: Die korrekten booleschen Literalwerte können nicht bestimmt werden. Boolean-Literale können nicht erstellt werden.
es: No se pueden determinar los valores literales boolean correctos. No se pueden crear los literales Boolean.
fr: Impossible de déterminer les valeurs littérales booléennes correctes. Impossible de créer des littéraux Boolean.
it: Impossibile determinare i valori letterali booleani corretti. Impossibile creare valori letterali Boolean.
ja: 正しいブール型のリテラル値を特定できません。Boolean リテラルを作成できません。
ko: 올바른 부울 리터럴 값을 확인할 수 없습니다. Boolean 리터럴을 만들 수 없습니다.
pt_br: Não é possível determinar os valores literais Boolean. Não é possível criar literais Boolean.
ru: Не удалось определить правильные значения логических констант. Логические литералы Boolean literals не могут быть созданы.
zh_hans: 无法确定正确的布尔文本值。无法创建 Boolean 文本。
zh_hant: 無法判斷正確的 Boolean 文字值。無法建立 Boolean 文字。

# ADP_UnsupportedNativeDataTypeOleDb
source: Literals of the native data type associated with data type '{0}' are not supported.
de: Literale des nativen Datentyps, die mit dem Datentyp '{0}' verknüpft sind, werden nicht unterstützt.
es: Los literales del tipo de datos nativo asociado al tipo de datos '{0}' no son compatibles.
fr: Les littéraux du type de données natif associé au type de données '{0}' ne sont pas pris en charge.
it: Le rappresentazioni formali del tipo di dati nativo associato al tipo di dati "{0}" non sono supportate.
ja: データ型 '{0}' に関連付けられたネイティブ データ型のリテラルはサポートされていません。
ko: 데이터 유형 '{0}'에 연결된 기본 데이터 유형의 리터럴은 지원되지 않습니다.
pt_br: Não há suporte para literais de tipo de dados nativo associados ao tipo de dados '{0}'.
ru: Константы собственного типа данных, назначенные типу данных "{0}", не поддерживаются.
zh_hans: 不支持与数据类型“{0}”关联的本地数据类型文本。
zh_hant: 不支援與資料型別 '{0}' 相關聯的原始資料型別。

# ADP_InvalidDataType
source: The parameter data type of {0} is invalid.
de: Der Parameterdatentyp von {0} ist ungültig.
es: El tipo de datos del parámetro {0} no es válido.
fr: Le type de données du paramètre de {0} n'est pas valide.
it: Il tipo di dati del parametro di {0} non è valido.
ja: {0} のパラメーター データ型が無効です。
ko: 매개 변수 데이터 형식 {0}이(가) 잘못되었습니다.
pt_br: Tipo de dados de parâmetro de {0} é inválido.
ru: Недопустимый тип данных параметра {0}.
zh_hans: {0} 的参数数据类型无效。
zh_hant: {0} 的參數資料型別無效。

# ADP_UnknownDataType
source: No mapping exists from object type {0} to a known managed provider native type.
de: Es ist keine Zuordnung zwischen dem Objekttyp {0} und einem bekannten verwalteten nativen Providertyp vorhanden.
es: No hay ninguna asignación de tipo de objeto {0} a un tipo nativo de un proveedor administrado conocido.
fr: Aucun mappage n'existe à partir du type d'objet {0} vers un type connu de fournisseur natif managé.
it: Nessun mapping esistente dal tipo di oggetto {0} a un tipo nativo di provider gestito noto.
ja: オブジェクトの型 {0} から既知のマネージ プロバイダーのネイティブ型へのマップがありません。
ko: 개체 유형 {0}에서 알려진 관리되는 공급자 기본 유형으로의 매핑이 없습니다.
pt_br: Não existe mapeamento do tipo de objeto {0} para um provedor gerenciado de tipo nativo.
ru: Отсутствует сопоставление типа объекта {0} с известным собственным типом управляемого поставщика.
zh_hans: 不存在从对象类型 {0} 到已知的托管提供程序本机类型的映射。
zh_hant: 物件型別 {0} 與已知的管理提供者原始型別之間並無對應。

# ADP_UnknownDataTypeCode
source: Unable to handle an unknown TypeCode {0} returned by Type {1}.
de: Der unbekannte TypeCode {0}, der vom Type {1} zurückgegeben wurde, kann nicht behandelt werden.
es: No se puede tratar un TypeCode {0} desconocido devuelto por Type {1}.
fr: Impossible de gérer un TypeCode inconnu {0} retourné par le Type {1}.
it: Impossibile gestire un TypeCode {0} sconosciuto restituito da Type {1}.
ja: 型 {1} によって返された不明な TypeCode {0} を処理できません。
ko: Type {1}에서 반환한 알 수 없는 TypeCode {0}을(를) 처리할 수 없습니다.
pt_br: Não é possível tratar um TypeCode {0} desconhecido retornado pelo tipo {1}.
ru: Не удалось обработать неизвестный код TypeCode {0}, возвращенный типом {1}.
zh_hans: 无法处理由类型 {1} 返回的未知 TypeCode {0}。
zh_hant: 無法處理類型 {1} 所傳回的未知 TypeCode {0}。

# ADP_DbTypeNotSupported
source: No mapping exists from DbType {0} to a known {1}.
de: Es ist keine Zuordnung von DbType {0} zu einem bekannten {1} vorhanden.
es: No hay ninguna asignación de DbType {0} a ningún {1} conocido.
fr: Aucun mappage n'existe à partir de DbType {0} vers un {1} connu.
it: Nessun mapping esistente dal DbType {0} a un {1} riconosciuto.
ja: DbType {0} から周知の型 {1} へのマッピングは存在しません。
ko: DbType {0}에서 {1}(으)로의 매핑이 없습니다.
pt_br: Não existe mapeamento de DbType {0} para um {1} conhecido.
ru: Отсутствует сопоставление DbType {0} с известным {1}.
zh_hans: 没有从 DbType {0} 到已知 {1} 的映射。
zh_hant: DbType {0} 與已知的 {1} 之間並無對應。

# ADP_VersionDoesNotSupportDataType
source: The version of SQL Server in use does not support datatype '{0}'.
de: Die verwendete SQL Server-Version unterstützt nicht den Datentyp '{0}'.
es: La versión de SQL Server utilizada no es compatible con el tipo de datos '{0}'.
fr: La version de SQL Server utilisée ne prend pas en charge le type de données '{0}'.
it: La versione di SQL Server in uso non supporta il tipo di dati "{0}".
ja: 使用されている SQL Server のバージョンでは、データ型 '{0}' がサポートされていません。
ko: 사용 중인 SQL Server 버전에서 데이터 유형 '{0}'을(를) 지원하지 않습니다.
pt_br: A versão do SQL Server em uso não dá suporte ao tipo de dados '{0}'.
ru: Используемая версия SQL Server не поддерживает тип данных "{0}".
zh_hans: 使用的 SQL Server 版本不支持数据类型“{0}”。
zh_hant: 使用中的 SQL Server 版本不支援資料型別 '{0}'。

# ADP_ParameterValueOutOfRange
source: Parameter value '{0}' is out of range.
de: Der Parameterwert '{0}' befindet sich außerhalb des gültigen Bereichs.
es: El valor de parámetro '{0}' está fuera del intervalo.
fr: Valeur du paramètre '{0}' hors limites.
it: Il valore "{0}" del parametro non è compreso nell'intervallo.
ja: パラメーター値 '{0}' が範囲外です。
ko: 매개 변수 값 '{0}'이(가) 범위를 벗어났습니다.
pt_br: Valor de parâmetro '{0}' está fora do intervalo.
ru: Значение параметра "{0}" вне допустимого диапазона.
zh_hans: 参数值“{0}”超出范围。
zh_hant: 參數值 '{0}' 超出範圍。

# ADP_BadParameterName
source: Specified parameter name '{0}' is not valid.
de: Der angegebene Parametername '{0}' ist ungültig.
es: El nombre de parámetro especificado '{0}' no es válido.
fr: Le nom de paramètre spécifié, '{0}', n'est pas valide.
it: Il nome di parametro specificato "{0}" non è valido.
ja: 指定したパラメーター名 '{0}' は無効です。
ko: 지정한 매개 변수 이름 '{0}'이(가) 잘못되었습니다.
pt_br: Nome de parâmetro especificado '{0}' inválido.
ru: Указанное имя параметра "{0}" является недопустимым.
zh_hans: 指定的参数名“{0}”无效。
zh_hant: 指定的參數名稱 '{0}' 無效。

# ADP_MultipleReturnValue
source: Multiple return value parameters are not supported.
de: Mehrere Rückgabewertparameter werden nicht unterstützt.
es: No se admiten varios parámetros de valores devueltos.
fr: Les paramètres de valeur de retour multiples ne sont pas pris en charge.
it: Non sono supportati più parametri di valori restituiti.
ja: 複数の戻り値パラメーターはサポートされていません。
ko: 반환 값이 여러 개인 매개 변수는 지원되지 않습니다.
pt_br: Não há suporte para vários parâmetros de valores de retorno.
ru: Параметры с несколькими возвращаемыми значениями не поддерживаются.
zh_hans: 不支持多个返回值参数。
zh_hant: 不支援多次傳回值參數。

# ADP_InvalidSizeValue
source: Invalid parameter Size value '{0}'. The value must be greater than or equal to 0.
de: Ungültiger Wert für die Parametergröße '{0}'. Der Wert muss größer oder gleich 0 sein.
es: Valor del parámetro Size '{0}' no válido. El valor debe ser mayor o igual a 0.
fr: Valeur Size du paramètre '{0}' non valide. La valeur doit être supérieure ou égale à 0.
it: Valore '{0}' del parametro Size non valido. Il valore deve essere maggiore o uguale a zero.
ja: パラメーター Size の値 '{0}' が無効です。値は 0 に等しいか、またはそれより大きくなければなりません。
ko: 매개 변수 Size 값 '{0}'이(가) 잘못되었습니다. 값은 0보다 크거나 같아야 합니다.
pt_br: Valor '{0}' do parâmetro Size inválido. O valor deve ser maior ou igual a 0.
ru: Недопустимое значение параметра размера "{0}". Значение должно быть больше или равно 0.
zh_hans: 无效的 Size 参数值“{0}”。该值必须大于或等于 0。
zh_hant: 參數 Size 的值 '{0}' 無效，該值必須大於或等於 0。

# ADP_NegativeParameter
source: Invalid value for argument '{0}'. The value must be greater than or equal to 0.
de: Ungültiger Wert für das Argument '{0}'. Der Wert muss größer oder gleich 0 sein.
es: Valor no válido para el argumento '{0}'. El valor debe ser igual o mayor que 0.
fr: Valeur non valide pour l'argument '{0}'. La valeur doit être supérieure ou égale à 0.
it: Valore non valido per l'argomento '{0}'. Il valore deve essere maggiore o uguale a 0.
ja: 引数 '{0}' は無効な値です。0 以上の値を指定してください。
ko: 인수 '{0}'에 대한 값이 잘못되었습니다. 값은 0보다 크거나 같아야 합니다.
pt_br: Valor inválido para argumento '{0}'. O valor deve ser maior ou igual a 0.
ru: Недопустимое значение для аргумента "{0}". Значение должно быть больше или равно нулю.
zh_hans: 参数“{0}”的值无效。该值必须大于或等于 0。
zh_hant: 引數 '{0}' 的無效值。值必須大或等於 0。

# ADP_InvalidMetaDataValue
source: Invalid value for this metadata.
de: Ungültiger Wert für diese Metadaten.
es: Valor no válido para este metadato.
fr: Valeur non valide pour ces métadonnées.
it: Valore non valido per questi metadati.
ja: このメタデータの値は無効です。
ko: 이 메타데이터에 대한 값이 잘못되었습니다.
pt_br: Valor inválido para este metadado.
ru: Недопустимое значение для этих метаданных.
zh_hans: 此元数据的值无效。
zh_hant: 此中繼資料的無效值。

# ADP_NotRowType
source: Metadata must be SqlDbType.Row
de: Metadaten müssen vom Typ SqlDbType.Row sein
es: Los metadatos deben ser SqlDbType.Row
fr: Les métadonnées doivent être SqlDbType.Row
it: I metadati devono essere SqlDbType.Row
ja: メタデータは SqlDbType.Row 型である必要があります。
ko: 메타데이터는 SqlDbType.Row여야 합니다.
pt_br: Metadados devem ser SqlDbType.Row
ru: Метаданные должны быть SqlDbType.Row
zh_hans: 元数据必须为 SqlDbType.Row
zh_hant: 中繼資料必須是 SqlDbType.Row

# ADP_ParameterConversionFailed
source: Failed to convert parameter value from a {0} to a {1}.
de: Parameterwert konnte nicht von {0} in {1} umgewandelt werden.
es: Error al convertir el valor del parámetro de {0} a {1}.
fr: Échec de la conversion de la valeur de paramètre d'un {0} en un {1}.
it: Impossibile convertire il valore del parametro da un {0} a un {1}.
ja: パラメーター値を {0} から {1} に変換できませんでした。
ko: 매개 변수 값을 {0}에서 {1}(으)로 변환하지 못했습니다.
pt_br: Falha ao converter valor de parâmetro de {0} em {1}.
ru: Не удалось преобразовать значение параметра из {0} в {1}.
zh_hans: 将参数值从 {0} 转换到 {1} 失败。
zh_hant: 將參數值從 {0} 轉換成 {1} 失敗。

# ADP_ParallelTransactionsNotSupported
source: {0} does not support parallel transactions.
de: {0} unterstützt keine parallelen Transaktionen.
es: {0} no admite transacciones paralelas.
fr: Les transactions parallèles ne sont pas prises en charge par {0}.
it: {0} non supporta le transazioni parallele.
ja: {0} はパラレル トランザクションをサポートしません。
ko: {0}에서 병렬 트랜잭션을 지원하지 않습니다.
pt_br: {0} não dá suporte para transações paralelas.
ru: {0} не поддерживает параллельные транзакции.
zh_hans: {0} 不支持并行事务。
zh_hant: {0} 不支援平行交易處理。

# ADP_TransactionZombied
source: This {0} has completed; it is no longer usable.
de: {0} wurde beendet und kann nicht mehr verwendet werden.
es: {0} se completó; ya no se puede utilizar.
fr: {0} est terminé ; il n'est plus utilisable.
it: La {0} è completata e non può più essere utilizzata.
ja: この {0} は完了しています。再度使用することはできません。
ko: 이 {0}이(가) 완료되었습니다. 더 이상 사용할 수 없습니다.
pt_br: Este {0} foi concluído; ele não pode mais ser usado.
ru: Данный {0} завершен; его повторное использование невозможно.
zh_hans: 此 {0} 已完成；它再也无法使用。
zh_hant: 這個 {0} 已經完成，它已不再是個可使用的項目。

# ADP_DbRecordReadOnly
source: '{0}' cannot be called when the record is read only.
de: '{0}' kann nicht aufgerufen werden, wenn der Datensatz schreibgeschützt ist.
es: No se puede llamar a '{0}' cuando el registro es de solo lectura.
fr: '{0}' ne peut pas être appelé lorsque l'enregistrement est en lecture seule.
it: Impossibile chiamare "{0}" se il record è di sola lettura.
ja: レコードが読み取り専用の場合は、'{0}' を呼び出すことはできません。
ko: 레코드가 읽기 전용이면 '{0}'을(를) 호출할 수 없습니다.
pt_br: '{0}' não pode ser chamado quando o registro é somente leitura.
ru: Нельзя вызвать "{0}", если запись доступна только для чтения.
zh_hans: 记录为只读时不能调用“{0}”。
zh_hant: 當記錄為唯讀時無法呼叫 '{0}'。

# ADP_DbDataUpdatableRecordReadOnly
source: '{0}' cannot be called when the DbDataRecord is read only.
de: '{0}' kann nicht aufgerufen werden, wenn DbDataRecord schreibgeschützt ist.
es: No se puede llamar a '{0}' cuando DbDataRecord es de solo lectura.
fr: '{0}' ne peut pas être appelé lorsque DbDataRecord est en lecture seule.
it: Impossibile chiamare "{0}" se DbDataRecord è di sola lettura.
ja: DbDataRecord が読み取り専用の場合は、'{0}' を呼び出すことはできません。
ko: DbDataRecord가 읽기 전용이면 '{0}'을(를) 호출할 수 없습니다.
pt_br: '{0}' não pode ser chamado quando o DbDataRecord é somente leitura.
ru: Нельзя вызвать "{0}", если запись DbDataRecord доступна только для чтения.
zh_hans: DbDataRecord 为只读时不能调用“{0}”。
zh_hant: 當 DbDataRecord 為唯讀時無法呼叫 '{0}'。

# ADP_InvalidImplicitConversion
source: Implicit conversion of object type '{0}' to data type '{1}' is not supported.
de: Die implizite Umwandlung des Objekttyps '{0}' in den Datentyp '{1}' wird nicht unterstützt.
es: La conversión implícita del tipo de objeto '{0}' a tipo de dato '{1}' no es compatible.
fr: La conversion implicite du type d'objet '{0}' en type de données '{1}' n'est pas prise en charge.
it: Conversione implicita del tipo di oggetto "{0}" nel tipo di dati "{1}" non supportata.
ja: オブジェクトの型 '{0}' のデータ型 '{1}' への暗黙的な変換はサポートされていません。
ko: 개체 유형 '{0}'을(를) 데이터 형식 '{1}'(으)로 암시적으로 변환할 수 없습니다.
pt_br: Não há suporte para conversão implícita de tipo de objeto '{0}' para tipo de dados '{1}'.
ru: Неявное преобразование типа объекта "{0}" в тип данных "{1}" не поддерживается.
zh_hans: 不支持对象类型“{0}”到数据类型“{1}”的隐式转换。
zh_hant: 不支援將物件型別 '{0}' 隱含轉換成資料型別 '{1}'。

# ADP_InvalidBufferSizeOrIndex
source: Buffer offset '{1}' plus the bytes available '{0}' is greater than the length of the passed in buffer.
de: Pufferoffset '{1}' plus verfügbare Bytes '{0}' ist größer als die Länge des übergebenen Puffers.
es: El desplazamiento del búfer '{1}' más los bytes disponibles '{0}' es mayor que la longitud del búfer introducido.
fr: L'offset de la mémoire tampon « {1} » plus les octets disponibles « {0} » sont supérieurs à la longueur de la mémoire tampon passée.
it: L'offset del buffer '{1}' sommato ai byte disponibili '{0}' è maggiore della lunghezza del buffer passato.
ja: バッファー オフセット '{1}' と使用できるバイト数 '{0}' の合計が、バッファーに渡された長さを超えています。
ko: 버퍼 오프셋 '{1}'과(와) 사용 가능한 바이트 '{0}'을(를) 더한 값이 전달된 버퍼의 길이보다 큽니다.
pt_br: O valor de deslocamento de buffer '{1}' mais os bytes disponíveis '{0}' é maior que o tamanho passado no buffer.
ru: Смещение в буфере "{1}" и доступные байты "{0}" в сумме больше, чем длина, переданная в буфер.
zh_hans: 缓冲区偏移量“{1}”加上“{0}”可用字节数大于在缓冲区中传递的长度。
zh_hant: 緩衝區位移 '{1}' 加上可用位元組 '{0}'，大於傳入之緩衝區的長度。

# ADP_InvalidDataLength
source: Data length '{0}' is less than 0.
de: Datenlänge '{0}' ist kleiner als 0.
es: La longitud de los datos '{0}' es menor que 0.
fr: La longueur des données « {0} » est inférieure à 0.
it: Lunghezza dei dati '{0}' minore di 0.
ja: データの長さ '{0}' が 0 未満です。
ko: 데이터 길이 '{0}'은(는) 0보다 작습니다.
pt_br: O comprimento de dados '{0}' é menor que 0.
ru: Длина данных "{0}" меньше 0.
zh_hans: 数据长度“{0}”小于 0。
zh_hant: 資料長度 '{0}' 小於 0。

# ADP_InvalidDataLength2
source: Specified length '{0}' is out of range.
de: Die angegebene Länge '{0}' ist außerhalb des Gültigkeitsbereichs.
es: La longitud '{0}' especificada está fuera del intervalo.
fr: La longueur spécifiée '{0}' est hors limites.
it: La lunghezza specificata "{0}" non è compresa nell'intervallo.
ja: 指定された長さ '{0}' は有効範囲外です。
ko: 지정한 길이 '{0}'이(가) 범위를 벗어났습니다.
pt_br: O comprimento especificado '{0}' está fora do intervalo.
ru: Указанная длина "{0}" находится вне допустимого диапазона.
zh_hans: 指定长度“{0}”超出了范围。
zh_hant: 指定的長度 '{0}' 超出範圍。

# ADP_NonSeqByteAccess
source: Invalid {2} attempt at dataIndex '{0}'. With CommandBehavior.SequentialAccess, you may only read from dataIndex '{1}' or greater.
de: Ungültiger Versuch dataIndex '{0}' zu {2}. Mit CommandBehavior.SequentialAccess kann nur dataIndex '{1}' oder größer gelesen werden.
es: Intento {2} no válido de dataIndex '{0}'. Con CommandBehavior.SequentialAccess, sólo puede leer de '{1}' dataIndex o mayores.
fr: Tentative {2} non valide au niveau de dataIndex '{0}'. Avec CommandBehavior.SequentialAccess ; vous ne pouvez lire qu'à partir de dataIndex '{1}' ou supérieur.
it: Tentativo di {2} nel dataIndex '{0}' non valido. Con CommandBehavior.SequentialAccess è possibile iniziare la lettura solo dal dataIndex '{1}'.
ja: dataIndex '{0}' での操作 {2} は無効です。CommandBehavior.SequentialAccess を使用する読み取りは、dataIndex '{1}' またはそれ以上のみ可能です
ko: '{0}' dataIndex에서 {2} 시도가 잘못되었습니다. CommandBehavior.SequentialAccess를 사용하는 경우 '{1}' dataIndex 이상에서만 읽을 수 있습니다.
pt_br: Tentativa de {2} inválida em dataIndex '{0}'. Com CommandBehavior.SequentialAccess, só é possível ler de dataIndex '{1}' ou maior.
ru: Недопустимая попытка {2} для dataIndex "{0}". При CommandBehavior.SequentialAccess считывание разрешается только при dataIndex "{1}" и больше.
zh_hans: 在 dataIndex“{0}”处的 {2} 尝试无效。通过 CommandBehavior.SequentialAccess 只能从“{1}”或更大的 dataIndex 处读取。
zh_hant: 在 dataIndex '{0}' 上無效的 {2} 嘗試。使用 CommandBehavior.SequentialAccess 時，您只能讀取大於或等於 dataIndex '{1}' 的值。

# ADP_OffsetOutOfRangeException
source: Offset must refer to a location within the value.
de: Offset muss sich auf eine Stelle im Wert beziehen.
es: El desplazamiento debe hacer referencia a una ubicación dentro del valor.
fr: Offset doit faire référence à un emplacement de la valeur.
it: Offset deve fare riferimento a una posizione all'interno del valore.
ja: オフセットは、値内の場所を参照する必要があります。
ko: 오프셋은 값 내의 위치를 참조해야 합니다.
pt_br: Deslocamento deve fazer referência a um local dentro do valor.
ru: Смещение должно ссылаться на позицию в пределах значения.
zh_hans: 偏移量必须指向值内的某个位置。
zh_hant: 位移必須參考值內的位置。

# ODBC_GetSchemaRestrictionRequired
source: "The ODBC managed provider requires that the TABLE_NAME restriction be specified and non-null for the GetSchema indexes collection.
de: "Der von ODBC verwaltete Provider erfordert es, dass die TABLE_NAME-Einschränkung angegeben wird und für die 'GetSchema'-Indexsammlung ungleich Null ist.
es: "El proveedor de ODBC administrado requiere que se especifique la restricción TABLE_NAME y que no sea null para la colección de índices GetSchema.
fr: Pour le fournisseur managé par ODBC, la restriction TABLE_NAME doit être spécifiée et non null pour la collection d'index GetSchema.
it: "per il provider gestito ODBC è necessario specificare la restrizione TABLE_NAME e che i valori della raccolta di indici GetSchema non siano null.
ja: "ODBC マネージド プロバイダーでは、TABLE_NAME 制約の指定が必要です。GetSchema インデックス コレクションの場合は、この制約は Null でない必要があります。
ko: ODBC 관리되는 공급자를 사용하려면 TABLE_NAME 제한을 지정해야 하며 GetSchema 인덱스 컬렉션에 대해 Null이 아닌 값을 지정해야 합니다.
pt_br: "O provedor gerenciado ODBC requer que a restrição TABLE_NAME seja especificada e não nula para a coleção de índices GetSchema.
ru: "Управляемому поставщику ODBC необходимо, чтобы для коллекции индексов GetSchema ограничение TABLE_NAME было определено и не было пустым.
zh_hans: "ODBC 托管提供程序要求为 GetSchema 索引集合指定 TABLE_NAME 限制并且不能是 Null。
zh_hant: "The ODBC 管理提供者要求指定 TABLE_NAME 限制，且 GetSchema 索引集合為非空值。
