Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataColumn_NullValues
source: Column '{0}' does not allow nulls.
de: Spalte '{0}' läßt nicht 'nulls' zu.
es: La columna '{0}' no permite tener valores nulls.
fr: La colonne '{0}' n'autorise pas les valeurs nulls.
it: La colonna '{0}' non accetta valori nulls.
ja: 列 '{0}' に nulls を使用することはできません。
ko: '{0}' 열에 nulls를 사용할 수 없습니다.
pt_br: Column '{0}' não permite valores nulls.
ru: В столбце "{0}" не допускаются значения равные nulls.
zh_hans: 列“{0}”不允许 nulls。
zh_hant: 資料行 '{0}' 不允許 nulls。

# DataColumn_ReadOnly
source: Column '{0}' is read only.
de: Spalte '{0}' ist schreibgeschützt.
es: La columna '{0}' es de solo lectura.
fr: La colonne '{0}' est en lecture seule.
it: La colonna '{0}' è di sola lettura.
ja: 列 '{0}' は読み取り専用です。
ko: '{0}' 열은 읽기 전용입니다.
pt_br: Coluna '{0}' é somente leitura.
ru: Столбец "{0}" доступен только для чтения.
zh_hans: 列“{0}”为只读。
zh_hant: 資料行 '{0}' 是唯讀。

# DataColumn_NonUniqueValues
source: Column '{0}' contains non-unique values.
de: Spalte '{0}' enthält nicht eindeutige Werte.
es: La Column '{0}' contiene valores que no son únicos.
fr: La colonne '{0}' contient des valeurs qui ne sont pas uniques.
it: Column '{0}' contiene valori non univoci.
ja: 列 '{0}' には一意でない値が含まれています。
ko: 열 '{0}'에 고유하지 않은 값이 있습니다.
pt_br: A Column '{0}' contém valores não exclusivos.
ru: Столбец "{0}" содержит повторяющиеся значения.
zh_hans: 列“{0}”包含不唯一的值。
zh_hant: Column '{0}' 包含非唯一的值。

# DataColumn_NotInTheTable
source: Column '{0}' does not belong to table {1}.
de: Spalte '{0}' gehört nicht zu Tabelle {1}.
es: La columna '{0}' no pertenece a la tabla {1}.
fr: La colonne '{0}' n'appartient pas à la table {1}.
it: La colonna '{0}' non appartiene alla tabella {1}.
ja: 列 '{0}' はテーブル {1} に属していません。
ko: '{0}' 열은 {1} 테이블에 속하지 않습니다.
pt_br: A coluna '{0}' não pertence à tabela {1}.
ru: Столбец "{0}" не принадлежит таблице {1}.
zh_hans: 列“{0}”不属于表 {1}。
zh_hant: 資料行 '{0}' 不屬於資料表 {1}。

# DataColumn_NotInAnyTable
source: Column must belong to a table.
de: Spalte gehört in eine Tabelle.
es: La columna debe pertenecer a una tabla.
fr: La colonne doit appartenir à une table.
it: La colonna deve appartenere a una tabella.
ja: 列はテーブルに属していなければなりません。
ko: 열은 테이블에 속해야 합니다.
pt_br: A coluna deve pertencer a uma tabela.
ru: Столбец должен принадлежать таблице.
zh_hans: 列必须属于某个表。
zh_hant: 資料行必須屬於資料表。

# DataColumn_SetFailed
source: Couldn't store <{0}> in {1} Column. Expected type is {2}.
de: <{0}> konnte nicht in der {1}-Spalte gespeichert werden. Erwarteter Typ: {2}.
es: No se puede almacenar <{0}> en la columna {1}. El tipo esperado es {2}.
fr: Impossible de stocker <{0}> dans la colonne {1}. Type attendu est {2}.
it: Impossibile archiviare <{0}> nella colonna {1}. Il tipo previsto è {2}.
ja: 列 {1} に <{0}> を格納できませんでした。 必要な型は {2} です。
ko: <{0}>을(를) {1} 열에 저장할 수 없습니다. {2} 형식이 필요합니다.
pt_br: Não foi possível armazenar <{0}> na coluna {1}. O tipo esperado é {2}.
ru: Невозможно сохранить <{0}> в столбце {1}. Ожидался тип {2}.
zh_hans: 不能在 {1} 列中存储 <{0}>。所需类型是 {2}。
zh_hant: 無法在 {1} 資料行中儲存 <{0}>。需要的型別是 {2}。

# DataColumn_CannotSetToNull
source: Cannot set Column '{0}' to be null. Please use DBNull instead.
de: Column '{0}' kann nicht auf 'null' gesetzt werden. Verwenden Sie statt dessen DBNull.
es: No puede establecer el valor de Column '{0}' en null. Utilice DBNull en su lugar.
fr: Impossible de définir Column '{0}' à null. Utilisez DBNull à la place.
it: Impossibile impostare Column '{0}' come null. Utilizzare invece DBNull.
ja: Column '{0}' を null に設定できません。DBNull を使用してください。
ko: Column '{0}'을(를) null로 설정할 수 없습니다. 대신 DBNull을 사용하십시오.
pt_br: Não é possível definir a Column '{0}' como null. Em seu lugar, use DBNull.
ru: Невозможно присвоить столбцу Column "{0}" значение null. Используйте DBNull.
zh_hans: 不能将 Column“{0}”设置为 null。请改用 DBNull。
zh_hant: 無法將 Column '{0}' 設定為 null，請改用 DBNull。

# DataColumn_LongerThanMaxLength
source: Cannot set column '{0}'. The value violates the MaxLength limit of this column.
de: Die Spalte kann nicht auf '{0}' festgelegt werden. Der Wert überschreitet den MaxLength-Grenzwert dieser Spalte.
es: No se puede establecer la columna '{0}'. El valor infringe el límite de MaxLength de esta columna.
fr: Impossible de définir la colonne '{0}'. La valeur dépasse la limite MaxLength de cette colonne.
it: Impossibile impostare la colonna "{0}". Il valore viola il limite MaxLength della colonna.
ja: 列 '{0}' を設定できません。値が、この列に指定できる MaxLength の制限を超えています。
ko: 열 '{0}'을(를) 설정할 수 없습니다. 값이 이 열의 MaxLength 제한을 위반합니다.
pt_br: Não é possível definir a coluna '{0}'. O valor viola o limite de MaxLength desta coluna.
ru: Не удается задать столбец "{0}". Значение нарушает ограничение MaxLength для этого столбца.
zh_hans: 无法设置列“{0}”。此值违反了此列的 MaxLength 限制。
zh_hant: 無法設定資料行 '{0}'。該值違反了這個資料行的 MaxLength 限制。

# DataColumn_HasToBeStringType
source: MaxLength applies to string data type only. You cannot set Column '{0}' property MaxLength to be non-negative number.
de: MaxLength trifft nur auf den Datentyp der Zeichenfolge zu. Die MaxLength-Eigenschaft von Column '{0}' kann nicht auf eine positive Zahl festgelegt werden.
es: MaxLength se aplica únicamente al tipo de datos String. La propiedad MaxLength de Column '{0}' no se puede establecer en un número negativo.
fr: MaxLength s'applique uniquement au type de données string. Vous ne pouvez pas définir la propriété MaxLength de Column '{0}' avec un nombre non négatif.
it: MaxLength è applicabile solo ai dati di tipo stringa. Non è possibile impostare la proprietà MaxLength di Column '{0}' come numero non negativo.
ja: MaxLength は、文字列データ型にのみ適用します。Column '{0}' プロパティの MaxLength を、負でない数に設定することはできません。
ko: MaxLength는 문자열 데이터 형식에만 적용됩니다. Column '{0}'의 MaxLength 속성을 음수가 아닌 숫자로 설정할 수 없습니다.
pt_br: MaxLength aplica-se apenas a tipo de dados de cadeia de caracteres. Não é possível definir a propriedade MaxLength da Column '{0}' como um número não negativo.
ru: MaxLength действует только в отношении данных строкового типа. Для свойства MaxLength столбца Column "{0}" невозможно установить значение в виде неотрицательного числа.
zh_hans: MaxLength 仅适用于字符串数据类型。您不能将 Column“{0}”的属性 MaxLength 设置为非负数字。
zh_hant: MaxLength 只適用於字串資料型別。您無法將 Column '{0}' 的 MaxLength 屬性設定成非負數。

# DataColumn_CannotSetMaxLength
source: Cannot set Column '{0}' property MaxLength to '{1}'. There is at least one string in the table longer than the new limit.
de: Die MaxLength-Eigenschaft von Column '{0}' kann nicht auf '{1}' festgelegt werden. Mindestens eine Zeichenfolge in der Tabelle überschreitet die neue Grenze.
es: No se puede establecer la propiedad MaxLength de Column '{0}' en '{1}'. Hay al menos una cadena en la tabla más larga que el nuevo límite.
fr: Impossible de définir la propriété MaxLength en '{1}' pour Column'{0}'. Au moins une chaîne dans la table est plus longue que la nouvelle limite.
it: Impossibile impostare su '{1}' la proprietà MaxLength di Column '{0}'. La tabella contiene almeno una stringa di lunghezza superiore al nuovo limite.
ja: Column '{0}' プロパティの MaxLength を '{1}' に設定できません。テーブルに、新しい制限よりも長い文字列が少なくとも 1 つあります。
ko: Column '{0}'의 MaxLength 속성을 '{1}'(으)로 설정할 수 없습니다. 테이블에 새 제한값보다 긴 문자열이 최소한 하나 이상 있습니다.
pt_br: Não é possível definir a propriedade MaxLength da Column '{0}' como '{1}'. Há pelo menos uma cadeia de caracteres da tabela maior do que o novo limite.
ru: Невозможно присвоить свойству MaxLength столбца Column "{0}" значение "{1}". Длина по меньшей мере одной строки в таблице превышает новое предельное значение.
zh_hans: 无法将 Column“{0}”的属性 MaxLength 设置为“{1}”。表中至少存在一个长度超过新的限制的字符串。
zh_hant: 無法將 Column '{0}' 的 MaxLength 屬性設定成 '{1}'。資料表中至少有一個字串的長度超過新的限制。

# DataColumn_CannotSetMaxLength2
source: Cannot set Column '{0}' property MaxLength. The Column is SimpleContent.
de: Die MaxLength-Eigenschaft für die Spalte '{0}' kann nicht festgelegt werden. Column ist SimpleContent.
es: No se puede establecer la propiedad MaxLength de Column '{0}'. La columna es SimpleContent.
fr: Impossible de définir la propriété MaxLength de Column '{0}'. La colonne est de type SimpleContent.
it: Impossibile impostare la proprietà MaxLength di Column '{0}'. Column è SimpleContent.
ja: Column '{0}' プロパティの MaxLength を設定できません。この Column は SimpleContent です。
ko: Column '{0}'의 MaxLength 속성을 설정할 수 없습니다. 해당 열이 SimpleContent입니다.
pt_br: Não é possível definir a propriedade MaxLength da Column '{0}'. A Column é SimpleContent.
ru: Невозможно задать свойство MaxLength столбца Column "{0}". Он является столбцом Column SimpleContent.
zh_hans: 无法设置 Column“{0}”的属性 MaxLength。该列为 SimpleContent。
zh_hant: 無法設定 Column '{0}' 的 MaxLength 屬性。Column 是 SimpleContent。

# DataColumn_CannotSimpleContentType
source: Cannot set Column '{0}' property DataType to {1}. The Column is SimpleContent.
de: Die DataType-Eigenschaft für die Spalte '{0}' kann nicht auf {1} festgelegt werden. Column ist SimpleContent.
es: No se puede establecer la propiedad DataType de Column '{0}' en {1}. La columna es SimpleContent.
fr: Impossible de définir la propriété DataType à {1} pour Column '{0}'. La colonne est de type SimpleContent.
it: Impossibile impostare su {1} la proprietà DataType di Column '{0}'. Column è SimpleContent.
ja: Column '{0}' プロパティの DataType を {1} に設定できません。この Column は SimpleContent です。
ko: Column '{0}'의 DataType 속성을 {1}(으)로 설정할 수 없습니다. 해당 열이 SimpleContent입니다.
pt_br: Não é possível definir a propriedade DataType da Column '{0}' como {1}. A Column é SimpleContent.
ru: Невозможно присвоить свойству DataType столбца Column "{0}" значение {1}. Он является столбцом SimpleContent.
zh_hans: 无法将 Column“{0}”的属性 DataType 设置为 {1}。该列为 SimpleContent。
zh_hant: 無法將 Column '{0}' 的 DataType 屬性設定成 {1}。Column 是 SimpleContent。

# DataColumn_CannotSimpleContent
source: Cannot set Column '{0}' property MappingType to SimpleContent. The Column DataType is {1}.
de: Die MappingType-Eigenschaft für die Spalte '{0}' kann nicht auf SimpleContent festgelegt werden. Der DataType von Column ist {1}.
es: No se puede establecer la propiedad MappingType de Column '{0}' en SimpleContent. DataType de la columna es {1}.
fr: Impossible de définir la propriété MappingType à SimpleContent pour la colonne '{0}'. Le DataType de Column est {1}.
it: Impossibile impostare su SimpleContent la proprietà MappingType della colonna '{0}'. DataType di Column è {1}.
ja: Column '{0}' プロパティの MappingType を SimpleContent に設定できません。Column の DataType は {1} です。
ko: Column '{0}'의 MappingType 속성을 SimpleContent로 설정할 수 없습니다. 해당 열의 DataType은 {1}입니다.
pt_br: Não é possível definir a propriedade MappingType da Column '{0}' como SimpleContent. DataType de Column coluna é {1}.
ru: Невозможно присвоить свойству MappingType столбца Column "{0}" значение SimpleContent. DataType столбца равен {1}.
zh_hans: 无法将 Column“{0}”的属性 MappingType 设置为 SimpleContent。Column DataType 为 {1}。
zh_hant: 無法將 Column '{0}' 的 MappingType 屬性設定成 SimpleContent。Column 的 DataType 是 {1}。

# DataColumn_ExceedMaxLength
source: Column '{0}' exceeds the MaxLength limit.
de: Column '{0}' überschreitet das MaxLength-Limit.
es: La Column '{0}' superó el límite de MaxLength.
fr: Column '{0}' dépasse la limite MaxLength.
it: Column '{0}' supera il limite MaxLength.
ja: Column '{0}' が MaxLength の制限を超えています。
ko: Column '{0}'이(가) MaxLength 제한값을 초과합니다.
pt_br: A Column '{0}' excede o limite de MaxLength.
ru: В столбце Column "{0}" превышено ограничение, которое задает MaxLength.
zh_hans: Column“{0}”超过 MaxLength 限制。
zh_hant: Column '{0}' 超過 MaxLength 的限制。

# DataColumn_NotAllowDBNull
source: Column '{0}' does not allow DBNull.Value.
de: Die Spalte '{0}' lässt DBNull.Value nicht zu.
es: La columna '{0}' no admite DBNull.Value.
fr: La colonne '{0}' n'autorise pas DBNull.Value.
it: DBNull.Value non consentito per la colonna '{0}'.
ja: 列 '{0}' で DBNull.Value を使用できません。
ko: 열 '{0}'에는 DBNull.Value를 사용할 수 없습니다.
pt_br: A coluna '{0}' não permite DBNull.Value.
ru: Для столбца "{0}" использование DBNull.Value не разрешено.
zh_hans: 列“{0}”不允许 DBNull.Value。
zh_hant: 資料行 '{0}' 不允許 DBNull.Value。

# DataColumn_CannotChangeNamespace
source: Cannot change the Column '{0}' property Namespace. The Column is SimpleContent.
de: Die Namespace-Eigenschaft für die Spalte '{0}' kann nicht geändert werden. Column ist SimpleContent.
es: No se puede cambiar la propiedad Namespace de Column '{0}'. La columna es SimpleContent.
fr: Impossible de modifier la propriété Namespace de Column '{0}'. La colonne est de type SimpleContent.
it: Impossibile modificare la proprietà Namespace di Column '{0}'. Column è SimpleContent.
ja: Column '{0}' プロパティの Namespace を変更できません。この Column は SimpleContent です。
ko: Column '{0}'의 Namespace 속성을 변경할 수 없습니다. 해당 열이 SimpleContent입니다.
pt_br: Não é possível alterar a propriedade Namespace da coluna '{0}'. Column é SimpleContent.
ru: Невозможно изменить свойство Namespace столбца Column "{0}". Он является столбцом SimpleContent.
zh_hans: 无法更改 Column“{0}”的 Namespace 属性。该列为 SimpleContent。
zh_hant: 無法變更 Column '{0}' 的 Namespace 屬性。Column 是 SimpleContent。

# DataColumn_AutoIncrementCannotSetIfHasData
source: Cannot change AutoIncrement of a DataColumn with type '{0}' once it has data.
de: AutoIncrement einer DataColumn mit dem Typ '{0}' kann nicht geändert werden, sobald diese Daten enthält.
es: Una vez que tiene datos, no se puede cambiar AutoIncrement en DataColumn con tipo '{0}'.
fr: Impossible de modifier AutoIncrement d'un DataColumn du type '{0}' lorsqu'il comporte des données.
it: Impossibile modificare con il tipo "{0}" la proprietà AutoIncrement di una DataColumn contenente dati.
ja: '{0}' 型 の DataColumn AutoIncrement は、一度データが設定されたら変更できません。
ko: DataColumn에 데이터가 있으면 유형이 '{0}'인 DataColumn의 AutoIncrement를 변경할 수 없습니다.
pt_br: Não é possível alterar AutoIncrement de um DataColumn com tipo '{0}' quando ele já tem dados.
ru: Не удалось изменить AutoIncrement для DataColumn типа "{0}", поскольку он содержит данные.
zh_hans: 类型为“{0}”的 DataColumn 一旦拥有数据，就无法更改其 AutoIncrement。
zh_hant: 一旦 DataColumn 的 AutoIncrement 包含資料，就無法變更為型別 '{0}'。

# DataColumn_NotInTheUnderlyingTable
source: Column '{0}' does not belong to underlying table '{1}'.
de: Die Spalte '{0}' gehört nicht zur zugrunde liegenden Tabelle '{1}'.
es: La columna '{0}' no pertenece a la tabla subyacente '{1}'.
fr: La colonne '{0}' n'appartient pas à la table sous-jacente '{1}'.
it: La colonna "{0}" non appartiene alla tabella sottostante "{1}".
ja: 列 '{0}' は基になるテーブル {1} に属していません。
ko: 열 '{0}'은(는) 기본 테이블 '{1}'에 속하지 않습니다.
pt_br: A coluna '{0}' não pertence à tabela '{1}' subjacente.
ru: Столбец "{0}" не принадлежит базовой таблице "{1}".
zh_hans: 列“{0}”不属于基础表“{1}”。
zh_hant: 資料行 '{0}' 不屬於下列的資料表 '{1}'。

# DataColumn_InvalidDataColumnMapping
source: DataColumn with type '{0}' is a complexType. Can not serialize value of a complex type as Attribute
de: 'DataColumn' mit Typ '{0}' ist ein 'complexType'. Der Wert eines 'complexType' kann nicht als 'Attribute' serialisiert werden.
es: DataColumn con tipo '{0}' es un complexType. No se puede serializar el valor de un tipo complejo como Attribute
fr: DataColumn de type '{0}' est de type complexType. Impossible de sérialiser la valeur d'un type complexe comme Attribute
it: La DataColumn con il tipo "{0}" è una complexType. Impossibile serializzare il valore di un tipo complex come Attribute
ja: '{0}' 型の DataColumn は complexType です。複合型の値を Attribute としてシリアル化することはできません
ko: 형식이 '{0}'인 DataColumn은 complexType입니다. 복합 형식의 값을 Attribute로 serialize할 수 없습니다.
pt_br: DataColumn com tipo '{0}' é um complexType. Não é possível serializar valor de tipo complexo como Attribute
ru: DataColumn типа "{0}" относится к типу complexType. Невозможно сериализовать значение составного типа как атрибут Attribute.
zh_hans: 类型“{0}”的 DataColumn 是 complexType。无法将复杂类型的值序列化为 Attribute
zh_hant: 資料型別 '{0}' 的 DataColumn 是一個 complexType。無法將複雜型別的值序列化為 Attribute。

# DataColumn_CannotSetDateTimeModeForNonDateTimeColumns
source: The DateTimeMode can be set only on DataColumns of type DateTime.
de: Der DateTimeMode kann nur für DataColumns vom Typ DateTime festgelegt werden.
es: DateTimeMode solo se puede establecer en DataColumns de tipo DateTime.
fr: Possibilité de définir DateTimeMode uniquement sur les DataColumns du type DateTime.
it: La proprietà DateTimeMode può essere impostata solo su DataColumns di tipo DateTime.
ja: DateTimeMode を設定できるのは、DateTime 型の DataColumns に対してのみです。
ko: DateTimeMode는 DateTime 유형의 DataColumns에만 설정할 수 있습니다.
pt_br: DateTimeMode somente pode ser definido em DataColumns do tipo DateTime.
ru: DateTimeMode может быть назначен только для DataColumns типа DateTime.
zh_hans: 只可在 DateTime 类型的 DataColumns 上设置 DateTimeMode。
zh_hant: 僅可在型別 DateTime 的 DataColumns 中設定 DateTimeMode。

# DataColumn_InvalidDateTimeMode
source: '{0}' is Invalid DataSetDateTime value.
de: '{0}' ist ein ungültiger DataSetDateTime-Wert.
es: '{0}' es un valor DataSetDateTime no válido.
fr: La valeur du DataSetDateTime de '{0}' n'est pas valide.
it: "{0}" è un valore di DataSetDateTime non valido.
ja: '{0}' は無効な DataSetDateTime 値です。
ko: '{0}'은(는) 잘못된 DataSetDateTime 값입니다.
pt_br: '{0}' é um valor de DataSetDateTime inválido.
ru: "{0}" является недействительным значением DataSetDateTime.
zh_hans: “{0}”是无效的 DataSetDateTime 值。
zh_hant: '{0}' 不是有效的 DataSetDateTime 值。

# DataColumn_DateTimeMode
source: Cannot change DateTimeMode from '{0}' to '{1}' once the table has data.
de: Der 'DateTimeMode' kann nicht von '{0}' in '{1}' geändert werden, sobald die Tabelle Daten enthält.
es: No se puede cambiar DateTimeMode de '{0}' a '{1}' una vez que la tabla contiene datos.
fr: Impossible de modifier DateTimeMode de '{0}' en '{1}' lorsque la table contient des données.
it: Impossibile modificare la proprietà DateTimeMode da '{0}' a '{1}' di una colonna contenente dati.
ja: テーブルにデータを指定した後は、DateTimeMode を '{0}' から '{1}' に変更することはできません。
ko: 테이블에 데이터가 있으면 DateTimeMode를 '{0}'에서 '{1}'(으)로 변경할 수 없습니다.
pt_br: Não é possível alterar DateTimeMode de '{0}' para '{1}' quando a tabela tem dados.
ru: Не удалось изменить DateTimeMode с "{0}" на "{1}", поскольку таблица содержит данные.
zh_hans: 一旦表具有数据，就无法将 DateTimeMode 由“{0}”更改为“{1}”。
zh_hant: 一旦 DateTimeMode 表格中有資料時，就無法將 '{0}' 變更為 '{1}'。

# DataColumn_INullableUDTwithoutStaticNull
source: Type '{0}' does not contain static Null property or field.
de: Type '{0}' enthält nicht die static Null-Eigenschaft bzw. das Null-Feld.
es: El Type '{0}' no contiene el campo o la propiedad Null static.
fr: Type '{0}' ne contient pas la propriété ou le champ Null static.
it: Type "{0}" non contiene proprietà o campi Null statici.
ja: Type '{0}' には static Null プロパティまたはフィールドがありません。
ko: Type '{0}'에 static Null 속성 또는 필드가 없습니다.
pt_br: Type '{0}' não contém campo ou propriedade Null static.
ru: Тип Type "{0}" не содержит статическое свойство или поле static Null.
zh_hans: Type“{0}”不包含 static Null 属性或字段。
zh_hant: Type '{0}' 不包含 static Null 屬性或欄位。

# DataColumn_UDTImplementsIChangeTrackingButnotIRevertible
source: Type '{0}' does not implement IRevertibleChangeTracking; therefore can not proceed with RejectChanges().
de: Der Typ '{0}' implementiert nicht IRevertibleChangeTracking. Deswegen ist eine Fortsetzung mit RejectChanges() nicht möglich.
es: El tipo '{0}' no implementa IRevertibleChangeTracking; por tanto, no se puede continuar con RejectChanges().
fr: Le type '{0}' n'implémente pas IRevertibleChangeTracking ; impossible de poursuivre RejectChanges().
it: Il tipo "{0}" non implementa IRevertibleChangeTracking, pertanto non può procedere con RejectChanges().
ja: 型 '{0}' は IRevertibleChangeTracking を実装しないため、RejectChanges() を実行できません。
ko: 유형 '{0}'이(가) IRevertibleChangeTracking을 구현하지 않으므로 RejectChanges()를 계속할 수 없습니다.
pt_br: Tipo '{0}' não implementa IRevertibleChangeTracking; por isso não pode proceder com RejectChanges().
ru: Тип "{0}" не содержит реализации IRevertibleChangeTracking; невозможно продолжить RejectChanges().
zh_hans: 类型“{0}”不实现 IRevertibleChangeTracking；因此不能使用 RejectChanges() 继续。
zh_hant: 型別 '{0}' 不實作 IRevertibleChangeTracking；因此無法進行 RejectChanges()。

# DataColumn_SetAddedAndModifiedCalledOnNonUnchanged
source: SetAdded and SetModified can only be called on DataRows with Unchanged DataRowState.
de: SetAdded und SetModified können nur für DataRows mit Unchanged DataRowState aufgerufen werden.
es: Solo se puede llamar a SetAdded y SetModified en DataRows con DataRowState no modificado.
fr: SetAdded et SetModified peuvent uniquement être appelés sur DataRows avec l'état DataRowState Unchanged.
it: È possibile chiamare SetAdded e SetModified sui DataRows con DataRowState Unchanged.
ja: SetAdded および SetModified を呼び出せるのは、DataRowState プロパティの値が Unchanged である DataRows オブジェクトからのみです。
ko: SetAdded 및 SetModified는 DataRowState가 Unchanged인 DataRows에서만 호출할 수 있습니다.
pt_br: SetAdded e SetModified somente podem ser chamados em DataRows com Unchanged DataRowState.
ru: SetAdded и SetModified могут вызываться только для DataRows с неизмененным DataRowState.
zh_hans: 只能在具有 Unchanged DataRowState 的 DataRows 上调用 SetAdded 和 SetModified 。
zh_hant: 僅可使用未變更 DataRowState 的 DataRows 呼叫 SetAdded 與 SetModified。

# DataColumn_OrdinalExceedMaximun
source: Ordinal '{0}' exceeds the maximum number.
de: Die Ordinalzahl '{0}' überschreitet die Höchstzahl.
es: El valor ordinal '{0}' supera el número máximo.
fr: L'ordinal '{0}' dépasse le nombre maximal.
it: L'ordinale "{0}" supera il numero massimo.
ja: 序数 '{0}' は最大数を超えています。
ko: 서수 '{0}'이(가) 최대 수를 초과합니다.
pt_br: Ordinal '{0}' excede o número máximo.
ru: Порядковый номер "{0}" превышает максимальное значение.
zh_hans: 序数“{0}”超出了最大数字。
zh_hant: 序數 '{0}' 超過上限。

# DataColumn_NullableTypesNotSupported
source: DataSet does not support System.Nullable<>.
de: 'DataSet' unterstützt nicht System.Nullable<>.
es: DataSet no admite System.Nullable<>.
fr: DataSet ne prend pas en charge System.Nullable<>.
it: DataSet non supporta System.Nullable<>.
ja: DataSet は System.Nullable<> をサポートしていません。
ko: DataSet에서 System.Nullable<>을 지원하지 않습니다.
pt_br: DataSet não dá suporte a System.Nullable<>.
ru: DataSet не поддерживает System.Nullable<>.
zh_hans: DataSet 不支持 System.Nullable<>。
zh_hant: DataSet 不支援 System.Nullable<>。

# DataConstraint_NoName
source: Cannot change the name of a constraint to empty string when it is in the ConstraintCollection.
de: Der Name einer Einschränkung kann nicht in eine leere Zeichenfolge geändert werden, wenn sie sich in der ConstraintCollection befindet.
es: No se puede cambiar el nombre de una restricción por una cadena vacía cuando está en ConstraintCollection.
fr: Impossible de changer le nom d'une contrainte en chaîne vide lorsqu'elle se trouve dans ConstraintCollection.
it: Impossibile modificare in una stringa vuota il nome di un vincolo contenuto in ConstraintCollection.
ja: 制約の名前が ConstraintCollection にあるときは、それを空の文字列に変更することはできません。
ko: ConstraintCollection에 포함되어 있는 경우 해당 제약 조건의 이름을 빈 문자열로 변경할 수 없습니다.
pt_br: Não é possível trocar o nome de uma restrição por uma cadeia de caracteres vazia quando ela estiver na ConstraintCollection.
ru: Невозможно изменить имя ограничения на пустую строку, когда оно входит в ConstraintCollection.
zh_hans: 当约束处于 ConstraintCollection 中时，不能将其名称更改为空字符串。
zh_hant: 當條件約束在 ConstraintCollection 中時，無法將它的名稱變更成空白字串。

# DataConstraint_Violation
source: Cannot enforce constraints on constraint {0}.
de: Für die Einschränkung {0} können keine Einschränkungen erzwungen werden.
es: No se pueden forzar las restricciones en la restricción {0}.
fr: Impossible d'appliquer des contraintes sur la contrainte {0}.
it: Impossibile imporre vincoli sul vincolo {0}.
ja: 制約 {0} の制約を適用できません。
ko: {0} 제약 조건에 제약 조건을 적용할 수 없습니다.
pt_br: Não é possível aplicar restrições na restrição {0}.
ru: Невозможно наложить ограничения на ограничение {0}.
zh_hans: 不能在约束 {0} 上强制约束。
zh_hant: 無法在條件約束 {0} 上強制使用條件約束。
