Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_InvalidCngKey
source: An error occurred while opening the Microsoft Cryptography API: Next Generation (CNG) key: '{0}'. Verify that the CNG provider name '{1}' is valid, installed on the machine, and the key '{2}' exists.
de: Fehler beim Öffnen des Microsoft CNG-Schlüssels (Cryptography API Next Generation): '{0}'. Vergewissern Sie sich, dass der CNG-Anbietername '{1}' gültig und auf dem Computer installiert und der Schlüssel '{2}' vorhanden ist.
es: Hubo un error al abrir la clave de Cryptography API: Next Generation (CNG) de Microsoft '{0}'. Compruebe que el nombre del proveedor CNG '{1}' sea válido, que esté instalado en el equipo y que la clave '{2}' exista.
fr: Une erreur s'est produite lors de l'ouverture de l'API de chiffrement Microsoft : Clé CNG : '{0}'. Vérifiez que le nom du fournisseur CNG '{1}' est valide, qu'il est installé sur l'ordinateur et que la clé '{2}' existe.
it: Si è verificato un errore durante l'apertura della chiave dell'API Cryptography Next Generation (CNG) Microsoft: '{0}'. Verificare che il nome del provider CNG '{1}' sia valido e installato nel computer e che la chiave '{2}' sia presente.
ja: Microsoft Cryptography API: Next Generation (CNG) キー: '{0}' を開いているときにエラーが発生しました。CNG プロバイダー名 '{1}' が有効で、コンピューターにインストールされており、キー '{2}' が存在することを確認してください。
ko: Microsoft CNG(Cryptography API: Next Generation) 키 '{0}'을(를) 여는 동안 오류가 발생했습니다. CNG 공급자 이름 '{1}'이(가) 올바르며 컴퓨터에 설치되어 있고 '{2}' 키가 있는지 확인하세요.
pt_br: Ocorreu um erro ao abrir a chave de CNG (Cryptography API: Next Generation) da Microsoft: '{0}'. Verifique se o nome do provedor CNG '{1}' está válido, instalado no computador e se a chave '{2}' existe.
ru: Произошла ошибка при открытии ключа "{0}" Microsoft Cryptography API: Next Generation (CNG). Убедитесь, что имя "{1}" поставщика CNG является допустимым, установлено на компьютере и ключ "{2}" существует.
zh_hans: 打开 Microsoft API 下一代加密技术(CNG)密钥时出错:“{0}”。验证 CNG 提供程序名称“{1}”是否有效、计算机上是否已安装该提供程序，以及密钥“{2}”是否存在。
zh_hant: 開啟 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 金鑰時發生錯誤: '{0}'。請確認 CNG 提供者名稱 '{1}' 有效，並已安裝在電腦上，且金鑰 '{2}' 存在。

# TCE_InvalidCngKeySysErr
source: Internal error. An error occurred while opening the Microsoft Cryptography API: Next Generation (CNG) key: '{0}'. Verify that the CNG provider name '{1}' is valid, installed on the machine, and the key '{2}' exists.
de: Interner Fehler. Fehler beim Öffnen des Microsoft CNG-Schlüssels (Cryptography API Next Generation): '{0}'. Vergewissern Sie sich, dass der CNG-Anbietername '{1}' gültig und auf dem Computer installiert und der Schlüssel '{2}' vorhanden ist.
es: Error interno. Hubo un error al abrir la clave de Cryptography API: Next Generation (CNG) de Microsoft '{0}'. Compruebe que el nombre del proveedor CNG '{1}' sea válido, que esté instalado en el equipo y que la clave '{2}' exista.
fr: Erreur interne. Une erreur s'est produite lors de l'ouverture de l'API de chiffrement Microsoft : Clé CNG : '{0}'. Vérifiez que le nom du fournisseur CNG '{1}' est valide, qu'il est installé sur l'ordinateur et que la clé '{2}' existe.
it: Errore interno. Si è verificato un errore durante l'apertura della chiave dell'API Cryptography Next Generation (CNG) Microsoft: '{0}'. Verificare che il nome del provider CNG '{1}' sia valido e installato nel computer e che la chiave '{2}' sia presente.
ja: 内部エラー。Microsoft Cryptography API: Next Generation (CNG) キー: '{0}' を開いているときにエラーが発生しました。CNG プロバイダー名 '{1}' が有効で、コンピューターにインストールされており、キー '{2}' が存在することを確認してください。
ko: 내부 오류입니다. Microsoft CNG(Cryptography API: Next Generation) 키 '{0}'을(를) 여는 동안 오류가 발생했습니다. CNG 공급자 이름 '{1}'이(가) 올바르며 컴퓨터에 설치되어 있고 '{2}' 키가 있는지 확인하세요.
pt_br: Erro interno. Ocorreu um erro ao abrir a chave de CNG (Cryptography API: Next Generation) da Microsoft: '{0}'. Verifique se o nome do provedor CNG '{1}' está válido, instalado no computador e se a chave '{2}' existe.
ru: Внутренняя ошибка. Произошла ошибка при открытии ключа "{0}" Microsoft Cryptography API: Next Generation (CNG). Убедитесь, что имя "{1}" поставщика CNG является допустимым, установлено на компьютере и ключ "{2}" существует.
zh_hans: 内部错误。打开 Microsoft API 下一代加密技术(CNG)密钥时出错:“{0}”。验证 CNG 提供程序名称“{1}”是否有效、计算机上是否已安装该提供程序，以及密钥“{2}”是否存在。
zh_hant: 內部錯誤。開啟 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 金鑰時發生錯誤: '{0}'。請確認 CNG 提供者名稱 '{1}' 有效，並已安裝在電腦上，且金鑰 '{2}' 存在。

# TCE_CertificateNotFound
source: Certificate with thumbprint '{0}' not found in certificate store '{1}' in certificate location '{2}'.
de: Zertifikat mit Fingerabdruck '{0}' wurde nicht im Zertifikatspeicher '{1}' unter dem Speicherort '{2}' gefunden.
es: Certificado con huella digital "{0}" no encontrado en el almacenamiento de certificados "{1}" de la ubicación "{2}".
fr: Le certificat avec l’empreinte numérique « {0} » est introuvable dans l’emplacement de certificat « {2} » du magasin de certificats « {1} ».
it: Il certificato con identificazione personale '{0}' non è stato trovato nella posizione '{2}' dell'archivio certificati '{1}'.
ja: 拇印 '{0}' 付きの証明書が、証明書の場所 '{2}' の証明書ストア '{1}' に見つかりませんでした。
ko: 지문이 '{0}'인 인증서를 인증서 저장소 '{1}'의 인증서 위치 '{2}'에서 찾을 수 없습니다.
pt_br: Certificado com impressão digital '{0}' não encontrado no repositório de certificados '{1}' no local do certificado '{2}'.
ru: Сертификат с отпечатком "{0}" не найден в хранилище сертификатов "{1}" в расположении сертификата "{2}".
zh_hans: 在证书位置“{2}”中的证书存储库“{1}”中找不到具有指纹“{0}”的证书。
zh_hant: 在憑證位置 '{2}' 的憑證存放區 '{1}' 中找不到指紋為 '{0}' 的憑證。

# TCE_CertificateNotFoundSysErr
source: Certificate with thumbprint '{0}' not found in certificate store '{1}' in certificate location '{2}'. Verify the certificate path in the column master key definition in the database is correct, and the certificate has been imported correctly into the certificate location/store.
de: Zertifikat mit Fingerabdruck '{0}' wurde nicht im Zertifikatspeicher '{1}' unter dem Speicherort '{2}' gefunden. Vergewissern Sie sich, dass der Zertifikatpfad in der Hauptschlüsseldefinitionsspalte der Datenbank korrekt ist und das Zertifikat richtig in den Zertifikatspeicherort/-speicher importiert wurde.
es: Certificado con huella digital "{0}" no encontrado en el almacenamiento de certificados "{1}" de la ubicación "{2}". Compruebe que la ruta del certificado en las definiciones de claves maestras de columnas de la base de datos sea correcta y que el certificado se haya importado correctamente en el almacenamiento o la ubicación de certificados.
fr: Le certificat avec l’empreinte numérique « {0} » est introuvable dans l’emplacement de certificat « {2} » du magasin de certificats « {1} ». Vérifiez l’exactitude du chemin d’accès au certificat dans la définition de clé principale de colonne de la base de données. De même, vérifiez que le certificat a été importé dans le magasin de certificats ou l’emplacement de certificat.
it: Il certificato con identificazione personale '{0}' non è stato trovato nella posizione '{2}' dell'archivio certificati '{1}'. Verificare che il percorso certificato nella definizione della chiave master della colonna nel database sia corretto e che il certificato sia stato importato correttamente nella posizione e/o nell'archivio certificati.
ja: 拇印 '{0}' 付きの証明書が、証明書の場所 '{2}' の証明書ストア '{1}' に見つかりませんでした。データベースにある列マスター キー定義の証明書パスが正しいことと、証明書が証明書の場所/ストアに正しくインポートされていることを確認してください。
ko: 지문이 '{0}'인 인증서를 인증서 저장소 '{1}'의 인증서 위치 '{2}'에서 찾을 수 없습니다. 데이터베이스의 열 마스터 키 정의에서 인증서 경로가 올바르고 인증서를 인증서 위치/저장소로 올바로 가져왔는지 확인하세요.
pt_br: Certificado com impressão digital '{0}' não encontrado no repositório de certificados '{1}' no local do certificado '{2}'. Verifique se o caminho do certificado na definição de chave mestra da coluna no banco de dados está correto e se o certificado foi importado corretamente no local/repositório de certificados.
ru: Сертификат с отпечатком "{0}" не найден в хранилище сертификатов "{1}" в расположении сертификата "{2}". Проверьте правильность пути к сертификату в определении главного ключа столбца в базе данных, а также убедитесь, что сертификат был соответствующим образом импортирован в расположение или хранилище сертификатов.
zh_hans: 在证书位置“{2}”中的证书存储库“{1}”中找不到具有指纹“{0}”的证书。请验证数据库中的列的主密钥定义中的证书路径是否正确，以及证书是否已正确导入到证书位置/存储库。
zh_hant: 在憑證位置 '{2}' 的憑證存放區 '{1}' 中找不到指紋為 '{0}' 的憑證。請確認資料庫內資料行主要金鑰定義中的憑證路徑正確，且憑證已經正確地匯入該憑證位置/存放區。

# TCE_InvalidAlgorithmVersionInEncryptedCEK
source: Specified encrypted column encryption key contains an invalid encryption algorithm version '{0}'. Expected version is '{1}'.
de: Der Verschlüsselungsschlüssel der angegebenen verschlüsselten Spalte enthält die ungültige Verschlüsselungsalgorithmusversion "{0}". Erwartet wird die Version "{1}".
es: La clave de cifrado de columna cifrada especificada contiene una versión de algoritmo de cifrado no válida '{0}'. La versión esperada es '{1}'.
fr: La clé de chiffrement de colonne chiffrée spécifiée contient une version d’algorithme de chiffrement non valide (« {0} »). La version attendue est « {1} ».
it: La chiave di crittografia di colonna crittografata specificata contiene una versione non valida '{0}' dell'algoritmo di crittografia. La versione prevista è '{1}'.
ja: 指定した方法で暗号化された列暗号化キーに、無効な暗号化アルゴリズムのバージョン '{0}' が含まれています。期待されているバージョンは '{1}' です。
ko: 지정한 암호화된 열 암호화 키에 잘못된 암호화 알고리즘 버전 '{0}'이(가) 포함되어 있습니다. 필요한 버전은 '{1}'입니다.
pt_br: A chave de criptografia de coluna criptografada especificada contém uma versão inválida do algoritmo de criptografia '{0}'. A versão esperada é '{1}'.
ru: Указанный ключ шифрования зашифрованного столбца содержит недействительную версию алгоритма шифрования "{0}". Ожидается версия "{1}".
zh_hans: 指定的加密列的加密密钥包含无效的加密算法版本“{0}”。预期版本是“{1}”。
zh_hant: 指定的加密資料行加密金鑰，包含無效的加密演算法版本 '{0}'。預期的版本為 '{1}'。

# TCE_InvalidCiphertextLengthInEncryptedCEK
source: The specified encrypted column encryption key's ciphertext length: {0} does not match the ciphertext length: {1} when using column master key (certificate) in '{2}'. The encrypted column encryption key may be corrupt, or the specified certificate path may be incorrect.
de: Die angegebene Chiffretextlänge {0} des Verschlüsselungsschlüssels der verschlüsselten Spalte entspricht nicht der Chiffretextlänge {1}, wenn der Spaltenhauptschlüssel (Zertifikat) in '{2}' verwendet wird. Der Verschlüsselungsschlüssel der verschlüsselten Spalte ist möglicherweise beschädigt, oder der angegebene Zertifikatpfad ist falsch.
es: La longitud del texto cifrado de la clave de cifrado de la columna cifrada especificada ({0}) no coincide con la longitud del texto cifrado ({1}) al usar una clave maestra de columna (certificado) en "{2}". Puede que la clave de cifrado de la columna cifrada esté dañada o que la ruta del certificado especificada no sea correcta.
fr: La longueur de texte de chiffrement spécifiée {0} pour la clé de chiffrement de colonne chiffrée ne correspond pas à la longueur de texte chiffré {1} quand la clé principale de colonne (certificat) est utilisée dans « {2} ». Il se peut que la clé de chiffrement de colonne chiffrée soit endommagée ou que le chemin d’accès de certificat spécifié soit incorrect.
it: La lunghezza {0} del testo crittografato della chiave di crittografia di colonna crittografata specificata non corrisponde alla lunghezza {1} del testo crittografato quando si usa la chiave master di colonna (certificato) in '{2}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato per il certificato potrebbe essere errato.
ja: 指定した暗号化された列暗号化キーの暗号化テキストの長さ {0} が、'{2}' にある列マスター キー (証明書) を使った暗号化テキストの長さ {1} と一致しません 。暗号化された列暗号化キーが壊れているか、指定された証明書のパスが正しくない可能性があります。
ko: '{2}'의 열 마스터 키(인증서)를 사용할 때 지정한 암호화된 열 암호화 키의 암호 텍스트 길이 {0}이(가) 암호 텍스트 길이 {1}과(와) 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정한 인증서 경로가 올바르지 않을 수 있습니다.
pt_br: O comprimento do texto cifrado da chave da coluna de criptografia especificada, {0}, não corresponde ao cumprimento {1} que é dado durante o uso da chave mestra de coluna (certificado) em '{2}'. A chave de criptografia da coluna criptografada pode estar corrompida ou o caminho especificado pode estar errado.
ru: Длина зашифрованных данных указанного ключа шифрования зашифрованного столбца {0} не совпадает с длиной зашифрованных данных {1} при использовании главного ключа столбца (сертификата) в "{2}". Ключ шифрования зашифрованного столбца может быть поврежден или неверно указан путь к сертификату.
zh_hans: 当在“{2}”中使用列主密钥(证书)时，指定的加密列加密密钥的密码文本长度“{0}”与密码文本长度“{1}”不匹配。加密列加密密钥可能已损坏，或指定的证书路径可能不正确。
zh_hant: 指定的加密資料行加密金鑰的加密文字長度 {0}，不符合使用 '{2}' 中資料行主要金鑰 (憑證) 時的加密文字長度 {1}。可能是該加密資料行加密金鑰已損毀，或指定的憑證路徑不正確。

# TCE_InvalidCiphertextLengthInEncryptedCEKCsp
source: The specified encrypted column encryption key's ciphertext length: {0} does not match the ciphertext length: {1} when using column master key (asymmetric key) in '{2}'. The encrypted column encryption key may be corrupt, or the specified Microsoft Cryptographic Service provider (CSP) path may be incorrect.
de: Die angegebene Länge {0} des Verschlüsselungstexts des Verschlüsselungsschlüssels der verschlüsselten Spalte stimmt nicht mit der Länge {1} des Verschlüsselungstexts überein, wenn der Masterschlüssel der Spalte (asymmetrischer Schlüssel) in '{2}' verwendet wird. Der Verschlüsselungsschlüssel der verschlüsselten Spalte ist ggf. fehlerhaft, oder der angegebene Microsoft CSP-Pfad (Cryptographic Service Provider, Kryptografiedienstanbieter) ist ggf. falsch.
es: La longitud del texto cifrado de la clave de cifrado de la columna cifrada especificada {0} no coincide con la longitud del texto cifrado {1} al usar la clave maestra de la columna (clave asimétrica) en '{2}'. La clave de cifrado de la columna cifrada puede estar dañada o la ruta especificada del proveedor de servicios criptográficos (CSP) de Microsoft puede no ser correcta.
fr: La longueur du texte chiffré de la clé de chiffrement de la colonne chiffrée spécifiée {0} ne correspond pas à la longueur du texte chiffré {1} lors de l'utilisation de la clé principale de la colonne (clé asymétrique) dans '{2}'. La clé de chiffrement de la colonne chiffrée est peut-être endommagée ou le chemin d'accès du fournisseur de service de chiffrement Microsoft spécifié est peut-être incorrect.
it: La lunghezza {0} del testo crittografato della chiave di crittografia di colonna crittografata specificata non corrisponde alla lunghezza {1} del testo crittografato quando si usa la chiave master di colonna (chiave asimmetrica) in '{2}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato per il provider del servizio di crittografia (CSP) Microsoft potrebbe essere errato.
ja: 指定された暗号化列の暗号化キーの暗号化テキストの長さ: {0} が、'{2}' にある列マスター キー (非対称キー) を使った暗号化テキストの長さ: {1} と一致しません 。暗号化列の暗号化キーが壊れているか、指定された Microsoft 暗号化サービス プロバイダー (CSP) のパスが正しくない可能性があります。
ko: '{2}'의 열 마스터 키(비대칭 키)를 사용할 때 지정한 암호화된 열 암호화 키의 암호 텍스트 길이 {0}이(가) 암호 텍스트 길이 {1}과(와) 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정된 Microsoft CSP(암호화 서비스 공급자) 경로가 잘못되었을 수 있습니다.
pt_br: O tamanho do texto cifrado da chave de criptografia da coluna criptografada especificada: {0} não corresponde ao tamanho do texto cifrado: {1} ao usar a chave mestra da coluna (chave assimétrica) em '{2}'. A chave de criptografia da coluna criptografada por estar corrompida ou o caminho do provedor de CSP (Provedor de Serviços de Criptografia) da Microsoft pode estar incorreto.
ru: Длина зашифрованных данных ({0}) указанного ключа шифрования зашифрованного столбца не соответствует длине зашифрованных данных ({1}) при использовании главного ключа (асимметричного ключа) в "{2}". Ключ шифрования зашифрованного столбца может быть поврежден, или указанный путь к поставщику служб шифрования Microsoft (CSP) может быть неверным.
zh_hans: 使用 {2} 中的列主密钥(非对称密钥)时，指定的已加密列加密密钥的已加密文本长度 {0} 与已加密文本长度 {1} 不匹配。已加密列加密密钥可能已损坏，或指定的 Microsoft 加密服务提供程序(CSP)路径可能不正确。
zh_hant: 使用 '{2}' 中的資料行主要金鑰 (非對稱金鑰) 時，指定之加密資料行加密金鑰的加密文字長度 {0} 不符合加密文字長度 {1}。可能是因為加密資料行加密金鑰已毀損，或指定的 Microsoft 密碼編譯服務提供者 (CSP) 路徑不正確。

# TCE_InvalidCiphertextLengthInEncryptedCEKCng
source: The specified encrypted column encryption key's ciphertext length: {0} does not match the ciphertext length: {1} when using column master key (asymmetric key) in '{2}'. The encrypted column encryption key may be corrupt, or the specified Microsoft Cryptography API: Next Generation (CNG) provider path may be incorrect.
de: Die angegebene Länge {0} des Verschlüsselungstexts des Verschlüsselungsschlüssels der verschlüsselten Spalte stimmt nicht mit der Länge {1} des Verschlüsselungstexts überein, wenn der Masterschlüssel der Spalte (asymmetrischer Schlüssel) in '{2}' verwendet wird. Der Verschlüsselungsschlüssel der verschlüsselten Spalte ist ggf. fehlerhaft, oder der Pfad des angegebenen Microsoft CNG-Anbieters (Cryptography API Next Generation) ist ggf. falsch.
es: La longitud del texto cifrado de la clave de cifrado de la columna cifrada especificada {0} no coincide con la longitud del texto cifrado {1} al usar la clave maestra de la columna (clave asimétrica) en '{2}'. La clave de cifrado de la columna cifrada puede estar dañada o la ruta especificada del proveedor Cryptography API: Next Generation (CNG) de Microsoft puede no ser correcta.
fr: La longueur du texte chiffré de la clé de chiffrement de la colonne chiffrée spécifiée {0} ne correspond pas à la longueur du texte chiffré {1} lors de l'utilisation de la clé principale de la colonne (clé asymétrique) dans '{2}'. La clé de chiffrement de la colonne chiffrée est peut-être endommagée ou le chemin d'accès du fournisseur CNG de l'API de chiffrement Microsoft spécifié est peut-être incorrect.
it: La lunghezza {0} del testo crittografato della chiave di crittografia di colonna crittografata specificata non corrisponde alla lunghezza {1} del testo crittografato quando si usa la chiave master di colonna (chiave asimmetrica) in '{2}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato per il provider dell'API Criptography Next Generation (CNG) Microsoft potrebbe essere errato.
ja: 指定された暗号化列の暗号化キーの暗号化テキストの長さ: {0} が、'{2}' にある列マスター キー (非対称キー) を使った暗号化テキストの長さ: {1} と一致しません 。暗号化列の暗号化キーが壊れているか、指定された Microsoft Cryptography API: Next Generation (CNG) プロバイダーのパスが正しくない可能性があります。
ko: '{2}'의 열 마스터 키(비대칭 키)를 사용할 때 지정한 암호화된 열 암호화 키의 암호 텍스트 길이 {0}이(가) 암호 텍스트 길이 {1}과(와) 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정된 Microsoft CNG(Cryptography API: Next Generation) 공급자 경로가 잘못되었을 수 있습니다.
pt_br: O tamanho do texto cifrado da chave de criptografia da coluna criptografada especificada: {0} não corresponde ao tamanho do texto cifrado: {1} ao usar a chave mestra da coluna (chave assimétrica) em '{2}'. A chave de criptografia da coluna criptografada pode estar corrompida ou o caminho do provedor CNG (Cryptography API: Next Generation) da Microsoft pode estar incorreto.
ru: Длина зашифрованных данных ({0}) указанного ключа шифрования зашифрованного столбца не соответствует длине зашифрованных данных ({1}) при использовании главного ключа (асимметричного ключа) в "{2}". Ключ шифрования зашифрованного столбца может быть поврежден, или указанный путь к поставщику Microsoft Cryptography API: Next Generation (CNG) может быть неверным.
zh_hans: 使用 {2} 中的列主密钥(非对称密钥)时，指定的已加密列加密密钥的已加密文本长度 {0} 与已加密文本长度 {1} 不匹配。已加密列加密密钥可能已损坏，或指定的 Microsoft API 下一代加密技术(CNG)提供程序路径可能不正确。
zh_hant: 使用 '{2}' 中的資料行主要金鑰 (非對稱金鑰) 時，指定之加密資料行加密金鑰的加密文字長度 {0} 不符合加密文字長度 {1}。可能是加密資料行加密金鑰已毀損，或指定的 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 路徑不正確。

# TCE_InvalidSignatureInEncryptedCEK
source: The specified encrypted column encryption key's signature length: {0} does not match the signature length: {1} when using column master key (certificate) in '{2}'. The encrypted column encryption key may be corrupt, or the specified certificate path may be incorrect.
de: Die angegebene Signaturlänge {0} des Verschlüsselungsschlüssels der verschlüsselten Spalte entspricht nicht der Signaturlänge {1}, wenn der Spaltenhauptschlüssel (Zertifikat) in '{2}' verwendet wird. Der Verschlüsselungschlüssel der verschlüsselten Spalte ist möglicherweise beschädigt, oder der angegebene Zertifikatpfad ist falsch.
es: La longitud de la firma de la clave de cifrado de columna cifrada especificada ({0}) no coincide con la longitud de la firma ({1}) al usar la clave maestra de columna (certificado) en "{2}". Puede que la clave de cifrado de la columna cifrada esté dañada o que la ruta del certificado especificada no sea correcta.
fr: La longueur de signature spécifiée {0} pour la clé de chiffrement de colonne chiffrée ne correspond pas à la longueur de signature {1} quand la clé principale de colonne (certificat) est utilisée dans « {2} ». Il se peut que la clé de chiffrement de colonne chiffrée soit endommagée ou que le chemin d’accès de certificat spécifié soit incorrect.
it: La lunghezza {0} della firma della chiave di crittografia di colonna crittografata specificata non corrisponde alla lunghezza {1} della firma quando si usa la chiave master di colonna (certificato) in '{2}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato per il certificato potrebbe essere errato.
ja: 指定した暗号化された列暗号化キーの署名の長さ {0} が、'{2}' の列マスター キー (証明書) を使った署名の長さ {1} と一致しません。暗号化された列暗号化キーが壊れているか、指定されたパスが正しくない可能性があります。
ko: '{2}'의 열 마스터 키(인증서)를 사용할 때 지정한 암호화된 열 암호화 키의 서명 길이 {0}이(가) 서명 길이 {1}과(와) 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정한 인증서 경로가 올바르지 않을 수 있습니다.
pt_br: O comprimento da assinatura da chave da coluna de criptografia especificada, {0}, não corresponde ao cumprimento {1} que é dado durante o uso da chave mestra da coluna (certificado) em '{2}'. A chave de criptografia da coluna criptografada pode estar corrompida ou o caminho especificado pode estar errado.
ru: Длина подписи указанного ключа шифрования зашифрованного столбца ({0}) не совпадает с длиной подписи ({1}) при использовании главного ключа столбца (сертификата) в "{2}". Ключ шифрования зашифрованного столбца может быть поврежден или неверно указан путь к сертификату.
zh_hans: 当在“{2}”中使用列主密钥(证书)时，指定的加密列加密密钥的签名长度“{0}”与签名长度“{1}”不匹配。加密列加密密钥可能已损坏，或指定的证书路径可能不正确。
zh_hant: 指定的加密資料行加密金鑰的簽章長度 {0}，不符合使用 '{2}' 中資料行主要金鑰 (憑證) 時的簽章長度 {1}。可能是該加密資料行加密金鑰已損毀，或指定的憑證路徑不正確。
