Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_InvalidKeyEncryptionAlgorithmSysErr
source: Internal error. Invalid key encryption algorithm specified: '{0}'. Expected value: '{1}'.
de: Interner Fehler. Ungültiger Schlüsselverschlüsselungsalgorithmus angegeben: '{0}'. Erwarteter Wert: '{1}'.
es: Error interno. Algoritmo de cifrado de clave especificado no válido: "{0}". Valor esperado: "{1}".
fr: Erreur interne. L’algorithme de chiffrement de clé spécifié n’est pas valide : « {0} ». Valeur attendue : « {1} ».
it: Errore interno. L'algoritmo di crittografia a chiave specificato non è valido: '{0}'. Valore previsto: '{1}'.
ja: 内部エラー。指定されたキー暗号化アルゴリズム '{0}' は無効です。値 '{1}' が必要です。
ko: 내부 오류입니다. 잘못된 키 암호화 알고리즘이 지정되었습니다. '{0}'. 예상 값: '{1}'
pt_br: Erro interno. Algoritmo de criptografia de chave inválida especificado: '{0}'. Valor esperado: '{1}'.
ru: Внутренняя ошибка. Указан неверный алгоритм шифрования ключа: "{0}". Ожидаемое значение: "{1}".
zh_hans: 内部错误。指定的密钥加密算法无效:“{0}”。预期值:“{1}”。
zh_hant: 內部錯誤。指定了無效的金鑰加密演算法: '{0}'。值應為: '{1}'。

# TCE_NullKeyEncryptionAlgorithm
source: Key encryption algorithm cannot be null.
de: Schlüsselverschlüsselungsschlüssel kann nicht NULL sein.
es: El algoritmo de cifrado de clave no puede ser nulo.
fr: L'algorithme de chiffrement de clé ne peut pas avoir la valeur Null.
it: L'algoritmo di crittografia a chiave non può essere Null.
ja: キー暗号化アルゴリズムを Null にすることはできません。
ko: 키 암호화 알고리즘은 null일 수 없습니다.
pt_br: O algoritmo de criptografia de chave não pode ser nulo.
ru: Алгоритм шифрования ключа не может иметь значение Null.
zh_hans: 密钥加密算法不能为 null。
zh_hant: 金鑰加密演算法不能是 Null。

# TCE_NullKeyEncryptionAlgorithmSysErr
source: Internal error. Key encryption algorithm cannot be null.
de: Interner Fehler. Schlüsselverschlüsselungsalgorithmus darf nicht NULL sein.
es: Error interno. El algoritmo de cifrado de claves no puede ser nulo.
fr: Erreur interne. L’algorithme de chiffrement de clé ne peut pas avoir la valeur null.
it: Errore interno. L'algoritmo di crittografia a chiave non può essere Null.
ja: 内部エラー。キー暗号化アルゴリズムを Null にすることはできません。
ko: 내부 오류입니다. 키 암호화 알고리즘은 null일 수 없습니다.
pt_br: Erro interno. O algoritmo de criptografia de chave não pode ser nulo.
ru: Внутренняя ошибка. Алгоритм шифрования ключа не может иметь значение Null.
zh_hans: 内部错误。密钥加密算法不能为 null。
zh_hant: 內部錯誤。金鑰加密演算法不能是 Null。

# TCE_EmptyColumnEncryptionKey
source: Empty column encryption key specified.
de: Leerer Spaltenverschlüsselungsschlüssel festgelegt.
es: Se especificó una clave de cifrado de columna vacía.
fr: La clé de chiffrement de colonne spécifiée est vide.
it: La chiave di crittografia di colonna specificata è vuota.
ja: 空の列暗号化キーが指定されています。
ko: 빈 열 암호화 키가 지정되었습니다.
pt_br: Chave de criptografia de coluna vazia especificada.
ru: Указан пустой ключ шифрования столбца.
zh_hans: 指定了空的列加密密钥。
zh_hant: 為資料行所指定的加密金鑰是空白的。

# TCE_NullColumnEncryptionKey
source: Column encryption key cannot be null.
de: Spaltenverschlüsselungsschlüssel kann nicht NULL sein.
es: La clave de cifrado de columnas no puede ser nula.
fr: La clé de chiffrement de colonne ne peut pas avoir la valeur Null.
it: La chiave di crittografia di colonna non può essere Null.
ja: 列暗号化キーを Null にすることはできません。
ko: 열 암호화 키는 null일 수 없습니다.
pt_br: A chave de criptografia da coluna não pode ser nula.
ru: Ключ шифрования столбца не может иметь значение Null.
zh_hans: 列加密密钥不能为 null。
zh_hant: 資料行加密金鑰不能是 Null。

# TCE_EmptyEncryptedColumnEncryptionKey
source: Internal error. Empty encrypted column encryption key specified.
de: Interner Fehler. Leerer Spaltenverschlüsselungsschlüssel festgelegt.
es: Error interno. Clave de cifrado de columna de cifrado vacía especificada.
fr: Erreur interne. La clé de chiffrement de colonne chiffrée spécifiée est vide.
it: Errore interno. La chiave di crittografia di colonna crittografata specificata è vuota.
ja: 内部エラー。指定された暗号化済みの列暗号化キーが空です。
ko: 내부 오류입니다. 빈 열 암호화 키가 지정되었습니다.
pt_br: Erro interno. Chave de criptografia de coluna vazia especificada.
ru: Внутренняя ошибка. Указан пустой ключ шифрования для зашифрованного столбца.
zh_hans: 内部错误。指定了空的已加密列加密密钥。
zh_hant: 內部錯誤。指定了空白的資料行加密金鑰。

# TCE_NullEncryptedColumnEncryptionKey
source: Internal error. Encrypted column encryption key cannot be null.
de: Interner Fehler. Verschlüsselter Spaltenverschlüsselungsschlüssel darf nicht NULL sein.
es: Error interno. La clave de cifrado de columnas cifradas no puede ser nula.
fr: Erreur interne. La clé de chiffrement de colonne chiffrée ne peut pas avoir la valeur null.
it: Errore interno. La chiave di crittografia di colonna crittografata non può essere Null.
ja: 内部エラー。暗号化された列暗号化キーを Null にすることはできません。
ko: 내부 오류입니다. 암호화된 열 암호화 키는 null일 수 없습니다.
pt_br: Erro interno. A chave de criptografia da coluna criptografada não pode ser nula.
ru: Внутренняя ошибка. Ключ шифрования зашифрованного столбца не может иметь значение Null.
zh_hans: 内部错误。加密的列加密密钥不能为 null。
zh_hant: 內部錯誤。加密的資料行加密金鑰不能是 Null。

# TCE_LargeCertificatePathLength
source: Specified certificate path has {0} bytes, which exceeds maximum length of {1} bytes.
de: Der angegebene Zertifikatpfad hat {0} Bytes. Dies überschreitet die maximale Länge von {1} Bytes.
es: La ruta de certificado especificada tiene {0} bytes, lo que supera la longitud máxima de {1} bytes.
fr: Le chemin d’accès de certificat spécifié fait {0} octets, ce qui dépasse la longueur maximale de {1} octets.
it: Il percorso certificato specificato è di {0} byte e supera la lunghezza massima pari a {1} byte.
ja: 指定された証明書のパスは {0} バイトで、最大長 {1} バイトを超えています。
ko: 지정한 인증서 경로에 최대 길이 {1}바이트를 초과하는 {0}바이트가 포함되어 있습니다.
pt_br: O caminho especificado de certificado tem {0} bytes, excedendo o comprimento máximo de {1} bytes.
ru: Указанный путь к сертификату имеет {0} байт, что превышает максимальную длину, равную {1} байт.
zh_hans: 指定的证书路径具有 {0} 个字节，超过 {1} 个字节的最大长度。
zh_hant: 指定的憑證路徑有 {0} 個位元組，超過了長度上限 {1} 個位元組。

# TCE_LargeCertificatePathLengthSysErr
source: Internal error. Specified certificate path has {0} bytes, which exceeds maximum length of {1} bytes.
de: Interner Fehler. Der angegebene Zertifikatpfad umfasst {0} Bytes. Dies überschreitet die maximale Länge von {1} Bytes.
es: Error interno. La ruta de certificado especificada tiene {0} bytes, lo que supera la longitud máxima de {1} bytes.
fr: Erreur interne. Le chemin d’accès de certificat spécifié fait {0} octets, ce qui dépasse la longueur maximale de {1} octets.
it: Errore interno. Il percorso certificato specificato è di {0} byte e supera la lunghezza massima pari a {1} byte.
ja: 内部エラー。指定された証明書のパスは {0} バイトで、最大長 {1} バイトを超えています。
ko: 내부 오류입니다. 지정한 인증서 경로에 최대 길이 {1}바이트를 초과하는 {0}바이트가 포함되어 있습니다.
pt_br: Erro interno. O caminho de certificado especificado tem {0} bytes, excedendo o comprimento máximo de {1} bytes.
ru: Внутренняя ошибка. Указанный путь к сертификату имеет {0} байт, что превышает максимальную длину, равную {1} байт.
zh_hans: 内部错误。指定证书路径具有 {0} 个字节，超过 {1} 个字节的最大长度。
zh_hant: 內部錯誤。指定的憑證路徑有 {0} 個位元組，超過了長度上限 {1} 個位元組。

# TCE_NullCertificatePath
source: Certificate path cannot be null. Use the following format: <certificate location>{2}<certificate store>{2}<certificate thumbprint>, where <certificate location> is either '{0}' or '{1}'.
de: Zertifikatpfad darf nicht NULL sein. Verwenden Sie das folgende Format: <Zertifikatspeicherort>{2}<Zertifikatspeicher>{2}<Zertifikatfingerabdruck>, wobei <Zertifikatspeicherort> entweder '{0}' oder '{1}' ist.
es: La ruta de certificado no puede ser nula. Use el siguiente formato: <ubicación de certificado>{2}<almacenamiento de certificado>{2}<huella digital de certificado>, donde <ubicación de certificado> es "{0}" o "{1}".
fr: Le chemin d’accès de certificat ne peut pas avoir la valeur null. Utilisez le format suivant : <emplacement de certificat>{2}<magasin de certificats>{2}<empreinte de certificat>, où <emplacement de certificat> a la valeur « {0} » ou « {1} ».
it: Il percorso certificato non può essere Null. Usare il formato seguente: <posizione certificato>{2}<archivio certificati>{2}<identificazione personale certificato>, dove <posizione certificato> è '{0}' o '{1}'.
ja: 証明書パスを Null にすることはできません。次の形式を使用してください: <certificate location>{2}<certificate store>{2}<certificate thumbprint>。ここで <certificate location> は '{0}' または '{1}' のいずれかです。
ko: 인증서 경로는 null일 수 없습니다. <certificate location>{2}<certificate store>{2}<certificate thumbprint> 형식을 사용하세요. 여기서 <certificate location>은 '{0}' 또는 '{1}'입니다.
pt_br: O caminho de certificado não pode ser nulo. Use o seguinte formato: <local do certificado>{2}<repositório de certificados>{2}<impressão digital do certificado>, em que <local do certificado> é '{0}' ou '{1}'.
ru: Путь к сертификату не может иметь значение Null. Используйте следующий формат: <расположение_сертификата>{2}<хранилище_сертификатов>{2}<отпечаток_сертификата>, где <расположение_сертификата> имеет значение {0} или {1}.
zh_hans: 证书路径不能为空。使用以下格式: <证书位置>{2}<证书存储库>{2}<证书指纹>，其中 <证书位置> 是“{0}”或“{1}”。
zh_hant: 憑證路徑不得為 Null。請使用下列格式: <憑證位置>{2}<憑證存放區>{2}<憑證指紋>，其中 <憑證位置> 為 '{0}' 或 '{1}'。

# TCE_NullCertificatePathSysErr
source: Internal error. Certificate path cannot be null. Use the following format: <certificate location>{2}<certificate store>{2}<certificate thumbprint>, where <certificate location> is either '{0}' or '{1}'.
de: Interner Fehler. Zertifikatpfad darf nicht NULL sein. Verwenden Sie das folgende Format: <Zertifikatspeicherort>{2}<Zertifikatspeicher>{2}<Zertifikatfingerabdruck>, wobei <Zertifikatspeicherort> entweder '{0}' oder '{1}' ist.
es: Error interno. La ruta de certificado no puede ser nula. Use el siguiente formato: <ubicación de certificado>{2}<almacén de certificados>{2}<huella digital de certificado>, donde <ubicación de certificado> es "{0}" o "{1}".
fr: Erreur interne. Le chemin d’accès de certificat ne peut pas avoir la valeur null. Utilisez le format suivant : <emplacement de certificat>{2}<magasin de certificats>{2}<empreinte de certificat>, où <emplacement de certificat> a la valeur « {0} » ou « {1} ».
it: Errore interno. Il percorso certificato non può essere Null. Usare il formato seguente: <posizione certificato>{2}<archivio certificati>{2}<identificazione personale certificato>, dove <posizione certificato> è '{0}' o '{1}'.
ja: 内部エラー。証明書パスを Null にすることはできません。次の形式を使用してください: <certificate location>{2}<certificate store>{2}<certificate thumbprint>。ここで <certificate location> は '{0}' または '{1}' のいずれかです。
ko: 내부 오류입니다. 인증서 경로는 null일 수 없습니다. <certificate location>{2}<certificate store>{2}<certificate thumbprint> 형식을 사용하세요. 여기서 <certificate location>은 '{0}' 또는 '{1}'입니다.
pt_br: Erro interno. O caminho do certificado não pode ser nulo. Use o formato a seguir: <local do certificado>{2}<repositório de certificados>{2}<impressão digital do certificado>, em que <local do certificado> é '{0}' ou '{1}'.
ru: Внутренняя ошибка. Путь к сертификату не может иметь значение Null. Используйте следующий формат: <расположение_сертификата>{2}<хранилище_сертификатов>{2}<отпечаток_сертификата>, где <расположение_сертификата> имеет значение {0} или {1}.
zh_hans: 内部错误。证书路径不能为空。使用以下格式: <证书位置>{2}<证书存储库>{2}<证书指纹>，其中 <证书位置> 是“{0}”或“{1}”。
zh_hant: 內部錯誤。憑證路徑不得為 Null。請使用下列格式: <憑證位置>{2}<憑證存放區>{2}<憑證指紋>，其中 <憑證位置> 為 '{0}' 或 '{1}'。

# TCE_NullCspPath
source: Column master key path cannot be null. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{0}<Key Identifier>.
de: Der Masterschlüsselpfad der Spalte darf nicht NULL sein. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter (Cryptographic Service Provider, Kryptografiedienstanbieter) gespeicherten Schlüssel: <CSP-Anbietername>{0}<Schlüsselbezeichner>.
es: La ruta de la clave maestra de la columna no puede ser nula. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{0}<Identificador clave>.
fr: Le chemin d'accès de la clé principale de la colonne ne peut pas être Null. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement>{0}<Identificateur de clé>.
it: Il percorso della chiave master di colonna non può essere Null. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{0}<identificatore chiave>.
ja: 列マスター キーのパスを null にすることはできません。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{0}<キー識別子>。
ko: 열 마스터 키 경로는 null이면 안 됩니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{0}<키 식별자> 형식을 사용하세요.
pt_br: O caminho da chave mestra da coluna não pode ser nulo. Use o formato a seguir para uma chave armazenada em um CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CNG>{0}<Identificador de Chave>.
ru: Путь к главному ключу столбца не может иметь значение NULL. Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CNG>{0}<идентификатор ключа>.
zh_hans: 列主密钥路径不可为 NULL。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{0}<密钥标识符>。
zh_hant: 資料行主要金鑰路徑不得為 null。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{0}<金鑰識別碼>。

# TCE_NullCspPathSysErr
source: Internal error. Column master key path cannot be null. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{0}<Key Identifier>.
de: Interner Fehler. Der Masterschlüsselpfad der Spalte darf nicht NULL sein. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter (Cryptographic Service Provider, Kryptografiedienstanbieter) gespeicherten Schlüssel: <CSP-Anbietername>{0}<Schlüsselbezeichner>.
es: Error interno. La ruta de la clave maestra de la columna no puede ser nula. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{0}<Identificador clave>.
fr: Erreur interne. Le chemin d'accès de la clé principale de la colonne ne peut pas être Null. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement>{0}<Identificateur de clé>.
it: Errore interno. Il percorso della chiave master di colonna non può essere Null. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{0}<identificatore chiave>.
ja: 内部エラー。列マスター キーのパスを null にすることはできません。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{0}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로는 null이면 안 됩니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{0}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. O caminho da chave mestra da coluna não pode ser nulo. Use o formato a seguir para uma chave armazenada em um CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CNG>{0}<Identificador de Chave>.
ru: Внутренняя ошибка. Путь к главному ключу столбца не может иметь значение NULL. Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CNG>{0}<идентификатор ключа>.
zh_hans: 内部错误。列主密钥路径不可为 NULL。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{0}<密钥标识符>。
zh_hant: 內部錯誤。資料行主要金鑰路徑不得為 null。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{0}<金鑰識別碼>。

# TCE_NullCngPath
source: Column master key path cannot be null. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{0}<Key Identifier>.
de: Der Masterschlüsselpfad der Spalte darf nicht NULL sein. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{0}<Schlüsselbezeichner>.
es: La ruta de la clave maestra de la columna no puede ser nula. Use el siguiente formato para una clave almacenada en un proveedor Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{0}<Identificador clave>.
fr: Le chemin d'accès de la clé principale de la colonne ne peut pas être Null. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{0}<Identificateur de clé>.
it: Il percorso della chiave master di colonna non può essere Null. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{0}<identificatore chiave>.
ja: 列マスター キーのパスを null にすることはできません。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{0}<キー識別子>。
ko: 열 마스터 키 경로는 null이면 안 됩니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{0}<키 식별자> 형식을 사용하세요.
pt_br: O caminho da chave mestra da coluna não pode ser nulo. Use o formato a seguir para uma chave armazenada em um provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{0}<Identificador de Chave>.
ru: Путь к главному ключу столбца не может иметь значение NULL. Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{0}<идентификатор ключа>.
zh_hans: 列主密钥路径不可为 NULL。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{0}<密钥标识符>。
zh_hant: 資料行主要金鑰路徑不得為 null。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{0}<金鑰識別碼>。

# TCE_NullCngPathSysErr
source: Internal error. Column master key path cannot be null. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{0}<Key Identifier>.
de: Interner Fehler. Der Masterschlüsselpfad der Spalte darf nicht NULL sein. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{0}<Schlüsselbezeichner>.
es: Error interno. La ruta de la clave maestra de la columna no puede ser nula. Use el siguiente formato para una clave almacenada en un proveedor Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{0}<Identificador clave>.
fr: Erreur interne. Le chemin d'accès de la clé principale de la colonne ne peut pas être Null. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{0}<Identificateur de clé>.
it: Errore interno. Il percorso della chiave master di colonna non può essere Null. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{0}<identificatore chiave>.
ja: 内部エラー。列マスター キーのパスを null にすることはできません。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{0}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로는 null이면 안 됩니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{0}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. O caminho da chave mestra da coluna não pode ser nulo. Use o formato a seguir para uma chave armazenada em um provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{0}<Identificador de Chave>.
ru: Внутренняя ошибка. Путь к главному ключу столбца не может иметь значение NULL. Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{0}<идентификатор ключа>.
zh_hans: 内部错误。列主密钥路径不可为 NULL。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{0}<密钥标识符>。
zh_hant: 內部錯誤。資料行主要金鑰路徑不得為 null。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{0}<金鑰識別碼>。

# TCE_InvalidCertificatePath
source: Invalid certificate path: '{0}'. Use the following format: <certificate location>{3}<certificate store>{3}<certificate thumbprint>, where <certificate location> is either '{1}' or '{2}'.
de: Ungültiger Zertifikatpfad: '{0}'. Verwenden Sie das folgende Format: <Zertifikatspeicherort>{3}<Zertifikatspeicher>{3}<Zertifikatfingerabdruck>, wobei <Zertifikatspeicherort> entweder '{1}' oder '{2}' ist.
es: Ruta de certificado no válida: "{0}". Use el siguiente formato: <ubicación de certificado>{3}<almacén de certificados>{3}<huella digital de certificado>, donde <ubicación de certificado> es "{1}" o "{2}".
fr: Chemin d’accès de certificat non valide : « {0} ». Utilisez le format suivant : <emplacement de certificat>{3}<magasin de certificats>{3}<empreinte de certificat>, où <emplacement de certificat> a la valeur « {1} » ou « {2} ».
it: Il percorso certificato '{0}' non è valido. Usare il formato seguente: <posizione certificato>{3}<archivio certificati>{3}<identificazione personale certificato>, dove <posizione certificato> è '{1}' o '{2}'.
ja: 証明書パス '{0}' が無効です。次の形式を使用してください: <certificate location>{3}<certificate store>{3}<certificate thumbprint>。ここで <certificate location> は '{1}' または '{2}' のいずれかです。
ko: 인증서 경로가 잘못되었습니다. '{0}'. <certificate location>{3}<certificate store>{3}<certificate thumbprint> 형식을 사용하세요. 여기서 <certificate location>은 '{1}' 또는 '{2}'입니다.
pt_br: Caminho de certificado inválido: '{0}'. Use o seguinte formato: <local do certificado>{3}<repositório de certificados>{3}<impressão digital do certificado>, em que <local do certificado> é '{1}' ou '{2}'.
ru: Недействительный путь к сертификату: "{0}". Используйте следующий формат: <расположение_сертификата>{3}<хранилище_сертификатов>{3}<отпечаток_сертификата>, где <расположение_сертификата> имеет значение {1} или {2}.
zh_hans: 证书路径无效: {0}。使用以下格式: <证书位置>{3}<证书存储库>{3}<证书指纹>，其中 <证书位置> 是“{1}”或“{2}”。
zh_hant: 憑證路徑無效: '{0}'。請使用下列格式: <憑證位置>{3}<憑證存放區>{3}<憑證指紋>，其中 <憑證位置> 為 '{1}' 或 '{2}'。

# TCE_InvalidCertificatePathSysErr
source: Internal error. Invalid certificate path: '{0}'. Use the following format: <certificate location>{3}<certificate store>{3}<certificate thumbprint>, where <certificate location> is either '{1}' or '{2}'.
de: Interner Fehler. Ungültiger Zertifikatpfad: '{0}'. Verwenden Sie das folgende Format: <Zertifikatspeicherort>{3}<Zertifikatspeicher>{3}<Zertifikatfingerabdruck>, wobei <Zertifikatspeicherort> entweder '{1}' oder '{2}' ist.
es: Error interno. Ruta de certificado no válida: "{0}". Use el siguiente formato: <ubicación de certificado>{3}<almacén de certificados>{3}<huella digital de certificado>, donde <ubicación de certificado> es "{1}" o "{2}".
fr: Erreur interne. Chemin d’accès de certificat non valide : « {0} ». Utilisez le format suivant : <emplacement de certificat>{3}<magasin de certificats>{3}<empreinte de certificat>, où <emplacement du certificat> a la valeur « {1} » ou « {2} ».
it: Errore interno. Il percorso certificato '{0}' non è valido. Usare il formato seguente: <posizione certificato>{3}<archivio certificati>{3}<identificazione personale certificato>, dove <posizione certificato> è '{1}' o '{2}'.
ja: 内部エラー。証明書パス '{0}' が無効です。次の形式を使用してください: <certificate location>{3}<certificate store>{3}<certificate thumbprint>。ここで <certificate location> は '{1}' または '{2}' のいずれかです。
ko: 내부 오류입니다. 인증서 경로가 잘못되었습니다. '{0}'. <certificate location>{3}<certificate store>{3}<certificate thumbprint> 형식을 사용하세요. 여기서 <certificate location>은 '{1}' 또는 '{2}'입니다.
pt_br: Erro interno. Caminho de certificado inválido: '{0}'. Use o seguinte formato: <local do certificado>{3}<repositório de certificados>{3}<impressão digital do certificado>, em que <local do certificado> é '{1}' ou '{2}'.
ru: Внутренняя ошибка. Недействительный путь к сертификату: "{0}". Используйте следующий формат: <расположение_сертификата>{3}<хранилище_сертификатов>{3}<отпечаток_сертификата>, где <расположение_сертификата> имеет значение {1} или {2}.
zh_hans: 内部错误。证书路径无效: {0}。使用以下格式: <证书位置>{3}<证书存储库>{3}<证书指纹>，其中 <证书位置> 是“{1}”或“{2}”。
zh_hant: 內部錯誤。憑證路徑無效: '{0}'。請使用下列格式: <憑證位置>{3}<憑證存放區>{3}<憑證指紋>，其中 <憑證位置> 為 '{1}' 或 '{2}'。
