Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SqlNotify_SqlDepCannotBeCreatedInProc
source: SqlDependency object cannot be created when running inside the SQL Server process.
de: Das 'SqlDependency'-Objekt kann nicht erstellt werden, wenn es im Rahmen des SQL Server-Prozesses ausgeführt wird.
es: No se puede crear el objeto SqlDependency al funcionar dentro del proceso de SQL Server.
fr: L'objet SqlDependency ne peut pas être créé en cas d'exécution dans le processus SQL Server.
it: Impossibile creare un oggetto SqlDependency durante l'esecuzione nel processo SQL Server.
ja: SQL Server プロセス内で実行されている場合、SqlDependency オブジェクトは作成できません。
ko: SQL Server 프로세스 내에서 실행할 때는 SqlDependency 개체를 만들 수 없습니다.
pt_br: Não é possível criar o objeto SqlDependency ao executar dentro do processo do SQL Server.
ru: Объект SqlDependency не может быть создан при выполнении внутри процесса SQL Server.
zh_hans: 在 SQL Server 进程内运行时，无法创建 SqlDependency 对象。
zh_hant: 在 SQL Server 程序中執行時，SqlDependency 物件就不能建立。

# SqlDependency_DatabaseBrokerDisabled
source: The SQL Server Service Broker for the current database is not enabled, and as a result query notifications are not supported. Please enable the Service Broker for this database if you wish to use notifications.
de: Der SQL Server Service Broker für die aktuelle Datenbank ist nicht aktiviert. Als Folge davon werden keine Abfragebenachrichtigungen unterstützt. Aktivieren Sie den Service Broker für diese Datenbank, wenn Sie Benachrichtigungen verwenden möchten.
es: No está habilitado SQL Server Service Broker para la base de datos actual y, en consecuencia, no se admiten las notificaciones de consulta. Habilite Service Broker en esta base de datos si desea utilizar las notificaciones.
fr: Le SQL Server Service Broker de la base de données actuelle n'est pas activé. Par conséquent, les notifications de requête ne sont pas prises en charge. Activez le Service Broker pour cette base de données si vous souhaitez utiliser des notifications.
it: SQL Server Service Broker non è attivato per il database corrente, pertanto non sono supportate le notifiche di query. Attivare il servizio Service Broker per questo database se si desidera utilizzare le notifiche.
ja: 現在のデータベースの SQL Server Service Broker は有効になっていません。このため、クエリ通知はサポートされません。通知を利用する場合は、このデータベースの Service Broker を有効にしてください。
ko: 현재 데이터베이스에 대해 SQL Server Service Broker가 설정되어 있지 않으므로 쿼리 알림을 사용할 수 없습니다. 알림을 사용하려면 이 데이터베이스에 대해 Service Broker를 설정하십시오.
pt_br: O SQL Server Service Broker do banco de dados atual não está habilitado e, como resultado, não há suporte a notificações de consultas. Habilite o Service Broker para este banco de dados se desejar usar notificações.
ru: SQL Server Service Broker для текущей базы данных не включен, поэтому оповещения не поддерживаются. Включите Service Broker для этой базы данных, чтобы использовать оповещения.
zh_hans: 未启用当前数据库的 SQL Server Service Broker，因此查询通知不受支持。如果希望使用通知，请为此数据库启用 Service Broker。
zh_hant: 尚未啟用目前資料庫的 SQL Server Service Broker，因此不支援查詢通知。如果您想要使用通知，請啟用這個資料庫的 Service Broker。

# SqlDependency_DefaultOptionsButNoStart
source: When using SqlDependency without providing an options value, SqlDependency.Start() must be called prior to execution of a command added to the SqlDependency instance.
de: Bei Verwendung von 'SqlDependency' ohne Angabe eines Optionswertes muss 'SqlDependency.Start()' aufgerufen werden, bevor ein zur SqlDependency-Instanz hinzugefügter Befehl ausgeführt werden kann.
es: Al utilizar SqlDependency sin proporcionar un valor de opciones, se debe llamar a SqlDependency.Start() antes de la ejecución de un comando agregado a la instancia SqlDependency.
fr: Lors de l'utilisation de SqlDependency sans spécification d'une valeur d'options, SqlDependency.Start() doit être appelée avant l'exécution d'une commande ajoutée à l'instance SqlDependency.
it: Quando si utilizza SqlDependency senza indicare un valore per le opzioni, è necessario chiamare SqlDependency.Start() prima di aggiungere all'istanza SqlDependency l'esecuzione di un comando.
ja: オプション値を指定せずに SqlDependency を使用する場合は、SqlDependency インスタンスに追加されたコマンドを実行する前に、SqlDependency.Start() を呼び出す必要があります。
ko: 옵션 값을 지정하지 않고 SqlDependency를 사용하려면 SqlDependency 인스턴스에 추가된 명령을 실행하기 전에 SqlDependency.Start()를 호출해야 합니다.
pt_br: Quando você usar SqlDependency sem fornecer um valor de opção, chame SqlDependency.Start() antes de executar um comando adicionado à instância SqlDependency.
ru: Если SqlDependency используется без указания значения для Оptions, то перед выполнением команды, добавленной в экземпляр SqlDependency, необходимо вызвать метод SqlDependency.Start().
zh_hans: 如果使用没有提供选项值的 SqlDependency，必须先调用 SqlDependency.Start()，然后才能执行添加到 SqlDependency 实例中的命令。
zh_hant: 當使用 SqlDependency 而不提供選項值時，必須先呼叫 SqlDependency.Start() 才能執行新增至 SqlDependency 執行個體的命令。

# SqlDependency_EventNoDuplicate
source: SqlDependency.OnChange does not support multiple event registrations for the same delegate.
de: 'SqlDependency.OnChange' unterstützt nicht mehrere Ereignisregistrierungen für denselben Delegate.
es: SqlDependency.OnChange no admite registros de varios eventos para el mismo delegado.
fr: SqlDependency.OnChange ne prend pas en charge les inscriptions d'événements multiples pour le même délégué.
it: SqlDependency.OnChange non supporta più registrazioni eventi per lo stesso delegato.
ja: SqlDependency.OnChange は、同一の委任に対する複数のイベント登録をサポートしていません。
ko: SqlDependency.OnChange는 동일한 위임에 대한 여러 이벤트 등록을 지원하지 않습니다.
pt_br: SqlDependency.OnChange não oferece suporte a vários registros de evento para o mesmo delegado.
ru: SqlDependency.OnChange не поддерживает повторной регистрации события для одного делегата.
zh_hans: SqlDependency.OnChange 不支持相同的委托注册多个事件。
zh_hant: SqlDependency.OnChange 不支援單一委派的多事件登錄。

# SqlDependency_DuplicateStart
source: SqlDependency does not support calling Start() with different connection strings having the same server, user, and database in the same app domain.
de: 'SqlDependency' unterstützt nicht den Aufruf von 'Start()' bei unterschiedlichen Verbindungszeichenfolgen mit demselben Server, demselben Benutzer und derselben Datenbank in derselben Anwendungsdomäne.
es: SqlDependency no admite llamar a Start() con cadenas de conexión diferentes con el mismo servidor, usuario y base de datos en el mismo dominio app.
fr: SqlDependency ne prend pas en charge l'appel de Start() avec différentes chaînes de connexion ayant les mêmes serveur, utilisateur et base de données dans le même domaine d'application.
it: SqlDependency non supporta la chiamata di Start() se più stringhe di connessione hanno server, utente e database identici nello stesso dominio app.
ja: SqlDependency では、同一アプリケーション ドメイン内の同一のサーバー、ユーザー、およびデータベースを持つ、異なる接続文字列と共に Start() を呼び出すことはできません。
ko: SqlDependency는 동일한 응용 프로그램 도메인에서 동일한 서버, 사용자 및 데이터베이스를 사용하는 서로 다른 연결 문자열에 대해 Start()를 호출하지 않습니다.
pt_br: SqlDependency não oferece suporte para chamar Start() com cadeias de conexão diferentes que tenham o mesmo servidor, usuário e banco de dados no mesmo domínio de aplicativo.
ru: SqlDependency не поддерживает вызова метода Start() с разными строками подключения для одного и того же сервера, пользователя и базы данных в том же домене применения.
zh_hans: SqlDependency 不支持在调用 Start() 时使用包含相同应用程序域中的相同服务器、用户和数据库的不同连接字符串。
zh_hant: 當不同的連接字串在相同的應用網域中擁有相同的伺服器、使用者和資料庫時，SqlDependency 並不支援 Start() 的呼叫。

# SqlDependency_IdMismatch
source: No SqlDependency exists for the key.
de: Für den Schlüssel ist kein 'SqlDependency' vorhanden.
es: No existe SqlDependency para la clave.
fr: Aucun SqlDependency n'existe pour la clé.
it: Nessun SqlDependency esistente per la chiave.
ja: キーには SqlDependency がありません。
ko: 키에 대한 SqlDependency가 없습니다.
pt_br: Não existe nenhum SqlDependency para a chave.
ru: Не существует SqlDependency для ключа.
zh_hans: 没有用于该键的 SqlDependency。
zh_hant: 沒有索引鍵的 SqlDependency。

# SqlDependency_NoMatchingServerStart
source: When using SqlDependency without providing an options value, SqlDependency.Start() must be called for each server that is being executed against.
de: Bei Verwendung von 'SqlDependency' ohne Angabe eines Optionswertes muss 'SqlDependency.Start()' für jeden Server aufgerufen werden, auf den der Befehl angewendet werden soll.
es: Al utilizar SqlDependency sin proporcionar un valor de opciones, se debe llamar a SqlDependency.Start() para cada servidor que se esté ejecutando.
fr: Lors de l'utilisation de SqlDependency sans spécification d'une valeur d'options, SqlDependency.Start() doit être appelée pour chacun des serveurs pour lesquels elle est exécutée.
it: Quando si utilizza SqlDependency senza fornire un valore per le opzioni, è necessario chiamare SqlDependency.Start() per ogni server contro il quale si sta eseguendo.
ja: オプション値を指定せずに SqlDependency を使用する場合は、SqlDependency.Start() を、実行対象のサーバーごとに呼び出す必要があります。
ko: 옵션 값을 지정하지 않고 SqlDependency를 사용하려면 실행할 각 서버에 대해 SqlDependency.Start()를 호출해야 합니다.
pt_br: Quando você usar SqlDependency sem fornecer um valor de opção, chame SqlDependency.Start() para cada servidor no qual o comando estiver sendo executado.
ru: Если SqlDependency используется без указания значения Options, то для каждого затронутого сервера необходимо вызвать SqlDependency.Start().
zh_hans: 如果使用没有提供选项值的 SqlDependency，必须对每个正在执行该命令的服务器调用 SqlDependency.Start()。
zh_hant: 當使用 SqlDependency 而不提供選項值時，則必須針對各個執行的伺服器呼叫 SqlDependency.Start()。

# SqlDependency_NoMatchingServerDatabaseStart
source: SqlDependency.Start has been called for the server the command is executing against more than once, but there is no matching server/user/database Start() call for current command.
de: 'SqlDependency.Start' wurde für den Server aufgerufen, auf den der Befehl mehr als einmal angewendet wird. Es gibt jedoch keinen übereinstimmenden 'server/user/database Start()'-Aufruf für den aktuellen Befehl.
es: Se ha llamado a SqlDependency.Start para el servidor que ejecuta el comando más de una vez, pero no hay llamada coincidente servidor/usuario/base de datos Start() para el comando actual.
fr: SqlDependency.Start a été appelée pour le serveur pour lequel la commande s'exécute plusieurs fois, mais il n'y a pas d'appel Start() serveur/utilisateur/base de données correspondant pour la commande actuelle.
it: È stato chiamato più di una volta SqlDependency.Start per il server contro cui il comando sta eseguendo, ma non c'è nessuna chiamata Start() server/utente/data per il comando corrente.
ja: コマンドを再度実行しようとしたサーバーで SqlDependency.Start が呼び出されましたが、現在のコマンドを呼び出しているサーバー、ユーザー、およびデータベースの Start() に一致しません。
ko: 명령이 실행되고 있는 서버에 대해 SqlDependency.Start를 두 번 이상 호출했지만 현재 명령에 일치하는 서버/사용자/데이터베이스 Start() 호출이 없습니다.
pt_br: SqlDependency.Start foi chamado mais de uma vez para o servidor no qual o comando está sendo executando, mas não há chamada Start() para o servidor/usuário/banco de dados que corresponda ao comando atual.
ru: Метод SqlDependency.Start вызван для сервера, по отношению к которому выполняется команда, больше одного раза, но для текущей команды нет соответствующего вызова Start() для сервера/пользователя/базы данных.
zh_hans: 已多次对正在执行该命令的服务器调用 SqlDependency.Start，但是当前命令没有匹配的服务器/用户/数据库 Start() 调用。
zh_hant: SqlDependency.Start 已由伺服器呼叫，且命令也執行超過一次，但目前的命令並沒有符合的伺服器/使用者/資料庫 Start() 的呼叫。

# SqlDependency_InvalidTimeout
source: Timeout specified is invalid. Timeout cannot be < 0.
de: Der angegebene Timeoutwert ist ungültig. Der Timeoutwert darf nicht < 0 sein.
es: Timeout especificado no válido. El Timeout no puede ser < 0.
fr: Le Timeout spécifié n'est pas valide. Il ne peut pas être < 0.
it: Timeout specificato non valido. Il timeout non può essere < 0.
ja: 指定された Timeout 値が無効です。タイムアウトには 0 より小さい数値は指定できません。
ko: 지정한 Timeout이 잘못되었습니다. Timeout은 0보다 작을 수 없습니다.
pt_br: O Timeout especificado é inválido. O tempo limite não pode ser < 0.
ru: Указано недействительное время ожидания Timeout. Время ожидания не может быть отрицательным.
zh_hans: 指定的 Timeout 无效。Timeout 值不能小于 0。
zh_hant: 指定的等候 Timeout 無效。等候 Timeout 不可 < 0。

# SQLNotify_ErrorFormat
source: Notification Error. Type={0}, Info={1}, Source={2}.
de: Benachrichtigungsfehler. Typ={0}, Info={1}, Quelle={2}.
es: Error de notificación. Tipo={0}, Info={1}, Origen={2}.
fr: Erreur de notification. Type={0}, Info={1}, Source={2}.
it: Errore di notifica. Type={0}, Info={1}, Source={2}.
ja: 通知エラー。種類={0}、情報={1}、ソース={2}
ko: 알림 오류입니다. 유형={0}, 정보={1}, 원본={2}.
pt_br: Erro de Notificação. Tipo={0}, Informações={1}, Origem={2}.
ru: Ошибка уведомления. Type={0}, Info={1}, Source={2}.
zh_hans: 通知错误。Type={0}，Info={1}，Source={2}。
zh_hant: 通知錯誤。Type={0}, Info={1}, Source={2}。

# SqlMetaData_NoMetadata
source: GetMetaData is not valid for this SqlDbType.
de: GetMetaData ist für diesen SqlDbType nicht gültig.
es: GetMetaData no es válido para este SqlDbType.
fr: GetMetaData n'est pas valide pour ce SqlDbType.
it: GetMetaData non è valido per questo SqlDbType.
ja: GetMetaData は、この SqlDbType には無効です。
ko: GetMetaData는 이 SqlDbType에 적합하지 않습니다.
pt_br: GetMetaData não é válido para esse SqlDbType.
ru: GetMetaData недопустим для этого SqlDbType.
zh_hans: GetMetaData 对 SqlDbType 无效。
zh_hant: GetMetaData 對此 SqlDbType 無效。

# SqlMetaData_InvalidSqlDbTypeForConstructorFormat
source: The dbType {0} is invalid for this constructor.
de: Der 'dbType' {0} ist für diesen Konstruktor ungültig.
es: El dbType {0} no es válido para este constructor.
fr: Le dbType {0} n'est pas valide pour ce constructeur.
it: dbType {0} non è valido per questo costruttore.
ja: このコンストラクターに対し、dbType {0} は無効です。
ko: dbType {0}은(는) 이 생성자에 사용할 수 없습니다.
pt_br: O dbType {0} é inválido para esse construtor.
ru: dbType {0} недопустим для этого конструктора.
zh_hans: dbType {0} 对于此构造函数无效。
zh_hant: 此建構函式的 dbType {0} 無效。

# SqlMetaData_NameTooLong
source: The name is too long.
de: Der Name ist zu lang.
es: El nombre es demasiado largo.
fr: Le nom est trop long.
it: Il nome è troppo lungo.
ja: 名前が長すぎます。
ko: 이름이 너무 깁니다.
pt_br: O nome é muito longo.
ru: Слишком длинное имя.
zh_hans: 名称太长。
zh_hant: 名稱太長。

# SqlMetaData_SpecifyBothSortOrderAndOrdinal
source: The sort order and ordinal must either both be specified, or neither should be specified (SortOrder.Unspecified and -1). The values given were: order = {0}, ordinal = {1}.
de: Es müssen entweder Sortierreihenfolge und Ordinalwert oder keiner von beiden angegeben werden. (SortOrder.Unspecified und -1). Die angegebenen Werte waren: order = {0}, ordinal = {1}.
es: Se deben especificar tanto el criterio de ordenación como el ordinal. De lo contrario, ninguno de ellos debe especificarse (SortOrder.Unspecified y -1). Los valores fueron: ordenación = {0}, ordinal = {1}.
fr: Soit l'ordre de tri et l'ordinal doivent être tous les deux spécifiés, soit aucun des deux ne doit être spécifié (SortOrder.Unspecified et -1). Les valeurs données étaient : ordre = {0}, ordinal = {1}.
it: Il criterio ordinamento e l'ordinale devono essere entrambi specificati o entrambi assenti (SortOrder.Unspecified e -1). I valori forniti sono: order = {0}, ordinal = {1}.
ja: 並べ替え順序と序数は、両方指定するか、両方指定しないようにする (SortOrder.Unspecified と -1 にする) 必要があります。指定された値 : 順序 = {0}、序数 = {1}。
ko: 정렬 순서와 서수는 둘 다 지정하거나 둘 다 지정하지 않아야 합니다. (SortOrder.Unspecified 및 -1) 지정한 값은 순서 = {0}, 서수 = {1}입니다.
pt_br: A ordem de classificação e a ordinal devem ser ambas especificadas ou não (SortOrder.Unspecified e -1). Os valores fornecidos são: ordem = {0}, ordinal = {1}.
ru: Порядок сортировки и порядковый номер должны быть указаны оба или их вообще не следует указывать (SortOrder.Unspecified и -1). Здесь приняты следующие значения: порядок = {0}, порядковый номер = {1}.
zh_hans: 必须同时指定排序顺序和序号或者二者均不指定(SortOrder.Unspecified 和 -1)。指定的值为: 顺序 = {0}，序号 = {1}。
zh_hant: 排序次序以及序數必須同時指定或不指定 (SortOrder.Unspecified 以及 -1)。已指定的值: 順序 = {0}，序數 = {1}。

# SqlProvider_InvalidDataColumnType
source: The type of column '{0}' is not supported. The type is '{1}'
de: Der Typ der Spalte '{0}' wird nicht unterstützt. Der Typ ist {1}.
es: No se admite el tipo de columna '{0}'. El tipo es '{1}'
fr: Le type de colonne '{0}' n'est pas pris en charge. Le type est '{1}'
it: Il tipo della colonna '{0}' non è supportato. Il tipo è '{1}'
ja: 列 '{0}' の型はサポートされていません。型は '{1}' です。
ko: 열 '{0}'의 형식이 지원되지 않습니다. 형식은 '{1}'입니다.
pt_br: Não há suporte para o tipo de coluna '{0}'. O tipo é '{1}'
ru: Тип столбца "{0}" не поддерживается. Тип равен "{1}"
zh_hans: 不支持列“{0}”的类型。类型为 {1}。
zh_hant: 不支援資料行 '{0}' 的型別。型別是 '{1}'

# SqlProvider_InvalidDataColumnMaxLength
source: The size of column '{0}' is not supported. The size is {1}.
de: Die Größe der Spalte '{0}' wird nicht unterstützt. Die Größe ist {1}.
es: No se admite el tamaño de la columna '{0}'. El tamaño es {1}.
fr: La taille de la colonne '{0}' n'est pas mise à jour. La taille est {1}.
it: La dimensione della colonna '{0}' non è supportata. La dimensione è {1}.
ja: 列 '{0}' のサイズはサポートされていません。サイズは {1} です。
ko: 열 '{0}'의 크기가 지원되지 않습니다. 크기는 {1}입니다.
pt_br: Não há suporte para o tamanho da coluna '{0}'. O tamanho é {1}.
ru: Размер столбца "{0}" не поддерживается. Размер равен {1}.
zh_hans: 不支持列“{0}”的大小。大小为 {1}。
zh_hant: 不支援資料行 '{0}' 的大小。大小是 {1}。

# SqlProvider_NotEnoughColumnsInStructuredType
source: There are not enough fields in the Structured type. Structured types must have at least one field.
de: Im Structured-Typ sind nicht genügend Felder. Structured-Typen müssen mindestens ein Feld besitzen.
es: No hay suficientes campos en el tipo estructurado. Los tipos Structured deben tener al menos un campo.
fr: Le type structuré ne comprend pas suffisamment de champs. Les types Structured doivent avoir au moins un champ.
it: Campi insufficienti nel tipo Structured. I tipi Structured devono avere almeno un campo.
ja: Structured 型に十分なフィールドがありません。Structured 型には、少なくとも 1 つのフィールドが必要です。
ko: Structured 형식에 필드가 충분하지 않습니다. Structured 형식에는 필드가 하나 이상 있어야 합니다.
pt_br: Não há campos suficientes no tipo Structured. Os tipos Estruturados devem ter pelo menos um campo.
ru: В типе Structured недостаточно полей. В типах Structured должно содержаться не менее одного поля.
zh_hans: 结构化类型中的字段不足。Structured 类型必须至少包含一个字段。
zh_hant: Structured 型別中沒有足夠的欄位。Structured 型別必須至少有一個欄位。

# SqlProvider_DuplicateSortOrdinal
source: The sort ordinal {0} was specified twice.
de: Der Sortierordinalwert {0} wurde zweimal angegeben.
es: El ordinal de ordenación {0} se especificó dos veces.
fr: L'ordinal de tri {0} a été spécifié deux fois.
it: Ordinale {0} specificato due volte.
ja: 並べ替えの序数 {0} が 2 回指定されました。
ko: 정렬 서수 {0}이(가) 두 번 지정되었습니다.
pt_br: A classificação ordinal {0} foi especificada duas vezes.
ru: Порядковый номер сортировки {0} указан дважды.
zh_hans: 指定了两次排序序号 {0}。
zh_hant: 排序序數 {0} 指定了兩次。

# SqlProvider_MissingSortOrdinal
source: The sort ordinal {0} was not specified.
de: Der Sortierordinalwert {0} wurde nicht angegeben.
es: No se especificó el ordinal de ordenación {0}.
fr: L'ordinal de tri {0} n'a pas été spécifié.
it: Ordinale {0} non specificato.
ja: 並べ替えの序数 {0} が指定されませんでした。
ko: 정렬 서수 {0}이(가) 지정되지 않았습니다.
pt_br: A classificação ordinal {0} não foi especificada.
ru: Порядковый номер сортировки {0} не указан.
zh_hans: 未指定序号 {0}。
zh_hant: 未指定排序序數 {0}。

# SqlProvider_SortOrdinalGreaterThanFieldCount
source: The sort ordinal {0} on field {1} exceeds the total number of fields.
de: Der Sortierordinalwert {0} für Feld {1} überschreitet die Gesamtzahl der Felder.
es: El ordinal de ordenación {0} del campo {1} supera el número total de campos.
fr: L'ordinal de tri {0} sur le champ {1} dépasse le nombre total de champs.
it: L'ordinale {0} del campo {1} supera il numero totale di campi.
ja: フィールド {1} の並べ替えの序数 {0} がフィールドの総数を超えています。
ko: {1} 필드의 정렬 서수 {0}이(가) 총 필드 수를 초과합니다.
pt_br: A classificação ordinal {0} no campo {1} excede o número total de campos.
ru: Порядковый номер сортировки {0} в поле {1} превышает общее число полей.
zh_hans: 字段 {1} 的排序序号 {0} 超过字段总数。
zh_hant: 欄位 {1} 上的排序序數 {0} 超過欄位的總數。

# IEnumerableOfSqlDataRecordHasNoRows
source: There are no records in the SqlDataRecord enumeration. To send a table-valued parameter with no rows, use a null reference for the value instead.
de: Es sind keine Datensätze in der 'SqlDataRecord'-Enumeration vorhanden. Verwenden Sie zum Senden eines table-valued parameters ohne Zeilen stattdessen einen null-Verweis für den Wert.
es: No hay registros en la enumeración SqlDataRecord. Para enviar un table-valued parameter sin filas, utilice en su lugar una referencia null para el valor.
fr: Il n'existe aucun enregistrement dans l'énumération SqlDataRecord. Pour envoyer un table-valued parameter sans ligne, utilisez plutôt une référence null pour la valeur.
it: Non sono disponibili record nell'enumerazione SqlDataRecord. Utilizzare un riferimento con valore null, per inviare un table-valued parameter senza righe.
ja: SqlDataRecord 列挙にレコードがありません。行のない table-valued parameter を送信したい場合は、代わりにその値の null 参照を使用します。
ko: SqlDataRecord 열거형에 레코드가 없습니다. 행이 없는 table-valued parameter를 보내려면 대신 값에 null 참조를 사용하십시오.
pt_br: Não há registros na enumeração SqlDataRecord. Para enviar um table-valued parameter sem linhas, use uma referência null para o valor.
ru: В перечислении SqlDataRecord нет записей. Чтобы передать имеющий табличное значение параметр table-valued parameter, который не содержит строк, используйте неопределенную ссылку null на значение.
zh_hans: SqlDataRecord 枚举中没有记录。要发送不包含行的 table-valued parameter，请对该值改用 null 引用。
zh_hant: SqlDataRecord 列舉之中沒有記錄。若要傳送沒有資料列的 table-valued parameter，請使用該值的 null 參考來代替。

# SqlPipe_CommandHookedUpToNonContextConnection
source: SqlPipe does not support executing a command with a connection that is not a context connection.
de: 'SqlPipe' unterstützt nicht die Ausführung eines Befehls bei einer Nicht-Kontextverbindung.
es: SqlPipe no admite ejecutar un comando con una conexión que no es de contexto.
fr: SqlPipe ne prend pas en charge l'exécution d'une commande avec une connexion qui n'est pas une connexion du contexte.
it: SqlPipe non supporta l'esecuzione di un comando con una connessione diversa da una connessione contesto.
ja: SqlPipe では、コンテキスト接続ではない接続を使用してコマンドを実行することはできません。
ko: SqlPipe는 컨텍스트 연결이 아닌 다른 연결 상태에서 명령을 실행할 수 없습니다.
pt_br: O SqlPipe não oferece suporte à execução de um comando com uma conexão que não seja conexão de contexto.
ru: SqlPipe не поддерживает выполнения команды с подключением, которое не является контекстным.
zh_hans: SqlPipe 不支持使用非上下文连接执行命令。
zh_hant: 當某命令的連接不是內容連接時，SqlPipe 不支援該命令的執行。

# SqlPipe_MessageTooLong
source: Message length {0} exceeds maximum length supported of 4000.
de: Die Nachrichtenlänge {0} überschreitet die zulässige Länge von 4.000.
es: La longitud del mensaje {0} excede la longitud máxima admitida de 4000.
fr: La longueur de message {0} dépasse la longueur maximale prise en charge de 4000.
it: La lunghezza del messaggio {0} supera la lunghezza massima supportata di 4000.
ja: メッセージの長さ {0} が、サポートしている最大長である 4000 を超えています。
ko: 메시지 길이 {0}이(가) 지원되는 최대 길이 4000자를 초과했습니다.
pt_br: {0} ultrapassa o tamanho máximo de mensagens aceito de 4.000.
ru: Длина сообщения {0} превышает максимальное поддерживаемое значение 4000.
zh_hans: 消息长度 {0} 超过支持的最大长度 4000。
zh_hant: 訊息長度 {0} 超過支援的最大長度 4000。

# SqlPipe_IsBusy
source: Could not use the pipe while it is busy with another operation.
de: Die Pipe konnte nicht verwendet werden, da sie zurzeit eine andere Operation ausführt.
es: No se puede usar la canalización mientras esté ocupado con otra operación.
fr: Impossible d'utiliser le canal tant qu'il est occupé par une autre opération.
it: Impossibile utilizzare la pipe se è occupata con un'altra operazione.
ja: 別の操作でパイプがビジー状態である場合、このパイプを使用できない可能性があります。
ko: 다른 작업을 수행 중인 동안에는 파이프를 사용할 수 없습니다.
pt_br: Não é possível usar o pipe enquanto ele está ocupado com outra operação.
ru: Не удалось использовать канал, поскольку он занят другой операцией.
zh_hans: 无法使用该管道，该管道正在处理其他操作。
zh_hant: 當管線忙碌於其他操作時便無法使用。
