Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# GT_UnsupportedSysTxVersion
source: The currently loaded System.Transactions.dll does not support Global Transactions. Please upgrade to .NET Framework 4.6.1 or later.
de: Die aktuell geladene Datei "System.Transactions.dll" unterstützt keine globalen Transaktionen. Führen Sie ein Upgrade auf .NET Framework 4.6.1 oder höher durch.
es: El archivo System.Transactions.dll cargado actualmente no es compatible con las transacciones globales. Actualice a .NET Framework 4.6.1 o posterior.
fr: Le fichier System.Transactions.dll actuellement chargé ne prend pas en charge les transactions globales. Effectuez une mise à niveau vers .NET Framework 4.6.1 ou ultérieur.
it: Il file System.Transactions.dll attualmente caricato non supporta le transazioni globali. Effettuare l'aggiornamento a .NET Framework 4.6.1 o versioni successive.
ja: 現在読み込まれている System.Transactions.dll では、グローバル トランザクションはサポートされていません。.NET Framework 4.6.1 またはそれ以降にアップグレードしてください。
ko: 현재 로드된 System.Transactions.dll은 전역 트랜잭션을 지원하지 않습니다. .NET Framework 4.6.1 이상으로 업그레이드하세요.
pt_br: O System.Transactions.dll carregado no momento não dá suporte a Transações Globais. Atualize para o .NET Framework 4.6.1 ou posterior.
ru: Загруженная библиотека System.Transactions.dll не поддерживает глобальные транзакции. Перейдите на .NET Framework 4.6.1 или более позднюю версию.
zh_hans: 当前加载的 System.Transactions.dll 不支持全局事务。请升级到 .NET Framework 4.6.1 或更高版本。
zh_hant: 目前載入的 System.Transactions.dll 不支援全域交易。請升級為 .NET Framework 4.6.1 或更新版本。

# SQL_BatchedUpdatesNotAvailableOnContextConnection
source: Batching updates is not supported on the context connection.
de: Batchupdates werden bei der Kontextverbindung nicht unterstützt.
es: La conexión de contexto no admite la actualización de procesamiento por lotes.
fr: Le traitement par lots des mises à jour n'est pas pris en charge sur la connexion du contexte.
it: L'esecuzione di batch di aggiornamenti non è supportata nella connessione contesto.
ja: コンテキスト接続では、更新のバッチ処理はサポートされていません。
ko: 컨텍스트 연결에서는 일괄 처리 업데이트가 지원되지 않습니다.
pt_br: Não há suporte para as atualizações em lote na conexão de contexto.
ru: Группировка обновлений для контекстного подключения не поддерживается.
zh_hans: 在上下文连接上不支持批处理更新。
zh_hant: 內容連接上並不支援批次更新。

# SQL_ContextAllowsLimitedKeywords
source: The only additional connection string keyword that may be used when requesting the context connection is the Type System Version keyword.
de: Das einzige zusätzliche Schlüsselwort für die Verbindungszeichenfolge, das beim Anfordern der Kontextverbindung verwendet werden darf, lautet 'Type System Version'.
es: La palabra clave Type System Version es la única palabra clave de cadena de conexión adicional que se puede emplear al solicitar la conexión de contexto.
fr: Le seul mot clé de chaîne de connexion supplémentaire qui peut être utilisé lors de la demande de la connexion du contexte est le mot clé Type System Version.
it: L'unica parola chiave per la stringa di connessione supplementare che può essere utilizzata quando si richiede la connessione contesto è Type System Version.
ja: コンテキスト接続を要求する際に、この他に使用される唯一の接続文字列キーワードは Type System Version キーワードです。
ko: 컨텍스트 연결을 요청할 때 유일하게 추가할 수 있는 연결 문자열 키워드는 Type System Version 키워드입니다.
pt_br: A única palavra-chave da cadeia de conexão adicional que deve ser usada ao solicitar a conexão de contexto é a palavra-chave Type System Version.
ru: Единственным дополнительным ключевым словом строки подключения, которое может использоваться при запросе контекстного подключения, является ключевое слово Type System Version.
zh_hans: 在请求上下文连接时唯一可以使用的其他连接字符串关键字是 Type System Version 关键字。
zh_hant: Type System Version 關鍵字是唯一在要求內容連接時可能需要使用的其他連接字串關鍵字。

# SQL_ContextAllowsOnlyTypeSystem2005
source: The context connection does not support Type System Version=SQL Server 2000.
de: Die Kontextverbindung unterstützt nicht Type System Version=SQL Server 2000.
es: La conexión de contexto no admite Type System Version=SQL Server 2000.
fr: La connexion du contexte ne prend pas en charge Type System Version=SQL Server 2000.
it: La connessione contesto non supporta Type System Version=SQL Server 2000.
ja: コンテキスト接続は Type System Version=SQL Server 2000 をサポートしていません。
ko: 컨텍스트 연결은 Type System Version=SQL Server 2000을 지원하지 않습니다.
pt_br: Não há suporte para a conexão de contexto Type System Version=SQL Server 2000.
ru: Контекстное подключение не поддерживает Type System Version=SQL Server 2000.
zh_hans: 上下文连接不支持 Type System Version=SQL Server 2000。
zh_hant: 此內容連接不支援 Type System Version=SQL Server 2000。

# SQL_ContextConnectionIsInUse
source: The context connection is already in use.
de: Die Kontextverbindung wird bereits verwendet.
es: La conexión de contexto ya está en uso.
fr: La connexion du contexte est déjà en cours d'utilisation.
it: La connessione contesto è giù in uso.
ja: コンテキスト接続は既に使用されています。
ko: 컨텍스트 연결이 이미 사용 중입니다.
pt_br: A conexão de contexto já está em uso.
ru: Контекстное подключение уже используется.
zh_hans: 上下文连接已经在使用。
zh_hant: 此內容連接已在使用中。

# SQL_ContextUnavailableOutOfProc
source: The requested operation requires a SqlClr context, which is only available when running in the Sql Server process.
de: Die angeforderte Operation erfordert einen SqlClr -Kontext, der nur bei Ausführung im Sql Server-Prozess verfügbar ist.
es: La operación solicitada necesita un contexto SqlClr que sólo está disponible cuando se utiliza con el proceso de Sql Server.
fr: L'opération demandée nécessite un contexte SqlClr, qui n'est disponible qu'en cas d'exécution dans le processus Sql Server.
it: L'operazione richiesta richiede un contesto SqlClr che è disponibile solo quando si opera nel processo Sql Server.
ja: 要求された操作には、SqlClr コンテキストが必要です。このコンテキストは、Sql Server プロセス内で実行する場合にのみ使用できます。
ko: 요청한 작업을 수행하려면 Sql Server 프로세스에서 실행 중인 경우에만 사용할 수 있는 SqlClr 컨텍스트가 필요합니다.
pt_br: A operação solicitada requer um contexto SqlClr que somente está disponível durante a execução no processo Sql Server.
ru: Для затребованной операции необходим контекст SqlClr, который доступен только при выполнении в процессе Sql Server.
zh_hans: 所请求的操作需要使用 SqlClr 上下文，该上下文只有在 Sql Server 进程中运行时才可用。
zh_hant: 要求的操作需要 SqlClr 內容，這是在 Sql Server 程序中執行時唯一可用的內容。

# SQL_ContextUnavailableWhileInProc
source: The requested operation requires a Sql Server execution thread. The current thread was started by user code or other non-Sql Server engine code.
de: Für die angeforderte Operation ist ein SQL Server-Ausführungsthread erforderlich. Der aktuelle Thread wurde durch Benutzercode oder einen anderen Nicht-Sql Server-Modulcode gestartet.
es: La operación solicitada necesita un proceso de ejecución de Sql Server. El proceso de ejecución actual comenzó por un código de usuario u otro código de motor de servidor que no es Sql.
fr: L'opération demandée nécessite un thread d'exécution Sql Server. Le thread en cours a été démarré par code d'utilisateur ou autre code de moteur non-Sql Server.
it: L'operazione richiesta richiede un thread di esecuzione Sql Server Il thread corrente è stato avviato da un codice utente o da un altro codice motore diverso da Sql Server.
ja: 要求された操作には、Sql Server の実行スレッドが必要です。現在のスレッドはユーザー コードまたはその他の non-Sql Server エンジン コードによって開始されました。
ko: 요청한 작업을 수행하려면 Sql Server 실행 스레드가 필요합니다. 현재 스레드는 사용자 코드 또는 Sql Server가 아닌 다른 엔진 코드에서 시작했습니다.
pt_br: A operação solicitada requer um thread de execução Sql Server. O thread atual foi iniciado pelo código do usuário ou outro código de mecanismo sem ser o Sql Server.
ru: Для затребованной операции необходим поток выполнения Sql Server. Текущий поток был запущен кодом пользователя или другим кодом, который не является кодом модуля Sql Server.
zh_hans: 所请求的操作需要使用 Sql Server 执行线程。当前线程由用户代码或其他非 Sql Server 引擎代码启动。
zh_hant: 要求的操作需要 Sql Server 執行緒。目前的執行緒是由使用者編碼或其他非 Sql Server 引擎碼所啟動的。

# SQL_NestedTransactionScopesNotSupported
source: Nested TransactionScopes are not supported.
de: Geschachtelte 'TransactionScopes' werden nicht unterstützt.
es: No se admiten las TransactionScopes anidadas.
fr: Les TransactionScopes imbriquées ne sont pas prises en charge.
it: Non sono supportati TransactionScopes annidati.
ja: TransactionScopes を入れ子にすることはできません。
ko: 중첩 TransactionScopes는 지원되지 않습니다.
pt_br: Não há suporte para TransactionScopes aninhados.
ru: Вложенные TransactionScopes не поддерживаются.
zh_hans: 不支持嵌套的 TransactionScopes。
zh_hant: 不支援巢狀 TransactionScopes。

# SQL_NotAvailableOnContextConnection
source: The requested operation is not available on the context connection.
de: Die angeforderte Operation ist für die Kontextverbindung nicht verfügbar.
es: La operación solicitada no está disponible en la conexión de contexto.
fr: L'opération demandée n'est pas disponible sur la connexion du contexte.
it: L'operazione richiesta non è disponibile nella connessione contesto.
ja: 要求された操作をコンテキスト接続で行うことはできません。
ko: 요청한 작업은 컨텍스트 연결에서 사용할 수 없습니다.
pt_br: A operação solicitada não está disponível na conexão de contexto.
ru: Для контекстного подключения затребованная операция не доступна.
zh_hans: 所请求的操作在上下文连接上不可用。
zh_hant: 在此內容連接上無法使用要求的操作。

# SQL_NotificationsNotAvailableOnContextConnection
source: Notifications are not available on the context connection.
de: Die Benachrichtigungen sind für die Kontextverbindung nicht verfügbar.
es: Las notificaciones no están disponibles en la conexión de contexto.
fr: Les notifications ne sont pas disponibles sur la connexion du contexte.
it: Le notifiche non sono disponibili nella connessione contesto.
ja: コンテキスト接続で通知を使用することはできません。
ko: 알림은 컨텍스트 연결에서 사용할 수 없습니다.
pt_br: Notificações não estão disponíveis na conexão de contexto.
ru: Для контекстного подключения уведомления не доступны.
zh_hans: 通知在上下文连接上不可用。
zh_hant: 在此內容連接尚無法使用通知。

# SQL_UnexpectedSmiEvent
source: Unexpected server event: {0}.
de: Unerwartetes Serverereignis: {0}.
es: Evento de servidor inesperado: {0}.
fr: Événement serveur inattendu : {0}.
it: Evento server imprevisto: {0}.
ja: サーバーの予期しないイベント : {0}。
ko: 예기치 않은 서버 이벤트가 발생했습니다. {0}
pt_br: Evento de servidor inesperado: {0}.
ru: Недопустимое серверное событие: {0}.
zh_hans: 意外的服务器事件: {0}。
zh_hant: 未預期的伺服器事件: {0}。

# SQL_UserInstanceNotAvailableInProc
source: User instances are not allowed when running in the Sql Server process.
de: Benutzerinstanzen sind bei der Ausführung im Sql Server-Prozess nicht zulässig.
es: No se permiten las instancias de usuario al funcionar dentro de proceso del Sql Server.
fr: Les instances d'utilisateur ne sont pas autorisées en cas d'exécution dans le processus Sql Server.
it: Le istanze utente non sono consentite quando è in funzione il processo Sql Server.
ja: Sql Server プロセスで実行している場合は、ユーザー インスタンスは許可されません。
ko: Sql Server 프로세스에서 실행할 때는 사용자 인스턴스가 허용되지 않습니다.
pt_br: Instâncias do usuário não são permitidas durante a execução no processo Sql Server.
ru: Пользовательские экземпляры не разрешены при выполнении в процессе Sql Server.
zh_hans: 在 Sql Server 进程中运行时不允许使用用户实例。
zh_hant: 在 Sql Server 程序中執行時並不允許使用者執行個體。

# SQL_ArgumentLengthMismatch
source: The length of '{0}' must match the length of '{1}'.
de: Die Länge von '{0}' muss mit der Länge von '{1}' übereinstimmen.
es: La longitud de '{0}' debe coincidir con la longitud de '{1}'.
fr: La longueur de '{0}' doit correspondre à celle de '{1}'.
it: La lunghezza di '{0}' deve corrispondere alla lunghezza di '{1}'.
ja: '{0}' と '{1}' の長さは同じである必要があります。
ko: '{0}'의 길이는 '{1}'의 길이와 일치해야 합니다.
pt_br: O comprimento de '{0}' deve corresponder ao comprimento de '{1}'.
ru: Длина "{0}" должна соответствовать длине "{1}".
zh_hans: “{0}”的长度必须与“{1}”的长度匹配。
zh_hant: '{0}' 的長度必須和 '{1}' 的長度相符。

# SQL_InvalidSqlDbTypeWithOneAllowedType
source: The SqlDbType '{0}' is invalid for {1}. Only {2} is supported.
de: Der 'SqlDbType' '{0}' ist für {1} unzulässig. Unterstützt wird nur {2}.
es: SqlDbType '{0}' no es válido para {1}. Sólo admite {2}.
fr: Le type SqlDbType '{0}' n'est pas valide pour {1}. Seul {2} est pris en charge.
it: SqlDbType '{0}' non è valido per {1}. Solo {2} è supportato.
ja: {1} に対し、SqlDbType '{0}' は無効です。サポートしているのは {2} のみです。
ko: SqlDbType '{0}'은(는) {1}에 사용할 수 없습니다. {2}만 지원됩니다.
pt_br: A SqlDbType '{0}' é inválida para {1}. Há suporte apenas para {2}.
ru: SqlDbType "{0}" недопустим для {1}. Поддерживается только {2}.
zh_hans: SqlDbType“{0}”对于 {1} 无效。只支持 {2}。
zh_hant: SqlDbType '{0}' 對 {1} 是無效的。只支援 {2}。

# SQL_PipeErrorRequiresSendEnd
source: An error occurred with a prior row sent to the SqlPipe. SendResultsEnd must be called before anything else can be sent.
de: Fehler bei einer vorherigen Zeile, die an die SqlPipe gesendet wurde. 'SendResultsEnd' muss aufgerufen werden, bevor eine andere Zeile gesendet werden kann.
es: Error al enviar la fila anterior a SqlPipe. Se debe llamar a SendResultsEnd antes de poder enviar algo más.
fr: Une erreur s’est produite avec une ligne précédente envoyée au SqlPipe. SendResultsEnd doit être appelé avant que quoi que ce soit d’autre puisse être envoyé.
it: Si è verificato un errore con una riga precedente inviata alla SqlPipe. Prima di poter eseguire altri invii, è necessario chiamare SendResultsEnd.
ja: SqlPipe に送信された前の行でエラーが発生しました。他のものを送信する前に SendResultsEnd を呼び出す必要があります。
ko: SqlPipe로 보낸 이전 행에서 오류가 발생했습니다. 다른 행을 보내려면 SendResultsEnd를 호출해야 합니다.
pt_br: Ocorreu um erro com uma linha anteriormente enviada para o SqlPipe. O SendResultsEnd deve ser chamado antes de qualquer outro envio.
ru: Произошла ошибка, связанная с предыдущей строкой, отправленной в SqlPipe. Перед отправкой других строк необходимо вызвать SendResultsEnd.
zh_hans: 以前发送到 SqlPipe 的某行出错。必须先调用 SendResultsEnd，才能发送其他内容。
zh_hant: 發生錯誤，已傳送優先資料列至 SqlPipe。在進行其他傳送之前，必須先呼叫 SendResultsEnd。

# SQL_TooManyValues
source: Too many values.
de: Zu viele Werte.
es: Demasiados valores.
fr: Trop de valeurs.
it: Troppi valori.
ja: 値が多すぎます。
ko: 값이 너무 많습니다.
pt_br: Excesso de valores.
ru: Слишком много значений.
zh_hans: 值太多。
zh_hant: 太多數值。

# SQL_StreamWriteNotSupported
source: The Stream does not support writing.
de: Vom Stream wird Schreiben nicht unterstützt.
es: La Stream no admite escritura.
fr: Le Stream ne prend pas en charge l'écriture.
it: Stream non supporta la scrittura.
ja: Stream は書き込みをサポートしていません。
ko: Stream이 쓰기를 지원하지 않습니다.
pt_br: O Stream não dá suporte para gravação.
ru: Поток Stream не поддерживает записи.
zh_hans: Stream 不支持写入。
zh_hant: 此 Stream 不支援寫入動作。

# SQL_StreamReadNotSupported
source: The Stream does not support reading.
de: Vom Stream wird Lesen nicht unterstützt.
es: La Stream no admite lectura.
fr: Le Stream ne prend pas en charge la lecture.
it: Stream non supporta la lettura.
ja: Stream は読み取りをサポートしていません。
ko: Stream이 읽기를 지원하지 않습니다.
pt_br: O Stream não dá suporte para leitura.
ru: Поток Stream не поддерживает чтения.
zh_hans: Stream 不支持读取。
zh_hant: 此 Stream 不支援讀取動作。

# SQL_StreamSeekNotSupported
source: The Stream does not support seeking.
de: Vom Stream wird Suchen nicht unterstützt.
es: La Stream no admite búsqueda.
fr: Le Stream ne prend pas en charge la recherche.
it: Stream non supporta la ricerca.
ja: Stream は検索をサポートしていません。
ko: Stream이 검색을 지원하지 않습니다.
pt_br: O Stream não dá suporte para pesquisa.
ru: Поток Stream не поддерживает поиска.
zh_hans: Stream 不支持查找。
zh_hant: 此 Stream 不支援搜尋動作。

# SQL_ExOriginalClientConnectionId
source: ClientConnectionId before routing:{0}
de: ClientConnectionId vor dem Routing:{0}
es: ClientConnectionId antes del enrutamiento:{0}
fr: ClientConnectionId avant de router :{0}
it: ClientConnectionId prima del routing:{0}
ja: ルーティング前の ClientConnectionId:{0}
ko: 라우팅하기 전 ClientConnectionId:{0}
pt_br: ClientConnectionId antes do roteamento:{0}
zh_hans: 路由前 ClientConnectionId:{0}
zh_hant: 路由之前的 ClientConnectionId:{0}

# SQL_ExRoutingDestination
source: Routing Destination:{0}
de: Routingziel:{0}
es: Destino del enrutamiento:{0}
fr: Destination de routage :{0}
it: Destinazione di routing:{0}
ja: ルーティング先:{0}
ko: 라우팅 대상:{0}
pt_br: Destino de Roteamento:{0}
ru: Цель маршрутизации: {0}
zh_hans: 路由目标: {0}
zh_hant: 路由目的地:{0}

# SqlMisc_MessageString
source: Message
de: Nachricht
es: Mensaje
it: Messaggio
ja: メッセージ
ko: 메시지
pt_br: Mensagem
ru: Сообщение
zh_hans: 消息
zh_hant: 訊息

# SqlMisc_ArithOverflowMessage
source: Arithmetic Overflow.
de: Arithmetischer Überlauf.
es: Desbordamiento aritmético.
fr: Dépassement arithmétique.
it: Overflow aritmetico.
ja: 演算でオーバーフローしました。
ko: 산술 오버플로가 발생했습니다.
pt_br: Estouro Aritmético.
ru: Арифметическое переполнение.
zh_hans: 算术溢出。
zh_hant: 算術溢位。

# SqlMisc_DivideByZeroMessage
source: Divide by zero error encountered.
de: Fehler aufgrund einer Division durch 0.
es: Error al dividir por cero.
fr: Erreur : division par zéro.
it: Errore di divisione per zero.
ja: 0 除算エラーが発生しました。
ko: 0으로 나눔 오류가 발생했습니다.
pt_br: Erro de divisão por zero.
ru: Ошибка деления на нуль.
zh_hans: 出现被零除错误。
zh_hant: 發生除以零的錯誤。

# SqlMisc_NullValueMessage
source: Data is Null. This method or property cannot be called on Null values.
de: Der Wert eines Null-SQL-Datensatzes kann nicht zurückgegeben werden.
es: Los datos tienen valor Null. No se puede llamar a este método o propiedad con valores Null.
fr: Les données sont null. Cette méthode ou propriété ne peut pas être appelée sur des valeurs Null.
it: I dati hanno valore Null. Impossibile chiamare il metodo o la proprietà su valori Null.
ja: データが Null です。このメソッド、またはプロパティは Null 値で呼び出せません。
ko: Data가 Null입니다. 이 메서드 또는 속성은 Null 값에 호출될 수 없습니다.
pt_br: Dados são Null. Não é possível chamar este método ou esta propriedade em valores Null.
ru: Неопределенные данные. Этот метод или свойство не может вызываться для значений равных Null.
zh_hans: 数据为空。不能对 Null 值调用此方法或属性。
zh_hant: 資料為 Null。無法在值為 Null 的情況下呼叫這個方法或屬性。

# SqlMisc_TruncationMessage
source: Numeric arithmetic causes truncation.
de: Die numerische Arithmetik bewirkt ein Abschneiden.
es: La aritmética numérica provoca truncamientos.
fr: L'arithmétique numérique génère une troncation.
it: Troncamento causato da un'operazione aritmetica.
ja: 数値演算で切り捨てが起こりました。
ko: 수치 연산을 수행하면 잘라내기가 발생합니다.
pt_br: Aritmética numérica causa truncamento.
ru: Арифметическая операция над числами вызвала усечение.
zh_hans: 数值算法导致截断。
zh_hant: 數字算術導致截斷。

# SqlMisc_DateTimeOverflowMessage
source: SqlDateTime overflow. Must be between 1/1/1753 12:00:00 AM and 12/31/9999 11:59:59 PM.
de: SqlDateTime-Überlauf; muss zwischen 1/1/1753 12:00:00 AM und 12/31/9999 11:59:59 PM liegen.
es: Desbordamiento de SqlDateTime. Debe estar entre 1/1/1753 12:00:00 AM y 12/31/9999 11:59:59 PM.
fr: Dépassement SqlDateTime. Doit être compris entre 1/1/1753 12:00:00 AM et 31/12/9999 11:59:59 PM.
it: Overflow di SqlDateTime. Deve essere compreso tra 1/1/1753 12:00:00 AM e 12/31/9999 11:59:59 PM.
ja: SqlDateTime のオーバーフローです。1/1/1753 12:00:00 AM から 12/31/9999 11:59:59 PM までの間でなければなりません。
ko: SqlDateTime 오버플로가 발생했습니다. 1753년 1월 1일 오전 12:00:00에서 9999년 12월 31일 오후 11:59:59 사이에 있어야 합니다.
pt_br: Estouro de SqlDateTime. Deve estar entre 1/1/1753 12:00:00 AM e 31/12/9999 11:59:59 PM.
ru: Переполнение SqlDateTime. Должно находиться в пределах от 1/1/1753 12:00:00 AM и 12/31/9999 11:59:59 PM.
zh_hans: SqlDateTime 溢出。必须介于 1/1/1753 12:00:00 AM 和 12/31/9999 11:59:59 PM 之间。
zh_hant: SqlDateTime 溢位。必須在 1/1/1753 12:00:00 AM 和 12/31/9999 11:59:59 PM 之間

# SqlMisc_ConcatDiffCollationMessage
source: Two strings to be concatenated have different collation.
de: Zwei zu verkettende Zeichenfolgen haben unterschiedliche Sortierungen.
es: Las dos cadenas que se concatenan tienen una intercalación diferente.
fr: Les deux chaînes à concaténer ont un classement différent.
it: Due stringhe da concatenare hanno regole di confronto diverse.
ja: 連結する 2 つの文字列の照合順序が異なります。
ko: 연결할 두 문자열의 데이터가 다르게 정렬되어 있습니다.
pt_br: Duas cadeias de caracteres a serem concatenadas têm intercalação diferente.
ru: Две соединяемые строки имеют различный порядок следования.
zh_hans: 要连接的两个字符串具有不同的排序规则。
zh_hant: 要串連的兩個字串擁有不同的定序。

# SqlMisc_CompareDiffCollationMessage
source: Two strings to be compared have different collation.
de: Zwei zu vergleichende Zeichenfolgen haben unterschiedliche Sortierungen.
es: Las dos cadenas que se comparan tienen una intercalación diferente.
fr: Les deux chaînes à comparer ont un classement différent.
it: Due stringhe da confrontare hanno regole di confronto diverse.
ja: 比較する 2 つの文字列の照合順序が異なります。
ko: 비교할 두 문자열의 데이터가 다르게 정렬되어 있습니다.
pt_br: Duas cadeias de caracteres a serem comparadas têm intercalação diferente.
ru: Две сравниваемые строки имеют различный порядок следования.
zh_hans: 要比较的两个字符串具有不同的排序规则。
zh_hant: 要比較的兩個字串擁有不同的定序。

# SqlMisc_InvalidFlagMessage
source: Invalid flag value.
de: Ungültiger Flagwert.
es: Valor de marca no válido.
fr: Valeur d'indicateur non valide.
it: Valore del flag non valido.
ja: フラグ値が無効です。
ko: 플래그 값이 잘못되었습니다.
pt_br: Valor de sinalizador inválido.
ru: Недопустимое значение флага.
zh_hans: 无效的标志值。
zh_hant: 無效的旗標值。

# SqlMisc_NumeToDecOverflowMessage
source: Conversion from SqlDecimal to Decimal overflows.
de: Überläufe bei Konvertierung von SqlDecimal in Decimal.
es: Desbordamiento de la conversión de SqlDecimal a Decimal.
fr: Dépassement lors de la conversion de SqlDecimal en Decimal.
it: Overflow durante la conversione da SqlDecimal a Decimal.
ja: SqlDecimal から Decimal への変換はオーバーフローします。
ko: SqlDecimal에서 Decimal로 변환하는 동안 오버플로가 발생했습니다.
pt_br: Estouro na conversão de SqlDecimal em Decimal.
ru: Переполнение при преобразовании из SqlDecimal в Decimal.
zh_hans: 从 SqlDecimal 到 Decimal 的转换溢出。
zh_hant: 從 SqlDecimal 轉換成 Decimal 溢位。

# SqlMisc_ConversionOverflowMessage
source: Conversion overflows.
de: Konversionsüberläufe.
es: Desbordamiento de conversión.
fr: Dépassement de la conversion.
it: Overflow di conversione.
ja: 変換オーバーフローです。
ko: 변환 오버플로가 발생했습니다.
pt_br: Estouros de conversão.
ru: Переполнение при преобразовании.
zh_hans: 转换溢出。
zh_hant: 轉換溢位。

# SqlMisc_InvalidDateTimeMessage
source: Invalid SqlDateTime.
de: Ungültige 'SqlDateTime'.
es: Estructura de SqlDateTime no válida.
fr: SqlDateTime non valide.
it: SqlDateTime non valido.
ja: SqlDateTime が無効です。
ko: SqlDateTime이 잘못되었습니다.
pt_br: SqlDateTime inválido.
ru: Недопустимая структура SqlDateTime.
zh_hans: 无效的 SqlDateTime。
zh_hant: 無效的 SqlDateTime。

# SqlMisc_TimeZoneSpecifiedMessage
source: A time zone was specified. SqlDateTime does not support time zones.
de: Es wurde eine Zeitzone angegeben. 'SqlDateTime' unterstützt keine Zeitzonen.
es: Se ha especificado una zona horaria. SqlDateTime no admite zonas horarias.
fr: Un fuseau horaire était spécifié. SqlDateTime ne prend pas en charge les fuseaux horaires.
it: È stato specificato un fuso orario. SqlDateTime non supporta i fusi orari.
ja: タイム ゾーンが指定されました。SqlDateTime はタイム ゾーンをサポートしていません。
ko: 표준 시간대를 지정했습니다. SqlDateTime은 표준 시간대를 지원하지 않습니다.
pt_br: Um fuso horário foi especificado. SqlDateTime não oferece suporte a fusos horários.
ru: Указана временная зона. SqlDateTime не поддерживает временных зон.
zh_hans: 已指定了时区。SqlDateTime 不支持时区。
zh_hant: 已經指定時區。SqlDateTime 不支援時區。

# SqlMisc_InvalidArraySizeMessage
source: Invalid array size.
de: Ungültige Arraygröße.
es: Tamaño de matriz no válido.
fr: Taille de tableau non valide.
it: Dimensione matrice non valida.
ja: 配列サイズが無効です。
ko: 배열 크기가 잘못되었습니다.
pt_br: Tamanho de matriz inválido.
ru: Недопустимый размер массива.
zh_hans: 无效的数组大小。
zh_hant: 無效的陣列大小。

# SqlMisc_InvalidPrecScaleMessage
source: Invalid numeric precision/scale.
de: Ungültige numerische Genauigkeit/Skala.
es: Precisión o escala numérica no válida.
fr: Précision numérique/échelle non valide.
it: Scala/precisione numerica non valida.
ja: 数値の総桁数/小数点以下桁数が無効です。
ko: 전체 자릿수/소수 자릿수가 잘못되었습니다.
pt_br: Precisão ou escala numérica inválida.
ru: Недопустимая числовая точность или шкала.
zh_hans: 无效的数值精度/小数位数。
zh_hant: 無效的數字整數位數/小數位數。
