Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataViewApplyDefaultSortDescr
source: Indicates whether to use the default sort if the Sort property is not set.
de: Gibt an, ob die Standardsortierung verwendet wird, wenn die Sort-Eigenschaft nicht festgelegt wurde.
es: Indica si se debe utilizar el orden predeterminado si no está establecida la propiedad Sort.
fr: Indique si l'ordre de tri par défaut doit être utilisé lorsque la propriété Sort n'est pas définie.
it: Indica se utilizzare l'ordinamento predefinito, quando la proprietà Sort non è impostata.
ja: Sort プロパティが設定されていない場合に、既定の並べ替えを使用するかどうかを示します。
ko: Sort 속성이 설정되어 있지 않은 경우 기본 정렬을 사용할지 여부를 나타냅니다.
pt_br: Indica se a classificação padrão deverá ser usada quando a propriedade Sort não estiver definida.
ru: Указывает, должна ли использоваться сортировка по умолчанию, если свойство Sort не задано.
zh_hans: 指示没有设置 Sort 属性时是否使用默认排序。
zh_hant: 指定若未設定 Sort 屬性，是否使用預設的排序。

# DataViewTableDescr
source: Indicates the table this DataView uses to get data.
de: Gibt die Tabelle an, die diese DataView verwendet, um Daten abzurufen.
es: Indica la tabla que DataView utiliza para obtener datos.
fr: Indique la table que ce DataView utilise pour obtenir les données.
it: Indica la tabella da cui questo DataView recupera i dati.
ja: この DataView がデータの取得に使うテーブルを示します。
ko: 이 DataView에서 데이터를 가져오기 위해 사용하는 테이블을 나타냅니다.
pt_br: Indica a tabela usada por este DataView para obter dados.
ru: Указывает таблицу, которую этот DataView использует для извлечения данных.
zh_hans: 指示此 DataView 用来获取数据的表。
zh_hant: 表示這個 DataView 用來取得資料的資料表。

# DataViewListChangedDescr
source: Indicates that the data returned by this DataView has somehow changed.
de: Gibt an, dass die Daten, die von dieser DataView zurückgegeben wurden, geändert wurden.
es: Indica que los datos devueltos por DataView han cambiado de alguna manera.
fr: Indique que les données retournées par ce DataView ont été modifiées.
it: Indica che i dati restituiti da questo DataView hanno subito modifiche.
ja: この DataView によって返されたデータが何らかの理由によって変更されたことを示します。
ko: 이 DataView에서 반환된 데이터가 변경되었음을 나타냅니다.
pt_br: Indica se os dados retornados por este DataView sofreram alguma alteração.
ru: Указывает, что данные, возвращенные этим DataView, каким-либо образом изменились.
zh_hans: 指示此 DataView 返回的数据被以某种方式进行了更改。
zh_hant: 表示由這個 DataView 傳回的資料已經變更。

# DataViewManagerDataSetDescr
source: Indicates the source of data for this DataViewManager.
de: Zeigt die Datenquelle für den DataViewManager an.
es: Indica el origen de datos para este DataViewManager.
fr: Indique la source des données pour ce DataViewManager.
it: Indica l'origine dati del DataViewManager.
ja: この DataViewManager のデータのソースを示します。
ko: 이 DataViewManager의 데이터 원본을 나타냅니다.
pt_br: Indica a fonte de dados deste DataViewManager.
ru: Указывает источник данных для этого DataViewManager.
zh_hans: 指示此 DataViewManager 的数据源。
zh_hant: 表示這個 DataViewManager 的資料來源。

# DataViewManagerTableSettingsDescr
source: Indicates the sorting/filtering/state settings for any table in the corresponding DataSet.
de: Gibt die Sortier-/Filter-/Statuseinstellungen für jede Tabelle im entsprechenden DataSet an.
es: Indica la configuración de orden, filtro y estado para cualquier tabla en el DataSet correspondiente.
fr: Indique les paramètres de tri/filtre/état pour une table dans le DataSet correspondant.
it: Indica le impostazioni di ordinamento/filtro/stato per le tabelle del DataSet corrispondente.
ja: 対応する DataSet のテーブルに対する並べ替え/フィルター/状態の設定を示します。
ko: 해당하는 DataSet의 테이블에 대한 정렬/필터링/상태 설정을 나타냅니다.
pt_br: Indica as configurações de classificação/filtro/estado de qualquer tabela do DataSet correspondente.
ru: Указывает параметры сортировки, фильтрации и состояния для любой таблицы в соответствующем DataSet.
zh_hans: 指示相应 DataSet 中任意表的排序/筛选/状态设置。
zh_hant: 表示在對應 DataSet 中任何資料表的排序/篩選/狀態設定。

# Xml_SimpleTypeNotSupported
source: DataSet doesn't support 'union' or 'list' as simpleType.
de: DataSet unterstützt 'union' oder 'list' nicht als simpleType.
es: DataSet no admite valores 'union' o 'list' como simpleType.
fr: DataSet ne prend pas en charge 'union' ou 'list' en tant que simpleType.
it: Il DataSet non supporta 'union' e 'list' come simpleType.
ja: DataSet は、'union' または 'list' を simpleType としてサポートしません。
ko: DataSet은 simpleType으로 'union' 또는 'list'를 지원하지 않습니다.
pt_br: DataSet não dá suporte para 'union' ou 'list' como simpleType.
ru: DataSet не поддерживает union и list в качестве simpleType.
zh_hans: DataSet 不支持“union”或“list”作为 simpleType。
zh_hant: DataSet 並不支援 'union' 或 'list' 當作 simpleType 來使用。

# Xml_MissingAttribute
source: Invalid {0} syntax: missing required '{1}' attribute.
de: Ungültige {0} Syntax: Fehlendes erforderliches '{1}'-Attribut.
es: Sintaxis {0} no válida: falta el atributo '{1}' necesario.
fr: Syntaxe {0} non valide : attribut requis '{1}' manquant.
it: Sintassi {0} non valida: attributo richiesto '{1}' mancante.
ja: 無効な {0} 構文 : 必要な '{1}' 属性がありません。
ko: 잘못된 {0} 구문: 필요한 '{1}' 특성이 없습니다.
pt_br: Sintaxe {0} inválida: falta o atributo necessário '{1}'.
ru: Недопустимый синтаксис {0}: отсутствует обязательный атрибут "{1}".
zh_hans: 无效的 {0} 语法: 缺少必需的“{1}”特性。
zh_hant: 無效的 {0} 語法: 遺漏必要的 '{1}' 屬性。

# Xml_ValueOutOfRange
source: Value '{1}' is invalid for attribute '{0}'.
de: Der Wert '{1}' ist für das Attribut '{0}' ungültig.
es: El valor '{1}' no es válido para el atributo '{0}'.
fr: La valeur '{1}' n'est pas valide pour l'attribut '{0}'.
it: Valore '{1}' non valido per l'attributo '{0}'.
ja: 属性 '{0}' の値 '{1}' が無効です。
ko: '{1}' 값은 '{0}' 특성에 사용할 수 없습니다.
pt_br: Valor '{1}' é inválido para atributo '{0}'.
ru: Значение "{1}" является недопустимым для атрибута "{0}".
zh_hans: 值“{1}”对于特性“{0}”无效。
zh_hant: 屬性 '{0}' 的值 '{1}' 無效。

# Xml_AttributeValues
source: The value of attribute '{0}' should be '{1}' or '{2}'.
de: Der Wert des Attributs '{0}' sollte '{1}' oder '{2}' sein.
es: El valor del atributo '{0}' debería ser '{1}' o '{2}'.
fr: La valeur de l'attribut '{0}' doit être '{1}' ou '{2}'.
it: Il valore dell'attributo '{0}' deve essere '{1}' o '{2}'.
ja: 属性 '{0}' の値は '{1}' か '{2}' でなければなりません。
ko: '{0}' 특성의 값은 '{1}' 또는 '{2}'(으)로 설정해야 합니다.
pt_br: Valor do atributo '{0}' deve ser '{1}' ou '{2}'.
ru: Значение атрибута "{0}" должно быть равно "{1}" или "{2}".
zh_hans: 特性“{0}”的值应为“{1}”或“{2}”。
zh_hant: 屬性 '{0}' 的值必須是 '{1}' 或 '{2}'。

# Xml_ElementTypeNotFound
source: Cannot find ElementType name='{0}'.
de: ElementType-name='{0}' wurde nicht gefunden.
es: No se puede encontrar el ElementType name='{0}'.
fr: Impossible de trouver ElementType name='{0}'.
it: Impossibile trovare ElementType name='{0}'.
ja: ElementType name='{0}' が見つかりません。
ko: ElementType name='{0}'을(를) 찾을 수 없습니다.
pt_br: Não é possível encontrar ElementType name='{0}'.
ru: Не удается найти имя ElementType name="{0}".
zh_hans: 找不到 ElementType name='{0}'。
zh_hant: 找不到 ElementType name='{0}'。

# Xml_RelationParentNameMissing
source: Parent table name is missing in relation '{0}'.
de: Der übergeordnete Tabellenname ist nicht in der Beziehung '{0}' vorhanden.
es: Falta el nombre de la tabla primaria en la relación '{0}'.
fr: Le nom de la table parente est absent de la relation '{0}'.
it: Nome tabella padre mancante nella relazione '{0}'.
ja: リレーションシップ '{0}' に親テーブル名が見つかりません。
ko: '{0}' 관계에 부모 테이블 이름이 없습니다.
pt_br: Nome da tabela pai ausente na relação '{0}'.
ru: В отношении "{0}" отсутствует имя родительской таблицы.
zh_hans: 在关系“{0}”中缺少父表名称。
zh_hant: 關聯 '{0}' 中遺漏父資料表名稱。

# Xml_RelationChildNameMissing
source: Child table name is missing in relation '{0}'.
de: Der untergeordnete Tabellenname ist nicht in der Beziehung '{0}' vorhanden.
es: Falta el nombre de la tabla secundaria en la relación '{0}'.
fr: Le nom de la table enfant est absent de la relation '{0}'.
it: Nome tabella figlio mancante nella relazione '{0}'.
ja: リレーションシップ '{0}' に子テーブル名が見つかりません。
ko: '{0}' 관계에 자식 테이블 이름이 없습니다.
pt_br: Nome da tabela filho ausente na relação '{0}'.
ru: В отношении "{0}" отсутствует имя дочерней таблицы.
zh_hans: 在关系“{0}”中缺少子表名称。
zh_hant: 關聯 '{0}' 中遺漏子資料表名稱。

# Xml_RelationTableKeyMissing
source: Parent table key is missing in relation '{0}'.
de: Der übergeordnete Tabellenschlüssel ist nicht in der Beziehung '{0}' vorhanden.
es: Falta la clave de la tabla primaria en la relación '{0}'.
fr: La clé de la table parente est absente de la relation '{0}'.
it: Chiave tabella padre mancante nella relazione '{0}'.
ja: リレーションシップ '{0}' に親テーブル キーが見つかりません。
ko: '{0}' 관계에 부모 테이블 키가 없습니다.
pt_br: Chave da tabela pai ausente na relação '{0}'.
ru: В отношении "{0}" отсутствует ключ родительской таблицы.
zh_hans: 在关系“{0}”中缺少父表键。
zh_hant: 關聯 '{0}' 中遺漏父資料表索引鍵。

# Xml_RelationChildKeyMissing
source: Child table key is missing in relation '{0}'.
de: Der untergeordnete Tabellenschlüssel ist nicht in der Beziehung '{0}' vorhanden.
es: Falta la clave de la tabla secundaria en la relación '{0}'.
fr: La clé de la table enfant est absente de la relation '{0}'.
it: Chiave tabella figlio mancante nella relazione '{0}'.
ja: リレーションシップ '{0}' に子テーブル キーが見つかりません。
ko: '{0}' 관계에 자식 테이블 키가 없습니다.
pt_br: Chave de tabela filho ausente na relação '{0}'.
ru: В отношении "{0}" отсутствует ключ дочерней таблицы.
zh_hans: 在关系“{0}”中缺少子表键。
zh_hant: 關聯 '{0}' 中遺漏子資料表索引鍵。

# Xml_UndefinedDatatype
source: Undefined data type: '{0}'.
de: Undefinierter Datentyp: '{0}'.
es: Tipo de datos sin definir: '{0}'.
fr: Type de données non défini : '{0}'.
it: Tipo di dati non definito: '{0}'.
ja: 未定義のデータ型 : '{0}' です。
ko: 정의되지 않은 데이터 형식입니다. '{0}'
pt_br: Tipo de dados não definido: '{0}'.
ru: Не определенный тип данных: "{0}".
zh_hans: 未定义的数据类型:“{0}”。
zh_hant: 未定義的資料型別: '{0}'。

# Xml_DatatypeNotDefined
source: Data type not defined.
de: Datentyp wurde nicht definiert.
es: Tipo de datos sin definir.
fr: Type de données non défini.
it: Tipo di dati non definito.
ja: データ型が定義されていません。
ko: 데이터 형식이 정의되지 않았습니다.
pt_br: Tipo de dados não definido.
ru: Тип данных не определен.
zh_hans: 未定义数据类型。
zh_hant: 未定義的資料型別。

# Xml_InvalidField
source: Invalid XPath selection inside field node. Cannot find: {0}.
de: Ungültige XPath-Auswahl im Feldknoten. {0} kann nicht gefunden werden.
es: Selección XPath no válida dentro del nodo de campo. No se puede encontrar: {0}.
fr: Sélection XPath non valide dans le noeud de champ. Impossible de trouver : {0}.
it: Selezione XPath non valida all'interno del nodo campo. Impossibile trovare {0}.
ja: フィールド ノード内部の XPath 選択が無効です。{0} が見つかりません。
ko: 필드 노드 내의 XPath 선택이 잘못되었습니다. {0}을(를) 찾을 수 없습니다.
pt_br: Seleção XPath inválida dentro do nó do campo. Não é possível encontrar: {0}.
ru: Недопустимый выбор XPath в узле поля. Не удается найти: {0}.
zh_hans: 字段节点内的 XPath 选择无效。未找到: {0}。
zh_hant: 欄位節點內 XPath 選取無效。找不到: {0}。

# Xml_InvalidSelector
source: Invalid XPath selection inside selector node: {0}.
de: Ungültige XPath-Auswahl in einem Auswahlknoten: {0}.
es: La selección de XPath en un nodo de selector {0} no es válida.
fr: Sélection XPath non valide à l'intérieur du noeud selector : {0}.
it: Selezione XPath non valida all'interno del nodo selettore: {0}.
ja: セレクター ノード内で XPath の選択が無効です : {0}.
ko: 선택기 노드 내부에 잘못된 XPath 선택이 있습니다. {0}.
pt_br: Seleção XPath inválida dentro do nó do seletor: {0}.
ru: Недопустимый выбор XPath в узле селектора. {0}.
zh_hans: 选择器节点中的 XPath 选择无效: {0}。
zh_hant: 選取器節點內 XPath 選取無效: {0}。

# Xml_InvalidKey
source: Invalid 'Key' node inside constraint named: {0}.
de: Ungültiger 'Key'-Knoten innerhalb der Einschränkung: {0}.
es: Nodo 'Key' no válido dentro de la restricción denominada: {0}.
fr: Noeud 'Key' non valide dans la contrainte nommée : {0}.
it: Nodo 'Key' non valido all'interno del vincolo denominato {0}.
ja: {0} という制約内に無効な 'Key' ノードがあります。
ko: 이름이 {0}인 제약 조건 내의 'Key' 노드가 잘못되었습니다.
pt_br: Nó 'Key' inválido dentro da restrição chamada: {0}.
ru: Недопустимый узел Key в ограничении с именем: {0}.
zh_hans: 名为 {0} 的约束中的“Key”节点无效。
zh_hant: 名稱為 {0} 條件約束內部的無效 'Key' 節點。

# Xml_DuplicateConstraint
source: The constraint name {0} is already used in the schema.
de: Der Einschränkungsname {0} wird bereits im Schema verwendet.
es: Ya está en uso el nombre de la restricción {0} en el esquema.
fr: Le nom de la contrainte {0} est déjà utilisé dans le schéma.
it: Nome di vincolo {0} già utilizzato nello schema.
ja: 制約名 {0} は既にスキーマで使われています。
ko: 제약 조건 이름 {0}이(가) 스키마에서 이미 사용 중입니다.
pt_br: O nome de restrição {0} já está em uso no esquema.
ru: Имя ограничения {0} уже используется в данной схеме.
zh_hans: 约束名称 {0} 已用于架构中。
zh_hant: 結構描述中已經使用條件約束名稱 {0}。

# Xml_CannotConvert
source: Cannot convert '{0}' to type '{1}'.
de: '{0}' kann nicht in Typ {1} umgewandelt werden.
es: No se puede convertir '{0}' en el tipo '{1}'.
fr: Impossible de convertir '{0}' en type '{1}'.
it: Impossibile convertire "{0}" nel tipo "{1}".
ja: '{0}' から '{1}' に変換できません。
ko: '{0}'을(를) 유형 '{1}'(으)로 변환할 수 없습니다.
pt_br: Não é possível converter '{0}' no tipo '{1}'.
ru: Невозможно привести "{0}" к типу "{1}".
zh_hans: 无法将“{0}”转换为类型“{1}”。
zh_hant: 無法將 '{0} 轉換成型別 '{1}'。

# Xml_MissingRefer
source: Missing '{0}' part in '{1}' constraint named '{2}'.
de: Fehlender '{0}'-Teil in '{1}'der Einschränkung '{2}'.
es: Falta la parte '{0}' en la restricción '{1}' denominada '{2}'.
fr: Partie '{0}' manquante dans la contrainte '{1}' nommée '{2}'.
it: Parte "{0}" mancante nel vincolo "{1}" denominato "{2}".
ja: '{2}' という '{1}' 制約に '{0}' の部分が見つかりません。
ko: '{2}'(이)라는 '{1}' 제약 조건에 '{0}' 부분이 없습니다.
pt_br: Falta a parte '{0}' na restrição '{1}' denominada '{2}'.
ru: Отсутствует часть "{0}" в составе ограничения "{1}" под названием "{2}".
zh_hans: 在名为“{2}”的“{1}”约束中缺少“{0}”部分。
zh_hant: 在名稱為 '{2}' 的 '{1}' 條件約束中遺漏 '{0}' 部分。

# Xml_MismatchKeyLength
source: Invalid Relation definition: different length keys.
de: Ungültige Relationsdefinition: Unterschiedliche Schlüssellängen.
es: Definición de Relation no válida: claves con longitudes diferentes.
fr: Définition de Relation non valide : clés de longueur différente.
it: Definizione di Relation non valida: chiavi di lunghezza diversa.
ja: 無効な Relation 定義 : キーの長さが異なります。
ko: 잘못된 Relation 정의: 키 길이가 다릅니다.
pt_br: Definição de Relation inválida: chaves de comprimento diferentes.
ru: Недопустимое определение отношения Relation: ключи разной длины.
zh_hans: 无效的 Relation 定义: 不同长度的键。
zh_hant: 無效的 Relation 定義: 不同的長度索引鍵。

# Xml_CircularComplexType
source: DataSet doesn't allow the circular reference in the ComplexType named '{0}'.
de: DataSet läßt den Zirkelverweis im ComplexType '{0}' nicht zu.
es: DataSet no permite una referencia circular en el elemento ComplexType denominado '{0}'.
fr: DataSet n'autorise pas la référence circulaire dans le ComplexType nommé '{0}'.
it: Il DataSet non consente il riferimento circolare nel ComplexType denominato '{0}'.
ja: DataSet doesn't は、'{0} という名の ComplexType で循環参照を許可しません。
ko: DataSet에서는 이름이 '{0}'인 ComplexType의 순환 참조를 허용하지 않습니다 .
pt_br: DataSet não permite referência circular no ComplexType chamado '{0}'.
ru: DataSet не допускает циклических ссылок в ComplexType с именем "{0}".
zh_hans: DataSet 不允许在名为“{0}”的 ComplexType 中使用循环引用。
zh_hant: DataSet 不允許名為 '{0}' 的 ComplexType 中有循環參考。

# Xml_CannotInstantiateAbstract
source: DataSet cannot instantiate an abstract ComplexType for the node {0}.
de: DataSet kann keinen abstrakten ComplexType für den Knoten {0} instanziieren.
es: DataSet no puede crear una instancia de un ComplexType abstracto para el nodo {0}.
fr: DataSet ne peut pas instancier un ComplexType abstrait pour le noeud {0}.
it: DataSet non è in grado di creare un'istanza di ComplexType astratto per il nodo {0}.
ja: DataSet がノード {0} の抽象 ComplexType をインスタンス化できません。
ko: DataSet은 노드 {0}에 대해 추상 ComplexType을 인스턴스화할 수 없습니다.
pt_br: DataSet não pode criar uma instância de um ComplexType abstrato para o nó {0}.
ru: DataSet не удается создать экземпляр абстрактного ComplexType для узла {0}.
zh_hans: DataSet 无法为节点 {0} 实例化抽象 ComplexType。
zh_hant: DataSet 無法具現化抽象的節點 {0} 的 ComplexType。

# Xml_MultipleTargetConverterError
source: An error occurred with the multiple target converter while writing an Xml Schema. See the inner exception for details.
de: Beim Schreiben eines Xml-Schemas hat der Konverter für mehrere Ziele einen Fehler ausgelöst. Weitere Informationen finden Sie in der inneren Ausnahme.
es: Error del convertidor de varios destinos al escribir un Schema Xml. Vea la excepción interna para obtener detalles.
fr: Une erreur s'est produite au niveau du convertisseur multi-cibles lors de l'écriture d'un Schema Xml. Pour plus de détails, reportez-vous à l'exception interne.
it: Errore del convertitore di più destinazioni durante la scrittura di un Xml Schema. Per dettagli, vedere l'eccezione interna.
ja: Xml Schema の書き込み中に複数のターゲット コンバーターでエラーが発生しました。詳細については、内部例外を参照してください。
ko: Xml Schema를 작성하는 동안 여러 대상 변환기에서 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하십시오.
pt_br: Erro com o conversor de vários destinos ao gravar um Xml Schema. Consulte a exceção interna para obter detalhes.
ru: Произошла ошибка в преобразователе нескольких целей во время записи Xml Schema. Подробные сведения см. во внутреннем исключении.
zh_hans: 多目标转换器在编写 Xml Schema 时出错。有关详细信息，请参见内部异常。
zh_hant: 寫入 Xml Schema 時，多目標轉換器發生錯誤。詳細資訊請參閱內部例外狀況。

# Xml_MultipleTargetConverterEmpty
source: An error occurred with the multiple target converter while writing an Xml Schema. A null or empty string was returned.
de: Beim Schreiben eines Xml-Schemas hat der Konverter für mehrere Ziele einen Fehler ausgelöst. Es wurde eine null- oder eine leere Zeichenfolge zurückgegeben.
es: Error del convertidor de varios destinos al escribir un Schema Xml. Se devolvió null o una cadena vacía.
fr: Une erreur s'est produite au niveau du convertisseur multi-cibles lors de l'écriture d'un Schema Xml. Une chaîne null ou vide a été renvoyée.
it: Errore del convertitore di più destinazioni durante la scrittura di un Xml Schema. È stata restituita una stringa null o vuota.
ja: Xml Schema の書き込み中に複数のターゲット コンバーターでエラーが発生しました。null または空文字列が返されました。
ko: Xml Schema를 작성하는 동안 여러 대상 변환기에서 오류가 발생했습니다. null 또는 빈 문자열이 반환되었습니다.
pt_br: Erro com o conversor de vários destinos ao gravar um Xml Schema. Uma cadeia de caracteres null ou vazia foi retornada.
ru: Произошла ошибка в преобразователе нескольких целей во время записи Xml Schema. Возвращено значение null или пустая строка.
zh_hans: 多目标转换器在编写 Xml Schema 时出错。返回了 null 或空字符串。
zh_hant: 寫入 Xml Schema 時，多目標轉換器發生錯誤。傳回的字串是 null 或空的。

# Xml_MergeDuplicateDeclaration
source: Duplicated declaration '{0}'.
de: Doppelte Deklaration '{0}'.
es: Declaración duplicada '{0}'.
fr: Déclaration '{0}' dupliquée.
it: Dichiarazione '{0}' duplicata.
ja: 宣言 '{0}' が重複しています。
ko: '{0}' 선언이 중복되었습니다.
pt_br: Declaração duplicada '{0}'.
ru: Повторяющееся объявление "{0}".
zh_hans: 重复的声明“{0}”。
zh_hant: 重複的宣告 '{0}'。

# Xml_MissingTable
source: Cannot load diffGram. Table '{0}' is missing in the destination dataset.
de: diffGram kann nicht geladen werden. In der Tabelle '{0}' fehlt das Ziel-Dataset.
es: No se puede cargar diffGram. Falta la tabla '{0}' en el DataSet de destino.
fr: Impossible de charger diffGram. La table '{0}' est absente du groupe de données de destination.
it: Impossibile caricare diffGram. Tabella "{0}" mancante nel DataSet di destinazione.
ja: diffGram を読み込めません。テーブル '{0}' がターゲット データセットに見つかりません。
ko: diffGram을 로드할 수 없습니다. 대상 데이터 집합에 테이블 '{0}'이(가) 없습니다.
pt_br: Não é possível carregar diffGram. Tabela '{0}' inexistente no DataSet de destino.
ru: Невозможно загрузить diffGram. В результирующем наборе данных отсутствует таблица "{0}".
zh_hans: 无法加载 diffGram。目标 DataSet 中缺少表“{0}”。
zh_hant: 無法載入 diffGram。目的資料集中遺漏資料表 '{0}'。

# Xml_MissingSQL
source: Cannot load diffGram. The 'sql' node is missing.
de: diffGram kann nicht geladen werden. Der 'sql'-Knoten fehlt.
es: No se puede cargar diffGram. Falta el nodo 'sql'.
fr: Impossible de charger diffGram. Le noeud 'sql' est absent.
it: Impossibile caricare diffGram. Nodo 'sql' mancante.
ja: diffGram を読み込めません。'sql' ノードが見つかりません。
ko: diffGram을 로드할 수 없습니다. 'sql' 노드가 없습니다.
pt_br: Não é possível carregar diffGram. Falta o nó 'sql'.
ru: Невозможно загрузить diffGram. Отсутствует узел sql.
zh_hans: 无法加载 diffGram。缺少“sql”节点。
zh_hant: 無法載入 diffGram。遺漏 'sql' 節點。

# Xml_ColumnConflict
source: Column name '{0}' is defined for different mapping types.
de: Der Spaltenname '{0}' ist für verschiedene Zuordnungstypen definiert.
es: El nombre de la columna '{0}' está definido para diferentes tipos de asignación.
fr: Le nom de la colonne '{0}' est défini pour différents types de mappages.
it: Nome di colonna '{0}' definito per diversi tipi di mapping.
ja: 列名 '{0}' は別のマップの種類に対して定義されています。
ko: 열 이름 '{0}'이(가) 여러 매핑 형식에 대해 정의되어 있습니다.
pt_br: Nome de coluna '{0}' foi definido para diferentes tipos de mapeamento.
ru: Имя столбца "{0}" определено для различных типов сопоставления.
zh_hans: 列名“{0}”是为不同的映射类型定义的。
zh_hant: 資料行名稱 '{0}' 已經定義為不同的對應型別。

# Xml_InvalidPrefix
source: Prefix '{0}' is not valid, because it contains special characters.
de: Das Präfix '{0}' ist ungültig, da es Sonderzeichen enthält.
es: El prefijo '{0}' no es válido porque contiene caracteres especiales.
fr: Le préfixe '{0}' n'est pas valide, car il contient des caractères spéciaux.
it: Prefisso '{0}' non valido perché contiene caratteri speciali.
ja: プレフィックス '{0}' は有効ではありません。特殊な文字が含まれています。
ko: 접두사 '{0}'은(는) 유효하지 않습니다. 접두사에 특수 문자가 들어 있기 때문입니다.
pt_br: Prefixo '{0}' não é válido porque contém caracteres especiais.
ru: Префикс "{0}" является недопустимым, т.к. содержит специальные знаки.
zh_hans: 前缀“{0}”包含特殊字符，因此是无效的。
zh_hant: 前置字元 '{0}' 無效，因為其中含有特殊字元。

# Xml_NestedCircular
source: Circular reference in self-nested table '{0}'.
de: Zirkulärer Verweis in der selbstgeschachtelten Tabelle '{0}'.
es: Referencia circular en la tabla '{0}' anidada en sí misma.
fr: Référence circulaire dans une table à imbrication automatique '{0}'.
it: Riferimento circolare nella tabella autoannidata '{0}'.
ja: それ自体が入れ子になっているテーブル '{0}' の循環参照です。
ko: 자기 중첩 테이블 '{0}'의 순환 참조입니다.
pt_br: Referência circular em tabela aninhada em si mesma '{0}'.
ru: Циклическая ссылка во вложенной в себя таблице "{0}".
zh_hans: 自我嵌套表“{0}”中的循环引用。
zh_hant: 自我巢狀資料表 '{0}' 中的循環參考。

# Xml_FoundEntity
source: DataSet cannot expand entities. Use XmlValidatingReader and set the EntityHandling property accordingly.
de: Der DataSet kann die Einheiten nicht erweitern. Verwenden Sie XmlValidatingReader und legen Sie die EntityHandling-Eigenschaft entsprechend fest.
es: DataSet no puede expandir entidades. Utilice XmlValidatingReader y establezca la propiedad EntityHandling en consecuencia.
fr: DataSet ne peut pas développer d'entités. Utilisez XmlValidatingReader et définissez la propriété EntityHandling en conséquence.
it: Il DataSet non può espandere entità. Utilizzare XmlValidatingReader e impostare la proprietà EntityHandling in modo appropriato.
ja: DataSet は本体を展開できません。XmlValidatingReader を使用して、EntityHandling プロパティを適切に設定してください。
ko: DataSet의 엔터티를 확장할 수 없습니다. XmlValidatingReader를 사용하여 EntityHandling 속성을 적절하게 설정하십시오.
pt_br: DataSet não pode expandir entidades. Use XmlValidatingReader e defina a propriedade EntityHandling da mesma maneira.
ru: DataSet не может расширять объекты подстановки. Используйте XmlValidatingReader и задайте соответствующее значения свойства EntityHandling.
zh_hans: DataSet 无法扩展实体。使用 XmlValidatingReader 并相应地设置 EntityHandling 属性。
zh_hant: DataSet 無法展開實體。請使用 XmlValidatingReader 並適當地設定 EntityHandling 屬性。
