Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataRow_EndEditInRowChanging
source: Cannot call EndEdit() inside an OnRowChanging event.
de: EndEdit() kann nicht innerhalb eines OnRowChanging-Ereignisses aufgerufen werden.
es: No se puede llamar a EndEdit() dentro de un evento OnRowChanging.
fr: Impossible d'appeler EndEdit() dans un événement OnRowChanging.
it: Impossibile chiamare EndEdit() dall'interno di un evento OnRowChanging.
ja: OnRowChanging イベント内部で EndEdit() を呼び出すことはできません。
ko: OnRowChanging 이벤트 내에서 EndEdit()을 호출할 수 없습니다.
pt_br: Não é possível chamar EndEdit() dentro de um evento OnRowChanging.
ru: Невозможно вызвать EndEdit() внутри события OnRowChanging.
zh_hans: 不能在 OnRowChanging 事件内部调用 EndEdit()。
zh_hant: 無法在 OnRowChanging 事件內部呼叫 EndEdit。

# DataRow_BeginEditInRowChanging
source: Cannot call BeginEdit() inside the RowChanging event.
de: BeginEdit() kann nicht innerhalb des RowChanging-Ereignisses aufgerufen werden.
es: No se puede llamar a BeginEdit() dentro del evento RowChanging.
fr: Impossible d'appeler BeginEdit() dans l'événement RowChanging.
it: Impossibile chiamare BeginEdit() dall'interno dell'evento RowChanging.
ja: RowChanging イベント内部で BeginEdit() を呼び出すことはできません。
ko: RowChanging 이벤트 내에서 BeginEdit()을 호출할 수 없습니다.
pt_br: Não é possível chamar BeginEdit() dentro do evento RowChanging.
ru: Невозможно вызвать BeginEdit() внутри события RowChanging.
zh_hans: 不能在 RowChanging 事件内部调用 BeginEdit()。
zh_hant: 無法在 RowChanging 事件內呼叫 BeginEdit()。

# DataRow_CancelEditInRowChanging
source: Cannot call CancelEdit() inside an OnRowChanging event. Throw an exception to cancel this update.
de: CancelEdit() kann nicht innerhalb eines OnRowChanging-Ereignisses aufgerufen werden. Verwenden Sie eine exception, um das Update abzubrechen.
es: No se puede llamar a CancelEdit() dentro de un evento OnRowChanging. Inicie una exception para cancelar la actualización.
fr: Impossible d'appeler CancelEdit() dans un événement OnRowChanging. Levez une exception pour annuler cette mise à jour.
it: Impossibile chiamare CancelEdit() dall'interno di un evento OnRowChanging. Generare exception per annullare questo aggiornamento.
ja: OnRowChanging イベント内部で CancelEdit() を呼び出すことはできません。この更新をキャンセルするには exception をスローしてください。
ko: OnRowChanging 이벤트 내에서 CancelEdit()을 호출할 수 없습니다. exception을 Throw하여 이 업데이트를 취소하십시오.
pt_br: Não é possível chamar CancelEdit() dentro de um evento OnRowChanging. Gere uma exception para cancelar esta atualização.
ru: Невозможно вызвать CancelEdit() внутри события OnRowChanging. Для отмены этого обновления создайте исключение exception.
zh_hans: 不能在 OnRowChanging 事件内部调用 CancelEdit()。引发 exception 以取消此更新。
zh_hant: 無法在 OnRowChanging 事件內部呼叫 CancelEdit()。擲回 exception 以取消這個更新。

# DataRow_DeleteInRowDeleting
source: Cannot call Delete inside an OnRowDeleting event. Throw an exception to cancel this delete.
de: Delete kann nicht innerhalb eines OnRowDeleting-Ereignisses aufgerufen werden. Verwenden Sie eine exception, um diesen Löschvorgang abzubrechen.
es: No se puede llamar a Delete dentro de un evento OnRowDeleting. Inicie una exception para cancelar la función de eliminar.
fr: Impossible d'appeler Delete dans un événement OnRowDeleting. Levez une exception pour annuler cette suppression.
it: Impossibile chiamare Delete dall'interno di un evento OnRowDeleting. Generare exception per annullare questa eliminazione.
ja: OnRowDeleting イベント内部で Delete を呼び出せません。この Delete をキャンセルするには、exception をスローしてください。
ko: OnRowDeleting 이벤트 내에서 Delete를 호출할 수 없습니다. exception을 Throw하여 삭제를 취소하십시오.
pt_br: Não é possível chamar Delete dentro de um evento OnRowDeleting. Gere uma exception para cancelar a exclusão.
ru: Невозможно вызвать Delete внутри события OnRowDeleting. Для отмены этого удаления создайте исключение exception.
zh_hans: 不能在 OnRowDeleting 事件内部调用 Delete。引发 exception 以取消此删除。
zh_hant: 無法在 OnRowDeleting 事件內部呼叫 Delete。擲回 exception 以取消這個刪除。

# DataRow_ValuesArrayLength
source: Input array is longer than the number of columns in this table.
de: Der Eingabearray ist länger als die Anzahl der Spalten in dieser Tabelle.
es: La matriz de entrada es más larga que el número de columnas en esta tabla.
fr: Le tableau en entrée est plus long que le nombre de colonnes de cette table.
it: La matrice di input è più lunga del numero di colonne di questa tabella.
ja: 入力アレイの長さがこのテーブルの列数を超えています。
ko: 입력 배열이 이 테이블의 열 개수보다 깁니다.
pt_br: A matriz de entrada é maior do que o número de colunas desta tabela.
ru: Длина входного массива больше числа столбцов в этой таблице.
zh_hans: 输入阵列的长度超过了此表中的列数。
zh_hant: 輸入陣列的長度大於這個資料表中的資料行數目。

# DataRow_NoCurrentData
source: There is no Current data to access.
de: Es sind keine aktuellen Daten vorhanden, auf die zugegriffen werden kann.
es: No hay datos actuales a los que se pueda obtener acceso.
fr: Il n'y a pas de données Current auxquelles accéder.
it: Nessun dato corrente a cui accedere.
ja: アクセスする Current データがありません。
ko: 액세스할 Current 데이터가 없습니다.
pt_br: Não existem dados atuais a serem acessados.
ru: Отсутствуют данные Current для доступа.
zh_hans: 没有要访问的 Current 数据。
zh_hant: 沒有可存取的 Current 資料。

# DataRow_NoOriginalData
source: There is no Original data to access.
de: Es sind keine Originaldaten vorhanden, auf die zugegriffen werden kann.
es: No hay datos originales a los que se pueda obtener acceso.
fr: Il n'y a pas de données Original auxquelles accéder.
it: Nessun dato originale a cui accedere.
ja: アクセスする Original データがありません。
ko: 액세스할 Original 데이터가 없습니다.
pt_br: Não existem dados originais a serem acessados.
ru: Отсутствуют данные Original для доступа.
zh_hans: 没有要访问的 Original 数据。
zh_hant: 沒有可存取的 Original 資料。

# DataRow_NoProposedData
source: There is no Proposed data to access.
de: Es sind keine vorgeschlagenen Daten vorhanden, auf die zugegriffen werden kann.
es: No hay datos propuestos a los que se pueda obtener acceso.
fr: Il n'y a pas de données Proposed auxquelles accéder.
it: Nessun dato proposto a cui accedere.
ja: アクセスする Proposed データがありません。
ko: 액세스할 Proposed 데이터가 없습니다.
pt_br: Não existem dados propostos a serem acessados.
ru: Отсутствуют данные Proposed для доступа.
zh_hans: 没有要访问的 Proposed 数据。
zh_hant: 沒有可存取的 Proposed 資料。

# DataRow_RemovedFromTheTable
source: This row has been removed from a table and does not have any data. BeginEdit() will allow creation of new data in this row.
de: Diese Zeile wurde aus einer Tabelle entfernt und enthält keine Daten. BeginEdit() ermöglicht das Erstellen von neuen Daten in dieser Zeile.
es: Esta fila ha sido eliminada de la tabla y no contiene ningún dato. BeginEdit() permite la creación de nuevos datos en esta fila.
fr: Cette ligne a été supprimée d'une table et ne contient pas de données. BeginEdit() permettra la création de nouvelles données dans cette ligne.
it: Questa riga è stata rimossa da una tabella e non contiene alcun dato. BeginEdit() consentirà di inserirvi nuovi dati.
ja: この行はテーブルから削除されており、データは含まれていません。BeginEdit() を使うとこの行に新しいデータを作成することができます。
ko: 이 행은 테이블에서 제거되었으며 어떤 데이터도 포함하고 있지 않습니다. BeginEdit()을 사용하여 이 행에 새 데이터를 만들 수 있습니다.
pt_br: Esta linha foi removida de uma tabela e não possui dados. BeginEdit() permitirá a criação de dados novos nesta linha.
ru: Эта строка удалена из таблицы и не содержит данных. BeginEdit() позволит создать в этой строке новые данные.
zh_hans: 此行已从表中移除并且没有任何数据。BeginEdit() 将允许在此行中创建新数据
zh_hant: 這個資料列已經從資料表中移除，而且沒有任何資料。BeginEdit() 將允許在這個資料列中建立新資料。

# DataRow_DeletedRowInaccessible
source: Deleted row information cannot be accessed through the row.
de: Auf gelöschte Zeileninformationen kann nicht über die Zeile zugegriffen werden.
es: No se puede obtener acceso a la información eliminada de una fila.
fr: Impossible d'accéder via la ligne aux informations de ligne supprimées.
it: Impossibile accedere alle informazioni sulla riga eliminata tramite la riga.
ja: 削除された行を通して、その行の情報にアクセスすることはできません。
ko: 해당 행을 통해 삭제된 행 정보에 액세스할 수 없습니다.
pt_br: Informações sobre a linha excluída não podem ser acessadas através da linha.
ru: Невозможно получить доступ к удаленной информации строки через данную строку.
zh_hans: 不能通过已删除的行访问该行的信息。
zh_hant: 無法經由資料列存取已刪除的資料列資訊。

# DataRow_InvalidVersion
source: Version must be Original, Current, or Proposed.
de: Die Version muss Original, Aktuell oder Vorgeschlagen sein.
es: La versión debe ser original, actual o propuesta.
fr: La version doit être Original, Current, ou Proposed.
it: Version deve essere Original, Current o Proposed.
ja: バージョンは、Original、Current、または Proposed でなければなりません。
ko: 버전은 Original, Current 또는 Proposed여야 합니다.
pt_br: A versão deve ser original, atual ou proposta.
ru: Версия должна иметь значение Original, Current или Proposed.
zh_hans: 版本必须是“Original”、“Current”或“Proposed”。
zh_hant: 版本必須是 Original、Current 或 Proposed。

# DataRow_OutOfRange
source: There is no row at position {0}.
de: An der Position {0} befindet sich keine Zeile.
es: No hay ninguna fila en la posición {0}.
fr: Aucune ligne à la position {0}.
it: Nessuna riga alla posizione {0}.
ja: 位置 {0} に行がありません。
ko: 위치 {0}에 행이 없습니다.
pt_br: Não há linha na posição {0}.
ru: В позиции {0} строка отсутствует.
zh_hans: 在位置 {0} 处没有任何行。
zh_hant: 位置 {0} 沒有資料列。

# DataRow_RowInsertOutOfRange
source: The row insert position {0} is invalid.
de: Der Zeileneinfügepunkt {0} ist ungültig.
es: La posición de inserción de la fila {0} no es válida.
fr: La position d'insertion de la ligne {0} n'est pas valide.
it: La posizione di inserimento della riga, {0}, non è valida.
ja: 行の挿入位置 {0} が無効です。
ko: 행 삽입 위치 {0}이(가) 잘못되었습니다.
pt_br: Ponto de inserção {0} da linha é inválido.
ru: Недопустимая позиция вставки строки {0}.
zh_hans: 行插入位置 {0} 无效。
zh_hant: 無效的資料列插入位置 {0}。

# DataRow_RowInsertTwice
source: The rowOrder value={0} has been found twice for table named '{1}'.
de: rowOrder value={0} wurde zweimal für die Tabelle '{1}' gefunden.
es: El valor rowOrder value={0} está duplicado en la tabla denominada '{1}'.
fr: rowOrder value={0} a été trouvé deux fois pour la table nommée '{1}'.
it: Il valore {0} di rowOrder per la tabella denominata '{1}' è stato rilevato due volte.
ja: '{1}' という名のテーブルの rowOrder value={0} が 2 度見つかりました。
ko: 이름이 '{1}'인 테이블에 rowOrder 값={0}이(가) 두 번 사용되었습니다.
pt_br: Valor={0} de rowOrder foi encontrado duas vezes para a tabela chamada '{1}'.
ru: Значение rowOrder value={0} для таблицы с именем "{1}" обнаружено дважды.
zh_hans: 对于名为“{1}”的表，找到了两次 rowOrder value={0}。
zh_hant: 名稱為 '{1}' 的資料表中有兩個 rowOrder value={0}。

# DataRow_RowInsertMissing
source: Values are missing in the rowOrder sequence for table '{0}'.
de: In der rowOrder-Sequenz für die Tabelle '{0}' fehlen Werte.
es: Faltan valores en la secuencia rowOrder para la tabla '{0}'.
fr: Des valeurs manquent dans la séquence rowOrder pour la table '{0}'.
it: Valori mancanti nella sequenza rowOrder della tabella '{0}'.
ja: テーブル '{0}' の rowOrder シーケンスに値がありません。
ko: '{0}' 테이블의 rowOrder 시퀀스에 값이 없습니다.
pt_br: Faltam valores na sequência rowOrder da tabela '{0}'.
ru: Отсутствуют значения в последовательности rowOrder для таблицы "{0}".
zh_hans: 表“{0}”的 rowOrder 序列中缺少值。
zh_hant: 遺漏了資料表 '{0}' 的 rowOrder 順序中的值。

# DataRow_RowOutOfRange
source: The given DataRow is not in the current DataRowCollection.
de: Die angegebene DataRow befindet sich nicht in der aktuellen DataRowCollection.
es: El elemento DataRow especificado no está en la colección DataRowCollection actual.
fr: Le DataRow donné ne se trouve pas dans le DataRowCollection actuel.
it: Il DataRow specificato non si trova nel DataRowCollection corrente.
ja: 指定された DataRow は現在の DataRowCollection ではありません。
ko: 지정된 DataRow가 현재 DataRowCollection에 없습니다.
pt_br: A DataRow especificada não está na DataRowCollection atual.
ru: Указанная DataRow отсутствует в текущей DataRowCollection.
zh_hans: 给定的 DataRow 不在当前的 DataRowCollection 中。
zh_hant: 指定的 DataRow 不在目前的 DataRowCollection 中。

# DataRow_AlreadyInOtherCollection
source: This row already belongs to another table.
de: Diese Zeile gehört bereits zu einer anderen Tabelle.
es: Esta fila ya pertenece a otra tabla.
fr: Cette ligne appartient déjà à une autre table.
it: La riga appartiene già a un'altra tabella.
ja: この行は既に別のテーブルに属しています。
ko: 이 행은 이미 다른 테이블에 속해 있습니다.
pt_br: Esta linha já pertence a outra tabela.
ru: Эта строка уже принадлежит другой таблице.
zh_hans: 该行已经属于另一个表。
zh_hant: 這個資料列已經屬於其他資料表。

# DataRow_AlreadyInTheCollection
source: This row already belongs to this table.
de: Diese Zeile gehört bereits zu dieser Tabelle.
es: Esta fila ya pertenece a esta tabla.
fr: Cette ligne appartient déjà à cette table.
it: La riga appartiene già a questa tabella.
ja: この行は既にこのテーブルに属しています。
ko: 이 행은 이미 현재 테이블에 속해 있습니다.
pt_br: Esta linha já pertence a esta tabela.
ru: Эта строка уже принадлежит данной таблице.
zh_hans: 该行已经属于此表。
zh_hant: 這個資料列已經屬於這個資料表。

# DataRow_AlreadyDeleted
source: Cannot delete this row since it's already deleted.
de: Diese Zeile kann nicht gelöscht werden, da sie bereits gelöscht ist.
es: No se puede eliminar esta fila porque ya está eliminada.
fr: Impossible de supprimer cette ligne, car elle est déjà supprimée.
it: La riga è già stata eliminata. Impossibile eliminarla di nuovo.
ja: この行は既に削除されているため、さらに削除することはできません。
ko: 이 행은 이미 삭제되었으므로 다시 삭제할 수 없습니다.
pt_br: Não é possível excluir esta linha porque ela já foi excluída.
ru: Невозможно удалить эту строку, т.к. она уже удалена.
zh_hans: 此行已被删除，因此不能删除。
zh_hant: 無法刪除這個資料列，因為它之前已經被刪除了。

# DataRow_Empty
source: This row is empty.
de: Diese Zeile ist leer.
es: Esta fila está vacía.
fr: Cette ligne est vide.
it: Riga vuota.
ja: この行は空です。
ko: 이 행이 비어 있습니다.
pt_br: Esta linha está vazia.
ru: Эта строка пуста.
zh_hans: 此行是空行。
zh_hant: 這個資料列是空的。

# DataRow_AlreadyRemoved
source: Cannot remove a row that's already been removed.
de: Eine Zeile, die bereits entfernt ist, kann nicht entfernt werden.
es: No se puede eliminar una fila que ya está eliminada.
fr: Impossible de supprimer une ligne qui a déjà été supprimée.
it: Impossibile rimuovere una riga già rimossa.
ja: 既に削除されている行を削除することはできません。
ko: 이미 제거된 행이므로 다시 제거할 수 없습니다.
pt_br: Não é possível remover uma linha que já foi removida.
ru: Невозможно удалить строку, которая уже удалена.
zh_hans: 不能移除已被移除的行。
zh_hant: 無法移除已移除的資料列。

# DataRow_MultipleParents
source: A child row has multiple parents.
de: Eine untergeordnete Zeile hat mehrere übergeordnete Zeilen.
es: Una fila secundaria tiene varios elementos primarios.
fr: Une ligne enfant a plusieurs parents.
it: Una riga figlio ha più padri.
ja: 子行に複数の親行が含まれています。
ko: 자식 행에 부모가 여러 개 있습니다.
pt_br: Uma linha filho tem várias linhas pai.
ru: Дочерняя строка имеет несколько родительских строк.
zh_hans: 子行具有多个父行。
zh_hant: 子資料列擁有多個父資料列。

# DataRow_InvalidRowBitPattern
source: Unrecognized row state bit pattern.
de: Nicht erkanntes Bitmuster für Zeilenstatus.
es: patrón de bits de estado de fila no reconocido.
fr: Modèle de bit non reconnu pour l'état de ligne.
it: Modello di bit dello stato della riga non riconosciuto.
ja: 行状態のビット パターンを認識できません。
ko: 인식할 수 없는 행 상태 비트 패턴입니다.
pt_br: Padrão de bits de estado de linha não reconhecido.
ru: Неопознанное сочетание битов состояния строки.
zh_hans: 未识别的行状态位模式。
zh_hant: 無法識別資料列位元模式。

# DataSet_SetNameToEmpty
source: Cannot change the name of the DataSet to an empty string.
de: Der Name des DataSet kann nicht in eine leere Zeichenfolge geändert werden.
es: No se puede cambiar el nombre del DataSet a una cadena vacía.
fr: Impossible de changer le nom du DataSet en une chaîne vide.
it: Impossibile modificare il nome del DataSet in una stringa vuota.
ja: DataSet の名前を空の文字列に変更できません。
ko: DataSet 이름을 빈 문자열로 변경할 수 없습니다.
pt_br: Não é possível alterar o nome do DataSet por uma cadeia de caracteres vazia.
ru: Невозможно изменить имя DataSet на пустую строку.
zh_hans: 不能将此 DataSet 的名称更改为空字符串。
zh_hant: 無法將 DataSet 的名稱變更為空白字串。

# DataSet_SetDataSetNameConflicting
source: The name '{0}' is invalid. A DataSet cannot have the same name of the DataTable.
de: Der Name '{0}' ist ungültig. Ein DataSet kann nicht den gleichen Namen wie die DataTable haben.
es: El nombre '{0}' no es válido. DataSet no puede tener el mismo nombre que DataTable.
fr: Le nom '{0}' n'est pas valide. Un DataSet ne peut pas avoir le même nom que le DataTable.
it: Il nome '{0}' non è valido. Il nome di un DataSet non può essere uguale a quello del DataTable.
ja: 名前 '{0}' が無効です。DataSet に DataTable と同じ名前を指定することはできません。
ko: 이름 '{0}'이(가) 잘못되었습니다. DataSet 이름에는 DataTable과 같은 이름을 사용할 수 없습니다.
pt_br: O nome '{0}' é inválido. Um DataSet não pode ter o mesmo nome da DataTable.
ru: Недопустимое имя "{0}". Имя DataSet не может совпадать с именем DataTable.
zh_hans: 名称“{0}”无效。DataSet 不能与 DataTable 同名。
zh_hant: 名稱 '{0}' 無效。DataSet 不可以和 DataTable 同名。

# DataSet_UnsupportedSchema
source: The schema namespace is invalid. Please use this one instead: {0}.
de: Der Schemanamespace ist ungültig. Verwenden Sie statt dessen {0}.
es: El espacio de nombres del esquema no es válido. Utilice éste en su lugar: {0}.
fr: L'espace de noms du schéma est non valide. Utilisez plutôt celui-ci : {0}.
it: Spazio dei nomi dello schema non valido. Utilizzare {0}.
ja: スキーマ名前空間が無効です。{0} を使用してください。
ko: 스키마 네임스페이스가 잘못되었습니다. {0}을(를) 대신 사용하십시오.
pt_br: O espaço para nome do esquema é inválido. Em seu lugar, use o seguinte: {0}.
ru: Пространство имен данной схемы недействительно. Вместо него используйте указанное: {0}.
zh_hans: 该架构命名空间无效。请改用此命名空间: {0}。
zh_hant: 結構描述命名空間無效，請改用這個命名空間: {0}。

# DataSet_CannotChangeCaseLocale
source: Cannot change CaseSensitive or Locale property. This change would lead to at least one DataRelation or Constraint to have different Locale or CaseSensitive settings between its related tables.
de: Die CaseSensitive- oder Locale-Eigenschaft kann nicht geändert werden. Die Änderung würde dazu führen, dass mindestens eine DataRelation oder Constraint unterschiedliche Locale- oder CaseSensitive-Einstellungen in den verknüpften Tabellen hat.
es: No se puede cambiar la propiedad CaseSensitive ni Locale. Este cambio provocaría que al menos una clase DataRelation o Constraint tengan una configuración Locale o CaseSensitive distinta entre sus tablas relacionadas.
fr: Impossible de modifier une propriété CaseSensitive ou Locale. Cette modification obligerait au moins un DataRelation ou un Constraint à posséder des paramètres Locale ou CaseSensitive différents entre ses tables connexes.
it: Impossibile modificare la proprietà CaseSensitive o Locale. In seguito alla modifica, almeno un DataRelation o Constraint avrebbe impostazioni Locale o CaseSensitive diverse da quelle delle tabelle correlate.
ja: CaseSensitive または Locale プロパティを変更できません。この変更によって、関連テーブル間に少なくとも1 つの DataRelation または Constraint の異なる Locale または CaseSensitive 設定が指定されることになります。
ko: CaseSensitive 또는 Locale 속성을 변경할 수 없습니다. 이 속성을 변경하면 최소한 하나의 DataRelation 또는 Constraint가 관련 테이블 간에 서로 다른 Locale 또는 CaseSensitive 설정을 포함하게 됩니다.
pt_br: Não é possível alterar a propriedade CaseSensitive ou Locale. Essa alteração levaria pelo menos uma DataRelation ou Constraint a ter configurações Locale ou CaseSensitive diferentes entre suas tabelas relacionadas.
ru: Невозможно изменить свойство CaseSensitive или Locale. Такое изменение приведет к тому, что по меньшей мере один DataRelation или Constraint будет иметь другое значение параметра Locale или CaseSensitive в связанных с ним таблицах.
zh_hans: 无法更改 CaseSensitive 或 Locale 属性。该更改可能导致至少一个 DataRelation 或 Constraint 在其相关表之间具有不同的 Locale 或 CaseSensitive 设置。
zh_hant: 無法變更 CaseSensitive 或 Locale 屬性。這項變更將會導致至少一個 DataRelation 或 Constraint 在它的相關資料表之間，擁有不同的 Locale 或 CaseSensitive 設定。

# DataSet_CannotChangeSchemaSerializationMode
source: SchemaSerializationMode property can be set only if it is overridden by derived DataSet.
de: Die 'SchemaSerializationMode'-Eigenschaft kann nur festgelegt werden, wenn sie vom abgeleiteten DataSet überschrieben wurde.
es: La propiedad SchemaSerializationMode solo se puede establecer si la reemplaza un DataSet derivado.
fr: La propriété SchemaSerializationMode ne peut être définie que si elle est remplacée par un DataSet dérivé.
it: La proprietà SchemaSerializationMode può essere impostata soltanto se ignorata dal DataSet derivato.
ja: 派生した DataSet に SchemaSerializationMode のプロパティがオーバーライドされる場合のみ、このプロパティを設定することができます。
ko: SchemaSerializationMode 속성은 파생 DataSet에서 재정의한 경우에만 설정할 수 있습니다.
pt_br: A propriedade SchemaSerializationMode somente pode ser definida se for substituída por DataSet derivado.
ru: Свойство SchemaSerializationMode может быть установлено только в том случае, если оно переопределено производным DataSet.
zh_hans: SchemaSerializationMode 属性只有在被派生的 DataSet 覆盖时才可以设置。
zh_hant: SchemaSerializationMode 屬性只有在被衍生 DataSet 忽略時才能設定。

# DataTable_ForeignPrimaryKey
source: PrimaryKey columns do not belong to this table.
de: PrimaryKey-Spalten gehören nicht zu dieser Tabelle.
es: Las columnas PrimaryKey no pertenecen a esta tabla.
fr: Les colonnes PrimaryKey n'appartiennent pas à cette table.
it: Le colonne PrimaryKey non appartengono a questa tabella.
ja: PrimaryKey 列はこのテーブルのものではありません。
ko: PrimaryKey 열은 이 테이블에 속하지 않습니다.
pt_br: Colunas PrimaryKey não pertencem a esta tabela.
ru: Столбцы PrimaryKey не принадлежат этой таблице.
zh_hans: PrimaryKey 列不属于此表。
zh_hant: PrimaryKey 資料行不屬於個資料表。

# DataTable_CannotAddToSimpleContent
source: Cannot add a nested relation or an element column to a table containing a SimpleContent column.
de: Eine geschachtelte Beziehung oder eine Elementespalte kann nicht zu einer Tabelle mit einer SimpleContent-Spalte hinzugefügt werden.
es: No se puede agregar una relación anidada ni una columna de elementos a una tabla que contenga una columna SimpleContent.
fr: Impossible d'ajouter une relation imbriquée ou une colonne d'éléments à une table contenant une colonne SimpleContent.
it: Impossibile aggiungere una relazione annidata o una colonna di elementi a una tabella contenente una colonna SimpleContent.
ja: 入れ子にされたリレーションシップまたは要素列を、SimpleContent 列を含むテーブルに追加することはできません。
ko: SimpleContent 열을 포함하는 테이블에 중첩 관계 또는 요소 열을 추가할 수 없습니다.
pt_br: Não é possível adicionar uma relação aninhada ou uma coluna de elementos a uma tabela que contém uma coluna SimpleContent.
ru: Невозможно добавить вложенное отношение или столбец элементов в таблицу, содержащую столбец SimpleContent.
zh_hans: 不能将嵌套关系或元素列添加到包含 SimpleContent 列的表中。
zh_hant: 無法加入巢狀關聯或元素資料行至包含 SimpleContent 資料行的資料表。

# DataTable_NoName
source: TableName is required when it is part of a DataSet.
de: Der TableName ist erforderlich wenn er Teil eines DataSets ist.
es: TableName es necesario cuando forma parte de DataSet.
fr: TableName est requis lorsqu'il fait partie d'un DataSet.
it: TableName è obbligatorio quando è parte di un DataSet.
ja: TableName は、DataSet の一部になっている場合には必要です。
ko: DataSet의 일부인 경우 TableName이 필요합니다.
pt_br: TableName é necessário quando ele é parte de um DataSet.
ru: TableName является обязательным, если является частью DataSet.
zh_hans: 当 TableName 是 DataSet 的一部分时，它是必需的。
zh_hant: 當 TableName 是 DataSet 的一部分時，它是必要的。

# DataTable_MultipleSimpleContentColumns
source: DataTable already has a simple content column.
de: DataTable enthält bereits eine einfache Inhaltsspalte.
es: DataTable ya tiene una columna de contenido simple.
fr: DataTable comporte déjà une colonne de contenu simple.
it: DataTable dispone già di una colonna di contenuto semplice.
ja: DataTable は既に単一のコンテンツ コラムを持っています。
ko: DataTable에 단순 콘텐츠 열이 이미 있습니다.
pt_br: DataTable já tem uma coluna de conteúdo simples.
ru: DataTable уже содержит столбец с простым содержимым.
zh_hans: DataTable 已有简单的内容列。
zh_hant: DataTable 已具有簡單內容資料行。

# DataTable_MissingPrimaryKey
source: Table doesn't have a primary key.
de: Die Tabelle hat keine Primärschlüssel.
es: La tabla no tiene una clave principal.
fr: La table n'a pas une clé primaire.
it: La tabella non ha una chiave primaria.
ja: テーブルに主キーがありません。
ko: 테이블에 기본 키가 없습니다.
pt_br: Tabela não tem uma chave primária.
ru: Таблица не имеет первичного ключа.
zh_hans: 表没有主键。
zh_hant: 資料表沒有主索引鍵。
