Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DbConnectionString_AttachDBFilename
source: The name of the primary file, including the full path name, of an attachable database.
de: Der Name der primären Datei, einschließlich dem vollständigen Pfadnamen, einer anfügbaren Datenbank.
es: Nombre del archivo principal, incluido el nombre completo de ruta, de una base de datos que se puede adjuntar.
fr: Nom du fichier principal, comprenant le nom du chemin complet, d'une base de données pouvant être attachée.
it: Nome del file primario, incluso il nome completo del percorso, di un database collegabile.
ja: 完全なパス名を含む、接続可能なデータベースのプライマリ ファイル名です。
ko: 연결할 수 있는 데이터베이스의 기본 파일 이름(전체 경로 이름 포함)입니다.
pt_br: O nome do arquivo primário, incluindo o nome do caminho completo, de um banco de dados anexável.
ru: Имя первичного файла прикрепляемой базы данных, включая полный путь.
zh_hans: 主文件名称，包括可附加数据库的完整路径名。
zh_hant: 可附加資料庫中的主要檔案名稱，包含名稱的完整路徑。

# DbConnectionString_ConnectTimeout
source: The length of time (in seconds) to wait for a connection to the server before terminating the attempt and generating an error.
de: Der Zeitraum (in Sekunden), für den auf eine Verbindung mit dem Server gewartet wird, bevor der Versuch beendet und ein Fehler generiert wird.
es: Tiempo de espera (en segundos) para que se establezca una conexión con el servidor antes de finalizar el intento y generar un error.
fr: La durée d'attente (en secondes) d'une connexion au serveur avant de mettre fin à la tentative et de générer une erreur.
it: Quantità di tempo (in secondi) per cui attendere la connessione al server prima di interrompere il tentativo e generare un errore.
ja: サーバーに接続を試みてから、接続試行を終了し、エラーを生成するまでの待機時間の長さ (秒)。
ko: 서버에 연결할 때 연결 시도를 마치고 오류를 표시하기까지 기다리는 시간(초)입니다.
pt_br: O tempo (em segundos) a aguardar uma conexão com o servidor antes de encerrar a tentativa e gerar um erro.
ru: Продолжительность времени (в секундах) ожидания соединения с сервером перед прекращением попытки и выработкой ошибки.
zh_hans: 在终止尝试和生成错误前等待连接到服务器的时间长度(秒)。
zh_hant: 在結束嘗試到伺服器的連接，並產生錯誤之前將等候的時間長度 (以秒為單位)。

# DbConnectionString_ConnectionReset
source: When true, indicates the connection state is reset when removed from the pool.
de: Gibt, falls wahr, an, dass der Status der Verbindung bei Entfernen aus dem Pool zurückgesetzt wird.
es: Cuando el valor es true, indica que el estado de conexión se restablece cuando se elimina del grupo.
fr: Lorsque sa valeur est true, indique que l'état de la connexion est rétabli lorsqu'elle est supprimée du pool.
it: Se il valore è true, indica che lo stato della connessione viene reimpostato quando viene rimosso dal pool.
ja: True の場合は、プールから削除されるときに接続の状態がリセットされることを示します。
ko: true인 경우 풀에서 제거될 때 연결 상태가 다시 설정됨을 나타냅니다.
pt_br: Se for true, indica que o estado da conexão foi redefinido ao ser removido do pool.
ru: Когда true (истина), то указывает, что состояние подключения было сброшено при удалении из пула.
zh_hans: 如果为 True，则指示从池中删除后，连接状态为重置。
zh_hant: 當 True 時，表示當連接狀態從集區中移除時已重設。

# DbConnectionString_ContextConnection
source: When true, indicates the connection should be from the Sql Server context. Available only when running in the Sql Server process.
de: Falls wahr, muss die Verbindung aus dem Sql Server-Kontext hergestellt werden. Ist nur bei Ausführung im Sql Server-Prozess verfügbar.
es: Cuando es true, indica que la conexión debe ser desde el contexto de Sql Server. Disponible sólo cuando funciona en el proceso de Sql Server.
fr: Lorsque sa valeur est true, indique que la connexion doit provenir du contexte Sql Server. Disponible uniquement en cas d'exécution dans le processus Sql Server.
it: Se il valore è true, indica che la connessione proviene dal contesto Sql Server. Disponibile solo quando in esecuzione nel processo Sql Server.
ja: True の場合は、接続元が Sql Server のコンテキストであることを示します。Sql Server のプロセスで実行する場合のみ使用できます。
ko: true인 경우 연결이 Sql Server 컨텍스트에서 시작되어야 함을 나타냅니다. Sql Server 프로세스에서 실행 중인 경우에만 사용할 수 있습니다.
pt_br: Se for true, indica que a conexão deve ser do contexto do Sql Server. Disponível somente durante execução no processo do Sql Server.
ru: Когда true (истина), то указывает, что подключение должно устанавливаться из контекста Sql Server. Доступно только, если запущен в процессе Sql Server.
zh_hans: 如果为 true，指示连接应来自 Sql Server 上下文。只有在 Sql Server 进程中运行时才可用。
zh_hant: 為 True 時，表示連結的來源應為 Sql Server 內容。只有在 Sql Server 程序中執行時才能使用。

# DbConnectionString_CurrentLanguage
source: The SQL Server Language record name.
de: Der Datensatzname der SQL Server-Sprache.
es: Nombre de registro de lenguaje de SQL Server.
fr: Nom de l'enregistrement de la langue de SQL Server.
it: Nome del record di lingua di SQL Server.
ja: SQL Server Language レコード名です。
ko: SQL Server 언어 레코드 이름입니다.
pt_br: O nome de registro do SQL Server Language.
ru: Имя записи SQL Server Language.
zh_hans: SQL Server 语言记录名。
zh_hant: SQL Server Language 記錄名稱。

# DbConnectionString_DataSource
source: Indicates the name of the data source to connect to.
de: Gibt den Namen der Datenquelle an, mit der eine Verbindung hergestellt werden soll.
es: Indica el nombre del origen de datos con el que conectarse.
fr: Indique le nom de la source de données à laquelle se connecter.
it: Indica il nome dell'origine dati con cui stabilire la connessione.
ja: 接続先のデータ ソースの名前を示します。
ko: 연결할 데이터 원본의 이름을 나타냅니다.
pt_br: Indica o nome da fonte de dados com a qual se conectar.
ru: Указывает имя источника данных для соединения.
zh_hans: 指示作为连接目标的数据源的名称。
zh_hant: 指出要連接的資料來源的名稱。

# DbConnectionString_Encrypt
source: When true, SQL Server uses SSL encryption for all data sent between the client and server if the server has a certificate installed.
de: Falls wahr, verwendet SQL Server die SSL-Verschlüsselung für alle Daten, die zwischen Client und Server gesendet werden, wenn auf dem Server ein Zertifikat installiert ist.
es: Cuando el valor es true, SQL Server utiliza cifrado SSL para todos los datos enviados entre el cliente y el servidor, cuando el servidor tiene instalado un certificado.
fr: Lorsque sa valeur est true, SQL Server utilise le cryptage SSL pour toutes les données échangées entre le client et le serveur si un certificat a été installé sur ce dernier.
it: Se il valore è true, SQL Server utilizza la crittografia SSL per tutti i dati scambiati tra il client e il server, se nel server è installato un certificato.
ja: True の場合、SQL Server は、サーバーに証明書がインストールされている場合は、クライアントとサーバー間で送信されるすべてのデータに SSL 暗号化を使用します。
ko: true인 경우 서버에 인증서가 설치되어 있으면 SQL Server는 클라이언트와 서버 간에 전송된 모든 데이터에 대해 SSL 암호화를 사용합니다.
pt_br: Se for true, o SQL Server usará criptografia SSL para todos os dados enviados entre cliente e servidor, se o servidor possuir um certificado instalado.
ru: Когда true (истина) и на сервере установлен сертификат, то SQL Server использует шифрование SSL для всех данных, которые пересылаются между клиентом и сервером.
zh_hans: 如果为 True，并且服务器安装了证书，那么 SQL Server 将对客户端与服务器之间发送的所有数据使用 SSL 加密。
zh_hant: 當 True 時，若伺服器已安裝憑證，SQL Server 會使用 SSL 加密所有在用戶端與伺服端傳送的資料。

# DbConnectionString_Enlist
source: Sessions in a Component Services (or MTS, if you are using Microsoft Windows NT) environment should automatically be enlisted in a global transaction where required.
de: Sitzungen in einer Component Services-Umgebung (oder MTS-Umgebung, wenn Sie mit Microsoft Windows NT arbeiten) müssen den Anforderungen entsprechend automatisch in eine globale Transaktion eingetragen werden.
es: Las sesiones de un entorno de Component Services (o MTS, si utiliza Microsoft Windows NT) deben darse de alta automáticamente en una transacción global cuando sea necesario.
fr: Les sessions d'un environnement Component Services (ou MTS, si vous utilisez Microsoft Windows NT) doivent automatiquement être inscrites dans une transaction globale, si nécessaire.
it: Le sessioni in un ambiente Component Services (o MTS, se si utilizza Microsoft Windows NT) devono essere automaticamente inserite in una transazione globale, se richiesto.
ja: 必要に応じ、Component Services (Microsoft Windows NT を使用している場合は MTS) 環境内のセッションをグローバル トランザクションに含める必要があります。
ko: Component Services(또는 Microsoft Windows NT를 사용하는 경우에는 MTS) 환경의 세션은 필요한 경우 전역 트랜잭션에 자동으로 참여해야 합니다.
pt_br: Sessões em um ambiente de Component Services (ou MTS, se você estiver usando o Microsoft Windows NT) devem ser inscritos automaticamente em uma transação global sempre que necessário.
ru: Сеансы в среде служб компонентов Component Services (или MTS для Microsoft Windows NT) должны автоматически вноситься в глобальную транзакцию, если это необходимо.
zh_hans: 如有必要，Component Services (如果使用 Microsoft Windows NT，则为 MTS)环境中的会话应自动登记在全局事务中。
zh_hant: 必要時，Component Services 環境下的工作階段 (或若使用 Microsoft Windows NT 中的 MTS) 應自動列入全域交易。

# DbConnectionString_InitialCatalog
source: The name of the initial catalog or database in the data source.
de: Der Name des Anfangskatalogs oder der Anfangsdatenbank in der Datenquelle.
es: Nombre del catálogo o base de datos inicial del origen de datos.
fr: Le nom du catalogue ou de la base de données initiale dans la source de données.
it: Nome del database o catalogo iniziale nell'origine dati.
ja: データ ソース内の初期カタログまたはデータベースの名前。
ko: 데이터 원본의 초기 카탈로그 또는 데이터베이스의 이름입니다.
pt_br: O nome do catálogo inicial ou banco de dados na fonte de dados.
ru: Имя исходного каталога или базы данных в источнике данных.
zh_hans: 数据源中的初始目录或数据库的名称。
zh_hant: 資料來源中初始目錄或資料庫的名稱。

# DbConnectionString_FailoverPartner
source: The name or network address of the instance of SQL Server that acts as a failover partner.
de: Der Name oder die Netzwerkadresse der Instanz von SQL Server, die als Failoverpartner fungiert.
es: Nombre o dirección de red de la instancia de SQL Server que actúa como asociado de conmutación por error.
fr: Nom ou adresse réseau de l'instance de SQL Server faisant office de partenaire de basculement.
it: Nome o indirizzo di rete dell'istanza di SQL Server che funge come partner di failover.
ja: フェールオーバー パートナーとして機能する SQL Server のインスタンスの名前かネットワーク アドレスです。
ko: 장애 조치(Failover) 파트너 역할을 하는 SQL Server 인스턴스의 이름 또는 네트워크 주소입니다.
pt_br: O nome ou endereço de rede da instância do SQL Server que atua como parceiro de failover.
ru: Имя или сетевой адрес экземпляра SQL Server, выступающего в роли партнера при обеспечении отказоустойчивости.
zh_hans: 充当故障恢复合作伙伴的 SQL Server 实例的名称或网络地址。
zh_hant: 做為容錯移轉夥伴的 SQL Server 執行個體名稱或網路位址。

# DbConnectionString_IntegratedSecurity
source: Whether the connection is to be a secure connection or not.
de: Gibt an, ob die Verbindung eine sichere Verbindung sein muss.
es: Si la conexión será una conexión segura o no.
fr: Indique si la connexion doit être sécurisée ou non.
it: Specifica se la connessione deve essere protetta.
ja: 接続をセキュリティで保護された接続にするかどうか。
ko: 연결의 보안 설정 여부입니다.
pt_br: Se a conexão deve ser segura ou não.
ru: Указывает, должно ли соединение быть безопасным.
zh_hans: 连接是否安全。
zh_hant: 連接是否為安全連接。

# DbConnectionString_LoadBalanceTimeout
source: The minimum amount of time (in seconds) for this connection to live in the pool before being destroyed.
de: Die Mindestdauer (in Sekunden), die diese Verbindung im Pool verbleibt, bevor sie gelöscht wird.
es: Periodo mínimo de tiempo (en segundos) que residirá esta conexión en el grupo antes de ser destruida.
fr: Durée minimale de conservation (en secondes) de cette connexion avant sa destruction.
it: Tempo minimo di attesa (in secondi) perché la connessione sia attiva nel pool prima di essere eliminata.
ja: この接続が破棄されるまでにプールに存在できる最低限の時間 (秒) です。
ko: 이 연결이 제거되기 전에 풀에서 활성화되어 있는 최소 시간(초)입니다.
pt_br: O tempo mínimo (em segundos) para que essa conexão exista no pool antes de ser destruída.
ru: Минимальное время (в секундах), которое это подключение будет оставаться в пуле до уничтожения.
zh_hans: 此连接在池中存活直至被销毁的最短时间(以秒为单位)。
zh_hant: 集區中的連接在被終結前的存在時間下限 (單位為秒)。

# DbConnectionString_MaxPoolSize
source: The maximum number of connections allowed in the pool.
de: Die maximal zulässige Anzahl von Verbindungen im Pool.
es: Número máximo de conexiones permitidas en el grupo.
fr: Nombre maximal de connexions autorisé dans le pool.
it: Numero massimo di connessioni consentite nel pool.
ja: プールに保持できる最大接続数です。
ko: 풀에서 허용되는 최대 연결 수입니다.
pt_br: O número máximo de conexões permitidas no pool.
ru: Максимально допустимое число подключений в пуле.
zh_hans: 池中所允许连接的最大数目。
zh_hant: 集區中允許的連接上限。

# DbConnectionString_MinPoolSize
source: The minimum number of connections allowed in the pool.
de: Die minimal zulässige Anzahl von Verbindungen im Pool.
es: Número mínimo de conexiones permitidas en el grupo.
fr: Nombre minimal de connexions autorisé dans le pool.
it: Numero minimo di connessioni consentite nel pool.
ja: プール内で行える接続の最小数です。
ko: 풀에서 허용되는 최소 연결 수입니다.
pt_br: O número mínimo de conexões permitidas no pool.
ru: Минимально допустимое число подключений в пуле.
zh_hans: 池中所允许连接的最小数目。
zh_hant: 集區中允許的連接下限。

# DbConnectionString_MultipleActiveResultSets
source: When true, multiple result sets can be returned and read from one connection.
de: Falls wahr, können mehrere Resultsets von einer Verbindung zurückgegeben und gelesen werden.
es: Cuando el valor es true, se pueden devolver varios conjuntos de resultados y leerlos desde una conexión.
fr: Lorsque la valeur est true, plusieurs ensembles de résultats peuvent être retournés et lus à partir d'une seule connexion.
it: Se il valore è true, possono essere restituiti e letti più set di risultati da un'unica connessione.
ja: True の場合は、1 つの接続から複数の結果セットが返され、これらを読み取ることができます。
ko: true인 경우 한 연결에서 여러 결과 집합을 반환하고 읽을 수 있습니다.
pt_br: Se for true, vários resultados definidos podem ser retornados e lidos em outra conexão.
ru: Если true (истина), то из одного подключения могут быть возвращены и прочитаны несколько наборов данных.
zh_hans: 如果为 True，则可从一个连接返回和读取多个结果集。
zh_hant: 當 True 時，可從一個連接中傳回多個結果集並讀取。

# DbConnectionString_MultiSubnetFailover
source: If your application is connecting to a high-availability, disaster recovery (AlwaysOn) availability group (AG) on different subnets, MultiSubnetFailover=Yes configures SqlConnection to provide faster detection of and connection to the (currently) active server.
de: Wenn die Anwendung eine Verbindung mit einer hochverfügbaren Verfügbarkeitsgruppe (Availability Group, AG) mit Notfallwiederherstellung (AlwaysOn) in unterschiedlichen Subnetzen herstellt, wird die SqlConnection mit MultiSubnetFailover=Yes so konfiguriert, dass der (derzeit) aktive Server schneller erkannt und schneller eine Verbindung hergestellt werden kann.
es: Si su aplicación se está conectando a un grupo de disponibilidad (AG) de recuperación ante un desastre (AlwaysOn) de alta disponibilidad en subredes diferentes, MultiSubnetFailover=Yes configura SqlConnection para proveer una detección más rápida del servidor activo (actualmente) y la conexión al mismo.
fr: Si votre application se connecte à un groupe de disponibilité (AG) de récupération d'incident à haute disponibilité (AlwaysOn) sur différents sous-réseaux, MultiSubnetFailover=Yes configure SqlConnection de manière à ce que cette dernière offre une détection de et une connexion vers le serveur (actuellement) actif qui soit plus rapide.
it: Se l'applicazione viene connessa a un gruppo di disponibilità per il ripristino di emergenza (AlwaysOn) a elevata disponibilità in subnet diverse, MultiSubnetFailover=Yes configura SqlConnection in modo da fornire un rilevamento più rapido del server attualmente attivo e consentirne la connessione.
ja: 別のサブネットにある高可用ディザスター リカバリー (AlwaysOn) 可用性グループ (AG) にアプリケーションが接続する場合は、MultiSubnetFailover=Yes を使用すると、SqlConnection による (現在) アクティブなサーバーの検出およびそのサーバーへの接続が高速化されます。
ko: 응용 프로그램이 서로 다른 서브넷에 있는 고가용성 재해 복구(AlwaysOn) AG(가용성 그룹)에 연결하는 경우, MultiSubnetFailover=Yes로 설정하면 현재 활성 서버에 대한 검색 및 연결 속도가 더 빨라지도록 SqlConnection이 구성됩니다.
pt_br: Se o seu aplicativo estiver se conectando a um AG (grupo de disponibilidade - AlwaysOn) de recuperação de desastre e alta disponibilidade em diferentes sub-redes, MultiSubnetFailover=Yes configurará SqlConnection para oferecer detecção mais rápida e conexão com o servidor ativo (atualmente).
ru: Если приложение соединяется в других подсетях с группой доступности (AG) с высокой степенью готовности и возможностью аварийного восстановления (к группе "AlwaysOn"), параметр MultiSubnetFailover=Yes настраивает SqlConnection для более быстрого обнаружения активного (на данный момент) сервера и соединения с ним.
zh_hans: 如果您的应用程序要连接到其他子网上的高可用性、灾难恢复(AlwaysOn)可用性组(AG)，则 MultiSubnetFailover=Yes 会配置 SqlConnection，以提供对(当前)活动服务器的快速检测和连接。
zh_hant: 如果您的應用程式正連接到不同子網路上的高可用性、嚴重損壞修復 (AlwaysOn) 可用性群組 (AG)，MultiSubnetFailover=Yes 會設定 SqlConnection，以便更快速地偵測並連線到 (目前) 使用中的伺服器。

# DbConnectionString_TransparentNetworkIPResolution
source: If your application connects to different networks, TransparentNetworkIPResolution=Yes configures SqlConnection to provide transparent connection resolution to the currently active server, independently of the network IP topology.
de: Wenn Ihre Anwendung eine Verbindung mit verschiedenen Netzwerken herstellt, konfiguriert "TransparentNetworkIPResolution=Yes" "SqlConnection" so, dass transparente Verbindungsauflösung mit dem zurzeit aktiven Server unabhängig von der IP-Netzwerktopologie bereitgestellt wird.
es: Si la aplicación se conecta a diferentes redes, TransparentNetworkIPResolution=Sí configura SqlConnection para que proporcione resoluciones de conexión transparentes al servidor activo actualmente, sin tener en cuenta la topología de la dirección IP de la red.
fr: Si votre application se connecte à différents réseaux, TransparentNetworkIPResolution=Oui configure SqlConnection pour fournir une résolution transparente de la connexion au serveur actif, indépendamment de la topologie IP du réseau.
it: Se l'applicazione si connette a reti diverse, specificando TransparentNetworkIPResolution=Yes SqlConnection verrà configurato in modo da offrire la risoluzione trasparente delle connessioni per il server attualmente attivo indipendentemente dalla topologia IP della rete.
ja: 別のネットワークにアプリケーションが接続した場合、ネットワーク IP トポロジに関係なく、現在アクティブなサーバーに透過的な接続の解決を提供するため、SqlConnection が TransparentNetworkIPResolution=Yes により構成されます。
ko: 응용 프로그램이 다른 네트워크에 연결되어 있는 경우 TransparentNetworkIPResolution=Yes는 네트워크 IP 토폴로지와 독립적으로 현재 활성 서버에 대한 투명한 연결 확인을 제공하도록 SqlConnection을 구성합니다.
pt_br: Se o seu aplicativo se conecta a redes diferentes, o TransparentNetworkIPResolution=Yes configura SqlConnection para fornecer resolução de conexão transparente para o servidor ativo atualmente, independentemente da topologia de IP de rede.
ru: Если приложение подключается к различным сетям, TransparentNetworkIPResolution=Yes настраивает подключение SqlConnection на предоставление прозрачного разрешения подключения для текущего активного сервера независимо от топологии IP-адресов.
zh_hans: 如果你的应用程序连接至不同的网络，TransparentNetworkIPResolution=Yes 会将 SqlConnection 配置为向当前的活动服务器提供透明连接解决方案，且此行为将独立于网络 IP 拓扑结构进行。
zh_hant: 如果您的應用程式連接到其他網路，則 TransparentNetworkIPResolution=Yes 會將 SqlConnection 設定為將透明的連接解析提供給目前作用中的伺服器，且獨立於網路 IP 拓樸。

# DbConnectionString_NetworkLibrary
source: The network library used to establish a connection to an instance of SQL Server.
de: Die zum Einrichten einer Verbindung mit einer Instanz von SQL Server verwendete Netzwerkbibliothek.
es: Biblioteca de red utilizada para establecer conexión con una instancia de SQL Server.
fr: Bibliothèque réseau permettant d'établir une connexion à une instance de SQL Server.
it: Libreria di rete utilizzata per stabilire la connessione a un'istanza di SQL Server.
ja: SQL Server のインスタンスへの接続を確立するために使われるネットワーク ライブラリです。
ko: SQL Server의 인스턴스에 대한 연결을 설정하는 데 사용되는 네트워크 라이브러리입니다.
pt_br: A biblioteca de rede usada para estabelecer uma conexão com uma instância do SQL Server.
ru: Сетевая библиотека, использующаяся для подключения к экземпляру SQL Server.
zh_hans: 用于与 SQL Server 实例建立连接的网络库。
zh_hant: 用來建立至 SQL Server 執行個體連接的網路程式庫。

# DbConnectionString_PacketSize
source: Size in bytes of the network packets used to communicate with an instance of SQL Server.
de: Größe der Netzwerkpakete (in Bytes) für die Kommunikation mit einer Instanz von SQL Server.
es: Tamaño en bytes de los paquetes de red utilizados para comunicarse con una instancia de SQL Server.
fr: Taille, en octets, des paquets réseau utilisés pour communiquer avec une instance de SQL Server.
it: Dimensione in byte dei pacchetti di rete utilizzati per comunicare con un'istanza di SQL Server.
ja: SQL Server との通信に使われるネットワーク パケットのサイズ (バイト) です。
ko: SQL Server 인스턴스와 통신하는 데 사용되는 네트워크 패킷의 크기(바이트)입니다.
pt_br: Tamanho em bytes dos pacotes de rede usados na comunicação com a instância do SQL Server.
ru: Размер (в байтах) сетевых пакетов, которые используются для взаимодействия с экземпляром SQL Server.
zh_hans: 用于与 SQL Server 实例通信的网络包的大小(以字节为单位)。
zh_hant: 用來與 SQL Server 執行個體通訊的網路封包位元大小。

# DbConnectionString_Password
source: Indicates the password to be used when connecting to the data source.
de: Gibt das Kennwort an, das beim Verbinden mit der Datenquelle verwendet werden soll.
es: Indica la contraseña que se utilizará al conectar con el origen de datos.
fr: Indique le mot de passe à utiliser lors de la connexion à la source de données.
it: Indica la password da utilizzare per la connessione all'origine dati.
ja: データ ソースへの接続時に使用するパスワードを示します。
ko: 데이터 원본 연결에 사용할 암호를 나타냅니다.
pt_br: Indica a senha a ser usada durante a conexão com a fonte de dados.
ru: Отображает пароль, используемый для соединения с источником данных.
zh_hans: 指示连接到数据源时使用的密码。
zh_hant: 指出連接資料來源時要使用的密碼。

# DbConnectionString_PersistSecurityInfo
source: When false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
de: Falls falsch, werden sicherheitsrelevante Informationen, wie z. B. das Kennwort, nicht als Teil der Verbindung zurückgegeben, wenn die Verbindung geöffnet ist oder jemals einen geöffneten Status hatte.
es: Si el valor es false, no se devuelve información que afecta a la seguridad, como la contraseña, como parte de la conexión si ésta está abierta o lo ha estado alguna vez.
fr: Si la valeur est FALSE, les informations sensibles pour la sécurité, telles que le mot de passe, ne sont pas retournées dans le cadre de la connexion si la connexion est ouverte ou s'est déjà trouvée dans un état d'ouverture.
it: Se ha valore false, le informazioni basate sulla sicurezza, ad esempio la password, non vengono restituite nell'ambito della connessione se quest'ultima è aperta o se in precedenza si è trovata in uno stato aperto.
ja: False のときは、接続が開かれるか、既に開かれた状態の場合に、接続の一環として、パスワードなどのセキュリティ関連の情報が返されません。
ko: False인 경우 연결이 열려 있거나 열린 적이 있으면 암호와 같은 보안 관련 정보가 연결의 일부로 반환되지 않습니다.
pt_br: Quando false, as informações confidenciais de segurança, como a senha, não são retornadas como parte da conexão, caso a conexão esteja aberta ou já tenha sido aberta antes.
ru: Если имеет значение false, то конфиденциальные данные, например пароль, не возвращаются как часть соединения, если соединение открыто в данный момент или когда-либо находилось в открытом состоянии.
zh_hans: 设置为 False 时，如果连接目前是打开的或一直都处于打开状态，则安全敏感信息(如密码)不作为该连接的一部分返回。
zh_hant: 若為 False，如果連接為開啟或曾經處於開啟狀態，安全性敏感資訊，例如密碼，就不會傳回為連接的一部分。
