Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# OleDb_TransactionsNotSupported
source: The ITransactionLocal interface is not supported by the '{0}' provider. Local transactions are unavailable with the current provider.
de: Die ITransactionLocal-Schnittstelle wird nicht vom '{0}'-Provider unterstützt. Lokale Transaktionen sind mit dem aktuellen Provider nicht verfügbar.
es: El proveedor '{0}' no admite la interfaz ITransactionLocal. Las transacciones locales no están disponibles con el proveedor actual.
fr: L'interface ITransactionLocal n'est pas prise en charge par le fournisseur '{0}'. Les transactions locales ne sont pas disponibles avec le fournisseur actuel.
it: L'interfaccia ITransactionLocal non è supportata dal provider "{0}". Le transazioni locali non sono disponibili con il provider corrente.
ja: ITransactionLocal インターフェイスは、'{0}' プロバイダーではサポートしていません。ローカル トランザクションを現在のプロバイダーで使用することはできません。
ko: ITransactionLocal 인터페이스는 '{0}' 공급자에서 지원되지 않습니다. 로컬 트랜잭션은 현재 공급자에서 사용할 수 없습니다.
pt_br: O provedor '{0}' não dá suporte para a interface ITransactionLocal. Transações locais não disponíveis com o provedor atual.
ru: Интерфейс ITransactionLocal не поддерживается поставщиком "{0}". Локальные транзакции недоступны с помощью текущего поставщика.
zh_hans: “{0}”提供程序不支持 ITransactionLocal 接口。本地事务不可用于当前提供程序。
zh_hant: '{0}' 提供者不支援 ITransactionLocal 介面。目前的提供者不提供本機的交易。

# OleDb_ConnectionStringSyntax
source: Format of the initialization string does not conform to the OLE DB specification. Starting around char[{0}] in the connection string.
de: Das Format der Initialisierungszeichenfolge entspricht nicht der OLE DB-Spezifikation. Beginn bei char[{0}] in der Verbindungszeichenfolge.
es: El formato de la cadena de inicialización no cumple con las especificaciones OLE DB. Empieza alrededor del char [{0}] en la cadena de conexión.
fr: Le format de la chaîne d'initialisation n'est pas conforme à la spécification OLE DB. La chaîne de connexion commence aux alentours du caractère char[{0}].
it: Formato della stringa di inizializzazione non conforme alle specifiche OLE DB, a partire da char[{0}] circa nella stringa di connessione.
ja: 初期化文字列の形式が OLE DB 仕様に適合しません。接続文字列の char[{0}] 付近で始まっています。
ko: 초기화 문자열 형식이 OLE DB 사양에 맞지 않습니다. '연결 문자열의 char[{0}] 주위에서 시작합니다.
pt_br: Formato da cadeia de inicialização não está de acordo com a especificação de OLE DB. Iniciando próximo ao char[{0}] na cadeia de conexão.
ru: Формат строки инициализации не соответствует спецификации OLE DB. Начинается с char[{0}] в строке подключения.
zh_hans: 初始化字符串的格式不符合 OLE DB 规范。在连接字符串中开始于 char[{0}] 周围。
zh_hant: 初始化字串的格式和 OLE DB 規格不一致。從連接字串中 char[{0}] 附近開始。

# OleDb_AsynchronousNotSupported
source: 'Asynchronous Processing' is not a supported feature of the .NET Framework Data OLE DB Provider(Microsoft.Data.OleDb).
de: Die asynchrone Verarbeitung ist kein unterstütztes Feature des .NET Framework-OLE DB-Datenanbieters (Microsoft.Data.OleDb).
es: El procesamiento asíncrono no es una característica admitida del proveedor de datos .NET Framework para OLE DB (Microsoft.Data.OleDb).
fr: La fonctionnalité de traitement asynchrone n'est pas prise en charge par le fournisseur de données .NET Framework OLE DB (Microsoft.Data.OleDb).
it: 'Elaborazione asincrona' non è una funzionalità supportata dal provider di dati .NET Framework OLE DB (Microsoft.Data.OleDb).
ja: 'Asynchronous Processing' は、.NET Framework Data OLE DB Provider(Microsoft.Data.OleDb) でサポートされている機能ではありません。
ko: '비동기 처리'는 .NET Framework Data OLE DB Provider(Microsoft.Data.OleDb)에서 지원하지 않는 기능입니다.
pt_br: Não há suporte para o recurso 'Processamento Assíncrono' do Provedor de Dados .NET Framework para OLE DB (Microsoft.Data.OleDb).
ru: "Асинхронная обработка" не является поддерживаемой функцией поставщика данных .NET Framework для OLE DB (System.Data.OleDb).
zh_hans: .NET Framework OLE DB 数据提供程序(Microsoft.Data.OleDb)不支持“异步处理”功能。
zh_hant: .NET Framework Data OLE DB Provider(System.Data.OleDb) 不支援 'Asynchronous Processing' 功能。

# OleDb_NoProviderSpecified
source: An OLE DB Provider was not specified in the ConnectionString. An example would be, 'Provider=SQLOLEDB;'.
de: In ConnectionString wurde kein OLE DB Provider angegeben. Anwendungsbeispiel: 'Provider=SQLOLEDB;'.
es: No se ha especificado un proveedor OLE DB en ConnectionString. Un ejemplo sería, 'Provider=SQLOLEDB;'.
fr: Un fournisseur OLE DB n'était pas spécifié dans ConnectionString. Par exemple, 'Provider=SQLOLEDB;'.
it: Provider OLE DB non specificato in ConnectionString. Utilizzare ad esempio 'Provider=SQLOLEDB;'.
ja: OLE DB プロバイダーが ConnectionString で指定されませんでした。たとえば 'Provider=SQLOLEDB;' などの場合です。
ko: ConnectionString에 OLE DB 공급자를 지정하지 않았습니다(예: 'Provider=SQLOLEDB;').
pt_br: Provedor OLE DB não foi especificado em ConnectionString. Por exemplo, 'Provider=SQLOLEDB;'.
ru: В ConnectionString не задан поставщик OLE DB. Образец задания поставщика: "Provider=SQLOLEDB;".
zh_hans: 在 ConnectionString 中未指定 OLE DB 提供程序。示例为:“Provider=SQLOLEDB;”。
zh_hant: ConnectionString 中未指定 OLE DB Provider。正確範例為 'Provider=SQLOLEDB;'。

# OleDb_InvalidProviderSpecified
source: The OLE DB Provider specified in the ConnectionString is too long.
de: Der OLE DB-Provider, der in ConnectionString angegeben wurde, ist zu lang.
es: El proveedor OLE DB especificado en ConnectionString es demasiado largo.
fr: Le fournisseur OLE DB spécifié dans le ConnectionString est trop long.
it: Il provider OLE DB specificato in ConnectionString è troppo lungo.
ja: ConnectionString で指定された OLE DB プロバイダーの文字列が長すぎます。
ko: ConnectionString에 지정된 OLE DB 공급자가 너무 깁니다.
pt_br: O provedor OLE DB especificado em ConnectionString é muito longo.
ru: Недопустимо большая длина указанного в ConnectionString поставщика OLE DB.
zh_hans: ConnectionString 中指定的 OLE DB 提供程序太长。
zh_hant: 在 ConnectionString 中指定的OLE DB Provider (名稱) 太長。

# OleDb_InvalidRestrictionsDbInfoKeywords
source: No restrictions are expected for the DbInfoKeywords OleDbSchemaGuid.
de: Für DbInfoKeywords OleDbSchemaGuid werden keine Einschränkungen erwartet.
es: No se esperaban restricciones para DbInfoKeywords OleDbSchemaGuid.
fr: Aucune restriction n'est attendue pour le DbInfoKeywords OleDbSchemaGuid.
it: Non sono previste restrizioni per DbInfoKeywords OleDbSchemaGuid.
ja: DbInfoKeywords OleDbSchemaGuid に制限が設定されているのは誤りです。
ko: DbInfoKeywords OleDbSchemaGuid에 대한 제한이 없어야 합니다.
pt_br: Não são esperadas restrições para o DbInfoKeywords OleDbSchemaGuid.
ru: Для поля DbInfoKeywords из OleDbSchemaGuid ограничений не предусмотрено.
zh_hans: DbInfoKeywords OleDbSchemaGuid 不应有任何限制。
zh_hant: DbInfoKeywords OleDbSchemaGuid 應該是沒有限制的。

# OleDb_InvalidRestrictionsDbInfoLiteral
source: No restrictions are expected for the DbInfoLiterals OleDbSchemaGuid.
de: Für DbInfoLiterals OleDbSchemaGuid werden keine Einschränkungen erwartet.
es: No se esperaban restricciones para DbInfoLiterals OleDbSchemaGuid.
fr: Aucune restriction n'est attendue pour DbInfoLiterals OleDbSchemaGuid.
it: Non sono previste restrizioni per il campo DbInfoLiterals di OleDbSchemaGuid.
ja: OleDbSchemaGuid DbInfoLiterals に制限はありません。
ko: DbInfoLiterals OleDbSchemaGuid에 제한 사항이 없어야 합니다.
pt_br: Não são esperadas restrições para DbInfoLiterals OleDbSchemaGuid.
ru: Для поля DbInfoLiterals из OleDbSchemaGuid ограничений не предусмотрено.
zh_hans: DbInfoLiterals OleDbSchemaGuid 不需要限制。
zh_hant: DbInfoLiterals OleDbSchemaGuid 應該是沒有限制的。

# OleDb_InvalidRestrictionsSchemaGuids
source: No restrictions are expected for the schema guid OleDbSchemaGuid.
de: Für die Schema-guid OleDbSchemaGuid werden keine Einschränkungen erwartet.
es: No se esperaban restricciones para el esquema guid OleDbSchemaGuid.
fr: Aucune restriction n'est attendue pour le guid de schéma OleDbSchemaGuid.
it: Non sono previste restrizioni per il guid dello schema OleDbSchemaGuid.
ja: スキーマの guid、OleDbSchemaGuid に制限が設定されているのは誤りです。
ko: 스키마 guid OleDbSchemaGuid에 대한 제한이 없어야 합니다.
pt_br: Não são esperadas restrições para o guid de esquemas OleDbSchemaGuid.
ru: Для идентификатора схемы guid OleDbSchemaGuid ограничений не предусмотрено.
zh_hans: 架构 guid OleDbSchemaGuid 不应有任何限制。
zh_hant: 結構描述 guid OleDbSchemaGuid 應該是沒有限制的。

# OleDb_NotSupportedSchemaTable
source: The {0} OleDbSchemaGuid is not a supported schema by the '{1}' provider.
de: Das Schema {0} OleDbSchemaGuid wird vom '{1}'-Provider nicht unterstützt.
es: El proveedor '{1}' no admite el esquema OleDbSchemaGuid {0}.
fr: Le schéma OleDbSchemaGuid {0} n'est pas pris en charge par le fournisseur '{1}'.
it: La {0} OleDbSchemaGuid non è uno schema supportato dal provider '{1}'.
ja: {0} OleDbSchemaGuid は '{1}' プロバイダーによってサポートされたスキーマではありません。。
ko: {0} OleDbSchemaGuid는 '{1}' 공급자에서 지원되는 스키마가 아닙니다.
pt_br: O provedor '{1}' não dá suporte para o esquema {0} OleDbSchemaGuid.
ru: OleDbSchemaGuid {0} не является схемой, поддерживаемой поставщиком "{1}".
zh_hans: {0} OleDbSchemaGuid 是一个不受“{1}”提供程序支持的架构。
zh_hant: '{1}' 提供者不支援使用 {0} OleDbSchemaGuid 結構描述。

# OleDb_ConfigWrongNumberOfValues
source: The '{0}' configuration setting has the wrong number of values.
de: Die Konfigurationseinstellung '{0}' weist eine falsche Anzahl von Werten auf.
es: La configuración '{0}' posee un número incorrecto de valores.
fr: Le paramètre de configuration '{0}' possède un nombre de valeurs incorrect.
it: Le impostazioni di configurazione "{0}" hanno un numero di valori errato.
ja: 構成設定 '{0}' に指定されている値の数が正しくありません。
ko: '{0}' 구성 설정의 값 수가 잘못되었습니다.
pt_br: A definição de configuração '{0}' tem o número errado de valores.
ru: Параметр конфигурации "{0}" имеет неверное число значений.
zh_hans: “{0}”配置设置包含不正确数目的值。
zh_hant: '{0}' 組態設定的數值錯誤。

# OleDb_ConfigUnableToLoadXmlMetaDataFile
source: Unable to load the XML file specified in configuration setting '{0}'.
de: Die in der Konfigurationseinstellung '{0}' angegebene XML-Datei konnte nicht geladen werden.
es: No se puede cargar el archivo XML especificado en la configuración '{0}'.
fr: Impossible de charger le fichier XML spécifié dans le paramètre de configuration '{0}'.
it: Impossibile caricare il file XML specificato nell'impostazione di configurazione "{0}".
ja: 構成設定 '{0}' で指定されている XML ファイルを読み込めません。
ko: 구성 설정 '{0}'에 지정된 XML 파일을 로드할 수 없습니다.
pt_br: Não é possível carregar o arquivo XML especificado na definição de configuração '{0}'.
ru: Не удается загрузить файл XML, указанный в параметре конфигурации "{0}".
zh_hans: 无法加载在配置设置“{0}”中指定的 XML 文件。
zh_hant: 無法載入指定於組態設定 '{0}' 中的 XML 檔案。

# OleDb_CommandParameterBadAccessor
source: Command parameter[{0}] '{1}' is invalid.
de: Befehlsparameter [{0}] '{1}' ist ungültig.
es: Parámetro de comando [{0}] '{1}' no válido.
fr: Le paramètre de commande [{0}] '{1}' n'est pas valide.
it: Parametro Command [{0}] '{1}' non valido.
ja: コマンド引数 [{0}] '{1}' が無効です。
ko: 명령 매개 변수[{0}] '{1}'이(가) 잘못되었습니다.
pt_br: Parâmetro de comando [{0}] '{1}' inválido.
ru: Параметр команды [{0}] "{1}" является недопустимым.
zh_hans: 命令参数[{0}] '{1}' 无效。
zh_hant: 命令參數[{0}] '{1}' 無效。

# OleDb_CommandParameterCantConvertValue
source: Command parameter[{0}] '{1}' data value could not be converted for reasons other than sign mismatch or data overflow.
de: Der Datenwert des Befehlsparameters [{0}] '{1}' konnte aus anderen Gründen als einem Signaturübereinstimmungsfehler oder Datenüberlauf nicht konvertiert werden.
es: No se puede convertir el valor de los datos del parámetro de comando [{0}] '{1}' por otras razones diferentes a la falta de correspondencia de signo o el desbordamiento de los datos.
fr: La valeur de données [{0}] '{1}' du paramètre de commande n'a pas pu être convertie pour des raisons autres que l'incompatibilité de signe ou le dépassement de données.
it: Impossibile convertire il valore dei dati del parametro Command [{0}] "{1}" per ragioni diverse dalla mancata corrispondenza dei segni o dall'overflow dei dati.
ja: 署名の不一致またはデータ オーバーフロー以外の理由により、コマンド引数 [{0}] '{1}' データ値を変換できませんでした。
ko: 부호 불일치 또는 데이터 오버플로 이외의 다른 이유로 인해 명령 매개 변수[{0}] '{1}' 데이터 값을 변환할 수 없습니다.
pt_br: Valor dos dados do parâmetro de comando [{0}] '{1}' não pôde ser convertido por razões diferentes de sinais incompatíveis ou estouro de dados.
ru: Невозможно преобразовать значение данных параметра команды [{0}] "{1}" по причине, отличной от несоответствия знака или переполнения данных.
zh_hans: 由于符号不匹配或数据溢出以外的其他原因，无法转换命令参数[{0}]“{1}”数据值。
zh_hant: 因為正負號不符合或資料溢位之外的原因，無法轉換命令參數[{0}]'{1}' 資料值。

# OleDb_CommandParameterSignMismatch
source: Conversion failed for command parameter[{0}] '{1}' because the data value was signed and the type used by the provider was unsigned.
de: Die Konvertierung des Befehlsparameters [{0}] '{1}' ist fehlgeschlagen, da der Datenwert signiert war, aber der vom Anbieter verwendete Typ nicht.
es: Error de conversión del parámetro de comando [{0}] '{1}' porque el valor de los datos es de tipo signed y el tipo utilizado por el proveedor es de tipo unsigned.
fr: Échec de la conversion pour le paramètre de commande [{0}] '{1}', car la valeur des données était signée et le type utilisé par le fournisseur n'était pas signé.
it: Impossibile convertire il parametro Command [{0}] '{1}'. Il valore dei dati è con segno, mentre il tipo utilizzato dal provider è senza segno.
ja: コマンド引数 [{0}] '{1}' の変換に失敗しました。データ値が signed であるのに対し、プロバイダーが使用する型は unsigned です。
ko: 데이터 값은 부호가 있고 공급자에서 사용한 형식은 부호가 없기 때문에 명령 매개 변수[{0}] '{1}'을(를) 변환하지 못했습니다.
pt_br: Falha na conversão do parâmetro de comando [{0}] '{1}' porque o valor dos dados tinha sinal e o tipo usado pelo provedor era sem sinal.
ru: Сбой преобразования для параметра команды[{0}] "{1}" из-за того, что значение данных имеет знак, а поставщик использует тип без знака.
zh_hans: 因为数据值是有符号的，而提供程序使用的类型是无符号的，所以命令参数[{0}] '{1}' 的转换失败。
zh_hant: 命令參數[{0}] '{1}' 的轉換失敗，因為資料值為 signed，而提供者使用的型別為 unsigned。

# OleDb_CommandParameterDataOverflow
source: Conversion failed for command parameter[{0}] '{1}' because the data value overflowed the type used by the provider.
de: Die Konvertierung des Befehlsparameters [{0}] '{1}' ist fehlgeschlagen, da der Datenwert den vom Provider verwendeten Typ überlaufen hat.
es: Error de conversión del parámetro de comando [{0}] '{1}' porque el valor de datos ha desbordado el tipo utilizado por el proveedor.
fr: La conversion a échoué pour le paramètre de commande [{0}] '{1}', car la valeur des données a dépassé le type utilisé par le fournisseur.
it: Impossibile convertire il parametro Command [{0}] '{1}'. Il valore dei dati ha determinato l'overflow del tipo utilizzato dal provider.
ja: コマンド引数 [{0}] '{1}' の変換に失敗しました。データ値がプロバイダーで使われた型をオーバーフローしました。
ko: 공급자에서 사용한 형식에 대해 데이터 값 오버플로가 발생했기 때문에 명령 매개 변수[{0}] '{1}'을(를) 변환하지 못했습니다.
pt_br: Falha na conversão do parâmetro de comando [{0}] '{1}' porque o valor dos dados estourou o tipo usado pelo provedor.
ru: Сбой преобразования параметра команды[{0}] "{1}" в силу того, что для значения данных произошло переполнение типа, используемого поставщиком.
zh_hans: 因为数据值溢出了提供程序所使用的类型，所以命令参数[{0}] '{1}' 的转换失败。
zh_hant: 命令參數[{0}] '{1}' 的轉換失敗，因為資料值溢位提供者使用的型別。

# OleDb_CommandParameterUnavailable
source: Provider encountered an error while sending command parameter[{0}] '{1}' value and stopped processing.
de: Der Anbieter ist beim Senden des Werts des Befehlsparameters [{0}] '{1}' auf einen Fehler gestoßen und hat die Verarbeitung angehalten.
es: El proveedor encontró un error al enviar el valor del parámetro de comando [{0}] '{1}' y ha detenido el procesamiento.
fr: Le fournisseur a rencontré une erreur lors de l'envoi d'une valeur [{0}] '{1}' de paramètre de commande et a arrêté le traitement.
it: Il provider ha rilevato un errore durante l'invio del valore del parametro Command [{0}] '{1}' e ha arrestato l'elaborazione.
ja: コマンド引数 [{0}] '{1}' 値を送出中にエラーが発生したため、プロバイダーは処理を中止しました。
ko: 명령 매개 변수[{0}] '{1}' 값을 보내는 동안 공급자에서 오류가 발생하여 처리가 중지되었습니다.
pt_br: O provedor encontrou um erro ao enviar valor do parâmetro de comando [{0}] '{1}' e interrompeu o processamento.
ru: Поставщик обнаружил ошибку при передаче значения параметра команды [{0}] "{1}" и прекратил обработку.
zh_hans: 提供程序在发送命令参数[{0}] '{1}' 值时遇到错误，已停止处理。
zh_hant: 當傳送命令參數[{0}] '{1}' 值和停止處理時，提供者發生錯誤。

# OleDb_CommandParameterDefault
source: Parameter[{0}] '{1}' has no default value.
de: Der Parameter [{0}] '{1}' hat keinen Standardwert.
es: El parámetro [{0}] '{1}' no tiene un valor predeterminado.
fr: Le paramètre[{0}] '{1}' n'a pas de valeur par défaut.
it: Il parametro [{0}] "{1}" non ha valore predefinito.
ja: パラメーター [{0}] '{1}' に既定値がありません。
ko: 매개 변수[{0}] '{1}'에 기본값이 없습니다.
pt_br: Parâmetro [{0}] '{1}' não tem valor padrão.
ru: Параметр [{0}] "{1}" не имеет значения по умолчанию.
zh_hans: 参数[{0}] '{1}' 没有默认值。
zh_hant: 參數[{0}] '{1}' 沒有預設值。

# OleDb_CommandParameterError
source: Error occurred with parameter[{0}]: {1}.
de: Fehler beim Befehlsparameter [{0}]: {1}.
es: Error del parámetro[{0}]: {1}.
fr: Une erreur s'est produite avec le paramètre de commande [{0}] : {1}.
it: Errore nel parametro [{0}]: {1}.
ja: パラメーター [{0}] で、次のエラーが発生しました。{1}
ko: 매개 변수[{0}]: {1}에서 오류가 발생했습니다.
pt_br: Erro com o parâmetro[{0}]: {1}.
ru: Ошибка, связанная с параметром [{0}]: {1}.
zh_hans: 参数[{0}] 出现错误: {1}。
zh_hant: 使用參數[{0}]: {1} 時發生錯誤。

# OleDb_BadStatus_ParamAcc
source: Microsoft.Data.OleDb.OleDbDataAdapter internal error: invalid parameter accessor: {0} {1}.
de: Interner Microsoft.Data.OleDb.OleDbDataAdapter-Fehler: ungültiger Parameteraccessor: {0} {1}.
es: Error interno de Microsoft.Data.OleDb.OleDbDataAdapter: descriptor de acceso de parámetro incorrecto: {0} {1}.
fr: Erreur interne Microsoft.Data.OleDb.OleDbDataAdapter : accesseur de paramètre non valide : {0} {1}.
it: Errore interno di Microsoft.Data.OleDb.OleDbDataAdapter: funzione di accesso al parametro non valida: {0} {1}.
ja: Microsoft.Data.OleDb.OleDbDataAdapter の内部エラー : パラメーター アクセサーが無効です: {0} {1}。
ko: Microsoft.Data.OleDb.OleDbDataAdapter 내부 오류: 매개 변수 접근자가 잘못되었습니다. {0} {1}.
pt_br: Erro interno do Microsoft.Data.OleDb.OleDbDataAdapter: acessador de parâmetro inválido: {0} {1}.
ru: Внутренняя ошибка System.Data.OleDb.OleDbDataAdapter. Недопустимый параметрический метод доступа: {0} {1}.
zh_hans: Microsoft.Data.OleDb.OleDbDataAdapter 内部错误:参数访问器 {0} {1} 无效。
zh_hant: Microsoft.Data.OleDb.OleDbDataAdapter 內部錯誤: 參數存取子無效: {0} {1}。

# OleDb_UninitializedParameters
source: Parameter[{0}]: the OleDbType property is uninitialized: OleDbType.{1}.
de: Parameter {0}: die Eigenschaft OleDbType ist nicht initialisiert: OleDbType.{1}.
es: Parameter[{0}]: la propiedad OleDbType no está inicializada: OleDbType.{1}.
fr: Parameter [{0}] : la propriété OleDbType n'est pas initialisée : OleDbType.{1}.
it: Parameter[{0}]: proprietà OleDbType non inizializzata: OleDbType.{1}.
ja: Parameter [{0}]: OleDbType プロパティが初期化されていません。OleDbType.{1}
ko: Parameter[{0}]: OleDbType 속성이 초기화되지 않았습니다. OleDbType.{1}.
pt_br: Parameter[{0}]: a propriedade OleDbType não foi inicializada: OleDbType.{1}.
ru: Параметр Parameter[{0}]: свойство OleDbType не инициализировано: OleDbType.{1}.
zh_hans: Parameter[{0}]: 未初始化 OleDbType 属性: OleDbType.{1}。
zh_hant: Parameter[{0}]: OleDbType 屬性未初始化: OleDbType.{1}。

# OleDb_NoProviderSupportForParameters
source: The ICommandWithParameters interface is not supported by the '{0}' provider. Command parameters are unsupported with the current provider.
de: Die ICommandWithParameters-Schnittstelle wird vom '{0}'-Provider nicht unterstützt. Befehlsparameter werden vom aktuellen Provider nicht unterstützt.
es: El proveedor '{0}' no admite con la interfaz ICommandWithParameters. Los parámetros de comando no son compatibles con el proveedor actual.
fr: L'interface ICommandWithParameters n'est pas prise en charge par le fournisseur '{0}'. Les paramètres de commande ne sont pas pris en charge avec le fournisseur actuel.
it: L'interfaccia ICommandWithParameters non è supportata dal provider '{0}'. I parametri Command non sono supportati dal provider corrente.
ja: ICommandWithParameters インターフェイスは '{0}' によってサポートされていません。現在のプロバイダーはコマンド パラメーターをサポートしません。
ko: ICommandWithParameters 인터페이스는 '{0}' 공급자에서 지원되지 않습니다. 현재 공급자는 명령 매개 변수를 지원하지 않습니다.
pt_br: O provedor '{0}' não dá suporte para a interface ICommandWithParameters. O provedor atual não dá suporte para os parâmetros de comando.
ru: Интерфейс ICommandWithParameters не поддерживается поставщиком "{0}". Параметры команды не поддерживаются текущим поставщиком.
zh_hans: “{0}”提供程序不支持 ICommandWithParameters 接口。当前提供程序不支持命令参数。
zh_hant: '{0}' 提供者不支援使用 ICommandWithParameters 介面。目前的提供者並不支援這些命令參數。

# OleDb_NoProviderSupportForSProcResetParameters
source: Retrieving procedure parameter information is not supported by the '{0}' provider.
de: Das Abfragen der Prozedurparameterinformationen wird vom '{0}'-Provider nicht unterstützt.
es: El proveedor '{0}' no admite la recuperación de información de parámetros de procedimientos.
fr: L'extraction des informations sur les paramètres de procédures n'est pas prise en charge par le fournisseur '{0}'.
it: Il recupero di informazioni sui parametri di procedura non è supportato dal provider '{0}'.
ja: プロシージャ パラメーター情報の取得は '{0}' プロバイダーによってサポートされていません。
ko: 프로시저 매개 변수 정보 검색은 '{0}' 공급자에서 지원되지 않습니다.
pt_br: O provedor '{0}' não dá suporte para recuperação de informações sobre parâmetro de procedimento.
ru: Извлечение сведений о параметрах процедур не поддерживается поставщиком "{0}".
zh_hans: “{0}”提供程序不支持检索过程参数信息。
zh_hant: '{0}' 提供者不支援擷取程序的參數資訊。

# OleDb_CanNotDetermineDecimalSeparator
source: Can not determine the server's decimal separator. Non-integer numeric literals can not be created.
de: Das Dezimaltrennzeichen des Servers kann nicht bestimmt werden. Nicht ganzzahlige numerische Literale können nicht erstellt werden.
es: No se puede determinar el separador decimal del servidor. No se pueden crear literales numéricos no enteros.
fr: Impossible de déterminer le séparateur décimal du serveur. Impossible de créer des littéraux numériques qui ne sont pas des entiers.
it: Impossibile determinare il separatore decimale del server. Impossibile creare valori numerici letterali non Integer.
ja: サーバーの桁区切り記号を特定できません。integer 以外の数値リテラルは作成できません。
ko: 서버의 소수 구분 기호를 확인할 수 없습니다. 정수가 아닌 숫자 리터럴을 만들 수 없습니다.
pt_br: Não é possível determinar o separador decimal do servidor. Não é possível criar literais numéricos não inteiros.
ru: Не удается определить используемый сервером разделитель для десятичной дробной части. Невозможно создать нецелую числовую константу.
zh_hans: 无法确定服务器的十进制分隔符。不能创建非整数文本。
zh_hant: 無法判斷伺服器的小數位數分隔符號。無法建立非整數的數字。

# OleDb_Fill_NotADODB
source: Object is not an ADODB.RecordSet or an ADODB.Record.
de: Das Objekt ist kein ADODB.RecordSet oder ADODB.Record.
es: El objeto no es ADODB.RecordSet ni ADODB.Record.
fr: L'objet n'est ni un ADODB.RecordSet, ni un ADODB.Record.
it: L'oggetto non è un oggetto ADODB.RecordSet o un ADODB.Record.
ja: オブジェクトは ADODB.RecordSet または ADODB.Record ではありません。
ko: ADODB.RecordSet 또는 ADODB.Record 개체가 아닙니다.
pt_br: Objeto não é um ADODB.RecordSet ou um ADODB.Record.
ru: Объект не является ни ADODB.RecordSet, ни ADODB.Record.
zh_hans: 对象不是 ADODB.RecordSet 或 ADODB.Record。
zh_hant: 該物件不是一個 ADODB.RecordSet 或 ADODB.Record。

# OleDb_Fill_EmptyRecordSet
source: Unable to retrieve the '{0}' interface from the ADODB.RecordSet object.
de: Die Schnittstelle '{0}' kann vom ADODB.RecordSet-Objekt nicht abgerufen werden.
es: No se puede recuperar la interfaz '{0}' del objeto ADODB.RecordSet.
fr: Impossible d'extraire l'interface '{0}' de l'objet ADODB.RecordSet.
it: Impossibile recuperare l'interfaccia "{0}" dall'oggetto ADODB.RecordSet.
ja: ADODB.RecordSet オブジェクトから '{0}' インターフェイスを取得することができません。
ko: ADODB.RecordSet 개체에서 '{0}' 인터페이스를 검색할 수 없습니다.
pt_br: Não é possível recuperar a interface '{0}' do objeto ADODB.RecordSet.
ru: Не удалось извлечь интерфейс "{0}" из объекта ADODB.RecordSet.
zh_hans: 无法从 ADODB.RecordSet 对象中检索“{0}”接口。
zh_hant: 無法擷取 ADODB.RecordSet 物件中的 '{0}' 介面。
