Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_InvalidKeyStoreProviderName
source: Invalid key store provider name: '{0}'. A key store provider name must denote either a system key store provider or a registered custom key store provider. Valid system key store provider names are: {1}. Valid (currently registered) custom key store provider names are: {2}. Please verify key store provider information in column master key definitions in the database, and verify all custom key store providers used in your application are registered properly.
de: Ungültiger Name des Schlüsselspeicheranbieters: {0}. Der Name eines Schlüsselspeicheranbieters muss entweder einen Systemschlüsselspeicheranbieter oder einen registrierten benutzerdefinierten Schlüsselspeicheranbieter bezeichnen. Gültige Systemschlüsselspeicheranbieternamen: {1}. Gültige (derzeit registrierte) benutzerdefinierte Schlüsselspeicheranbieternamen: {2}. Prüfen Sie die Daten zu den Schlüsselspeicheranbietern in der Spalte mit den Hauptschlüsseldefinitionen in der Datenbank, und stellen Sie sicher, dass alle benutzerdefinierten Schlüsselspeicheranbieter, die in der Anwendung verwendet werden, korrekt registriert sind.
es: Nombre de proveedor de almacenamiento de claves no válido: "{0}". El nombre del proveedor de almacenamiento de claves debe denotar un proveedor de almacenamiento de claves de sistema o un proveedor de almacenamiento de claves personalizadas registrado. Los nombres de proveedores de almacenamiento de claves del sistema válidos son: {1}. Los nombres de proveedores de almacenamiento de claves personalizados válidos (registrados actualmente) son: {2}. Compruebe la información del proveedor de almacenamiento de claves en las definiciones de claves maestras de columnas de la base de datos y compruebe que todos los proveedores de almacenamiento de claves personalizadas usados en la aplicación se han registrado correctamente.
fr: Le nom du fournisseur de magasins de clés est non valide : '{0}'. Un nom de fournisseur de magasins de clés doit désigner un fournisseur de magasins de clés système ou un fournisseur de magasins de clés personnalisé inscrit. Les noms de fournisseurs de magasins de clés système valides sont : {1}. Les noms de fournisseurs de magasins de clés personnalisés (inscrits) valides sont : {2}. Vérifiez les informations des fournisseurs de magasins de clés dans les définitions de clé principale de colonne au sein de la base de données. De plus, vérifiez que tous les fournisseurs de magasins de clés personnalisés utilisés dans votre application sont correctement inscrits.
it: Il nome del provider dell'archivio chiavi '{0}' non è valido. Un nome di provider dell'archivio chiavi deve indicare un provider dell'archivio chiavi di sistema oppure uno personalizzato registrato. I nomi dei provider dell'archivio chiavi di sistema validi sono: {1}. I nomi dei provider dell'archivio chiavi personalizzati attualmente registrati sono: {2}. Verificare le informazioni sul provider dell'archivio chiavi nelle definizioni di chiave master di colonna nel database; verificare inoltre che tutti i provider dell'archivio chiavi personalizzati usati nell'applicazione siano registrati correttamente.
ja: キー ストア プロバイダー名 '{0}' が無効です。キー ストア プロバイダー名は、システム キー ストア プロバイダーまたは登録されたカスタム キー ストア プロバイダーを表している必要があります。有効なシステム キー ストア プロバイダー名は {1} です。有効な (現時点で登録済みの) カスタム キー ストア プロバイダー名は {2} です。データベースにある列マスター キー定義のキー ストア プロバイダー情報を確認し、アプリケーションで使用されているすべてのカスタム キー ストア プロバイダーが正しく登録されていることをご確認ください。
ko: 키 저장소 공급자 이름 '{0}'이(가) 잘못되었습니다. 키 저장소 공급자 이름은 시스템 키 저장소 공급자나 등록된 사용자 지정 키 저장소 공급자를 나타내야 합니다. 유효한 시스템 키 저장소 공급자 이름은 {1}입니다. 유효한(현재 등록된) 사용자 지정 키 저장소 공급자 이름은 {2}입니다. 데이터베이스의 열 마스터 키 정의에서 키 저장소 공급자 정보를 확인하고 응용 프로그램에서 사용된 모든 사용자 지정 키 저장소 공급자가 올바로 등록되어 있는지 확인하세요.
pt_br: Nome do provedor do repositório de chaves inválido: '{0}'. Um nome de provedor de repositório de chaves deve indicar um provedor de repositório de chaves do sistema ou um provedor de repositório de chaves personalizado registrado. Nomes de provedor válidos são: {1}. Nomes de provedor de repositório de chaves válidos (atualmente registrados) são: {2}. Verifique as informações do provedor do repositório de chaves nas definições de chave mestra de coluna no banco de dados e verifique se todos os provedores de repositórios de chaves personalizados usados no aplicativo estão registrados corretamente.
ru: Недопустимое имя поставщика хранилища ключей: "{0}". Имя поставщика хранилища ключей должно указывать на поставщика хранилища ключей системы или на зарегистрированного пользовательского поставщика хранилища ключей. Допустимые имена поставщиков хранилища ключей системы: {1}. Допустимые (зарегистрированные в настоящее время) имена пользовательских поставщиков хранилища ключей: {2}. Проверьте сведения о поставщике хранилища ключей в определениях главного ключа столбца в базе данных, а также убедитесь, что все пользовательские поставщики хранилища ключей, которые используются в вашем приложении, зарегистрированы правильно.
zh_hans: 密钥存储提供程序名无效:“{0}”。密钥存储提供程序名必须表示系统密钥存储提供程序或已注册的自定义密钥存储提供程序。有效的系统密钥存储提供程序名是: {1}。有效的(当前已注册的)自定义密钥存储提供程序名是: {2}。请验证数据库中列主密钥定义中的密钥存储提供程序信息，并验证应用程序中使用的所有自定义密钥存储提供程序是否都正确注册。
zh_hant: 金鑰存放區提供者名稱無效: '{0}'。金鑰存放區提供者名稱必須代表系統金鑰存放區提供者或已註冊的自訂金鑰存放區提供者。有效的系統金鑰存放區提供者名稱為: {1}。有效 (目前已登錄) 的自訂金鑰存放區提供者名稱為: {2}。請驗證資料庫中資料行主要金鑰定義中的金鑰存放區提供者資訊，並驗證應用程式中的所有自訂金鑰存放區提供者均已正確註冊。

# TCE_FailedToEncryptRegisterRulesBytePackage
source: Internal Error. Failed to encrypt byte package to be sent to the enclave. Error Message: {0}
de: Interner Fehler. Fehler beim Verschlüsseln des Bytepakets zum Senden an Enclave. Fehlermeldung: {0}
es: Error interno. No se pudo cifrar el paquete de bytes que se enviará al enclave. Mensaje de error: {0}
fr: Erreur interne. Échec du chiffrement du package d'octets à envoyer à l'enclave. Message d'erreur : {0}
it: Messaggio di errore. Non è stato possibile crittografare il pacchetto di byte da inviare all'enclave. Messaggio di errore: {0}
ja: 内部エラーです。エンクレーブに送信するバイト パッケージを暗号化できませんでした。エラー メッセージ: {0}
ko: 내부 오류가 발생했습니다. enclave로 전송할 바이트 패키지를 암호화하지 못했습니다. 오류 메시지: {0}
pt_br: Erro Interno. Falha ao criptografar o pacote de bytes a ser enviado para o enclave. Mensagem de Erro: {0}
ru: Внутренняя ошибка. Не удалось зашифровать пакет байтов для отправки в анклав. Сообщение об ошибке: {0}
zh_hans: 出现内部错误。未能加密要发送到 enclave 的字节包。错误消息: {0}
zh_hant: 內部錯誤。無法加密要傳送至 enclave 的位元組套件。錯誤訊息: {0}

# TCE_OffsetOutOfBounds
source: Internal Error. Failed to serialize keys to be sent to the enclave. The start offset specified by argument '{0}' for method {1}.{2} is out of bounds.
de: Interner Fehler. Fehler beim Serialisieren der Schlüssel zum Senden an Enclave. Das über das Argument "{0}" für die Methode "{1}.{2}" angegebene Startoffset liegt außerhalb des gültigen Bereichs.
es: Error interno. Error al serializar las claves para enviarlas al enclave. El desplazamiento inicial especificado por el argumento "{0}" para el método {1}.{2} está fuera de los límites.
fr: Erreur interne. Échec de la sérialisation des clés à envoyer à l'enclave. Le décalage de départ spécifié par l'argument '{0}' pour la méthode {1}.{2} est hors limites.
it: Errore interno. Non è stato possibile serializzare le chiavi da inviare all'enclave. L'offset iniziale specificato dall'argomento '{0}' per il metodo {1}.{2} non è compreso nell'intervallo.
ja: 内部エラーです。エンクレーブに送信するキーをシリアル化できませんでした。メソッド {1}.{2} に対して引数 '{0}' で指定した開始オフセットが範囲外です。
ko: 내부 오류가 발생했습니다. enclave로 전송할 키를 직렬화하지 못했습니다. {1}.{2} 메서드에 대해 인수 '{0}'(으)로 지정되는 시작 오프셋이 범위를 벗어납니다.
pt_br: Erro Interno. Falha ao serializar chaves a ser enviadas para o enclave. O deslocamento de início especificado pelo argumento '{0}' para o método {1}.{2} está fora dos limites.
ru: Внутренняя ошибка. Не удалось сериализовать ключи для отправки в анклав. Начальное смещение, заданное аргументом "{0}" для метода {1}.{2}, выходит за допустимые пределы.
zh_hans: 出现内部错误。未能序列化要发送至 enclave 的密钥。参数“{0}”为方法 {1}.{2} 指定的起始偏移量超出了界限。
zh_hant: 內部錯誤。無法序列化要傳送至 enclave 的金鑰。引數 '{0}' 為方法 {1}.{2} 指定的起始位移超出界限。

# TCE_InsufficientBuffer
source: Internal Error. The buffer specified by argument '{0}' for method '{1}.{2}' has insufficient space.
de: Interner Fehler. Der über das Argument "{0}" für die Methode "{1}.{2}" angegebene Puffer weist unzureichenden Speicher auf.
es: Error interno. El búfer especificado por el argumento "{0}" para el método "{1}.{2}" no tiene espacio suficiente.
fr: Erreur interne. L'espace de la mémoire tampon spécifiée par l'argument '{0}' pour la méthode '{1}.{2}' est insuffisant.
it: Errore interno. Lo spazio del buffer specificato dall'argomento '{0}' per il metodo '{1}.{2}' è insufficiente.
ja: 内部エラーです。メソッド '{1}.{2}' に対する引数 '{0}' で指定したバッファーに十分な領域がありません。
ko: 내부 오류가 발생했습니다. '{1}.{2}' 메서드에 대해 인수 '{0}'(으)로 지정되는 버퍼에 공간이 부족합니다.
pt_br: Erro Interno. O buffer especificado pelo argumento '{0}' para o método '{1}.{2}' não tem espaço suficiente.
ru: Внутренняя ошибка. В буфере, заданном аргументом "{0}" для метода "{1}.{2}", недостаточно места.
zh_hans: 出现内部错误。参数“{0}”为方法“{1}.{2}”指定的缓冲区空间不足。
zh_hant: 內部錯誤。引數 '{0}' 為方法 '{1}.{2}' 指定的緩衝區空間不足。

# TCE_ColumnEncryptionKeysNotFound
source: Internal Error. Encrypted column encryption keys not found when trying to send the keys to the enclave.
de: Interner Fehler. Die verschlüsselten Spaltenverschlüsselungsschlüssel zum Senden an Enclave wurden nicht gefunden.
es: Error interno. No se encontraron las claves de cifrado de la columna cifrada al intentar enviar las claves al enclave.
fr: Erreur interne. Les clés de chiffrement des colonnes chiffrées sont introuvables durant la tentative d'envoi des clés à l'enclave.
it: Errore interno. Si è provato a inviare le chiavi di crittografia di colonna crittografata all'enclave, ma le chiavi non sono state trovate.
ja: 内部エラーです。エンクレーブにキーを送信しようとしましたが、暗号化された列暗号化キーが見つかりませんでした。
ko: 내부 오류가 발생했습니다. enclave로 키를 전송하려고 할 때 암호화된 열의 암호화 키를 찾지 못했습니다.
pt_br: Erro Interno. As chaves de criptografia da coluna criptografada não foram encontradas ao tentar enviar as chaves para o enclave.
ru: Внутренняя ошибка. Не найдены ключи шифрования зашифрованного столбца при попытке отправить ключи в анклав.
zh_hans: 内部错误。尝试向 enclave 发送秘钥时，找不到加密列的加密密钥。
zh_hant: 內部錯誤。嘗試傳送金鑰到 enclave 時，找不到加密資料行的加密金鑰。

# TCE_NullEnclaveSessionDuringQueryExecution
source: Internal Error. Enclave session is null during query execution. Enclave type is '{0}' and enclaveAttestationUrl is '{1}'.
de: Interner Fehler. Die Enclave-Sitzung lautet während einer Abfrageausführung NULL. Der Enclave-Typ ist "{0}", die enclaveAttestationUrl lautet {1}.
es: Error interno. La sesión de enclave es nula durante la ejecución de la consulta. El tipo de enclave es "{0}" y enclaveAttestationUrl es "{1}".
fr: Erreur interne. La session de l'enclave a une valeur null durant l'exécution de la requête. Le type d'enclave est '{0}' et enclaveAttestationUrl a la valeur '{1}'.
it: Errore interno. La sessione dell'enclave è Null durante l'esecuzione della query. Il tipo di enclave è '{0}' e l'URL di attestazione dell'enclave è '{1}'.
ja: 内部エラーです。クエリの実行中にエンクレーブ セッションが null です。エンクレーブ型は '{0}' で、enclaveAttestationUrl は '{1}' です。
ko: 내부 오류가 발생했습니다. 쿼리 실행 중 enclave 세션이 null입니다. enclave 형식은 '{0}'이고 enclaveAttestationUrl은 '{1}'입니다.
pt_br: Erro Interno. A sessão de enclave é nula durante a execução da consulta. O tipo de enclave é '{0}' e enclaveAttestationUrl é '{1}'.
ru: Внутренняя ошибка. Сеанс анклава равен NULL во время выполнения запроса. Тип анклава — "{0}", а enclaveAttestationUrl — "{1}".
zh_hans: 出现内部错误。在查询执行期间 enclave 会话为 null。Enclave 类型为“{0}”，enclaveAttestationUrl 为“{1}”。
zh_hant: 內部錯誤。查詢執行期間，enclave 工作階段為 null。Enclave 類型為 '{0}'，enclave 證明 URL 為 '{1}'。

# TCE_NullEnclavePackageForEnclaveBasedQuery
source: Internal Error. Enclave package is null during execution of an enclave based query. Enclave type is '{0}' and enclaveAttestationUrl is '{1}'.
de: Interner Fehler. Das Enclave-Paket lautet während der Ausführung einer Enclave-basierten Abfrage NULL. Der Enclave-Typ ist "{0}", die enclaveAttestationUrl lautet {1}.
es: Error interno. El paquete de enclave es nulo durante la ejecución de una consulta basada en enclave. El tipo de enclave es "{0}" y enclaveAttestationUrl es "{1}".
fr: Erreur interne. Le package de l'enclave a une valeur null durant l'exécution d'une requête basée sur l'enclave. Le type d'enclave est '{0}' et enclaveAttestationUrl a la valeur '{1}'.
it: Errore interno. Il pacchetto dell'enclave è Null durante l'esecuzione di una query basata su enclave. Il tipo di enclave è '{0}' e l'URL di attestazione dell'enclave è '{1}'.
ja: 内部エラーです。エンクレーブに基づくクエリの実行中に、エンクレーブ パッケージが null です。エンクレーブ型は '{0}' で、enclaveAttestationUrl は '{1}' です。
ko: 내부 오류가 발생했습니다. enclave 기반 쿼리 실행 중 enclave 패키지가 null입니다. enclave 형식은 '{0}'이고 enclaveAttestationUrl은 '{1}'입니다.
pt_br: Erro Interno. O pacote de enclave é nulo durante a execução de uma consulta com base em enclave. O tipo de enclave é '{0}' e enclaveAttestationUrl é '{1}'.
ru: Внутренняя ошибка. Пакет анклава равен NULL во время выполнения запроса на основе анклава. Тип анклава — "{0}", а enclaveAttestationUrl — "{1}".
zh_hans: 出现内部错误。在执行基于 enclave 的查询期间，enclave 包为 null。Enclave 类型为“{0}”，enclaveAttestationUrl 为“{1}”。
zh_hant: 內部錯誤。執行 enclave 類型的查詢期間，enclave 套件為 null。enclave 類型為 '{0}'，enclave 證明 URL 為 '{1}'。

# TCE_AttestationInfoNotReturnedFromSQLServer
source: Attestation information was not returned by SQL Server. Enclave type is '{0}' and enclave attestation URL is '{1}'.
de: Von SQL Server wurden keine Nachweisinformationen zurückgegeben. Der Enclave-Typ ist "{0}", die Enclave-Nachweis-URL lautet {1}.
es: SQL Server no devolvió información de atestación. El tipo de enclave es "{0}" y la dirección URL de la atestación de enclave es "{1}".
fr: Les informations d'attestation n'ont pas été retournées par SQL Server. Le type d'enclave est '{0}' et l'URL d'attestation d'enclave est '{1}'.
it: SQL Server non ha restituito le informazioni sull'attestazione. Il tipo di enclave è '{0}' e l'URL di attestazione dell'enclave è '{1}'.
ja: 構成証明情報が SQL Server によって返されませんでした。エンクレーブ型は '{0}' で、エンクレーブ構成証明 URL は '{1}' です。
ko: SQL Server에서 증명 정보를 반환하지 않았습니다. enclave 형식은 '{0}'이고 enclave 증명 URL은 '{1}'입니다.
pt_br: As informações de atestado não foram retornadas pelo SQL Server. O tipo de enclave é '{0}' e a URL do atestado de enclave é '{1}'.
ru: SQL Server не вернул сведения об аттестации. Тип анклава — "{0}", а URL-адрес аттестации анклава — "{1}".
zh_hans: SQL Server 未返回证明信息。Enclave 类型为“{0}”，enclave 证明 URL 为“{1}”。
zh_hant: SQL Server 未傳回證明資訊。enclave 類型為 '{0}'，enclave 證明 URL 為 '{1}'。

# TCE_UnableToEstablishSecureChannel
source: Unable to establish secure channel. Error Message: {0}
de: Es kann kein sicherer Kanal eingerichtet werden. Fehlermeldung: {0}
es: No se puede establecer un canal seguro. Mensaje de error: {0}
fr: Impossible d'établir un canal sécurisé. Message d'erreur : {0}
it: Non è possibile stabilire il canale sicuro. Messaggio di errore: {0}
ja: セキュリティで保護されたチャネルを確立できませんでした。エラー メッセージ: {0}
ko: 보안 채널을 설정할 수 없습니다. 오류 메시지: {0}
pt_br: Não é possível estabelecer um canal seguro. Mensagem de Erro: {0}
ru: Не удается установить безопасный канал. Сообщение об ошибке: {0}
zh_hans: 无法建立安全通道。错误消息: {0}
zh_hant: 無法建立安全通道。錯誤訊息: {0}

# TCE_NullArgumentInConstructorInternal
source: Internal Error. Null argument '{0}' specified when constructing an object of type '{1}'. '{0}' cannot be null.
de: Interner Fehler. NULL-Argument "{0}" beim Erstellen eines Objekts vom Typ "{1}" angegeben. "{0}" darf nicht NULL sein.
es: Error interno. Se especificó un argumento nulo "{0}" al construir un objeto de tipo "{1}". "{0}" no puede ser nulo.
fr: Erreur interne. L'argument '{0}' de valeur Null spécifié durant la construction d'un objet de type '{1}' est vide. '{0}' ne peut pas avoir la valeur null.
it: Errore interno. È stato specificato un argomento '{0}' Null durante la costruzione di un oggetto di tipo '{1}'. '{0}' non può essere Null.
ja: 内部エラーです。型 '{1}' のオブジェクトを構築するときに null の引数 '{0}' が指定されました。'{0}' を null にすることはできません。
ko: 내부 오류가 발생했습니다. '{1}' 형식의 개체를 생성할 때 빈 null 인수 '{0}'이(가) 지정되었습니다. '{0}'은(는) null일 수 없습니다.
pt_br: Erro Interno. Argumento {0} nulo especificado ao construir um objeto do tipo '{1}'. '{0}' não pode ser nulo.
ru: Внутренняя ошибка. При создании объекта типа "{1}" указан аргумент, равный NULL: "{0}". "{0}" не может быть равен NULL.
zh_hans: 出现内部错误。构造类型“{1}”的对象时指定了 null 参数“{0}”。“{0}”不能为 null。
zh_hant: 內部錯誤。建構類型為 '{1}' 的物件時，指定了 null 引數 '{0}'，但 '{0}' 不得為 null。

# TCE_EmptyArgumentInConstructorInternal
source: Internal Error. Empty argument '{0}' specified when constructing an object of type '{1}'. '{0}' cannot be empty.
de: Interner Fehler. Leeres Argument "{0}" beim Erstellen eines Objekts vom Typ "{1}" angegeben. "{0}" darf nicht leer sein.
es: Error interno. Se especificó un argumento "{0}" vacío al crear un objeto de tipo "{1}". "{0}" no puede estar vacío.
fr: Erreur interne. L'argument '{0}' spécifié durant la construction d'un objet de type '{1}' est vide. '{0}' ne peut pas être vide.
it: Errore interno. È stato specificato un argomento '{0}' vuoto durante la costruzione di un oggetto di tipo '{1}'. '{0}' non può essere vuoto.
ja: 内部エラーです。'{1}' 型のオブジェクトを構築するときに指定された引数 '{0}' が空です。'{0}' を空にすることはできません。
ko: 내부 오류가 발생했습니다. '{1}' 형식의 개체를 생성할 때 빈 인수 '{0}'이(가) 지정되었습니다. '{0}'은(는) 비워둘 수 없습니다.
pt_br: Erro Interno. Argumento '{0}' vazio especificado ao construir um objeto do tipo '{1}'. '{0}' não pode estar vazio.
ru: Внутренняя ошибка. Указан пустой аргумент "{0}" при создании объекта типа "{1}". "{0}" не может быть пустым.
zh_hans: 出现内部错误。构造“{1}”类型的对象时指定了空参数“{0}”。“{0}”不能为空。
zh_hant: 內部錯誤。建構類型為 '{1}' 的物件時，指定了空白引數 '{0}'，但 '{0}' 不得為空白。

# TCE_NullArgumentInternal
source: Internal Error. Argument '{0}' cannot be null when executing method '{1}.{2}'.
de: Interner Fehler. Das Argument "{0}" darf beim Ausführen der Methode "{1}.{2}" nicht NULL sein.
es: Error interno. El argumento "{0}" no puede ser nulo al ejecutar el método "{1}. {2}".
fr: Erreur interne. L'argument '{0}' ne peut pas avoir une valeur null durant l'exécution de la méthode '{1}.{2}'.
it: Errore interno. L'argomento '{0}' non può essere Null durante l'esecuzione del metodo '{1}.{2}'.
ja: 内部エラーです。メソッド '{1}.{2}' を実行するときに引数 '{0}' を null にすることはできません。
ko: 내부 오류가 발생했습니다. '{1}.{2}' 메서드를 실행할 때 인수 '{0}'은(는) null일 수 없습니다.
pt_br: Erro Interno. O argumento '{0}' não pode ser nulo ao executar o método '{1}.{2}'.
ru: Внутренняя ошибка. Аргумент "{0}" не может быть равен NULL при выполнении метода "{1}.{2}".
zh_hans: 出现内部错误。执行方法“{1}.{2}”时参数“{0}”不能为 null。
zh_hant: 內部錯誤。執行方法 '{1}.{2}' 時，引數 '{0}' 不得為 null。

# TCE_EmptyArgumentInternal
source: Internal Error. Argument '{0}' cannot be empty when executing method '{1}.{2}'.
de: Interner Fehler. Das Argument "{0}" darf beim Ausführen der Methode "{1}.{2}" nicht leer sein.
es: Error interno. El argumento "{0}" no puede estar vacío cuando se ejecuta el método "{1}.{2}".
fr: Erreur interne. L'argument '{0}' ne peut pas être vide durant l'exécution de la méthode '{1}.{2}'.
it: Errore interno. L'argomento '{0}' non può essere vuoto durante l'esecuzione del metodo '{1}.{2}'.
ja: 内部エラーです。メソッド '{1}.{2}' を実行するとき、引数 '{0}' を空にすることはできません。
ko: 내부 오류가 발생했습니다. '{1}.{2}' 메서드를 실행할 때 인수 '{0}'을(를) 비워둘 수 없습니다.
pt_br: Erro Interno. O argumento '{0}' não pode estar vazio ao executar o método '{1}.{2}'.
ru: Внутренняя ошибка. Аргумент "{0}" не может быть пустым при выполнении метода "{1}.{2}".
zh_hans: 出现内部错误。执行方法“{1}.{2}”时参数“{0}”不能为空。
zh_hant: 內部錯誤。執行方法 '{1}.{2}' 時，引數 '{0}' 不得為空白。

# TCE_DbConnectionString_EnclaveAttestationUrl
source: Specifies an endpoint of an enclave attestation service, which will be used to verify whether the enclave, configured in the SQL Server instance for computations on database columns encrypted using Always Encrypted, is valid and secure.
de: Hiermit wird ein Endpunkt für einen Enclave-Nachweisdienst angegeben. Mit diesem wird die Gültigkeit und Sicherheit des in der SQL Server-Instanz konfigurierten Enclave-Anbieters überprüft, der für Berechnungen in Always Encrypted-verschlüsselten Datenbankspalten verwendet wird.
es: Especifica un punto de conexión de un servicio de atestación de enclave, que se utilizará para comprobar si el enclave, configurado en la instancia de SQL Server para cálculos en columnas de base de datos que se cifran mediante Always Encrypted, es válido y seguro.
fr: Spécifie le point de terminaison d'un service d'attestation d'enclave pour vérifier si l'enclave, configurée dans l'instance SQL Server pour les calculs des colonnes de base de données chiffrées via Always Encrypted, est valide et sécurisée.
it: Specifica un endpoint di un servizio di attestazione enclave che verrà usato per verificare se l'enclave, configurato nell'istanza di SQL Server per i calcoli su colonne di database crittografate con Always Encrypted, è valido e sicuro.
ja: エンクレーブ構成証明サービスのエンドポイントを指定します。このエンドポイントは、Always Encrypted を使用して暗号化されたデータベース列に対する計算のために SQL Server インスタンス内で構成されたエンクレーブが有効であり、セキュリティで保護されているかどうかを確認するために使用されます。
ko: Always Encrypted를 사용하여 암호화된 데이터베이스 열의 계산에 대해 SQL Server 인스턴스에 구성된 elclave가 유효하고 안전한지를 확인하는 데 사용할 enclave 증명 서비스의 끝점을 지정합니다.
pt_br: Especifica um ponto de extremidade de um serviço de atestação de enclave, que será usado para verificar se o enclave, configurado na instância do SQL Server para cálculos em colunas de banco de dados criptografados usando Always Encrypted, é válido e seguro.
ru: Указывает конечную точку службы аттестации анклава, которая будет использоваться для проверки того, допустим и безопасен ли анклав, настроенный в экземпляре SQL Server для вычислений в столбцах базы данных, зашифрованных с помощью постоянного шифрования.
zh_hans: 指定 enclave 证明服务的终结点，以用于验证在 SQL Server 实例中配置的用于在使用“始终加密”加密的数据库列上执行计算的 enclave 是否安全有效。
zh_hant: 請指定 enclave 證明服務的端點，供驗證 SQL Server 執行個體中，為使用 Always Encrypted 加密之資料庫資料行計算而設定的 enclave 是否安全有效之用。

# TCE_CannotGetSqlColumnEncryptionEnclaveProviderConfig
source: Failed to read the configuration section for enclave providers. Make sure the section is correctly formatted in your application configuration file. Error Message: {0}
de: Fehler beim Lesen des Konfigurationsabschnitts für Enclave-Anbieter. Stellen Sie sicher, dass der Abschnitt in Ihrer Anwendungskonfigurationsdatei ordnungsgemäß formatiert ist. Fehlermeldung: {0}
es: Error al leer la sección de configuración para los proveedores de enclave. Asegúrese de que la sección tiene el formato correcto en el archivo de configuración de la aplicación. Mensaje de error: {0}
fr: Échec de lecture de la section de configuration des fournisseurs d'enclaves. Vérifiez que la section est correctement mise en forme dans le fichier de configuration de votre application. Message d'erreur : {0}
it: Non è stato possibile leggere la sezione di configurazione per i provider di enclave. Assicurarsi che la sezione sia formattata correttamente nel file di configurazione dell'applicazione. Messaggio di errore: {0}
ja: エンクレーブ プロバイダーの構成セクションを読み取れませんでした。アプリケーション構成ファイルに含まれるそのセクションの形式が正しいことを確認してください。エラー メッセージ: {0}
ko: enclave 공급자의 구성 섹션을 읽지 못했습니다. 섹션이 응용 프로그램 구성 파일에 올바르게 형식이 지정되어 있는지 확인하세요. 오류 메시지: {0}
pt_br: Falha ao ler a seção de configuração para provedores de enclave. Verifique se que a seção está formatada corretamente no seu arquivo de configuração de aplicativo. Mensagem de Erro: {0}
ru: Не удалось прочитать раздел конфигурации для поставщиков анклава. Убедитесь, что раздел правильно отформатирован в файле конфигурации приложения. Сообщение об ошибке: {0}
zh_hans: 未能读取 enclave 提供程序的配置节。请确保该节在应用程序配置文件中的格式正确。错误消息: {0}
zh_hant: 無法讀取 enclave 提供者的組態區段。請確定您應用程式組態檔中的區段格式正確。錯誤訊息: {0}
