Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_InvalidCspPath
source: Invalid column master key path: '{0}'. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{1}<Key Identifier>.
de: Ungültiger Schlüsselbezeichner im Masterschlüsselpfad der Spalte: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter (Cryptographic Service Provider, Kryptografiedienstanbieter) gespeicherten Schlüssel: <CSP-Anbietername>{1}<Schlüsselbezeichner>.
es: Ruta de la clave maestra de la columna '{0}' no válida. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{1}<Identificador clave>.
fr: Le chemin d'accès de la clé principale de la colonne '{0}' n'est pas valide. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement>{1}<Identificateur de clé>.
it: Il percorso della chiave master di colonna non è valido: '{0}'. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{1}<identificatore chiave>.
ja: 列マスター キーのパス: '{0}' が無効です。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{1}<キー識別子>。
ko: 열 마스터 키 경로 '{0}'이(가) 잘못되었습니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Caminho de chave mestra da coluna inválido: '{0}'. Use o formato a seguir para uma chave armazenada em um CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CSP>{1}<Identificador de Chave>.
ru: Недопустимый путь к главному ключу столбца: "{0}". Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CSP>{1}<идентификатор ключа>.
zh_hans: 无效的列主密钥路径:“{0}”。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{1}<密钥标识符>。
zh_hant: 資料行主要金鑰路徑 '{0}' 無效。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{1}<金鑰識別碼>。

# TCE_InvalidCspPathSysErr
source: Internal error. Invalid column master key path: '{0}'. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{1}<Key Identifier>.
de: Interner Fehler. Ungültiger Schlüsselbezeichner im Masterschlüsselpfad der Spalte: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter (Cryptographic Service Provider, Kryptografiedienstanbieter) gespeicherten Schlüssel: <CSP-Anbietername>{1}<Schlüsselbezeichner>.
es: Error interno. Ruta de la clave maestra de la columna '{0}' no válida. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{1}<Identificador clave>.
fr: Erreur interne. Le chemin d'accès de la clé principale de la colonne '{0}' n'est pas valide. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement>{1}<Identificateur de clé>.
it: Errore interno. Il percorso della chiave master di colonna non è valido: '{0}'. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{1}<identificatore chiave>.
ja: 内部エラー。列マスター キーのパス: '{0}' が無効です。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{1}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로 '{0}'이(가) 잘못되었습니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. Caminho de chave mestra da coluna inválido: '{0}'. Use o formato a seguir para uma chave armazenada em um CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CSP>{1}<Identificador de Chave>.
ru: Внутренняя ошибка. Недопустимый путь к главному ключу столбца: "{0}". Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CSP>{1}<идентификатор ключа>.
zh_hans: 内部错误。无效的列主密钥路径:“{0}”。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{1}<密钥标识符>。
zh_hant: 內部錯誤。資料行主要金鑰路徑 '{0}' 無效。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{1}<金鑰識別碼>。

# TCE_InvalidCngPath
source: Invalid column master key path: '{0}'. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{1}<Key Identifier>.
de: Ungültiger Masterschlüsselpfad der Spalte: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{1}<Schlüsselbezeichner>.
es: Ruta de la clave maestra de la columna '{0}' no válida. Use el siguiente formato para una clave almacenada en un proveedor de Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{1}<Identificador clave>.
fr: Le chemin d'accès de la clé principale de la colonne '{0}' n'est pas valide. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{1}<Identificateur de clé>.
it: Il percorso della chiave master di colonna non è valido: '{0}'. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{1}<identificatore chiave>.
ja: 列マスター キーのパス: '{0}' が無効です。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{1}<キー識別子>。
ko: 열 마스터 키 경로 '{0}'이(가) 잘못되었습니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Caminho inválido de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada em um provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{1}<Identificador de Chave>.
ru: Недопустимый путь к главному ключу столбца: "{0}". Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{1}<идентификатор ключа>.
zh_hans: 无效的列主密钥路径:“{0}”。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{1}<密钥标识符>。
zh_hant: 資料行主要金鑰路徑 '{0}' 無效。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{1}<金鑰識別碼>。

# TCE_InvalidCngPathSysErr
source: Internal error. Invalid column master key path: '{0}'. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{1}<Key Identifier>.
de: Interner Fehler. Ungültiger Masterschlüsselpfad der Spalte: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{1}<Schlüsselbezeichner>.
es: Error interno. Ruta de la clave maestra de la columna '{0}' no válida. Use el siguiente formato para una clave almacenada en un proveedor de Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{1}<Identificador clave>.
fr: Erreur interne. Le chemin d'accès de la clé principale de la colonne '{0}' n'est pas valide. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{1}<Identificateur de clé>.
it: Errore interno. Il percorso della chiave master di colonna non è valido: '{0}'. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{1}<identificatore chiave>.
ja: 内部エラー。列マスター キーのパス: '{0}' が無効です。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{1}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로 '{0}'이(가) 잘못되었습니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. Caminho inválido de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada em um provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{1}<Identificador de Chave>.
ru: Внутренняя ошибка. Недопустимый путь к главному ключу столбца: "{0}". Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{1}<идентификатор ключа>.
zh_hans: 内部错误。无效的列主密钥路径:“{0}”。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{1}<密钥标识符>。
zh_hant: 內部錯誤。資料行主要金鑰路徑 '{0}' 無效。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{1}<金鑰識別碼>。

# TCE_InvalidCertificateLocation
source: Invalid certificate location '{0}' in certificate path '{1}'. Use the following format: <certificate location>{4}<certificate store>{4}<certificate thumbprint>, where <certificate location> is either '{2}' or '{3}'.
de: Ungültiger Zertifikatspeicherort '{0}' im Zertifikatpfad '{1}'. Verwenden Sie das folgende Format: <Zertifikatspeicherort>{4}<Zertifikatspeicher>{4}<Zertifikatfingerabdruck>, wobei <Zertifikatspeicherort> entweder '{2}' oder '{3}' ist.
es: Ubicación de certificado no válida "{0}" en la ruta de certificado "{1}". Use el siguiente formato: <ubicación de certificado>{4}<almacén de certificados>{4}<huella digital de certificado>, donde <ubicación de certificado> es "{2}" o "{3}".
fr: L’emplacement de certificat « {0} » dans le chemin d’accès de certificat « {1} » n’est pas valide. Utilisez le format suivant : <emplacement de certificat>{4}<magasin de certificats>{4}<empreinte de certificat>, où <emplacement de certificat> a la valeur « {2} » ou « {3} ».
it: La posizione del certificato '{0}' non è valida nel percorso certificato '{1}'. Usare il formato seguente: <posizione certificato>{4}<archivio certificati>{4}<identificazione personale certificato>, dove <posizione certificato> è '{2}' o '{3}'.
ja: 証明書パス '{1}' の証明書の場所 '{0}' が無効です。次の形式を使用してください: <certificate location>{4}<certificate store>{4}<certificate thumbprint>。ここで <certificate location> は '{2}' または '{3}' のいずれかです。
ko: 인증서 경로 '{1}'의 인증서 위치 '{0}'이(가) 잘못되었습니다. <certificate location>{4}<certificate store>{4}<certificate thumbprint> 형식을 사용하세요. 여기서 <certificate location>은 '{2}' 또는 '{3}'입니다.
pt_br: Local do certificado inválido '{0}' no caminho do certificado '{1}'. Use o seguinte formato: <local do certificado>{4}<repositório de certificados>{4}<impressão digital do certificado>, em que <local do certificado> é '{2}' ou '{3}'.
ru: Недействительное расположение сертификата "{0}" в пути к сертификату "{1}". Используйте следующий формат: <расположение_сертификата>{4}<хранилище_сертификатов>{4}<отпечаток_сертификата>, где <расположение_сертификата> имеет значение {2} или {3}.
zh_hans: 证书路径“{1}”中的证书位置“{0}”无效。使用以下格式: <证书位置>{4}<证书存储库>{4}<证书指纹>，其中 <证书位置> 是“{2}”或“{3}”。
zh_hant: 憑證路徑 '{1}' 中的憑證位置 '{0}' 無效。請使用下列格式: <憑證位置>{4}<憑證存放區>{4}<憑證指紋>，其中 <憑證位置> 為 '{2}' 或 '{3}'。

# TCE_InvalidCertificateLocationSysErr
source: Internal error. Invalid certificate location '{0}' in certificate path '{1}'. Use the following format: <certificate location>{4}<certificate store>{4}<certificate thumbprint>, where <certificate location> is either '{2}' or '{3}'.
de: Interner Fehler. Ungültiger Zertifikatspeicherort '{0}' im Zertifikatpfad '{1}'. Verwenden Sie das folgende Format: <Zertifikatspeicherort>{4}<Zertifikatspeicher>{4}<Zertifikatfingerabdruck>, wobei <Zertifikatspeicherort> entweder '{2}' oder '{3}' ist.
es: Error interno. Ubicación de certificado no válida "{0}" en la ruta de certificado "{1}". Use el siguiente formato: <ubicación de certificado>{4}<almacén de certificados>{4}<huella digital de certificado>, donde <ubicación de certificado> es "{2}" o "{3}".
fr: Erreur interne. L’emplacement de certificat « {0} » dans le chemin d’accès de certificat « {1} » n’est pas valide. Utilisez le format suivant : <emplacement de certificat>{4}<magasin de certificats>{4}<empreinte de certificat>, où <emplacement de certificat> a la valeur « {2} » ou « {3} ».
it: Errore interno. La posizione del certificato '{0}' non è valida nel percorso certificato '{1}'. Usare il formato seguente: <posizione certificato>{4}<archivio certificati>{4}<identificazione personale certificato>, dove <posizione certificato> è '{2}' o '{3}'.
ja: 内部エラー。証明書パス '{1}' の証明書の場所 '{0}' が無効です。次の形式を使用してください: <certificate location>{4}<certificate store>{4}<certificate thumbprint>。ここで <certificate location> は '{2}' または '{3}' のいずれかです。
ko: 내부 오류입니다. 인증서 경로 '{1}'의 인증서 위치 '{0}'이(가) 잘못되었습니다. <certificate location>{4}<certificate store>{4}<certificate thumbprint> 형식을 사용하세요. 여기서 <certificate location>은 '{2}' 또는 '{3}'입니다.
pt_br: Erro interno. Local do certificado inválido '{0}' no caminho do certificado '{1}'. Use o seguinte formato: <local do certificado>{4}<repositório de certificados>{4}<impressão digital do certificado>, em que <local do certificado> é '{2}' ou '{3}'.
ru: Внутренняя ошибка. Недействительное расположение сертификата "{0}" в пути к сертификату "{1}". Используйте следующий формат: <расположение_сертификата>{4}<хранилище_сертификатов>{4}<отпечаток_сертификата>, где <расположение_сертификата> имеет значение {2} или {3}.
zh_hans: 内部错误。证书路径“{1}”中的证书位置“{0}”无效。使用以下格式: <证书位置>{4}<证书存储>{4}<证书指纹>，其中 <证书位置> 是“{2}”或“{3}”。
zh_hant: 內部錯誤。憑證路徑 '{1}' 中的憑證位置 '{0}' 無效。請使用下列格式: <憑證位置>{4}<憑證存放區>{4}<憑證指紋>，其中 <憑證位置> 為 '{2}' 或 '{3}'。

# TCE_InvalidCertificateStore
source: Invalid certificate store '{0}' specified in certificate path '{1}'. Expected value: '{2}'.
de: Ungültiger Zertifikatspeicher '{0}' im Zertifikatpfad '{1}'. Erwarteter Wert: '{2}'.
es: Se ha especificado un almacén de certificados "{0}" no válido en la ruta de certificado "{1}". Valor esperado: "{2}".
fr: Le magasin de certificats « {0} » spécifié dans le chemin d’accès de certificat « {1} » n’est pas valide. Valeur attendue : « {2} ».
it: L'archivio certificati '{0}' specificato nel percorso certificato '{1}' non è valido. Valore previsto: '{2}'.
ja: 証明書パス '{1}' で指定された証明書ストア '{0}' が無効です。予期されている値は '{2}' です。
ko: 인증서 경로 '{1}'에 지정된 인증서 저장소 '{0}'이(가) 잘못되었습니다. 필요한 값은 '{2}'입니다.
pt_br: Repositório de certificados inválido '{0}' especificado no caminho do certificado '{1}'. Valor esperado: '{2}'.
ru: В пути к сертификату "{1}" указано недействительное хранилище сертификатов "{0}". Ожидается значение "{2}".
zh_hans: 证书路径“{1}”中指定的证书存储库“{0}”无效。应为: {2}。
zh_hant: 憑證路徑 '{1}' 中指定了的憑證存放區 '{0}' 無效。預期值: '{2}'。

# TCE_InvalidCertificateStoreSysErr
source: Internal error. Invalid certificate store '{0}' specified in certificate path '{1}'. Expected value: '{2}'.
de: Interner Fehler. Ungültiger Zertifikatspeicher '{0}' im Zertifikatpfad '{1}'. Erwarteter Wert: '{2}'.
es: Error interno. Se ha especificado un almacén de certificados "{0}" no válido en la ruta de certificado "{1}". Valor esperado: "{2}".
fr: Erreur interne. Le magasin de certificats « {0} » spécifié dans le chemin d’accès de certificat « {1} » n’est pas valide. Valeur attendue : « {2} ».
it: Errore interno. L'archivio certificati '{0}' specificato nel percorso certificato '{1}' non è valido. Valore previsto: '{2}'.
ja: 内部エラー。証明書パス '{1}' で指定されている証明書ストア '{0}' が無効です。想定される値は '{2}' です。
ko: 내부 오류입니다. 인증서 경로 '{1}'에 지정된 인증서 저장소 '{0}'이(가) 잘못되었습니다. 필요한 값은 '{2}'입니다.
pt_br: Erro interno. Repositório de certificados inválido '{0}' especificado no caminho do certificado '{1}'. Valor esperado: '{2}'.
ru: Внутренняя ошибка. В пути к сертификату "{1}" указано недействительное хранилище сертификатов "{0}". Ожидается значение "{2}".
zh_hans: 内部错误。证书路径“{1}”中指定的证书存储库“{0}”无效。应为: {2}。
zh_hant: 內部錯誤。憑證路徑 '{1}' 中指定的憑證存放區 '{0}' 無效。預期值: '{2}'。

# TCE_EmptyCertificateThumbprint
source: Empty certificate thumbprint specified in certificate path '{0}'.
de: Leerer Zertifikatfingerabdruck im Zertifikatpfad '{0}' festgelegt.
es: Huella digital de certificado vacío especificado en la ruta de certificado "{0}".
fr: L’empreinte numérique de certificat spécifiée dans le chemin d’accès au certificat « {0} » est vide.
it: Nel percorso certificato '{0}' è stata specificata un'identificazione personale vuota per il certificato.
ja: 証明書パス '{0}' で指定された証明書の拇印が空です。
ko: 인증서 경로 '{0}'에서 빈 인증서 지문이 지정되었습니다.
pt_br: Impressão digital de certificado vazia especificada no caminho do certificado '{0}'.
ru: В пути к сертификату "{0}" указан пустой отпечаток сертификата.
zh_hans: 证书路径“{0}”中指定了空的证书指纹。
zh_hant: 憑證路徑 '{0}' 中指定了空白的憑證指紋。

# TCE_EmptyCertificateThumbprintSysErr
source: Internal error. Empty certificate thumbprint specified in certificate path '{0}'.
de: Interner Fehler. Leerer Zertifikatfingerabdruck im Zertifikatpfad '{0}' festgelegt.
es: Error interno. Huella digital de certificado vacío especificado en la ruta de certificado "{0}".
fr: Erreur interne. L’empreinte numérique de certificat spécifiée dans le chemin d’accès au certificat « {0} » est vide.
it: Errore interno. Nel percorso certificato '{0}' è stata specificata un'identificazione personale vuota per il certificato.
ja: 内部エラー。証明書パス '{0}' で指定された証明書の拇印が空です。
ko: 내부 오류입니다. 인증서 경로 '{0}'에서 빈 인증서 지문이 지정되었습니다.
pt_br: Erro interno. A impressão digital do certificado vazio especificado no caminho do certificado '{0}'.
ru: Внутренняя ошибка. В пути к сертификату "{0}" указан пустой отпечаток сертификата.
zh_hans: 内部错误。证书路径“{0}”中指定了空的证书指纹。
zh_hant: 內部錯誤。憑證路徑 '{0}' 中指定了空白的憑證指紋。

# TCE_EmptyCspName
source: Empty Microsoft cryptographic service provider (CSP) name specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{1}<Key Identifier>.
de: Es wurde ein leerer Microsoft CSP-Name (Cryptographic Service Provider, Kryptografiedienstanbieter) im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter gespeicherten Schlüssel: <CSP-Anbietername>{1}<Schlüsselbezeichner>.
es: Se especificó un nombre de proveedor de servicios criptográficos de Microsoft (CSP) vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{1}<Identificador clave>.
fr: Le nom du fournisseur de service de chiffrement Microsoft spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement>{1}<Identificateur de clé>.
it: Nel percorso della chiave master di colonna è stato specificato un nome di provider del servizio di crittografia Microsoft (CSP) vuoto: '{0}'. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{1}<identificatore chiave>.
ja: 空の Microsoft 暗号化サービス プロバイダー (CSP) 名が列マスター キーのパス: '{0}' で指定されています。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{1}<キー識別子>。
ko: 열 마스터 키 경로 '{0}'에 빈 Microsoft CSP(암호화 서비스 공급자) 이름이 지정되었습니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Nome vazio do CSP (Provedor de Serviços de Criptografia) da Microsoft especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada no provedor de CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CSP>{1}<Identificador de Chave>.
ru: Указано пустое имя поставщика служб шифрования Microsoft (CSP) в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CSP>{1}<идентификатор ключа>.
zh_hans: 列主密钥路径 {0} 中指定的 Microsoft 加密服务提供程序(CSP)名称为空。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{1}<密钥标识符>。
zh_hant: 在資料行主要金鑰路徑 '{0}' 中指定了空白的 Microsoft 密碼編譯服務提供者 (CSP) 名稱。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{1}<金鑰識別碼>。

# TCE_EmptyCspNameSysErr
source: Internal error. Empty Microsoft cryptographic service provider (CSP) name specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{1}<Key Identifier>.
de: Interner Fehler. Es wurde ein leerer Microsoft CSP-Name (Cryptographic Service Provider, Kryptografiedienstanbieter) im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter gespeicherten Schlüssel: <CSP-Anbietername>{1}<Schlüsselbezeichner>.
es: Error interno. Se especificó un nombre de proveedor de servicios criptográficos (CSP) de Microsoft vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{1}<Identificador clave>.
fr: Erreur interne. Le nom du fournisseur de service de chiffrement Microsoft spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement Microsoft>{1}<Identificateur de clé>.
it: Errore interno. Nel percorso della chiave master di colonna è stato specificato un nome di provider del servizio di crittografia Microsoft (CSP) vuoto: '{0}'. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{1}<identificatore chiave>.
ja: 内部エラー。空の Microsoft 暗号化サービス プロバイダー (CSP) 名が列マスター キーのパス: '{0}' で指定されています。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{1}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로 '{0}'에 빈 Microsoft CSP(암호화 서비스 공급자) 이름이 지정되었습니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. Nome vazio do CSP (Provedor de Serviços de Criptografia) da Microsoft especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada no provedor de CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CSP>{1}<Identificador de Chave>.
ru: Внутренняя ошибка. Указано пустое имя поставщика служб шифрования Microsoft (CSP) в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CSP>{1}<идентификатор ключа>.
zh_hans: 内部错误。列主密钥路径 {0} 中指定的 Microsoft 加密服务提供程序(CSP)名称为空。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{1}<密钥标识符>。
zh_hant: 內部錯誤。在資料行主要金鑰路徑 '{0}' 中指定了空白的 Microsoft 密碼編譯服務提供者 (CSP) 名稱。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{1}<金鑰識別碼>。
