Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# Xml_PolymorphismNotSupported
source: Type '{0}' does not implement IXmlSerializable interface therefore can not proceed with serialization.
de: Der Typ '{0}' implementiert nicht die IXmlSerializable-Schnittstelle, weshalb die Serialisierung nicht fortgesetzt werden kann.
es: El tipo '{0}' no implementa la interfaz IXmlSerializable, por lo que no puede continuar la serialización.
fr: Le type '{0}' n'implémente pas l'interface IXmlSerializable. Par conséquent, la sérialisation ne peut pas se poursuivre.
it: Il tipo '{0}' non implementa l'interfaccia IXmlSerializable, pertanto non può procedere con la serializzazione.
ja: 型 '{0}' は IXmlSerializable インターフェイスを実装しないため、シリアル化を実行できません。
ko: 유형 '{0}'은(는) IXmlSerializable 인터페이스를 구현하지 않으므로 serialization을 계속할 수 없습니다.
pt_br: O tipo '{0}' não implementa a interface IXmlSerializable e, portanto, não pode continuar com a serialização.
ru: Тип "{0}" не содержит реализации интерфейса IXmlSerializable; невозможно продолжить сериализацию.
zh_hans: 类型“{0}”未实现 IXmlSerializable 接口，因此不能继续序列化。
zh_hant: 型別 '{0}' 未實作 IXmlSerializable 介面，因此無法繼續序列化。

# Xml_CanNotDeserializeObjectType
source: Unable to proceed with deserialization. Data does not implement IXMLSerializable, therefore polymorphism is not supported.
de: Deserialisierung kann nicht fortgesetzt werden. Die Daten implementieren nicht IXMLSerializable, weshalb keine Polymorphie unterstützt wird.
es: No se puede continuar con la deserialización. El dato no implementa IXMLSerializable, por lo que no se admite el polimorfismo.
fr: Impossible de poursuivre la désérialisation. Les données n'implémentent pas IXMLSerializable. Par conséquent, le polymorphisme n'est pas pris en charge.
it: Non è possibile continuare con la deserializzazione. I dati non implementano IXMLSerializable, pertanto il polimorfismo non è supportato.
ja: シリアル化解除を実行できません。Data は IXMLSerializable を実装しないため、多態性はサポートされません。
ko: Deserialization을 계속할 수 없습니다. 데이터가 IXMLSerializable을 구현하지 않으므로 다형성이 지원되지 않습니다.
pt_br: Não é possível continuar com a desserialização. Os dados não implementam IXMLSerializable e, portanto, não há suporte para polimorfismo.
ru: Продолжить десериализацию невозможно. Поскольку данные не содержат реализации IXMLSerializable, полиморфизм не поддерживается.
zh_hans: 无法处理反序列化。数据不实现 IXMLSerializable，因此不支持多态性。
zh_hant: 無法繼續還原序列化。資料未實作 IXMLSerializable，因此不支援多型。

# Xml_DataTableInferenceNotSupported
source: DataTable does not support schema inference from Xml.
de: DataTable unterstützt keine Schemadeduktion von Xml.
es: DataTable no es compatible con la inferencia de esquemas de Xml.
fr: DataTable ne prend pas en charge l'inférence de schéma de Xml.
it: DataTable non supporta l'inferenza di schema proveniente da Xml.
ja: DataTable は Xml のスキーマの推論をサポートしていません。
ko: DataTable은 Xml에서 스키마 유추를 지원하지 않습니다.
pt_br: DataTable não oferece suporte a inferência de esquema de Xml.
ru: DataTable не поддерживает выведение схемы из Xml.
zh_hans: DataTable 不支持来自 Xml 的架构推断。
zh_hant: DataTable 不支援來自 Xml 的結構描述介面。

# Xml_MultipleParentRows
source: Cannot proceed with serializing DataTable '{0}'. It contains a DataRow which has multiple parent rows on the same Foreign Key.
de: Serialisierung von DataTable '{0}' kann nicht fortgesetzt werden. Sie enthält eine DataRow, die mehrere übergeordnete Zeilen für denselben Fremdschlüssel enthält.
es: No se puede continuar con la serialización de DataTable '{0}'. Contiene una DataRow que tiene varias filas primarias en la misma clave externa.
fr: Impossible de poursuivre la sérialisation du DataTable '{0}'. Il contient un DataRow doté de plusieurs lignes parent au niveau de la même clé étrangère.
it: Impossibile continuare la serializzazione di DataTable "{0}" poiché contiene un DataRow con più righe padre nello stesso Foreign Key.
ja: DataTable '{0}' のシリアル化を実行できません。この DataTable には、同一の外部キーに複数の親行がある DataRow が含まれています。
ko: DataTable '{0}' serialization을 계속할 수 없습니다. 같은 외래 키에 여러 개의 부모 행이 있는 DataRow가 포함되어 있습니다.
pt_br: Não é possível continuar com a serialização de DataTable '{0}'. Ele contém um DataRow com várias linhas pai na mesma Chave Estrangeira.
ru: Невозможно продолжить сериализацию DataTable "{0}". Содержит DataRow, имеющую несколько родительских строк для одного внешнего ключа.
zh_hans: 无法继续序列化 DataTable“{0}”。它包含的 DataRow 在同一外键上有多项父行。
zh_hant: 無法繼續序列化 DataTable '{0}'。它包含在相同的 Foreign Key 上有多個父資料列的 DataRow。

# Xml_IsDataSetAttributeMissingInSchema
source: IsDataSet attribute is missing in input Schema.
de: Das 'IsDataSet'-Attribut fehlt im Eingabe-Schema.
es: Falta el atributo IsDataSet del Schema de entrada.
fr: L'attribut IsDataSet est manquant dans le Schema d'entrée.
it: Attributo IsDataSet assente nello Schema input.
ja: 入力 Schema 内に IsDataSet 属性がありません。
ko: IsDataSet 특성이 입력 Schema에 없습니다.
pt_br: O atributo IsDataSet é inexistente no Schema de entrada.
ru: Атрибут IsDataSet отсутствует во входной схеме Schema.
zh_hans: 输入 Schema 中缺少 IsDataSet 特性。
zh_hant: 輸入的 Schema 中遺漏了 IsDataSet 屬性。

# Xml_TooManyIsDataSetAtributeInSchema
source: Cannot determine the DataSet Element. IsDataSet attribute exist more than once.
de: Das 'DataSet'-Element kann nicht ermittelt werden. Das 'IsDataSet-Attribut ist mehrmals vorhanden.
es: No se puede determinar el elemento DataSet. El atributo IsDataSet existe más de una vez.
fr: Impossible de déterminer l'élément DataSet. L'attribut IsDataSet existe plusieurs fois.
it: Impossibile determinare il DataSet Element. l'attributo IsDataSet è presente più di una volta.
ja: DataSet Element を特定することができません。IsDataSet 属性が 1 つ以上存在しています。
ko: DataSet 요소를 확인할 수 없습니다. IsDataSet 특성이 둘 이상 있습니다.
pt_br: Não é possível determinar o DataSet Element. Há mais de um atributo IsDataSet.
ru: Не удается определить элемент DataSet. Атрибут IsDataSet присутствует несколько раз.
zh_hans: 无法确定 DataSet 元素。IsDataSet 特性存在多次。
zh_hant: 無法判斷 DataSet Element。IsDataSet 屬性出現多次。

# Xml_DynamicWithoutXmlSerializable
source: DataSet will not serialize types that implement IDynamicMetaObjectProvider but do not also implement IXmlSerializable.
de: Typen, die IDynamicMetaObjectProvider implementieren, aber nicht gleichzeitig IXmlSerializable implementieren, werden von DataSet nicht serialisiert.
es: DataSet no serializará tipos que implementen IDynamicMetaObjectProvider pero que no implemente IXmlSerializable.
fr: DataSet ne sérialise pas les types qui implémentent IDynamicMetaObjectProvider mais n'implémentent pas IXmlSerializable.
it: DataSet non serializzerà i tipi che implementano IDynamicMetaObjectProvider ma che non implementano anche IXmlSerializable.
ja: DataSet は、IDynamicMetaObjectProvider を実装して IXmlSerializable を実装しない型をシリアル化しません。
ko: 데이터 집합은 IDynamicMetaObjectProvider를 구현하면서 IXmlSerializable은 구현하지 않는 형식을 직렬화하지 않습니다.
pt_br: DataSet não irá serializar tipos que implementam IDynamicMetaObjectProvider mas também não implementam IXmlSerializable.
ru: DataSet не сериализует типы, в которых реализован интерфейс IDynamicMetaObjectProvider, но не реализован интерфейс IXmlSerializable.
zh_hans: DataSet 将不对实现 IDynamicMetaObjectProvider 但不实现 IXmlSerializable 的类型进行序列化。
zh_hant: DataSet 不會序列化實作 IDynamicMetaObjectProvider 但未同時實作 IXmlSerializable 的型別。

# Expr_NYI
source: The feature not implemented. {0}.
de: Diese Funktion ist nicht implementiert. {0}.
es: Característica sin implementar. {0}.
fr: La fonctionnalité n'est pas implémentée. {0}.
it: Funzionalità non implementata. {0}.
ja: 機能が実装されていません。{0}.
ko: 기능이 구현되지 않았습니다. {0}
pt_br: Recurso não implementado. {0}.
ru: Данная функциональная возможность не реализована. {0}.
zh_hans: 未实现此功能。 {0}。
zh_hant: 功能未實作。{0}。

# Expr_MissingOperand
source: Syntax error: Missing operand after '{0}' operator.
de: Syntaxfehler: Fehlender Operand nach dem Operator '{0}'.
es: Error de sintaxis: falta el operando después del operador '{0}'.
fr: Erreur de syntaxe : opérande manquant après l'opérateur '{0}'.
it: Errore di sintassi: operando mancante dopo l'operatore '{0}'.
ja: 構文エラー : '{0}' 演算子の後にオペランドがありません。
ko: 구문 오류: '{0}' 연산자 뒤에 피연산자가 없습니다.
pt_br: Erro de sintaxe: operando ausente depois do operador '{0}'.
ru: Синтаксическая ошибка: отсутствует операнд после оператора "{0}".
zh_hans: 语法错误:“{0}”运算符后缺少操作数。
zh_hant: 語法錯誤: '{0}' 運算子之後遺漏運算元。

# Expr_TypeMismatch
source: Type mismatch in expression '{0}'.
de: Typenkonflikt im Ausdruck '{0}'.
es: El tipo no coincide en la expresión '{0}'.
fr: Incompatibilité de type dans l'expression '{0}'.
it: Tipo non corrispondente nell'espressione '{0}'.
ja: 式 '{0}' に型の不一致があります。
ko: '{0}' 식의 형식이 일치하지 않습니다.
pt_br: Tipo incompatível na expressão '{0}'.
ru: Несоответствие типов в выражении "{0}".
zh_hans: 表达式“{0}”中类型不匹配。
zh_hant: 運算式 '{0}' 中類型不符。

# Expr_ExpressionTooComplex
source: Expression is too complex.
de: Der Ausdruck ist zu komplex.
es: Expresión demasiado compleja.
fr: Expression trop complexe.
it: Espressione troppo complessa.
ja: 式が複雑すぎます。
ko: 식이 너무 복잡합니다.
pt_br: Expressão muito complexa.
ru: Выражение слишком сложное.
zh_hans: 表达式太复杂。
zh_hant: 運算式太複雜。

# Expr_UnboundName
source: Cannot find column [{0}].
de: Die Spalte [{0}] wurde nicht gefunden.
es: No se puede encontrar la columna [{0}].
fr: Impossible de trouver la colonne [{0}].
it: Impossibile trovare la colonna [{0}].
ja: 列 [{0}] が見つかりません。
ko: 열 [{0}]을(를) 찾을 수 없습니다.
pt_br: Não é possível encontrar a coluna [{0}].
ru: Не удается найти столбец [{0}].
zh_hans: 未找到列 [{0}]。
zh_hant: 找不到資料行 [{0}]。

# Expr_InvalidString
source: The expression contains an invalid string constant: {0}.
de: Der Ausdruck enthält eine ungültige Zeichenfolgenkonstante: {0}.
es: La expresión contiene una constante en la cadena no válida: {0}.
fr: L'expression contient une constante de chaîne non valide : {0}.
it: L'espressione contiene una costante di stringa non valida: {0}.
ja: 式に無効な文字列定数 : {0} が含まれています。
ko: 식에 잘못된 문자열 상수가 있습니다. {0}
pt_br: A expressão contém uma constante de cadeia de caracteres inválida: {0}.
ru: Данное выражение содержит недопустимую строковую константу: {0}.
zh_hans: 表达式包含无效的字符串常量: {0}。
zh_hant: 運算式包含無效的字串常數: {0}。

# Expr_UndefinedFunction
source: The expression contains undefined function call {0}().
de: Der Ausdruck enthält den undefinierten Funktionsaufruf {0}().
es: La expresión contiene una llamada a la función sin definir {0}().
fr: L'expression contient un appel de fonction non défini {0}().
it: L'espressione contiene una chiamata di funzione indefinita: {0}().
ja: 式に定義されていない関数呼び出し {0}() が含まれています。
ko: 식에 정의되지 않은 함수 호출 {0}()이(가) 있습니다.
pt_br: A expressão contém chamada de função indefinida {0}().
ru: Выражение содержит вызов не определенной функции {0}().
zh_hans: 表达式包含未定义的函数调用 {0}()。
zh_hant: 運算式包含未定義的函式呼叫 {0}()。

# Expr_Syntax
source: Syntax error in the expression.
de: Syntaxfehler im Ausdruck.
es: Error de sintaxis en la expresión.
fr: Erreur de syntaxe dans l'expression.
it: Errore di sintassi nell'espressione.
ja: 式に構文エラーがあります。
ko: 식에 구문 오류가 있습니다.
pt_br: Erro de sintaxe na expressão.
ru: Синтаксическая ошибка в данном выражении.
zh_hans: 表达式中有语法错误。
zh_hant: 運算式中語法錯誤。

# Expr_FunctionArgumentCount
source: Invalid number of arguments: function {0}().
de: Ungültige Anzahl von Argumenten: Funktion {0}().
es: Número no válido de argumentos: función {0}().
fr: Nombre d'arguments non valide : fonction {0}().
it: Numero di argomenti non valido: funzione {0}().
ja: 無効な引数の数 : 関数 {0}()
ko: 인수 개수가 잘못되었습니다. 함수 {0}()
pt_br: Número de argumentos inválido: função {0}().
ru: Недопустимое число аргументов: функция {0}().
zh_hans: 无效的参数数目: 函数 {0}()。
zh_hant: 無效的引數數目: 函式 {0}()。

# Expr_MissingRightParen
source: The expression is missing the closing parenthesis.
de: Im Ausdruck fehlt die schließende Klammer.
es: Falta el paréntesis de cierre en la expresión.
fr: La parenthèse fermante est absente de l'expression.
it: Nell'espressione manca la parentesi di chiusura.
ja: 式に閉じかっこが見つかりません。
ko: 식에 닫는 괄호가 없습니다.
pt_br: Falta o parêntese de fechamento na expressão.
ru: В выражении отсутствуют закрывающая круглая скобка.
zh_hans: 表达式缺少右括号。
zh_hant: 運算式遺漏右括號。

# Expr_UnknownToken
source: Cannot interpret token '{0}' at position {1}.
de: Das Token '{0}' kann an Position {1} nicht interpretiert werden.
es: No se puede interpretar el token '{0}' en la posición {1}.
fr: Impossible d'interpréter le jeton '{0}' à la position {1}.
it: Impossibile interpretare il token '{0}' nella posizione {1}.
ja: 位置 {1} のトークン '{0}' を変換できません。
ko: {1} 위치의 '{0}' 토큰을 해석할 수 없습니다.
pt_br: Não é possível interpretar símbolo '{0}' na posição {1}.
ru: Не удается интерпретировать маркер "{0}" в позиции {1}.
zh_hans: 无法解释位置 {1} 的标记“{0}”。
zh_hant: 無法於位置 {1} 轉譯語彙基元 '{0}'。

# Expr_UnknownToken1
source: Expected {0}, but actual token at the position {2} is {1}.
de: {0} wird erwartet. Das Token an Position {2} ist jedoch {1}.
es: Se esperaba {0}, pero el token en la posición {2} es {1}.
fr: {0} attendu, mais jeton à la position {2} est {1}.
it: Previsto {0}. Il token nella posizione {2} è invece {1}.
ja: {0} が必要ですが、位置 {2} の実際のトークンは {1} です。
ko: {0}이(가) 필요한데 {2} 위치의 실제 토큰은 {1}입니다.
pt_br: {0} era esperado, mas o símbolo existente na posição {2} é {1}.
ru: Ожидалось {0}, но фактически в позиции {2} находится маркер {1}.
zh_hans: 应为 {0}，但位置 {2} 的实际标记是 {1}。
zh_hant: 必須是 {0}，但於位置 {2} 的實際語彙基元是 {1}。

# Expr_DatatypeConvertion
source: Cannot convert from {0} to {1}.
de: {0} kann nicht in {1} konvertiert werden.
es: No se puede convertir de {0} a {1}.
fr: Impossible de convertir {0} en {1}.
it: Impossibile convertire da {0} a {1}.
ja: '{0}' から '{1}' に変換できません。
ko: {0}에서 {1}(으)로 변환할 수 없습니다.
pt_br: Não é possível converter {0} em {1}.
ru: Невозможно выполнить преобразование из {0} в {1}.
zh_hans: 无法从 {0} 转换到 {1}。
zh_hant: 無法從 {0} 轉換成 {1}。

# Expr_DatavalueConvertion
source: Cannot convert value '{0}' to Type: {1}.
de: Der Wert '{0}' kann nicht in den Typ {1} konvertiert werden.
es: No se puede convertir el valor '{0}' a tipo: {1}.
fr: Impossible de convertir la valeur '{0}' en type : {1}.
it: Impossibile convertire il valore '{0}' in tipo: {1}.
ja: 値 '{0}' を型 : {1} に変換できません。
ko: '{0}' 값을 {1} 형식으로 변환할 수 없습니다.
pt_br: Não é possível converter valor '{0}' no tipo {1}.
ru: Невозможно привести значение "{0}" к типу: {1}.
zh_hans: 无法将值“{0}”转换为类型: {1}。
zh_hant: 無法將值 '{0}' 轉換成型別: {1}。

# Expr_InvalidName
source: Invalid column name [{0}].
de: Ungültiger Spaltenname [{0}].
es: Nombre de columna no válido [{0}].
fr: Nom de colonne [{0}] non valide.
it: Nome di colonna non valido: [{0}].
ja: 列名 [{0}] が無効です。
ko: 열 이름[{0}]이 잘못되었습니다.
pt_br: Nome de coluna inválido [{0}].
ru: Недопустимое имя столбца [{0}].
zh_hans: 无效列名称 [{0}]。
zh_hant: 無效的資料行名稱 [{0}]。

# Expr_InvalidDate
source: The expression contains invalid date constant '{0}'.
de: Der Ausdruck enthält eine ungültige Datumskonstante '{0}'.
es: La expresión contiene una constante de fecha '{0}' no válida.
fr: L'expression contient une constante de date non valide '{0}'.
it: L'espressione contiene una costante di data non valida: '{0}'.
ja: この式には無効な日付定数 '{0}' があります。
ko: 식에 잘못된 날짜 상수 '{0}'이(가) 있습니다.
pt_br: A expressão contém constante de data inválida '{0}'.
ru: Выражение содержит недопустимую константу даты "{0}".
zh_hans: 表达式包含无效的日期常量“{0}”。
zh_hant: 運算式包含無效的日期常數 '{0}'。

# Expr_NonConstantArgument
source: Only constant expressions are allowed in the expression list for the IN operator.
de: In der Ausdrucksliste für den IN-Operator sind nur konstante Ausdrücke zugelassen.
es: En la lista de expresiones del operador IN sólo están permitidas las expresiones constantes.
fr: Seules les expressions de constante sont autorisées dans la liste des expressions pour l'opérateur IN.
it: Nell'elenco di espressioni per l'operatore IN è possibile specificare solo espressioni costanti.
ja: IN 演算子の式リストでは、定数式のみを使用できます。
ko: IN 연산자의 식 목록에는 상수 식만 사용할 수 있습니다.
pt_br: Apenas expressões constantes são permitidas na lista de expressões para o operador IN.
ru: В выражении для оператора IN допускаются только константные выражения.
zh_hans: 在 IN 运算符的表达式列表中只允许常量表达式。
zh_hant: 在 IN 運算子的運算式清單中只允許常數運算式。

# Expr_InvalidPattern
source: Error in Like operator: the string pattern '{0}' is invalid.
de: Fehler im Like-Operator: Das Zeichenfolgenmuster '{0}' ist ungültig.
es: Error en el operador Like: el patrón de cadena '{0}' no es válido.
fr: Erreur dans l'opérateur Like : le modèle de chaîne '{0}' n'est pas valide.
it: Errore nell'operatore Like: modello di stringa '{0}' non valido.
ja: Like 演算子のエラー : 文字列パターン '{0}' が無効です。
ko: Like 연산자에 오류가 있습니다. 문자열 패턴 '{0}'이(가) 잘못되었습니다.
pt_br: Erro no operador Like: o padrão da cadeia de caracteres '{0}' é inválido.
ru: Ошибка в операторе Like: шаблон строки "{0}" является недопустимым.
zh_hans: Like 运算符中出错: 字符串模式“{0}”无效。
zh_hant: Like 運算子中發生錯誤: 字串模式 '{0}' 無效。

# Expr_InWithoutParentheses
source: Syntax error: The items following the IN keyword must be separated by commas and be enclosed in parentheses.
de: Syntaxfehler: Die Elemente, die dem IN-Schlüsselwort folgen, müssen durch Kommata getrennt sein und in Klammern stehen.
es: Error de sintaxis: los elementos detrás de la palabra clave IN deben estar separados por comas y entre paréntesis.
fr: Erreur de syntaxe : les éléments qui suivent le mot clé IN doivent être séparés par des virgules et être entre parenthèses.
it: Errore di sintassi: le voci che seguono la parola chiave IN devono essere separate da virgole e racchiuse tra parentesi.
ja: 構文エラー : IN キーワードの後に続く項目は、カンマで区切ってかっこで閉じなければなりません。
ko: 구문 오류: IN 키워드 다음에 오는 항목은 쉼표로 구분해야 하고 괄호로 묶어야 합니다.
pt_br: Erro de sintaxe: os itens seguintes à palavra-chave IN devem ser separados por vírgulas e devem ser delimitados por parênteses.
ru: Синтаксическая ошибка: Элементы, стоящие за ключевым словом IN, должны быть разделены запятыми и заключены в круглые скобки.
zh_hans: 语法错误: IN 关键字后面的项必须用逗号分隔，并且必须用括号括起来。
zh_hant: 語法錯誤: IN 關鍵字之後的項目必須以逗號分隔，而且必須位於括號中。

# Expr_ArgumentType
source: Type mismatch in function argument: {0}(), argument {1}, expected {2}.
de: Typenkonflikt in Funktionsargument: {0}(), Argument {1}, {2} wird erwartet.
es: El tipo en el argumento de función no coincide: {0}(), argumento {1}, se esperaba {2}.
fr: Incompatibilité de type dans l'argument de fonction : {0}(), argument {1}, {2} attendu.
it: Tipo non corrispondente nell'argomento della funzione: {0}(), argomento {1}, previsto {2}.
ja: 関数引数に型の不一致があります : {0}()、引数 {1} ですが、{2} が必要です。
ko: 함수 인수의 형식이 일치하지 않습니다. 인수 {1}의 {0}()에는 {2}이(가) 필요합니다.
pt_br: Tipo incompatível em argumento de função: {0}(), argumento {1}, era esperado {2}.
ru: Несоответствие типов в аргументе функции: {0}(), аргумент {1}, ожидалось {2}.
zh_hans: 函数参数中的类型不匹配: {0}()，参数 {1}，应为 {2}。
zh_hant: 函式引數中類型不符: {0}()，引數 {1}，必須是 {2}。

# Expr_ArgumentTypeInteger
source: Type mismatch in function argument: {0}(), argument {1}, expected one of the Integer types.
de: Typenkonflikt in Funktionsargument: {0}(), Argument {1}, ein Ganzzahltyp wird erwartet.
es: El tipo no coincide en el argumento de la función: {0}(), argumento {1}, se esperaba un tipo entero.
fr: Incompatibilité de type dans l'argument de fonction : {0}(), argument {1}, l'un des types Integer attendu.
it: Tipo non corrispondente nell'argomento della funzione: {0}(), argomento {1}, previsto uno dei tipi Integer.
ja: 関数引数 : {0}() に型の不一致があります : 引数 {1} には Integer 型を指定してください。
ko: 함수 인수의 형식이 일치하지 않습니다. 인수 {1}의 {0}()에는 정수 형식이 필요합니다.
pt_br: Tipo incompatível em argumento de função: {0}(), argumento {1}, era esperado um dos tipos inteiros.
ru: Несоответствие типов в аргументе функции: {0}(), аргумент {1}, ожидался целочисленный тип.
zh_hans: 函数参数中的类型不匹配: {0}()，参数 {1}，应为一种 Integer 类型。
zh_hant: 函式引數中類型不符: {0}()，引數 {1}，必須是 Integer 型別其中之一。

# Expr_TypeMismatchInBinop
source: Cannot perform '{0}' operation on {1} and {2}.
de: Die Operation '{0}' kann nicht an {1} und {2} durchgeführt werden.
es: No se puede realizar la operación '{0}' en {1} y {2}.
fr: Impossible d'effectuer une opération '{0}' sur {1} et {2}.
it: Impossibile eseguire l'operazione '{0}' su {1} e {2}.
ja: {1} および {2} で '{0}' 操作を実行できません。
ko: {1} 및 {2}에서 '{0}' 작업을 수행할 수 없습니다.
pt_br: Não é possível realizar a operação '{0}' em {1} e {2}.
ru: Невозможно выполнить операцию "{0}" над {1} и {2}.
zh_hans: 无法在 {1} 和 {2} 上执行“{0}”操作。
zh_hant: 無法在 {1} 和 {2} 上執行 '{0}' 作業。

# Expr_AmbiguousBinop
source: Operator '{0}' is ambiguous on operands of type '{1}' and '{2}'. Cannot mix signed and unsigned types. Please use explicit Convert() function.
de: Der Operator '{0}' ist für Operanden vom Typ '{1}' und '{2}' nicht eindeutig. Signierte und unsignierte Typen können nicht gemeinsam verwendet werden. Verenden Sie eine explizite Convert()-Funktion.
es: El operador '{0}' es ambiguo en operandos de tipo '{1}' y '{2}'. No se pueden mezclar tipos signed y unsigned. Utilice la función explícita Convert().
fr: L'opérateur '{0}' est ambigu sur les opérandes de type '{1}' et '{2}'. Impossible de mélanger des types signés et non signés. Utilisez une fonction Convert() explicite.
it: Operatore '{0}' ambiguo su operandi di tipo '{1}' e '{2}'. Impossibile combinare tipi con e senza segno. Utilizzare la funzione Convert() esplicita.
ja: 型 '{1}' および '{2}' のオペランドの、演算子 '{0}' があいまいです。 符号付き型と符号なしの型を混合することはできません。明示的な Convert() 関数を使ってください。
ko: '{0}' 연산자는 '{1}' 및 '{2}' 형식의 피연산자에서 모호합니다. 부호 있는 형식과 부호 없는 형식을 함께 사용할 수 없습니다. 명시적 Convert() 함수를 사용하십시오.
pt_br: Operador '{0}' é ambíguo nos operandos do tipo '{1}' e '{2}'. Não é possível misturar tipos assinados e não assinados. Use a função Convert() explícita.
ru: Оператор "{0}" для операндов с типами "{1}" и "{2}" является неоднозначным. Невозможно использовать вместе типы со знаком и без знака. Используйте функцию Convert() явно.
zh_hans: 运算符“{0}”对于类型“{1}”和“{2}”的操作数具有多义性。不能将有符号和无符号的类型混合起来。请使用显式 Convert() 函数。
zh_hant: 運算子 '{0}' 在型別 '{1}' 和 '{2}' 的運算元上模稜兩可。無法混合 signed 和 unsigned 型別。請使用明確的 Convert() 函式。

# Expr_InWithoutList
source: Syntax error: The IN keyword must be followed by a non-empty list of expressions separated by commas, and also must be enclosed in parentheses.
de: Syntaxfehler: Das IN-Schlüsselwort muss von einer nicht leeren Liste von Ausdrücken gefolgt sein, die durch Kommata getrennt sind, und muss in Klammern stehen.
es: Error de sintaxis: la palabra clave IN debe estar seguida de una lista con expresiones separadas por comas y entre paréntesis.
fr: Erreur de syntaxe : le mot clé IN doit être suivi d'une liste d'expressions non vide séparées par des virgules et entre parenthèses.
it: Errore di sintassi: la parola chiave IN deve essere seguita da un elenco non vuoto di espressioni separate da virgole e racchiuse tra parentesi.
ja: 構文エラー : IN キーワードの後には、カンマで区切られた、空でない式の一覧を指定しなければなりません。また、最後はかっこで閉じなければなりません。
ko: 구문 오류: IN 키워드 다음에는 쉼표로 구분된 비어 있지 않은 식 목록이 와야 하고 이를 괄호로 묶어야 합니다.
pt_br: Erro de sintaxe: a palavra-chave IN deve ser seguida por uma lista não vazia de expressões separadas por vírgulas e deve ser delimitada por parênteses.
ru: Синтаксическая ошибка: За ключевым словом IN должен следовать непустой список выражений, разделенных запятыми и заключенных в круглые скобки.
zh_hans: 语法错误: IN 关键字后面必须是由逗号分隔的非空表达式列表，并且必须用括号括起来。
zh_hant: 語法錯誤: IN 關鍵字之後必須跟隨運算式以逗號分隔的非空白清單，而且必須包含在括號中。

# Expr_UnsupportedOperator
source: The expression contains unsupported operator '{0}'.
de: Der Ausdruck enthält den nicht unterstützten Operator '{0}'.
es: La expresión contiene un operador '{0}' no compatible.
fr: L'expression contient un opérateur '{0}' non pris en charge.
it: L'espressione contiene l'operatore non supportato '{0}'.
ja: 式にサポートされない演算子 '{0}' が含まれています。
ko: 식에 지원되지 않는 연산자 '{0}'이(가) 있습니다.
pt_br: A expressão contém operador sem suporte '{0}'.
ru: Выражение содержит не поддерживаемый оператор "{0}".
zh_hans: 表达式包含不支持的运算符“{0}”。
zh_hant: 運算式包含未支援的運算子 '{0}'。
