Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SqlConnection_ConnectionTimeout
source: Current connection timeout value, 'Connect Timeout=X' in the ConnectionString.
de: Aktueller Verbindungstimeout-Wert, 'Connect Timeout=X' in ConnectionString.
es: Valor actual de tiempo de espera de conexión, 'Connect Timeout=X' en la cadena de conexión (ConnectionString).
fr: Valeur du délai d'attente de la connexion actuelle, 'Connect Timeout=X' dans le ConnectionString.
it: Valore di timeout della connessione corrente. 'Connect Timeout=X' in ConnectionString.
ja: 現在の接続 timeout 値、ConnectionString 内の 'Connect Timeout=X' です。
ko: ConnectionString에서 현재 연결 시간 제한 값입니다('Connect Timeout=X').
pt_br: Valor de tempo limite da conexão atual, 'Connect Timeout=X' em ConnectionString.
ru: Время ожидания текущего подключения; "Connect Timeout=X" в ConnectionString.
zh_hans: 当前连接超时值，ConnectionString 中的“Connect Timeout=X”。
zh_hant: 目前連接的逾時值，即為 ConnectionString 中的 'Connect Timeout=X'。

# SqlConnection_Database
source: Current SQL Server database, 'Initial Catalog=X' in the connection string.
de: Aktuelle SQL Server-Datenbank, 'Initial Catalog=X' in der Verbindungszeichenfolge.
es: Base de datos de SQL Server actual, 'Initial Catalog=X' en la cadena de conexión.
fr: Base de données SQL Server actuelle, 'Initial Catalog=X' dans la chaîne de connexion.
it: Database SQL Server attuale. 'Initial Catalog=X' nella stringa di connessione.
ja: 現在の SQL Server データベースは、接続文字列内の 'Initial Catalog=X' です。
ko: 연결 문자열에서 현재 SQL Server 데이터베이스입니다('Initial Catalog=X').
pt_br: Banco de dados do SQL Server atual, 'Initial Catalog=X' na cadeia de conexão.
ru: Значение текущей базы данных сервера SQL Server, "Initial Catalog=X" в строке подключения.
zh_hans: 当前 SQL Server 数据库，连接字符串中的“Initial Catalog=X”。
zh_hant: 目前的 SQL Server 資料庫，即為連接字串中的 'Initial Catalog=X'。

# SqlConnection_DataSource
source: Current SqlServer that the connection is opened to, 'Data Source=X' in the connection string.
de: Aktueller SqlServer, für den die Verbindung geöffnet wird, 'Data Source=X' in der Verbindungszeichenfolge.
es: La conexión está abierta con SqlServer actual, 'Data Source=X' de la cadena de conexión.
fr: SqlServer actuel sur lequel la connexion est ouverte, 'Data Source=X' dans la chaîne de connexion.
it: SqlServer con cui è attualmente stabilita la connessione. "Data Source=X" nella stringa di connessione.
ja: 接続している現在の SqlServer データ ソースは、接続文字列内の 'Data Source=X' です。
ko: 연결이 열려 있는 현재 SqlServer이며 연결 문자열에서 연결 문자열에서 'Data Source=X'입니다.
pt_br: SqlServer atual para o qual a conexão está aberta, 'Data Source=X' na cadeia de conexão.
ru: Текущий SqlServer, к которому открыто подключение, "Data Source=X" в строке подключения.
zh_hans: 对于打开连接的当前 SqlServer，连接字符串中的“Data Source=X”。
zh_hant: 目前連接所開啟的 SqlServer，即為連接字串中的 'Data Source=X'。

# SqlConnection_PacketSize
source: Network packet size, 'Packet Size=x' in the connection string.
de: Netzwerkpaketgröße, 'Packet Size=x' in der Verbindungszeichenfolge.
es: Tamaño del paquete de red, 'Packet Size=x' en la cadena de conexión.
fr: Taille du paquet réseau, 'Packet Size=x' dans la chaîne de connexion.
it: Dimensione pacchetto di rete. 'Packet Size=x' nella stringa di connessione.
ja: ネットワーク パケット サイズ、接続文字列内の 'Packet Size=x' です。
ko: 연결 문자열의 네트워크 패킷 크기입니다('Packet Size=x').
pt_br: Tamanho do pacote de rede, 'Packet Size=x' na cadeia de conexão.
ru: Размер пакета данных в сети, "Packet Size=x" в строке подключения.
zh_hans: 网络数据包大小，连接字符串中的“Packet Size=x”。
zh_hant: 網路封包大小，即為連接字串中的 'Packet Size=x'。

# SqlConnection_ServerVersion
source: Version of the SQL Server accessed by the SqlConnection.
de: Version von SQL Server, in der die SqlConnection geöffnet ist.
es: SqlConnection obtuvo acceso a la versión del servidor SQL Server.
fr: Version de SQL Server à laquelle SqlConnection accède.
it: Versione di SQL Server a cui accede SqlConnection.
ja: SqlConnection によってアクセスされる SQL Server のバージョンです。
ko: SqlConnection에서 액세스하는 SQL Server의 버전입니다.
pt_br: Versão do SQL Server acessado por SqlConnection.
ru: Версия сервера SQL Server, к которому производит доступ SqlConnection.
zh_hans: SqlConnection 所访问的 SQL Server 的版本。
zh_hant: SqlConnection 所存取的 SQL Server 版本。

# SqlConnection_WorkstationId
source: Workstation Id, 'Workstation ID=x' in the connection string.
de: Workstation-ID, 'Workstation ID=x' in der Verbindungszeichenfolge.
es: Id de la estación de trabajo, 'Workstation ID=x' en la cadena de conexión.
fr: ID de la station de travail, 'Workstation ID=x' dans la chaîne de connexion.
it: ID Workstation. 'Workstation ID=x' nella stringa di connessione.
ja: 接続文字列内の、ワークステーション ID 'Workstation ID=x' です。
ko: 연결 문자열에서 워크스테이션 ID입니다('Workstation ID=x').
pt_br: Identificação da estação de trabalho, 'Workstation ID=x' na cadeia de conexão.
ru: Идентификатор рабочей станции, "Workstation ID=x" в строке подключения.
zh_hans: 工作站 ID，连接字符串中的“Workstation ID=x”。
zh_hant: 工作站 ID，即為連接字串中的 'Workstation ID=x'。

# SqlConnection_StatisticsEnabled
source: Collect statistics for this connection.
de: Erfassen von Statistiken für diese Verbindung.
es: Recopilar estadísticas de esta conexión.
fr: Statistiques de collecte de cette connexion.
it: Raccogliere dati statistici per la connessione.
ja: この接続の統計情報を収集します。
ko: 이 연결에 대한 통계를 수집합니다.
pt_br: Colete estatística para esta conexão.
ru: Сбор статистических данных для этого подключения.
zh_hans: 收集此连接的统计信息。
zh_hant: 收集此連接的統計資料。

# SqlConnection_CustomColumnEncryptionKeyStoreProviders
source: Custom column encryption key store providers.
de: Verschlüsselungs-Schlüsselspeicheranbieter für benutzerdefinierte Spalte.
es: Proveedores de almacenamiento de claves de cifrado de columnas personalizadas.
fr: Fournisseurs de magasins de clés de chiffrement de colonne personnalisée.
it: Provider dell'archivio chiavi di crittografia di colonna personalizzati.
ja: カスタム列暗号化キー ストア プロバイダーです。
ko: 사용자 지정 암호화 키 저장소 공급자입니다.
pt_br: Provedores de armazenamento de chaves de criptografia de coluna personalizada.
ru: Поставщики хранилища ключей шифрования пользовательского столбца.
zh_hans: 自定义列加密密钥存储提供程序。
zh_hant: 自訂資料行加密金鑰存放區提供者。

# SqlConnection_ClientConnectionId
source: A guid to represent the physical connection.
de: Eine GUID, die die physische Verbindung darstellt.
es: Un GUID para representar la conexión física.
fr: Un guid pour représenter la connexion physique.
it: Guid che rappresenta la connessione fisica.
ja: 物理的な接続を表す GUID。
ko: 실제 연결을 나타내는 GUID입니다.
pt_br: Uma guid para representar a conexão física.
ru: Идентификатор guid для представления физического соединения.
zh_hans: 一个用于表示物理连接的 GUID。
zh_hant: 代表實體連接的 Guid。

# SqlConnection_Credential
source: User Id and secure password to use for authentication.
de: Benutzer-ID und sicheres Kennwort für die Authentifizierung.
es: Id. de usuario y contraseña segura para usar en la autenticación.
fr: Id utilisateur et mot de passe sécurisé pour l'authentification.
it: ID utente e password di protezione per l'autenticazione.
ja: 認証に使用するユーザー ID とセキュリティで保護されたパスワード。
ko: 인증에 사용할 사용자 ID와 보안 암호입니다.
pt_br: Id de usuário e senha segura a serem usadas para autenticação.
ru: Идентификатор пользователя и пароль для аутентификации.
zh_hans: 用于进行身份验证的用户 ID 和安全密码。
zh_hant: 驗證所用的使用者識別項和安全密碼。

# DbConnection_InfoMessage
source: Event triggered when messages arrive from the DataSource.
de: Das Ereignis, das ausgelöst wird, wenn Meldungen von der DataSource erhalten werden.
es: Evento que se desencadena cuando llegan los mensajes de DataSource.
fr: Événement déclenché lorsque les messages arrivent du DataSource.
it: Evento generato all'arrivo dei messaggi dal DataSource.
ja: DataSource からメッセージが届いたときに、イベントが発生します。
ko: DataSource에서 메시지가 도착할 때 이벤트가 트리거됩니다.
pt_br: Evento disparado quando chegam mensagens da DataSource.
ru: Событие создается при поступлении сообщений от DataSource.
zh_hans: 当消息从 DataSource 到达时触发的事件。
zh_hant: 在收到 DataSource 所送出的訊息時，觸發的事件。

# DbCommand_CommandText
source: Command text to execute.
de: Auszuführender Befehlstext
es: El texto del comando que se va a ejecutar.
fr: Texte de la commande à exécuter.
it: Testo del comando da eseguire.
ja: 実行するコマンド テキストです。
ko: 실행할 명령 텍스트입니다.
pt_br: Texto de comando a ser executado.
ru: Текст команды для выполнения.
zh_hans: 要执行的命令文本。
zh_hant: 要執行的命令文字。

# DbCommand_CommandType
source: How to interpret the CommandText.
de: Gibt an, wie 'CommandText' zu interpretieren ist.
es: Cómo interpretar CommandText.
fr: Comment interpréter le CommandText.
it: Interpretazione di CommandText.
ja: CommandText の変換方法です。
ko: CommandText를 해석하는 방법을 지정합니다.
pt_br: Como interpretar CommandText.
ru: Каким образом интерпретируется CommandText.
zh_hans: 如何解释 CommandText。
zh_hant: 如何轉譯 CommandText。

# DbCommand_Connection
source: Connection used by the command.
de: Verbindung, die vom Befehl verwendet wird.
es: Conexión utilizada por el comando.
fr: Connexion utilisée par la commande.
it: Connessione utilizzata dal comando.
ja: コマンドが使用する接続です。
ko: 명령에서 사용하는 연결입니다.
pt_br: Conexão usada pelo comando.
ru: Подключение, используемой данной командой.
zh_hans: 该命令所使用的连接。
zh_hant: 命令使用的連接。

# DbCommand_Parameters
source: The parameters collection.
de: Parametersammlung
es: Colección de parámetros.
fr: La collection Parameters.
it: Raccolta dei parametri.
ja: パラメーターのコレクションです。
ko: 매개 변수 컬렉션입니다.
pt_br: A coleção de parâmetros.
ru: Коллекция параметров.
zh_hans: 参数集合。
zh_hant: 參數集合。

# DbCommand_Transaction
source: The transaction used by the command.
de: Die Transaktion, die von dem Befehl verwendet wird.
es: Transacción utilizada por el comando.
fr: La transaction utilisée par la commande.
it: Transazione utilizzata dal comando.
ja: コマンドで使用されるトランザクションです。
ko: 명령에서 사용하는 트랜잭션입니다.
pt_br: A transação usada pelo comando.
ru: Транзакция, используемая данной командой.
zh_hans: 该命令所使用的事务。
zh_hant: 命令使用的交易。

# DbCommand_UpdatedRowSource
source: When used by a DataAdapter.Update, how command results are applied to the current DataRow.
de: Zeigt, wie Befehlsergebnisse auf die aktuelle DataRow angewendet werden, wenn sie von DataAdapter.Update verwendet werden.
es: Cómo se aplican los resultados del comando al campo DataRow actual cuando lo utiliza DataAdapter.Update.
fr: Lorsqu'ils sont utilisés par un DataAdapter.Update, la façon dont les résultats de la commande sont appliqués au DataRow actuel.
it: Se utilizzata da DataAdapter.Update, indica il modo in cui i risultati del comando vengono applicati al DataRow corrente.
ja: DataAdapter.Update で使用された場合に、コマンドの結果がどのように現在の DataRow に適用されるかを示します。
ko: DataAdapter.Update에서 사용하는 경우 현재 DataRow에 명령 결과를 적용하는 방법입니다.
pt_br: Quando usado por um DataAdapter.Update, como os resultados do comando são aplicados a DataRow atual.
ru: При использовании в методе DataAdapter.Update - каким образом результаты выполнения команды применяются к текущему DataRow.
zh_hans: 当由 DataAdapter.Update 使用时，命令结果将如何应用到当前 DataRow。
zh_hant: 當由 DataAdapter.Update 使用時，命令結果如何套用至目前的 DataRow。

# DbCommand_StatementCompleted
source: When records are affected by a given statement by the execution of the command.
de: Wenn Datensätze durch eine angegebene Anweisung aufgrund der Ausführung eines Befehls betroffen sind.
es: Cuando los registros se ven afectados por una determinada instrucción debido a la ejecución del comando.
fr: Lorsque des enregistrements sont affectés par une instruction donnée suite à l'exécution de la commande.
it: Indica quando i record vengono modificati da una specifica istruzione durante l'esecuzione del comando.
ja: コマンドの実行により、指定されたステートメントによってレコードが影響を受けた時点を表します。
ko: 레코드가 명령의 실행으로 지정된 문의 영향을 받는 경우입니다.
pt_br: Quando os registros são afetados por uma instrução fornecida pela execução do comando.
ru: Если записи затронуты данным оператором при выполнении команды.
zh_hans: 由于执行命令而使记录受给定语句影响时。
zh_hant: 當記錄受到執行指定陳述式命令的影響。

# SqlCommand_Notification
source: Notification values used by Microsoft SQL Server.
de: Von Microsoft SQL Server verwendete Benachrichtigungswerte.
es: Valores de notificación utilizados por Microsoft SQL Server.
fr: Valeurs de notification utilisées par Microsoft SQL Server.
it: Valori di notifica utilizzati da Microsoft SQL Server.
ja: Microsoft SQL Server が使用する通知の値です。
ko: Microsoft SQL Server에서 사용하는 알림 값입니다.
pt_br: Valores de notificação usados pelo Microsoft SQL Server.
ru: Значения уведомлений, использующихся Microsoft SQL Server.
zh_hans: Microsoft SQL Server 使用的通知值。
zh_hant: Microsoft SQL Server 所用的通知值。

# SqlCommand_NotificationAutoEnlist
source: Automatic enlistment in notifications used by Microsoft SQL Server.
de: Automatische Eintragung in von Microsoft SQL Server verwendete Benachrichtigungen.
es: Alta automática en notificaciones utilizada por Microsoft SQL Server.
fr: Inscription automatique aux notifications utilisée par Microsoft SQL Server.
it: Inserimento automatico nelle notifiche utilizzato da Microsoft SQL Server.
ja: Microsoft SQL Server が使用する通知に自動的に組み込まれるデータです。
ko: Microsoft SQL Server에서 사용하는 알림의 자동 인리스트먼트입니다.
pt_br: Inscrição automática em notificações usadas pelo Microsoft SQL Server.
ru: Автоматический связующий объект в уведомлениях, использующихся Microsoft SQL Server.
zh_hans: 自动登记在 Microsoft SQL Server 使用的通知中。
zh_hant: 用於 Microsoft SQL Server 的自動編列通知。

# DbCommandBuilder_ConflictOption
source: How the where clause is auto-generated for the Update and Delete commands when not specified by the user.
de: Automatisches Generieren der WHERE-Klausel für die Befehle 'Update' und 'Delete', wenn diese vom Benutzer nicht angegeben wurde.
es: Cómo los comandos Update y Delete generan automáticamente la cláusula where cuando el usuario no lo especifica.
fr: Indique comment la clause where est automatiquement générée pour les commandes Update et Delete lorsqu'elle n'a pas été spécifiée par l'utilisateur.
it: Come la clausola WHERE viene autogenerata per i comandi Update e Delete quando non specificata dall'utente.
ja: ユーザーによって指定されない場合に、Update および Delete コマンドの Where 句をどのように自動生成するかを示します。
ko: 사용자가 지정하지 않은 경우 Update 및 Delete 명령에 대해 where 절이 자동 생성되는 방법입니다.
pt_br: Como a cláusula where é gerada automaticamente para os comandos Update e Delete quando não especificada pelo usuário.
ru: Как конструкция Where автоматически создается для команд Update и Delete, если она не указана пользователем.
zh_hans: 在用户未指定时，如何为 Update 和 Delete 命令自动生成 where 子句。
zh_hant: 當使用者未指定 Update 與 Delete 命令時，會如何自動產生 where 子句。

# DbCommandBuilder_CatalogLocation
source: Indicates the position of the catalog name in a qualified table name in a text command.
de: Gibt die Position des Katalognamens in einem qualifizierten Tabellennamen in einem Textbefehl an.
es: Indica la posición del nombre de catálogo en un nombre de tabla completo de un comando de texto.
fr: Indique la position du nom de catalogue dans le nom de table qualifié d'une commande de texte.
it: Indica la posizione del nome di catalogo in un nome di tabella qualificato in un comando di testo.
ja: テキスト コマンド内の修飾されたテーブル名内のカタログ名の位置を示します。
ko: 텍스트 명령의 정규화된 테이블 이름에서 카탈로그 이름의 위치를 나타냅니다.
pt_br: Indica a posição do nome do catálogo em um nome de tabela qualificado em um comando de texto.
ru: Указывает позицию имени каталога в полном имени таблицы в составе текстовой команды.
zh_hans: 指示文本命令中目录名在合法表名中的位置。
zh_hant: 表示在文字命令中，目錄名稱在適當資料表名稱中的位置。

# DbCommandBuilder_CatalogSeparator
source: The character that separates the catalog name from the rest of the identifier in a text command.
de: Das Zeichen, das den Katalognamen vom Rest des Bezeichners in einem Textbefehl trennt.
es: Carácter que separa el nombre de catálogo del resto del identificador en un comando de texto.
fr: Caractère séparant le nom du catalogue du reste de l'identificateur dans une commande de texte.
it: Carattere che separa il nome di catalogo dal resto dell'identificatore in un comando di testo.
ja: カタログ名とテキスト コマンド内の識別子の他の部分とを区切る文字です。
ko: 텍스트 명령의 나머지 식별자와 카탈로그 이름을 구분하는 문자입니다.
pt_br: O caractere que separa o nome do catálogo do resto do identificador em um comando de texto.
ru: Знак, отделяющий имя каталога от остальной части идентификатора в текстовой команде.
zh_hans: 文本命令中分隔目录名与其余标识符的字符串。
zh_hant: 在文字命令中，將目錄名稱與其餘識別項分隔的字元。

# DbCommandBuilder_SchemaSeparator
source: The character that separates the schema name from the rest of the identifier in a text command.
de: Das Zeichen, das den Schemanamen vom Rest des Bezeichners in einem Textbefehl trennt.
es: Carácter que separa el nombre de esquema del resto del identificador en un comando de texto.
fr: Caractère séparant le nom du schéma du reste de l'identificateur dans une commande de texte.
it: Carattere che separa il nome dello schema dal resto dell'identificatore in un comando di testo.
ja: スキーマ名とテキスト コマンド内の識別子の他の部分とを区切る文字です。
ko: 텍스트 명령의 나머지 식별자와 스키마 이름을 구분하는 문자입니다.
pt_br: O caractere que separa o nome do esquema do resto do identificador em um comando de texto.
ru: Знак, отделяющий имя схемы от остальной части идентификатора в текстовой команде.
zh_hans: 文本命令中分隔架构名与其余标识符的字符串。
zh_hant: 在文字命令中，將結構描述名稱與其餘識別項分隔的字元。

# DbCommandBuilder_QuotePrefix
source: The prefix string wrapped around sql objects.
de: Die Präfixzeichenfolge um sql-Objekte.
es: Cadena de prefijo que se ajusta alrededor de los objetos sql.
fr: Chaîne de préfixe autour des objets sql.
it: Stringa di prefisso utilizzata con gli oggetti sql.
ja: sql オブジェクトを囲むプレフィックス文字列です。
ko: 접두 문자열이 sql 개체 이름에 연결되었습니다.
pt_br: Cadeia de caracteres de prefixo encapsulada com objetos sql.
ru: Строка префикса, маркирующая объекты sql.
zh_hans: 环绕 sql 对象的前缀字符串。
zh_hant: 在 sql 物件周圍包裝的前置詞字串。

# DbCommandBuilder_QuoteSuffix
source: The suffix string wrapped around sql objects.
de: Die Suffixzeichenfolge um sql-Objekte.
es: Cadena de sufijo que se ajusta alrededor de los objetos sql.
fr: Chaîne de suffixe autour des objets sql.
it: Stringa di suffisso utilizzata con gli oggetti sql.
ja: sql オブジェクトを囲むサフィックス文字列です。
ko: 접미 문자열이 sql 개체 이름에 연결되었습니다.
pt_br: Cadeia de caracteres de sufixo encapsulada com objetos sql.
ru: Строка суффикса, маркирующая объекты sql.
zh_hans: 环绕 sql 对象的后缀字符串。
zh_hant: 在 sql 物件周圍包裝的後置詞字串。

# DbCommandBuilder_DataAdapter
source: The DataAdapter for which to automatically generate Commands.
de: Der DataAdapter, für den Befehle automatisch generiert werden.
es: DataAdapter para el que generar automáticamente comandos.
fr: DataAdapter pour lequel générer automatiquement des commandes.
it: DataAdapter per il quale generare automaticamente comandi.
ja: Command を自動的に生成する DataAdapter です。
ko: 자동으로 명령을 생성할 DataAdapter입니다.
pt_br: O DataAdapter para o qual gerar comandos automaticamente.
ru: DataAdapter, для которого будут автоматически создаваться команды.
zh_hans: 自动为其生成命令的 DataAdapter。
zh_hant: 自動產生 Commands 的目標 DataAdapter。

# DbCommandBuilder_SchemaLocation
source: Use schema from DataTable or the SelectCommand.
de: Verwenden Sie das Schema der DataTable oder den SelectCommand.
es: Utilice el esquema de DataTable o SelectCommand.
fr: Utilisez le schéma provenant de DataTable ou SelectCommand.
it: Usare lo schema di DataTable o il SelectCommand.
ja: DataTable のスキーマまたは SelectCommand を使用します。
ko: DataTable 또는 SelectCommand에서 스키마를 사용합니다.
pt_br: Use esquema de DataTable ou SelectCommand.
ru: Используйте схему из DataTable или SelectCommand.
zh_hans: 使用来自 DataTable 或 SelectCommand 的架构。
zh_hant: 使用 DataTable 或 SelectCommand 中的結構描述。

# DbCommandBuilder_SetAllValues
source: How the set clause is auto-generated for the Update command when not specified by the user.
de: Automatisches Generieren der SET-Klausel für den Update-Befehl, falls diese nicht vom Benutzer angegeben wurde.
es: Cómo se genera automáticamente la cláusula set para el comando Update cuando no ha sido especificada por el usuario.
fr: Indique comment la clause set est automatiquement générée pour la commande Update lorsqu'elle n'est pas spécifiée par l'utilisateur.
it: Indica il modo in cui viene generata automaticamente la clausola SET pre il comando Update quando non viene specificato dall'utente.
ja: ユーザーによって設定されていない場合に、Update コマンドの set 句が自動的に生成される方法を示します。
ko: 사용자가 지정하지 않은 경우 Update 명령에 대해 set 절이 자동 생성되는 방법입니다.
pt_br: Como a cláusula set é gerada automaticamente para o comando Update quando não especificada pelo usuário.
ru: Как конструкция Set автоматически создается для команды Update, если она не указана пользователем.
zh_hans: 用户未指定的情况下，如何自动生成 Update 命令的 Set 子语。
zh_hant: 當使用者未指定 Update 命令時，如何自動產生 set 子句。

# OdbcCommandBuilder_DataAdapter
source: The DataAdapter for which to automatically generate OdbcCommands
de: Der DataAdapter für den OdbcCommands automatisch generiert werden
es: DataAdapter para generar automáticamente OdbcCommands
fr: DataAdapter pour lequel il faut générer automatiquement OdbcCommands
it: Indica il DataAdapter per cui generare automaticamente OdbcCommands.
ja: OdbcCommands を自動的に生成する DataAdapter
ko: OdbcCommands를 자동으로 생성하는 DataAdapter입니다.
pt_br: O DataAdapter para o qual OdbcCommands serão gerados automaticamente
ru: DataAdapter, для которого будут автоматически создаваться OdbcCommands
zh_hans: 自动为其生成 OdbcCommands 的 DataAdapter
zh_hant: 用以自動產生 OdbcCommands 的 DataAdapter

# OdbcCommandBuilder_QuotePrefix
source: The character used in a text command as the opening quote for quoting identifiers that contain special characters.
de: Das Zeichen, das in einem Textbefehl als öffnendes Anführungszeichen für Bezeichner verwendet wird, die spezielle Zeichen verwenden.
es: El carácter utilizado en un comando de texto, como la comilla de apertura para los identificadores de comillas que contienen caracteres especiales.
fr: Caractère utilisé dans une commande de texte en tant que guillemet ouvrant pour les identificateurs qui contiennent des caractères spéciaux.
it: Carattere utilizzato come virgoletta di apertura, necessaria per inserire nei comandi di testo identificatori che contengono caratteri speciali.
ja: 特殊文字を含む識別子を引用符で囲むために開始引用符としてテキスト コマンドで使用される文字です。
ko: 텍스트 명령에서 특수 문자가 포함된 식별자를 따옴표로 묶을 때, 여는 따옴표로 사용되는 문자입니다.
pt_br: O caractere usado em um comando de texto como aspas de abertura para delimitar identificadores que contêm caracteres especiais.
ru: Знак, который используется в текстовых командах в качестве открывающей кавычки для заключения в кавычки идентификаторов, содержащих специальные знаки.
zh_hans: 在文本命令中用作左引号的字符，用于将包含特殊字符的标识符括起来。
zh_hant: 文字命令中，用來當作引號識別項 (其中包含特殊字元) 開頭引號的字元。

# OdbcCommandBuilder_QuoteSuffix
source: The character used in a text command as the closing quote for quoting identifiers that contain special characters.
de: Das Zeichen, das in einem Textbefehl als schließendes Anführungszeichen für Bezeichner verwendet wird, die spezielle Zeichen enthalten.
es: El carácter utilizado en un comando de texto, como la comilla de cierre para los identificadores de comillas que contienen caracteres especiales.
fr: Caractère utilisé dans une commande de texte en tant que guillemet fermant pour les identificateurs qui contiennent des caractères spéciaux.
it: Carattere utilizzato come virgoletta di chiusura, necessaria per inserire nei comandi di testo identificatori che contengono caratteri speciali.
ja: 特別な文字を含む識別子を引用する際の閉じの引用符として、テキスト コマンドで使用される文字です。
ko: 텍스트 명령에서 특수 문자가 포함된 식별자를 따옴표로 묶을 때, 닫는 따옴표로 사용되는 문자입니다.
pt_br: O caractere usado em um comando de texto como aspas de fechamento para delimitar identificadores que contêm caracteres especiais.
ru: Знак, который используется в текстовых командах в качестве закрывающей кавычки для заключения в кавычки идентификаторов, содержащих специальные знаки.
zh_hans: 在文本命令中用作右引号的字符，用于将包含特殊字符的标识符括起来。
zh_hant: 文字命令中，用來當作引號識別項 (其中包含特殊字元) 結束引號的字元。
