Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SQL_UnsupportedAuthenticationByProvider
source: The provider '{0}' does not support authentication '{1}'.
de: Die Authentifizierung "{1}" wird vom Anbieter "{0}" nicht unterstützt.
es: El proveedor "{0}" no admite la autenticación "{1}".
fr: Le fournisseur '{0}' ne prend pas en charge l'authentification '{1}'.
it: Il provider '{0}' non supporta l'autenticazione '{1}'.
ja: プロバイダー '{0}' では認証 '{1}' はサポートされていません。
ko: '{0}' 공급자에서 '{1}' 인증을 지원하지 않습니다.
pt_br: O provedor '{0}' não dá suporte à autenticação '{1}'.
ru: Поставщик "{0}" не поддерживает проверку подлинности "{1}".
zh_hans: 提供程序“{0}”不支持身份验证“{1}”。
zh_hant: 提供者 '{0}' 不支援驗證 '{1}'。

# SQL_CannotFindAuthProvider
source: Cannot find an authentication provider for '{0}'.
de: Für "{0}" wurde kein Authentifizierungsanbieter gefunden.
es: No se encuentra ningún proveedor de autenticación para "{0}".
fr: Le fournisseur d'authentification est introuvable pour '{0}'.
it: Non è possibile trovare un provider di autenticazione per '{0}'.
ja: '{0}' の認証プロバイダーが見つかりません。
ko: '{0}'에 대한 인증 공급자를 찾을 수 없습니다.
pt_br: Não é possível localizar um provedor de autenticação para '{0}'.
ru: Не удается найти поставщик проверки подлинности для "{0}".
zh_hans: 找不到“{0}”的身份验证提供程序。
zh_hant: 找不到 '{0}' 的驗證提供者。

# SQL_CannotGetAuthProviderConfig
source: Failed to read the config section for authentication providers.
de: Fehler beim Lesen des Konfigurationsabschnitts für Authentifizierungsanbieter.
es: No se pudo leer la sección de configuración para los proveedores de autenticación.
fr: Échec de lecture de la section de configuration des fournisseurs d'authentification.
it: Non è stato possibile leggere la sezione di configurazione per i provider di autenticazione.
ja: 認証プロバイダーの構成セクションを読み取ることができませんでした。
ko: 인증 공급자에 대한 구성 섹션을 읽지 못했습니다.
pt_br: Falha ao ler a seção de configuração para os provedores de autenticação.
ru: Не удалось прочитать раздел конфигурации для поставщиков проверки подлинности.
zh_hans: 未能读取身份验证提供程序的配置节。
zh_hant: 無法讀取驗證提供者的組態區段。

# SQL_ParameterCannotBeEmpty
source: Parameter '{0}' cannot be null or empty.
de: Der Parameter "{0}" darf nicht NULL oder leer sein.
es: El parámetro "{0}" no puede ser nulo ni estar vacío.
fr: Le paramètre « {0} » ne peut pas être Null ou vide.
it: Il parametro '{0}' non può essere Null o vuoto.
ja: パラメーター '{0}' を null や空にすることはできません。
ko: '{0}' 매개 변수는 null이거나 비워 둘 수 없습니다.
pt_br: O parâmetro '{0}' não pode ser nulo ou vazio.
ru: Параметр «{0}» не может иметь значение NULL или быть пустым.
zh_hans: 参数“{0}”不能为 null 或为空。
zh_hant: 參數 '{0}' 不能是 Null 或空白。

# SQL_AsyncOperationCompleted
source: The asynchronous operation has already completed.
de: Die asynchrone Operation wurde bereits abgeschlossen.
es: La operación asincrónica ya se ha completado.
fr: L'opération asynchrone est déjà terminée.
it: L'operazione asincrona è già completata.
ja: この非同期操作は既に完了しています。
ko: 비동기 작업이 이미 완료되었습니다.
pt_br: A operação assíncrona já foi concluída.
ru: Асинхронная операция уже завершилась.
zh_hans: 异步操作已完成。
zh_hant: 已完成非同步作業。

# SQL_PendingBeginXXXExists
source: The command execution cannot proceed due to a pending asynchronous operation already in progress.
de: Die Befehlsausführung kann aufgrund einer ausstehenden bereits laufenden asynchronen Operation nicht fortgesetzt werden.
es: La ejecución del comando no puede continuar debido a que ya está en curso una operación asincrónica pendiente.
fr: Impossible de poursuivre l'exécution de la commande : une opération asynchrone en attente est déjà en cours.
it: Impossibile eseguire il comando a causa di un'operazione asincrona in sospeso già in esecuzione.
ja: 既に実行中の非同期操作が保留されているため、コマンドの実行を行えません。
ko: 보류 중인 비동기 작업이 이미 진행 중이기 때문에 명령 실행을 계속할 수 없습니다.
pt_br: A execução do comando não pode prosseguir devido a uma operação assíncrona pendente que já está em andamento.
ru: Выполнение команды не может быть продолжено до завершения отложенной асинхронной операции.
zh_hans: 命令执行无法继续，因为正在处理一个挂起的异步操作。
zh_hant: 不可因為已在進行的非同步作業擱置而先執行命令。

# SQL_NonXmlResult
source: Invalid command sent to ExecuteXmlReader. The command must return an Xml result.
de: Der an ExecuteXmlReader gesendete Befehl ist ungültig. Der Befehl muss ein Xml-Ergebnis zurückgeben.
es: Comando no válido enviado a ExecuteXmlReader. El comando debe devolver un resultado Xml.
fr: Commande non valide envoyée vers ExecuteXmlReader. La commande doit retourner un résultat Xml.
it: Comando non valido inviato a ExecuteXmlReader. Il comando deve restituire un risultato Xml.
ja: 無効なコマンドが ExecuteXmlReader に送られました。このコマンドは Xml 結果を返さなければなりません。
ko: ExecuteXmlReader로 보낸 명령이 잘못되었습니다. 이 명령은 Xml 결과를 반환해야 합니다.
pt_br: Comando inválido enviado a ExecuteXmlReader. O comando deve retornar um resultado Xml.
ru: В ExecuteXmlReader передана недопустимая команда. Команда должна возвращать результат Xml.
zh_hans: 发送到 ExecuteXmlReader 的命令无效。该命令必须返回 Xml 结果。
zh_hant: 無效的命令傳送到 ExecuteXmlReader。命令必須傳回 Xml 結果。

# SQL_NotificationsRequireYukon
source: Notifications require SQL Server 9.0 or later.
de: Für Benachrichtigungen ist SQL Server 9.0 oder höher erforderlich.
es: Las notificaciones requieren tener instalado SQL Server 9.0 o posterior.
fr: Les notifications requièrent SQL Server 9.0 ou version ultérieure.
it: Le notifiche richiedono SQL Server 9.0 o versioni successive.
ja: 通知機能を使用するには SQL Server 9.0 以降が必要です。
ko: 알림을 사용하려면 SQL Server 9.0 이상이 필요합니다.
pt_br: Notificações requerem SQL Server 9.0 ou posterior.
ru: Для уведомлений требуется SQL Server 9.0 или более поздней версии.
zh_hans: 通知要求 SQL Server 9.0 或更高版本。
zh_hant: 通知需要 SQL Server 9.0 或更新的版本。

# SQL_InvalidUdt3PartNameFormat
source: Invalid 3 part name format for UdtTypeName.
de: Ungültiges dreiteiliges Namensformat für UdtTypeName.
es: Formato de nombre de parte 3 no válido para UdtTypeName.
fr: Format de nom en 3 parties non valide pour UdtTypeName.
it: Formato del nome in tre parti non valido per UdtTypeName.
ja: UdtTypeName では 3 パート名のフォーマットは無効です。
ko: UdtTypeName의 세 부분으로 된 이름 형식이 잘못되었습니다.
pt_br: Formato de nome em 3 partes inválido para UdtTypeName.
ru: Недопустимый трехэлементный формат имени для UdtTypeName.
zh_hans: 用于 UdtTypeName 的 3 部分名称格式无效。
zh_hant: UdtTypeName 的 3 個名稱組成格式無效。

# SQL_InvalidParameterTypeNameFormat
source: Invalid 3 part name format for TypeName.
de: Ungültiges dreiteiliges Namenformat für TypeName.
es: El formato de nombres con 3 partes no es válido para TypeName.
fr: Format de nom en 3 parties de TypeName non valide.
it: Formato del nome in tre parti non valido per TypeName.
ja: TypeName の 3 部構成の名前形式が無効です。
ko: TypeName의 세 부분으로 된 이름 형식이 잘못되었습니다.
pt_br: 3 formatos de nome de parte inválidos para TypeName.
ru: Недопустимый формат имени из трех частей для TypeName.
zh_hans: TypeName 的三部分名称格式无效。
zh_hant: TypeName 的 3 個名稱組成格式無效。

# SQL_InvalidParameterNameLength
source: The length of the parameter '{0}' exceeds the limit of 128 characters.
de: Der Parameter '{0}' überschreitet die zulässige Länge von 128 Zeichen.
es: La longitud del parámetro '{0}' supera el límite de 128 caracteres.
fr: La longueur du paramètre '{0}' dépasse la limite de 128 caractères.
it: La lunghezza del parametro "{0}" supera il limite di 128 caratteri.
ja: パラメーター '{0}' の長さが、上限の 128 文字を超えています。
ko: 매개 변수 '{0}'의 길이가 한계인 128자를 초과합니다.
pt_br: O comprimento do parâmetro '{0}' excede o limite de 128 caracteres.
ru: Длина параметра {0} превышает допустимую длину в 128 символов.
zh_hans: 参数“{0}”的长度超过了 128 个字符的限制。
zh_hant: 參數 '{0}' 的長度超過 128 個字元的上限。

# SQL_PrecisionValueOutOfRange
source: Precision value '{0}' is either less than 0 or greater than the maximum allowed precision of 38.
de: Der Genauigkeitswert '{0}' ist kleiner als 0 oder größer als die zugelassene maximale Genauigkeit von 38.
es: El valor de precisión '{0}' es menor que 0 o mayor que la precisión máxima permitida de 38.
fr: Valeur de précision '{0}' est inférieure à 0 ou supérieure à la précision maximale autorisée de 38.
it: Il valore di precisione '{0}' è minore di zero o maggiore della precisione massima consentita (38).
ja: 桁数値 '{0}' が 0 未満か、許可されている桁数の最大値 38 を超えています。
ko: 전체 자릿수 값 '{0}'이(가) 0보다 작거나 허용하는 최대 전체 자릿수 38보다 큽니다.
pt_br: Valor de precisão '{0}' é menor do que 0 ou maior do que a precisão máxima permitida de 38.
ru: Значение точности "{0}" меньше 0 или больше максимально разрешенной точности, равной 38.
zh_hans: 精度值“{0}”或者小于 0，或者大于允许的最大精度 38。
zh_hant: 整數位數值 '{0}' 不是小於 0，就是大於整數位數所允許的最大值 38 個位數。

# SQL_ScaleValueOutOfRange
source: Scale value '{0}' is either less than 0 or greater than the maximum allowed scale of 38.
de: Der Wert der Dezimalstellenanzahl '{0}' ist entweder kleiner 0 oder größer als der maximal zulässige Wert 38.
es: El valor de escala '{0}' es menor que 0 o mayor que la escala máxima permitida de 38.
fr: La valeur d'échelle '{0}' est inférieure à 0 ou supérieure à l'échelle maximale autorisée, 38.
it: Il valore di scala "{0}" è minore di 0 o maggiore della scala massima consentita di 38.
ja: スケール値 '{0}' が 0 未満か、許可されているスケールの最大値 38 を超えています。
ko: 소수 자릿수 값 '{0}'이(가) 0보다 작거나 허용되는 최대 소수 자릿수 38보다 큽니다.
pt_br: O valor de escala '{0}' é menor do que 0 ou maior do que a escala máxima permitida de 38.
ru: Значение масштаба "{0}" меньше 0 или больше максимально разрешенного масштаба, равного 38.
zh_hans: 小数位数值“{0}”不是小于 0，就是大于允许的最大小数位数 38。
zh_hant: 小數位數值 '{0}' 不可小於 0 或大於允許的小數位數最大值 38。

# SQL_TimeScaleValueOutOfRange
source: Scale value '{0}' is either less than 0 or greater than the maximum allowed scale of 7.
de: Der Skalierungswert '{0}' ist kleiner als 0 oder größer als die zugelassene maximale Skalierung von 7.
es: El valor de escala '{0}' es menor que 0 o mayor que la máxima escala de 7 permitida.
fr: La valeur d'échelle '{0}' est inférieure à 0 ou supérieure à la valeur d'échelle maximale autorisée de 7.
it: Il valore di scala "{0}" è minore di 0 o maggiore della scala massima consentita di 7.
ja: 小数点以下桁数値 '{0}' が 0 未満であるか、許可されている小数点以下桁数の最大値 7 を超えています。
ko: 소수 자릿수 값 '{0}'이(가) 0보다 작거나 허용되는 최대 소수 자릿수 7보다 큽니다.
pt_br: O valor da escala '{0}' ou é menor do que 0 ou maior que a escala máxima permitida de 7.
ru: Масштаб "{0}" меньше 0 или больше максимально допустимого масштаба, равного 7.
zh_hans: 小数位数值“{0}”小于 0 或大于小数位数允许的最大值 7。
zh_hant: 小數位數值 '{0}' 不可小於 0 或大於允許的小數位數最大值 7。

# SQL_ParameterInvalidVariant
source: Parameter '{0}' exceeds the size limit for the sql_variant datatype.
de: Der Parameter '{0}' überschreitet die Maximalgröße für den sql_variant-Datentyp.
es: El parámetro '{0}' supera el límite de tamaño en sql_variant datatype.
fr: Paramètre '{0}' dépasse la taille limite pour le type de données sql_variant.
it: Il parametro '{0}' eccede il limite di dimensione del tipo di dati sql_variant.
ja: パラメーター '{0}' が sql_variant データ型のサイズ制限を超えています。
ko: '{0}' 매개 변수가 sql_variant 데이터 형식의 크기 제한을 초과합니다.
pt_br: Parâmetro '{0}' excede o limite de tamanho para o tipo de dados sql_variant.
ru: Размер параметра "{0}" превышает предельный размер для типа данных sql_variant.
zh_hans: 参数“{0}”超过 sql_variant 数据类型的大小限制。
zh_hant: 參數 '{0}' 超過 sql_variant 資料型別的大小限制。

# SQL_ParameterTypeNameRequired
source: The {0} type parameter '{1}' must have a valid type name.
de: Der {0}-Typparameter '{1}' muss einen gültigen Typnamen haben.
es: El parámetro del tipo {0} '{1}' debe tener un nombre de tipo válido.
fr: Le paramètre '{1}' du type {0} doit avoir un nom de type valide.
it: Il parametro '{1}' del tipo {0} deve avere un nome di tipo valido.
ja: {0} 型パラメーター '{1}' には、有効な型名が必要です。
ko: {0} 형식 매개 변수 '{1}'에 올바른 형식 이름이 있어야 합니다.
pt_br: O tipo de parâmetro {0} '{1}' deve ter um nome de tipo válido.
ru: Параметр "{1}" типа {0} должен иметь допустимое имя типа.
zh_hans: {0} 类型参数“{1}”的类型名必须有效。
zh_hant: {0} 型別參數 '{1}' 必須具有有效的型別名稱。

# SQL_InvalidInternalPacketSize
source: Invalid internal packet size:
de: Ungültige interne Paketgröße:
es: Tamaño del paquete interno no válido:
fr: Taille de paquet interne non valide :
it: Dimensioni del pacchetto interno non valide:
ja: 無効な内部パケット サイズ:
ko: 내부 패킷 크기가 잘못되었습니다.
pt_br: Tamanho do pacote interno inválido:
ru: Недопустимый размер внутреннего пакета:
zh_hans: 内部数据包大小无效:
zh_hant: 無效的內部封包大小:

# SQL_InvalidTDSVersion
source: The SQL Server instance returned an invalid or unsupported protocol version during login negotiation.
de: Die SQL Server-Instanz gab während der Anmeldungsverhandlung eine ungültige oder nicht unterstützte Protokollversion zurück.
es: La instancia de SQL Server ha devuelto una versión de protocolo no válida o incompatible durante la negociación de inicio de sesión.
fr: L'instance SQL Server a retourné une version de protocole non valide ou non prise en charge lors de la négociation de la connexion.
it: L'istanza di SQL Server ha restituito una versione del protocollo non valida o non supportata durante la negoziazione dell'accesso.
ja: ログインのネゴシエーション中に、無効なまたはサポートされていないプロトコル バージョンが SQL Server インスタンスから返されました。
ko: SQL Server 인스턴스가 로그인 협상 중에 잘못되거나 지원되지 않는 프로토콜 버전을 반환했습니다.
pt_br: A instância do SQL Server retornou uma versão inválida ou não suportada do protocolo durante a negociação de logon.
ru: В процессе согласования входа экземпляр SQL Server вернул недопустимую или неподдерживаемую версию протокола.
zh_hans: SQL Server 实例在登录协商期间返回无效的或不支持的协议版本。
zh_hant: 登入交涉時，SQL Server 執行個體傳回無效或不支援的協定版本。

# SQL_InvalidTDSPacketSize
source: Invalid Packet Size.
de: Ungültige Paketgröße.
es: Tamaño de paquete no válido.
fr: Taille de paquet non valide.
it: Dimensioni del pacchetto non valide.
ja: 無効なパケット サイズです。
ko: 패킷 크기가 잘못되었습니다.
pt_br: Tamanho do Pacote Inválido.
ru: Недопустимый размер пакета.
zh_hans: 数据包大小无效。
zh_hant: 無效的封包大小。

# SQL_ParsingError
source: Internal connection fatal error.
de: Schwerwiegender Fehler bei interner Verbindung.
es: Error irrecuperable de conexión interna.
fr: Erreur irrécupérable de connexion interne.
it: Errore irreversibile della connessione interna.
ja: 内部接続の致命的なエラーです。
ko: 내부 연결에 심각한 오류가 발생했습니다.
pt_br: Erro fatal de conexão interna.
ru: Неустранимая ошибка подключения.
zh_hans: 内部连接致命错误。
zh_hant: 內部連接嚴重錯誤。

# SQL_ParsingErrorWithState
source: Internal connection fatal error. Error state: {0}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}
es: Error irrecuperable de conexión interna. Estado de error: {0}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}
it: Errore irreversibile di connessione interno. Stato errore: {0}
ja: 内部接続の致命的なエラーです。エラー状態: {0}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}
zh_hans: 内部连接致命错误。错误状态: {0}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}。

# SQL_ParsingErrorValue
source: Internal connection fatal error. Error state: {0}, Value: {1}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}, Wert: {1}
es: Error irrecuperable de conexión interna. Estado de error: {0}, valor: {1}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}, Valeur : {1}
it: Errore irreversibile di connessione interno. Stato errore: {0}. Valore: {1}
ja: 内部接続の致命的なエラーです。エラー状態: {0}、値: {1}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}, 값: {1}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}, Valor: {1}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}, Значение: {1}
zh_hans: 内部连接致命错误。错误状态: {0}，值: {1}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}，值: {1}。

# SQL_ParsingErrorOffset
source: Internal connection fatal error. Error state: {0}, Offset: {1}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}, Offset: {1}
es: Error irrecuperable de conexión interna. Estado de error: {0}, desplazamiento: {1}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}, Décalage : {1}
it: Errore irreversibile di connessione interno. Stato errore: {0}. Offset: {1}
ja: 内部接続の致命的なエラーです。エラー状態: {0}、オフセット: {1}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}, 오프셋: {1}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}, Deslocamento: {1}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}, Смещение: {1}
zh_hans: 内部连接致命错误。错误状态: {0}，偏移: {1}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}，位移: {1}。

# SQL_ParsingErrorFeatureId
source: Internal connection fatal error. Error state: {0}, Feature Id: {1}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}, Feature-ID: {1}
es: Error irrecuperable de conexión interna. Estado de error: {0}, id. de característica: {1}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}, ID de fonctionnalité : {1}
it: Errore irreversibile di connessione interno. Stato errore: {0}. ID funzionalità: {1}
ja: 内部接続の致命的なエラーです。エラー状態: {0}、機能 ID: {1}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}, 기능 ID: {1}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}, ID do recurso: {1}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}, Идентификатор компонента: {1}
zh_hans: 内部连接致命错误。错误状态: {0}，功能 ID: {1}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}，功能識別碼: {1}。

# SQL_ParsingErrorToken
source: Internal connection fatal error. Error state: {0}, Token : {1}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}, Token : {1}
es: Error irrecuperable de conexión interna. Estado de error: {0}, token: {1}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}, Jeton : {1}
it: Errore irreversibile di connessione interno. Stato errore: {0}. Token: {1}
ja: 内部接続の致命的なエラーです。エラー状態: {0}、トークン: {1}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}, 토큰: {1}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}, Token: {1}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}, Токен: {1}
zh_hans: 内部连接致命错误。错误状态: {0}，标记: {1}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}，語彙基元: {1}。

# SQL_ParsingErrorLength
source: Internal connection fatal error. Error state: {0}, Length: {1}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}, Länge: {1}
es: Error irrecuperable de conexión interna. Estado de error: {0}, longitud: {1}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}, Longueur : {1}
it: Errore irreversibile di connessione interno. Stato errore: {0}. Durata: {1}
ja: 内部接続の致命的なエラーです。エラー状態: {0}、長さ: {1}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}, 길이: {1}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}, Comprimento: {1}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}, Длина: {1}
zh_hans: 内部连接致命错误。错误状态: {0}，长度: {1}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}，長度: {1}。

# SQL_ParsingErrorStatus
source: Internal connection fatal error. Error state: {0}, Status: {1}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}, Status: {1}
es: Error irrecuperable de conexión interna. Estado de error: {0}, estado: {1}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}, État : {1}
it: Errore irreversibile di connessione interno. Stato errore: {0}. Stato: {1}
ja: 内部接続の致命的なエラーです。エラー状態: {0}、状況: {1}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}, 상태: {1}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}, Status: {1}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}, Статус: {1}
zh_hans: 内部连接致命错误。错误状态: {0}，状态: {1}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}，狀態: {1}。

# SQL_ParsingErrorAuthLibraryType
source: Internal connection fatal error. Error state: {0}, Authentication Library Type: {1}
de: Schwerwiegender Fehler bei interner Verbindung. Fehlerzustand: {0}, Authentifzierungsbibliothektyp: {1}
es: Error irrecuperable de conexión interna. Estado de error: {0}, tipo de biblioteca de autenticación: {1}
fr: Erreur irrécupérable de connexion interne. État d'erreur : {0}, Type de bibliothèque d'authentification : {1}
it: Errore irreversibile di connessione interno. Stato errore: {0}. Tipo della libreria di autenticazione: {1}
ja: 内部接続の致命的なエラーです。エラー状態: {0}、認証ライブラリの種類: {1}
ko: 심각한 내부 연결 오류입니다. 오류 상태: {0}, 인증 라이브러리 형식: {1}
pt_br: Erro fatal de conexão interna. Estado do erro: {0}, Tipo da biblioteca de autenticação: {1}
ru: Неустранимая ошибка подключения. Состояние ошибки: {0}, Тип библиотеки аутентификации: {1}
zh_hans: 内部连接致命错误。错误状态: {0}，身份验证库类型: {1}
zh_hant: 內部連接發生嚴重錯誤。錯誤狀態: {0}，驗證程式庫類型: {1}。

# SQL_ConnectionLockedForBcpEvent
source: The connection cannot be used because there is an ongoing operation that must be finished.
de: Die Verbindung kann nicht verwendet werden, da erst eine laufende Operation abgeschlossen werden muss.
es: No se puede utilizar la conexión, hay una operación saliente que debe finalizar.
fr: La connexion ne peut pas être utilisée car une opération en cours doit être terminée.
it: La connessione non può essere utilizzata perché l'operazione in corso non è ancora terminata.
ja: 終了する必要がある操作がまだ実行されているため、この接続を使用できません。
ko: 진행 중인 작업을 완료해야 하므로 연결을 사용할 수 없습니다.
pt_br: A conexão não pode ser usada, pois existe uma operação em andamento que deve ser concluída.
ru: Подключение не может быть использовано, поскольку предварительно должна завершиться выполняемая операция.
zh_hans: 连接无法使用，因为正在进行的操作必须完成。
zh_hant: 無法建立連接，因為必須有某個進行中的操作必須先予以完成。

# SQL_SNIPacketAllocationFailure
source: Memory allocation for internal connection failed.
de: Fehler bei der Speicherbelegung für die interne Verbindung.
es: No se pudo realizar la asignación de memoria para conexión interna.
fr: Échec de l'allocation de la mémoire pour la connexion interne.
it: Allocazione della memoria per la connessione interna non riuscita.
ja: 内部接続のメモリ割り当てが失敗しました。
ko: 내부 연결에 대한 메모리 할당이 실패했습니다.
pt_br: Falha na alocação de memória para conexão interna.
ru: Ошибка выделения памяти для внутреннего соединения.
zh_hans: 用于内部连接的内存分配失败。
zh_hant: 內部連接的記憶體配置失敗。

# SQL_SmallDateTimeOverflow
source: SqlDbType.SmallDateTime overflow. Value '{0}' is out of range. Must be between 1/1/1900 12:00:00 AM and 6/6/2079 11:59:59 PM.
de: SqlDbType.SmallDateTime-Überlauf. Der Wert '{0}' liegt außerhalb des gültigen Bereichs. Der Wert muss zwischen 1/1/1900 12:00:00 AM und 6/6/2079 11:59:59 PM liegen.
es: Desbordamiento de SqlDbType.SmallDateTime. El valor '{0}' está fuera del intervalo, debe estar entre el 1/1/1900 12:00:00 a.m. y el 6/6/2079 11:59:59 a.m.
fr: Dépassement SqlDbType.SmallDateTime. La valeur '{0}' est hors limites. Elle doit être comprise entre 1/1/1900 12:00:00 AM et 6/6/2079 11:59:59 PM.
it: Overflow di SqlDbType.SmallDateTime. Il valore '{0}' non è incluso nell'intervallo. Deve essere compreso fra 1/1/1900 00.00.00 e 6/6/2079 23.59.59.
ja: SqlDbType.SmallDateTime のオーバーフローです。 値 '{0}' は領域を越えています。値は 1/1/1900 12:00:00 AM と 6/6/2079 11:59:59 PM の間でなければなりません。
ko: SqlDbType.SmallDateTime 오버플로가 발생했습니다. '{0}' 값이 범위를 벗어났습니다. 이 값은 1900년 1월 1일 오전 12:00:00에서 2079년 6월 6일 오후 11:59:59 사이에 있어야 합니다.
pt_br: Estouro de SqlDbType.SmallDateTime. O valor '{0}' está fora do intervalo. Ele deverá estar entre 1/1/1900 12:00:00 AM e 6/6/2079 11:59:59 PM.
ru: Переполнение SqlDbType.SmallDateTime. Значение "{0}" вне допустимого диапазона. Должно находиться в пределах от 1/1/1900 12:00:00 AM и 6/6/2079 11:59:59 PM.
zh_hans: SqlDbType.SmallDateTime 溢出。值“{0}”超出范围。必须介于 1/1/1900 12:00:00 AM 和 6/6/2079 11:59:59 PM 之间。
zh_hant: SqlDbType.SmallDateTime 已溢位。值 '{0}' 超出範圍。這個值必須介於 1/1/1900 12:00:00 AM 和 6/6/2079 11:59:59 PM 之間。
