Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# Expr_InvalidNameBracketing
source: The expression contains invalid name: '{0}'.
de: Der Ausdruck enthält den ungültigen Namen: '{0}'.
es: La expresión contiene un nombre no válido: '{0}'.
fr: L'expression contient un nom non valide : '{0}'.
it: L'espressione contiene un nome non valido: '{0}'.
ja: 式に無効な名前 : '{0}' が含まれています。
ko: 식에 잘못된 이름이 있습니다. '{0}'
pt_br: A expressão contém nome inválido: '{0}'.
ru: Выражение содержит недопустимое имя: "{0}".
zh_hans: 表达式包含无效名称:“{0}”。
zh_hant: 運算式包含無效的名稱: '{0}'。

# Expr_MissingOperandBefore
source: Syntax error: Missing operand before '{0}' operator.
de: Syntaxfehler: Fehlender Operand vor dem Operator '{0}'.
es: Error de sintaxis: falta el operando antes del operador '{0}'.
fr: Erreur de syntaxe : opérande manquant avant l'opérateur '{0}'.
it: Errore di sintassi: operando mancante prima dell'operatore '{0}'.
ja: 構文エラー : '{0}' 演算子の前にオペランドがありません。
ko: 구문 오류: '{0}' 연산자 앞에 피연산자가 없습니다.
pt_br: Erro de sintaxe: operando ausente antes do operador '{0}'.
ru: Синтаксическая ошибка: отсутствует операнд перед оператором "{0}".
zh_hans: 语法错误:“{0}”运算符前缺少操作数。
zh_hant: 語法錯誤: '{0}' 運算子之前遺漏運算元。

# Expr_TooManyRightParentheses
source: The expression has too many closing parentheses.
de: Der Ausdruck hat zu viele schließende Klammern.
es: La expresión tiene demasiados paréntesis de cierre.
fr: Parenthèses fermantes trop nombreuses dans l'expression.
it: L'espressione presenta troppe parentesi di chiusura.
ja: 式に含まれる閉じかっこが多すぎます。
ko: 식에 닫는 괄호가 너무 많이 있습니다.
pt_br: A expressão tem muitos parênteses de fechamento excedentes.
ru: Выражение содержит лишние круглые скобки.
zh_hans: 表达式中右括号过多。
zh_hant: 運算式有太多右括號。

# Expr_UnresolvedRelation
source: The table [{0}] involved in more than one relation. You must explicitly mention a relation name in the expression '{1}'.
de: Die Tabelle [{0}] hat mehrere Beziehungen. Geben Sie einen eindeutigen Beziehungsnamen im Ausdruck '{1}' an.
es: La tabla [{0}] se encuentra en más de una relación. Debe mencionar el nombre de la relación en la expresión '{1}'.
fr: La table [{0}] est incluse dans plusieurs relations. Vous devez mentionner explicitement un nom de relation dans l'expression '{1}'.
it: La tabella [{0}] è parte di più relazioni. Occorre specificare esplicitamente un nome di relazione nell'espressione '{1}'.
ja: テーブル [{0}] が 2 つ以上のリレーションシップで呼び出されました。式 '{1}' のリレーションシップ名を明示的に記述してください。
ko: 테이블[{0}]이 둘 이상의 관계에 관련되어 있습니다. '{1}' 식의 관계 이름을 명시적으로 기술해야 합니다.
pt_br: A tabela [{0}] está envolvida em mais de uma relação. Mencione explicitamente um nome de relação na expressão '{1}'.
ru: Таблица [{0}] участвует в нескольких отношениях. В выражении "{1}" требуется указать имя отношения в явном виде.
zh_hans: 表 [{0}] 涉及不只一个关系。您必须在表达式“{1}”中明确提出一个关系名称。
zh_hant: 資料表 [{0}] 已經包含在多個關聯中。您必須在運算式 '{1}' 明確指定關聯名稱。

# Expr_AggregateArgument
source: Syntax error in aggregate argument: Expecting a single column argument with possible 'Child' qualifier.
de: Syntaxfehler im Aggregatargument: Es wird ein Einzelspaltenargument erwartet, das möglicherweise einen 'Child'-Qualifizierer hat.
es: Error de sintaxis en el argumento aggregate: Se esperaba una columna simple con un calificador 'Child'.
fr: Erreur de syntaxe dans l'argument d'agrégation : argument de colonne unique attendu avec un possible qualificateur 'Child'.
it: Errore di sintassi nell'argomento di aggregazione: previsto un argomento a colonna singola con possibile qualificatore 'Child'.
ja: 集約引数の構文エラー : 可能な 'Child' 修飾子を含む単一列の引数を指定してください。
ko: aggregate 인수에 구문 오류가 있습니다. 'Child' 한정자를 사용하는 단일 열 인수가 필요합니다.
pt_br: Erro de sintaxe em argumento agregado: era esperado um argumento de uma única coluna com possível qualificador 'Child'.
ru: Синтаксическая ошибка в составном аргументе: ожидается аргумент, состоящий из одного столбца, возможно, с квалификатором Child.
zh_hans: 聚合参数中的语法错误: 需要具有可能的“Child”限定符的单个列参数。
zh_hant: 彙總引數中語法錯誤: 必須是擁有可能 'Child' 限定詞的單一資料行引數。

# Expr_AggregateUnbound
source: Unbound reference in the aggregate expression '{0}'.
de: Ungebundener Verweis im Aggregatausdruck '{0}'.
es: Referencia sin enlazar en la expresión aggregate '{0}'.
fr: Référence indépendante dans l'expression d'agrégation '{0}'.
it: Riferimento non associato nell'espressione di aggregazione '{0}'.
ja: 集約式 '{0}' に非連結参照があります。
ko: 집계식 '{0}'에 바인딩되지 않은 참조가 있습니다.
pt_br: Referência não associada na expressão agregada '{0}'.
ru: Не привязанная ссылка в составном выражении "{0}".
zh_hans: 聚合表达式“{0}”中的未绑定引用。
zh_hant: 彙總運算式 '{0}' 中未繫結的參考。

# Expr_EvalNoContext
source: Cannot evaluate non-constant expression without current row.
de: Ein nicht konstanter Ausdruck kann nicht ohne die aktuelle Zeile ausgewertet werden.
es: No se puede evaluar una expresión no constante en la fila actual.
fr: Impossible d'évaluer une expression autre que de constante sans la ligne actuelle.
it: Impossibile valutare un'espressione non costante senza riga corrente.
ja: カレント行なしで定数以外の式を評価することはできません。
ko: 현재 행이 없는 비상수 식을 계산할 수 없습니다.
pt_br: Não é possível avaliar uma expressão não constante sem linha atual.
ru: Невозможно вычислить непостоянное выражение без текущей строки.
zh_hans: 没有当前行就无法计算非常数表达式。
zh_hant: 無法評估沒有目前資料列的非常數運算式。

# Expr_ExpressionUnbound
source: Unbound reference in the expression '{0}'.
de: Ungebundene Verweise im Ausdruck '{0}'.
es: Referencia sin enlazar en la expresión '{0}'.
fr: Référence indépendante dans l'expression '{0}'.
it: Riferimento non associato nell'espressione '{0}'.
ja: 式 '{0}' に非連結参照があります。
ko: '{0}' 식에 바인딩되지 않은 참조가 있습니다.
pt_br: Referência não associada na expressão '{0}'.
ru: Не привязанная ссылка в выражении "{0}".
zh_hans: 表达式“{0}”中的未绑定引用。
zh_hant: 運算式 '{0}' 中未繫結的參考。

# Expr_ComputeNotAggregate
source: Cannot evaluate. Expression '{0}' is not an aggregate.
de: Auswerten nicht möglich. Der Ausdruck '{0}' ist kein Aggregat.
es: No se puede evaluar. La expresión '{0}' no es un agregado.
fr: Impossible de calculer. L'expression '{0}' n'est pas un agrégat.
it: '{0}' non è un'espressione di aggregazione. Impossibile valutarla.
ja: 評価できません。式 '{0}' は集約ではありません。
ko: 계산할 수 없습니다. '{0}' 식은 집계식이 아닙니다.
pt_br: Não é possível avaliar. Expressão '{0}' não é agregada.
ru: Невозможно вычислить. Выражение "{0}" не является составным.
zh_hans: 无法计算。表达式“{0}”不是聚合。
zh_hant: 無法評估。運算式 '{0}' 不是彙總。

# Expr_FilterConvertion
source: Filter expression '{0}' does not evaluate to a Boolean term.
de: Der Filterausdruck '{0}' wertet nicht auf einen Boolean-Wert aus.
es: La expresión de filtro '{0}' no evalúa un término Boolean.
fr: L'expression de filtre '{0}' ne peut pas correspondre à un terme Boolean.
it: L'espressione filtro '{0}' non restituisce un valore Boolean.
ja: フィルター式 '{0}' は Boolean 型に対して評価しません。
ko: '{0}' 필터 식은 Boolean 형식으로 계산되지 않습니다.
pt_br: Expressão de filtro '{0}' não avalia um termo Boolean.
ru: Выражение фильтра "{0}" не задает логический терм Boolean.
zh_hans: 筛选表达式“{0}”的计算结果不是 Boolean 值项。
zh_hant: 篩選條件運算式 '{0}' 不會評估成 Boolean 詞彙。

# Expr_InvalidType
source: Invalid type name '{0}'.
de: Ungültiger Typname '{0}'.
es: El nombre de tipo '{0}' no es válido.
fr: Nom de type '{0}' non valide.
it: Nome di tipo non valido: '{0}'.
ja: 型名 '{0}' が無効です。
ko: 형식 이름 '{0}'이(가) 잘못되었습니다.
pt_br: Nome de tipo inválido '{0}'.
ru: Недопустимое имя типа "{0}".
zh_hans: 无效的类型名称“{0}”。
zh_hant: 無效的型別名稱 '{0}'。

# Expr_LookupArgument
source: Syntax error in Lookup expression: Expecting keyword 'Parent' followed by a single column argument with possible relation qualifier: Parent[(<relation_name>)].<column_name>.
de: Syntaxfehler in Lookup-Ausdruck: Es wird erwartet, dass das Schlüsselwort 'Parent' von nur einem Spaltenargument gefolgt ist, mit möglichem Beziehungsqualifizierer: Parent[(<Beziehung_Name>)].<Spalte_Name>.
es: Error de sintaxis en la expresión de búsqueda: se esperaba la palabra clave 'Parent' seguida de un argumento en una columna con un calificador de relación: Parent[(<relation_name>)].<column_name>.
fr: Erreur de syntaxe dans l'expression de recherche : mot clé 'Parent' attendu suivi d'un argument de colonne avec un qualificateur de relation si nécessaire : Parent[(<nom_relation>)].<nom_colonne>.
it: Errore di sintassi nell'espressione di ricerca: prevista la parola chiave 'Parent' seguita da un argomento che individua una sola colonna con possibile qualificatore di relazione: Parent[(<nome_relazione>)].<nome_colonna>.
ja: ルックアップ式の構文エラー : キーワード 'Parent' の後にリレーションシップ修飾子を含む単一列引数を指定してください : Parent[(<relation_name>)].<column_name
ko: 조회식에 구문 오류가 있습니다. 'Parent' 키워드 다음에는 관계 한정자를 사용하는 단일 열 인수가 필요합니다. Parent[(<relation_name>)].<column_name>.
pt_br: Erro de sintaxe na expressão Lookup: é esperada a palavra-chave 'Parent' seguida de um argumento de coluna única com possível qualificador de relação: Parent[(<nome_relação>)].<nome_relação>.
ru: Синтаксическая ошибка в выражении Lookup: Ожидается слово Parent, за которым следует аргумент, состоящий из одного столбца, возможно, с квалификатором отношения: Parent[(<имя отношения>)].<имя столбца>.
zh_hans: 查找表达式中的语法错误: 关键字“Parent”之后应当是具有可能的关系限定符的单个列参数: Parent[(<relation_name>)].<column_name>。
zh_hant: 查詢運算式中語法錯誤: 必須是關鍵字 'Parent' 之後跟隨擁有可能關聯限定詞的單一資料行引數: Parent[(<relation_name>)].<column_name>。

# Expr_InvokeArgument
source: Need a row or a table to Invoke DataFilter.
de: Zum Aufrufen von DataFilter ist eine Zeile oder eine Tabelle erforderlich.
es: Es necesaria una fila o una tabla para invocar DataFilter.
fr: Ligne ou table requise pour appeler DataFilter.
it: Per richiamare DataFilter occorre specificare una riga o una tabella.
ja: DataFilter を呼び出すには行またはテーブルが必要です。
ko: DataFilter를 호출할 행 또는 테이블이 필요합니다.
pt_br: É necessária uma linha ou uma tabela para invocar DataFilter.
ru: Для вызова DataFilter требуется строка или таблица.
zh_hans: 需要一行或一个表来调用 DataFilter。
zh_hant: 需要資料列或資料表以叫用 DataFilter。

# Expr_ArgumentOutofRange
source: {0}() argument is out of range.
de: Das Argument {0}() befindet sich außerhalb des gültigen Bereichs.
es: El argumento {0}() está fuera del intervalo.
fr: Argument {0}() hors limites.
it: Argomento {0}() non compreso nell'intervallo.
ja: {0}() 引数が範囲外です。
ko: {0}() 인수가 범위를 벗어났습니다.
pt_br: Argumento {0}() está fora do intervalo.
ru: Аргумент для {0}() вне допустимого диапазона.
zh_hans: {0}()参数超出范围。
zh_hant: {0}() 引數超過範圍。

# Expr_IsSyntax
source: Syntax error: Invalid usage of 'Is' operator. Correct syntax: <expression> Is [Not] Null.
de: Syntaxfehler: Ungültige Verwendung des 'Is'-Operators. Richtige Syntax: <Ausdruck> Is [Not] Null.
es: Error de sintaxis: uso no válido del operador 'Is'. Sintaxis correcta: <expression> Is [Not] Null.
fr: Erreur de syntaxe : utilisation non valide de l'opérateur 'Is'. La syntaxe correcte est : <expression> Is [Not] Null.
it: Errore di sintassi: utilizzo non valido dell'operatore 'Is'. Sintassi corretta: <espressione> Is [Not] Null.
ja: 構文エラー : 'Is' 演算子の使用が無効です。正しい構文 : <expression> Is [Not] Null
ko: 구문 오류: 'Is' 연산자 사용이 잘못되었습니다. 올바른 구문: <expression> Is [Not] Null
pt_br: Erro de sintaxe: uso inválido do operador 'Is'. Sintaxe correta: <expression> Is [Not] Null.
ru: Синтаксическая ошибка: Недопустимое использование оператора Is. Допустимый синтаксис: <выражение> Is [Not] Null.
zh_hans: 语法错误:“Is”运算符的用法无效。正确语法是: <expression> Is [Not] Null。
zh_hant: 語法錯誤: 'Is' 運算子的用法無效。正確語法: <expression> Is [Not] Null。

# Expr_Overflow
source: Value is either too large or too small for Type '{0}'.
de: Der Wert ist zu groß oder zu klein für den Typ '{0}'.
es: Valor demasiado grande o demasiado pequeño para un tipo '{0}'.
fr: La valeur est trop grande ou trop petite pour le type '{0}'.
it: Valore troppo grande o troppo piccolo per il tipo '{0}'.
ja: 値が型 '{0}' に対して大きすぎるか、小さすぎます。
ko: 값이 '{0}' 형식에 비해 너무 크거나 작습니다.
pt_br: Valor muito grande ou muito pequeno para Type '{0}'.
ru: Значение недопустимо мало или недопустимо велико для типа "{0}".
zh_hans: 值对于类型“{0}”而言或者太大或者太小。
zh_hant: 型別 '{0}' 的值太大或太小。

# Expr_DivideByZero
source: Divide by zero error encountered.
de: Fehler aufgrund einer Division durch 0.
es: Error al dividir por cero.
fr: Erreur : division par zéro.
it: Errore di divisione per zero.
ja: 0 除算エラーが発生しました。
ko: 0으로 나눔 오류가 발생했습니다.
pt_br: Erro de divisão por zero.
ru: Ошибка деления на нуль.
zh_hans: 出现被零除错误。
zh_hant: 發生除以零的錯誤。

# Expr_BindFailure
source: Cannot find the parent relation '{0}'.
de: Die übergeordnete Beziehung '{0}' kann nicht gefunden werden.
es: No se encuentra la relación primaria '{0}'.
fr: Relation parent '{0}' introuvable.
it: Impossibile trovare la relazione padre "{0}".
ja: 親リレーションシップ '{0}' が見つかりません。
ko: 부모 관계 '{0}'을(를) 찾을 수 없습니다.
pt_br: Não é possível localizar a relação pai '{0}'.
ru: Невозможно найти родительское отношение"{0}".
zh_hans: 找不到父关系“{0}”。
zh_hant: 找不到父關聯 '{0}'。

# Expr_InvalidHoursArgument
source: 'hours' argument is out of range. Value must be between -14 and +14.
de: Das 'hours'-Argument liegt außerhalb des gültigen Bereichs. Der Wert muss zwischen -14 und +14 liegen.
es: El argumento 'hours' está fuera del intervalo. El valor debe estar comprendido entre -14 y +14.
fr: Argument 'hours' hors limites. Spécifiez une valeur comprise entre -14 et +14.
it: L'argomento 'hours' non è compreso nell'intervallo. Il valore deve essere compreso tra -14 e +14.
ja: 'hours' 引数が有効範囲を超えています。-14 から +14 までの値を指定してください。
ko: 'hours' 인수가 범위를 벗어났습니다. -14에서 +14 사이의 값이어야 합니다.
pt_br: O argumento 'hours' está fora do intervalo. O valor deve estar entre -14 e +14.
ru: Аргумент "hours" находится вне допустимого диапазона. Это значение должно находиться в диапазоне от -14 до +14.
zh_hans: “hours”参数超出范围。其值必须在 -14 到 +14 之间。
zh_hant: 'hours' 引數超出範圍。值必須介於 -14 到 +14 之間。

# Expr_InvalidMinutesArgument
source: 'minutes' argument is out of range. Value must be between -59 and +59.
de: Das 'minutes'-Argument liegt außerhalb des gültigen Bereichs. Der Wert muss zwischen -59 und +59 liegen.
es: El argumento 'minutes' está fuera del intervalo. El valor debe estar comprendido entre -59 y +59.
fr: Argument 'minutes' hors limites. Spécifiez une valeur comprise entre -59 et +59.
it: L'argomento 'minutes' non è compreso nell'intervallo. Il valore deve essere compreso tra -59 e +59.
ja: 'minutes' 引数が有効範囲を超えています。-59 から +59 までの値を指定してください。
ko: 'minutes' 인수가 범위를 벗어났습니다. -59에서 +59 사이의 값이어야 합니다.
pt_br: O argumento 'minutes' está fora do intervalo. O valor deve estar entre -59 e +59.
ru: Аргумент "minutes" находится вне допустимого диапазона. Это значение должно находиться в диапазоне от -59 до +59.
zh_hans: “minutes”参数超出范围。其值必须在 -59 到 +59 之间。
zh_hant: 'minutes' 引數超出範圍。值必須介於 -59 到 +59 之間。

# Expr_InvalidTimeZoneRange
source: Provided range for time one exceeds total of 14 hours.
de: Der angegebene erste Zeitraum liegt über dem Gesamtwert von 14 Stunden.
es: El primer intervalo de tiempo proporcionado supera un total de 14 horas.
fr: La plage indiquée pour l'heure dépasse le total de 14 heures.
it: L'intervallo fornito per l'ora supera il totale di 14 ore.
ja: タイム ゾーンに指定した範囲が、合計 14 時間を超えています。
ko: 제공된 시간 범위가 총 14시간을 초과합니다.
pt_br: O intervalo fornecido para a hora um excede o total de 14 horas.
ru: Приведенный диапазон для первого времени превышает 14 часов.
zh_hans: 为时区提供的范围超出了合计的 14 小时。
zh_hant: 對時間一提供的範圍超過 14 小時的總數。

# Expr_MismatchKindandTimeSpan
source: Kind property of provided DateTime argument, does not match 'hours' and 'minutes' arguments.
de: Die 'Kind'-Eigenschaft des angegebenen 'DateTime'-Arguments stimmt nicht mit den Argumenten 'hours' und 'minutes' überein.
es: La propiedad Kind del argumento DateTime proporcionado no coincide con los argumentos 'hours' y 'minutes'.
fr: La propriété Kind de l'argument DateTime fourni ne correspond pas aux arguments 'hours' et 'minutes'.
it: La proprietà Kind dell'argomento DateTime fornito non corrisponde agli argomenti 'hours' e 'minutes'.
ja: 指定した DateTime 引数の Kind プロパティが、'hours' 引数および 'minutes' 引数と一致しません。
ko: 제공된 DateTime 인수의 Kind 속성이 'hours' 및 'minutes' 인수와 일치하지 않습니다.
pt_br: A propriedade Kind do argumento DateTime fornecido não corresponde aos argumentos 'hours' e 'minutes'.
ru: Свойство Kind приведенного аргумента DateTime не совпадает с аргументами "hours" и "minutes".
zh_hans: 所提供的 DateTime 参数的 Kind 属性与“hours”和“minutes”参数不匹配。
zh_hant: 提供的 DateTime 引數的 Kind 屬性，不符合 'hours' 和 'minutes' 引數。

# Expr_UnsupportedType
source: A DataColumn of type '{0}' does not support expression.
de: Eine DataColumn vom Typ '{0}' wird vom Ausdruck nicht unterstützt.
es: Una DataColumn de tipo '{0}' no admite la expresión.
fr: Le DataColumn de type '{0}' ne prend pas en charge l'expression.
it: Un DataColumn di tipo '{0}' non supporta espressioni.
ja: 型 '{0}' の DataColumn では式がサポートされていません。
ko: 형식이 '{0}'인 DataColumn은 식을 지원하지 않습니다.
pt_br: Uma DataColumn de tipo '{0}' não dá suporte à expressão.
ru: DataColumn типа {0} не поддерживает выражения.
zh_hans: 类型为“{0}”的 DataColumn 不支持表达式。
zh_hant: 型別 '{0}' 的 DataColumn 不支援運算式。

# Data_EnforceConstraints
source: Failed to enable constraints. One or more rows contain values violating non-null, unique, or foreign-key constraints.
de: Einschränkungen konnten nicht aktiviert werden. Mindestens eine Zeile enthält Werte die die Einschränkungen non-null, unique or foreign-key verletzen.
es: No se pudieron habilitar las restricciones. Una o varias filas contienen valores que infringen las restricciones NON-NULL, UNIQUE o FOREIGN-KEY.
fr: Impossible d'activer les contraintes. Une ou plusieurs lignes contiennent des valeurs qui violent les contraintes de type non null, unique ou de clé externe.
it: Impossibile attivare i vincoli. Una o più righe contengono valori che violano il vincolo non-null, unique o foreign-key.
ja: 制約を有効にできませんでした。行に入力できるのは、Null 以外の値、一意な値、あるいは外部キーですが、この制約の違反が 1 つ以上の行で発生しています。
ko: 제약 조건을 활성화하지 못했습니다. 하나 이상의 행에 NOT NULL, UNIQUE 또는 외래 키 제약 조건을 위반하는 값이 있습니다.
pt_br: Falha ao ativar restrições. Uma ou mais linhas contêm valores que violam as restrições non-null, unique ou foreign-key.
ru: Не удалось включить ограничения. По меньшей мере одна строка содержит значение, нарушающее ограничения по отсутствию пустых значений, уникальности или внешним ключам.
zh_hans: 未能启用约束。一行或多行中包含违反非空、唯一或外键约束的值。
zh_hant: 無法啟用條件約束。一或多個資料列的值違反非 Null、唯一或外部索引鍵條件約束。

# Data_CannotModifyCollection
source: Collection itself is not modifiable.
de: Sammlung kann nicht geändert werden.
es: No se puede modificar la misma colección.
fr: La collection elle-même n'est pas modifiable.
it: La raccolta stessa non è modificabile.
ja: コレクション自体を変更することはできません。
ko: 컬렉션 자체를 수정할 수 없습니다.
pt_br: A coleção não é modificável.
ru: Сама коллекция не поддается изменению.
zh_hans: 集合本身是不可修改的。
zh_hant: 集合本身無法修改。

# Data_CaseInsensitiveNameConflict
source: The given name '{0}' matches at least two names in the collection object with different cases, but does not match either of them with the same case.
de: Der angegebene Name '{0}' stimmt mit mindestens zwei Namen im Sammlungsobjekt mit unterschiedlicher Groß-/Kleinschreibung überein.
es: El nombre dado '{0}' coincide con al menos dos nombres del objeto de la colección con uso distinto de mayúsculas o minúsculas, pero no coincide con ninguno en el que el uso de mayúsculas y minúsculas sea igual.
fr: Le nom '{0}' spécifié correspond au moins à deux noms de l'objet Collection avec une casse différente, mais ne correspond à aucun d'eux avec une casse identique.
it: Il nome '{0}' corrisponde ad almeno due nomi nell'oggetto Collection, ma con una diversa combinazione di maiuscole e minuscole.
ja: 指定された名前 '{0}' は、大文字小文字を区別しない場合は、コレクション オブジェクトの中で一致する名前が少なくとも 2 つあります。大文字小文字を区別する場合は、一致する名前はありません。
ko: 주어진 이름 '{0}'이(가) 대/소문자가 다른 컬렉션 개체의 이름과 적어도 두 개 이상 일치하지만 대/소문자가 일치하는 이름은 없습니다.
pt_br: O nome especificado '{0}' corresponde a pelo menos dois nomes no objeto da coleção com maiúsculas e minúsculas diferentes, mas não há uma correspondência com coincidência de maiúsculas e minúsculas.
ru: Указанное имя "{0}" без учета регистра совпадает по меньшей мере с двумя именами в объекте коллекции, но с учетом регистра не совпадает ни с одним из этих имен.
zh_hans: 给定的名称“{0}”至少与集合对象中的两个名称匹配，但大小写不同，并且不与其中任何一个的大小写匹配。
zh_hant: 指定名稱 '{0}' 至少與集合物件中的兩個物件名稱相符，但大小寫不完全相同。

# Data_NamespaceNameConflict
source: The given name '{0}' matches at least two names in the collection object with different namespaces.
de: Der angegebene Name '{0}' entspricht mindestens zwei Namen im Sammlungsobjekt mit unterschiedlichen Namespaces.
es: El nombre especificado '{0}' coincide con al menos dos nombres del objeto de la colección con espacios de nombres diferentes.
fr: Le nom spécifié '{0}' correspond au moins à deux noms de l'objet Collection, avec des espaces de noms différents.
it: Il nome "{0}" corrisponde ad almeno due nomi nell'oggetto raccolta, ma con spazi dei nomi diversi.
ja: 指定された名前 '{0}' と同じ名前が、名前空間が異なるコレクション オブジェクト内に少なくとも 2 つあります。
ko: 지정된 이름 '{0}'이(가) 네임스페이스가 다른 컬렉션 개체에 있는 두 개 이상의 이름과 일치합니다.
pt_br: O nome fornecido '{0}' coincide com ao menos dois nomes no objeto de coleção com espaços para nome diferentes.
ru: Указанное имя "{0}" совпадает по меньшей мере с двумя именами в объекте коллекции с разными пространствами имен.
zh_hans: 给定的名称“{0}”至少与集合对象中具有不同命名空间的两个名称相匹配。
zh_hant: 指定的名稱 '{0}' 與集合物件中至少兩個不同命名空間的名稱相符。

# Data_InvalidOffsetLength
source: Offset and length were out of bounds for the array or count is greater than the number of elements from index to the end of the source collection.
de: Offset und Länge lagen für das Array außerhalb des gültigen Bereichs, oder die Anzahl war größer als die Anzahl der Elemente ab dem Index bis zum Ende der Quellsammlung.
es: El desplazamiento y la longitud estaban fuera de los límites para esta matriz o el recuento es superior al número de elementos desde el índice al final de la colección de origen.
fr: Offset et length étaient hors limites pour ce tableau ou bien le nombre est supérieur au nombre d'éléments de l'index à la fin de la collection source.
it: Offset e lunghezza eccedono i limiti della matrice oppure il conteggio è maggiore del numero di elementi presenti dall'indice alla fine della raccolta di origine.
ja: 配列のオフセットおよび長さが制限を超えているか、カウンターがソース コレクションのインデックスから最後までの要素の数より大きい値です。
ko: 오프셋 및 길이가 배열의 범위를 벗어났거나 카운트가 인덱스부터 소스 컬렉션 끝까지의 요소 수보다 큽니다.
pt_br: O deslocamento e o comprimento estavam fora dos limites para a matriz ou a contagem é maior do que o número de elementos do índice até o fim da coleção de origem.
ru: Смещение и длина вышли за границы массива или значение счетчика превышает количество элементов от указателя до конца исходной коллекции.
zh_hans: 偏移量和长度超出数组的界限，或者计数大于从索引到源集合结尾处的元素数量。
zh_hant: 位移和長度超過陣列的界限或計數大於從索引至來源集合尾端的項目數。

# Data_ArgumentOutOfRange
source: '{0}' argument is out of range.
de: '{0}'-Argument liegt außerhalb des gültigen Bereichs.
es: El argumento '{0}' está fuera del intervalo.
fr: Argument '{0}' hors limites.
it: Argomento '{0}' non compreso nell'intervallo.
ja: '{0}' 引数が範囲外です。
ko: '{0}' 인수가 범위를 벗어났습니다.
pt_br: Argumento '{0}' está fora do intervalo.
ru: Аргумент "{0}" вне допустимого диапазона.
zh_hans: “{0}”参数超出范围。
zh_hant: '{0}' 引數超過範圍。

# Data_ArgumentNull
source: '{0}' argument cannot be null.
de: '{0}'-Argument darf nicht null sein.
es: El argumento '{0}' no puede ser nulo.
fr: L'argument '{0}' ne peut pas être null.
it: L'argomento '{0}' non può essere null.
ja: '{0}' 引数を Null にすることはできません。
ko: '{0}' 인수는 Null일 수 없습니다.
pt_br: Argumento '{0}' não pode ser nulo.
ru: Аргумент "{0}" не может быть пустым.
zh_hans: “{0}”参数不能为空。
zh_hant: '{0}' 引數不可是 Null。

# Data_ArgumentContainsNull
source: '{0}' argument contains null value.
de: '{0}'-Argument enthält Nullwerte.
es: El argumento '{0}' contiene un valor null.
fr: L'argument '{0}' contient la valeur null.
it: L'argomento "{0}" contiene un valore null.
ja: '{0}' 引数に Null 値が含まれています。
ko: '{0}' 인수에 Null 값이 있습니다.
pt_br: Argumento '{0}' contém valor nulo.
ru: Аргумент "{0}" содержит пустое значение.
zh_hans: “{0}”参数包含 Null 值。
zh_hant: '{0}' 引數包含空值。
