Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# MDF_UndefinedPopulationMechanism
source: The population mechanism '{0}' is not defined.
de: Der Auffüllmechanismus '{0}' ist nicht definiert.
es: El mecanismo de llenado '{0}' no está definido.
fr: Le mécanisme de remplissage '{0}' n'est pas défini.
it: Il meccanismo di popolamento "{0}" non è definito.
ja: ポピュレーション機構 '{0}' が定義されていません。
ko: 채우기 메커니즘 '{0}'이(가) 정의되지 않았습니다.
pt_br: Mecanismo de preenchimento '{0}' não definido.
ru: Механизм заполнения "{0}" не определен.
zh_hans: 填充机制“{0}”未定义。
zh_hant: 未定義擴展機制 '{0}'。

# MDF_UnsupportedVersion
source: The requested collection ({0}) is not supported by this version of the provider.
de: Die angeforderte Sammlung ({0}) wird von dieser Version des Providers nicht unterstützt.
es: La colección solicitada ({0}) no es compatible con esta versión del proveedor.
fr: La collection demandée ({0}) n'est pas prise en charge par cette version du fournisseur.
it: La raccolta richiesta ({0}) non è supportata da questa versione del provider.
ja: 要求されたコレクション ({0}) は、プロバイダーのこのバージョンではサポートされていません。
ko: 요청한 컬렉션({0})은 이 버전의 공급자에서 지원되지 않습니다.
pt_br: Esta versão do provedor não dá suporte à coleção solicitada ({0}).
ru: Затребованная коллекция ({0}) не поддерживается поставщиком этой версии.
zh_hans: 此版本的提供程序不支持请求的集合 ({0})。
zh_hant: 提供者的版本不支援要求的集合 ({0})。

# MDF_MissingDataSourceInformationColumn
source: One of the required DataSourceInformation tables columns is missing.
de: Es fehlt eine der erforderlichen DataSourceInformation-Tabellenspalten.
es: Falta una de las columnas necesarias de las tablas DataSourceInformation.
fr: L'une des tables DataSourceInformation requises est manquante.
it: Manca una delle colonne obbligatorie della tabella DataSourceInformation.
ja: 必要な DataSourceInformation テーブルの行のうち 1 つが見つかりません。
ko: 필요한 DataSourceInformation 테이블 열 중 하나가 없습니다.
pt_br: Falta uma das colunas de tabelas DataSourceInformation necessárias.
ru: Отсутствует один из обязательных столбцов в таблице DataSourceInformation.
zh_hans: 缺少必需的 DataSourceInformation 表列之一。
zh_hant: 其中一個 DataSourceInformation tables 資料行遺失。

# MDF_IncorrectNumberOfDataSourceInformationRows
source: The DataSourceInformation table must contain exactly one row.
de: Die DataSourceInformation-Tabelle muss exakt eine Zeile enthalten.
es: La tabla DataSourceInformation debe contener exactamente una fila.
fr: La table DataSourceInformation ne doit contenir qu'une seule ligne.
it: la tabella DataSourceInformation deve contenere esattamente una riga.
ja: DataSourceInformation テーブルには、1 行のみが保持されている必要があります。
ko: DataSourceInformation 테이블에는 행이 하나만 있어야 합니다.
pt_br: A tabela DataSourceInformation deve conter exatamente uma linha.
ru: Таблица DataSourceInformation должна содержать только одну строку.
zh_hans: DataSourceInformation 表必须只包含一行。
zh_hant: DataSourceInformation 資料表必須至少包含一個資料列。

# MDF_MissingRestrictionColumn
source: One or more of the required columns of the restrictions collection is missing.
de: Es fehlt mindestens eine der erforderlichen Spalten für die Sammlung der Einschränkungen.
es: Faltan una o más columnas necesarias de colección de restricciones.
fr: Une ou plusieurs des colonnes requises de la collection de restrictions sont manquantes.
it: Mancano una o più colonne obbligatorie della raccolta di restrizioni.
ja: 制約コレクションで必須の列が 1 つ以上ありません。
ko: 제한 컬렉션의 필수 열이 하나 이상 없습니다.
pt_br: Falta uma ou mais colunas necessárias da coleção de restrições.
ru: Отсутствует один или несколько обязательных столбцов в коллекции ограничений.
zh_hans: 限制集合中缺少一个或多个必选列。
zh_hant: 一個或多個限制集合的資料庫遺失。

# MDF_MissingRestrictionRow
source: A restriction exists for which there is no matching row in the restrictions collection.
de: Es liegt eine Einschränkung vor, für die es keine übereinstimmende Zeile in der Sammlung der Einschränkungen gibt.
es: Existe una restricción para la que no hay fila coincidente en la colección de restricciones.
fr: Il existe une restriction sans ligne correspondante dans la collection de restrictions.
it: Esiste una restrizione per la quale non c'è nessuna riga corrispondente nella raccolta di restrizioni.
ja: 制約コレクション内の行に一致しない制約があります。
ko: 제한 컬렉션에 일치하는 행이 없는 제한이 있습니다.
pt_br: Há uma restrição sem linha correspondente na coleção de restrições.
ru: Для одного из ограничений нет соответствующей строки в коллекции ограничений.
zh_hans: 限制集合中存在没有匹配行的限制。
zh_hant: 有一項限制為限制集合中沒有相符的資料列。

# MDF_NoColumns
source: The schema table contains no columns.
de: Die Schematabelle enthält keine Spalten.
es: La tabla de esquema no contiene columnas.
fr: La table de schémas ne comporte aucune colonne.
it: La tabella dello schema non contiene colonne.
ja: スキーマ テーブルに列がありません。
ko: 스키마 테이블에 열이 없습니다.
pt_br: A tabela de esquema não contém colunas.
ru: Таблица схемы не содержит столбцов.
zh_hans: 架构表未包含列。
zh_hant: 結構描述資料表沒有包含資料行。

# MDF_UnableToBuildCollection
source: Unable to build schema collection '{0}';
de: Die Schema-Sammlung '{0}' konnte nicht erstellt werden.
es: No se puede compilar la colección de esquemas '{0}';
fr: Impossible de créer la collection de schémas '{0}' ;
it: Impossibile compilare la raccolta di schemi '{0}';
ja: スキーマ コレクション '{0}' を構築できません。
ko: 스키마 컬렉션 '{0}'을(를) 작성할 수 없습니다.
pt_br: Não é possível criar a coleção de esquemas '{0}';
ru: Не удается создать коллекцию схемы "{0}";
zh_hans: 无法构建架构集合“{0}”；
zh_hant: 無法建置結構描述 '{0}';

# MDF_AmbigousCollectionName
source: The collection name '{0}' matches at least two collections with the same name but with different case, but does not match any of them exactly.
de: Der Sammlungsname '{0}' stimmt mit mindestens zwei Sammlungen mit demselben Namen, jedoch anderer Schreibung überein, ohne aber mit diesen exakt übereinzustimmen.
es: El nombre de colección '{0}' coincide al menos con dos colecciones con el mismo nombre pero con diferente caso, pero no coincide exactamente con ninguna de ellas.
fr: Le nom de collection '{0}' correspond au moins à deux collections dotées du même nom, mais de casse différente, mais cette correspondance n'est pas précise.
it: Il nome della raccolta "{0}" corrisponde ad almeno due raccolte i cui nomi differiscono solo per l'uso delle maiuscole, ma non corrisponde a nessuno dei due esattamente.
ja: コレクション名 '{0}' と同じ名前のコレクションが少なくとも 2 つありますが、大文字と小文字が一致しておらず、このどちらとも完全には名前が一致していません。
ko: 컬렉션 이름 '{0}'이(가) 이름은 같지만 사례는 다른 둘 이상의 컬렉션과 일치합니다. 그러나 모두 정확하게 일치하지는 않습니다.
pt_br: O nome de coleção '{0}' corresponde a pelo menos duas coleções com o mesmo nome, mas com diferença em maiúsculas e minúsculas, mas não corresponde a qualquer uma delas exatamente.
ru: Имя коллекции "{0}" без учета регистра совпадает по меньшей мере с двумя именами коллекций, но с учетом регистра не совпадает ни с одним из них.
zh_hans: 集合名“{0}”至少与两个同名但是大小写不同的集合匹配，但是不与任何一个完全匹配。
zh_hant: 集合名稱 '{0}' 至少與兩個同名但大小寫不同的名稱相符，但與其中任一個均不完全相符。

# MDF_CollectionNameISNotUnique
source: There are multiple collections named '{0}'.
de: Es gibt mehrere Sammlungen mit dem Namen '{0}'.
es: Hay varias colecciones con nombre '{0}'.
fr: Plusieurs collections portent le nom '{0}'.
it: Esistono più raccolte denominate "{0}".
ja: '{0}' という名前のコレクションが複数あります。
ko: '{0}'(이)라는 컬렉션이 여러 개 있습니다.
pt_br: Há várias coleções chamadas '{0}'.
ru: Существует несколько коллекций с именем "{0}".
zh_hans: 有多个名为“{0}”的集合。
zh_hant: 有多個名為 '{0}' 的集合。

# MDF_DataTableDoesNotExist
source: The collection '{0}' is missing from the metadata XML.
de: Die Sammlung '{0}' fehlt im Metadaten-XML-Code.
es: Falta la colección '{0}' del XML de metadatos.
fr: La collection '{0}' est manquante dans le XML de métadonnées.
it: Dai metadati XML manca la raccolta "{0}".
ja: メタデータ XML に '{0}' がありません。
ko: 컬렉션 '{0}'이(가) 메타데이터 XML에 없습니다.
pt_br: Falta a coleção '{0}' no XML de metadados.
ru: Коллекции "{0}" нет в метаданных XML.
zh_hans: 元数据 XML 中缺少集合“{0}”。
zh_hant: 集合 '{0}' 已從中繼資料 XML 中遺失。

# MDF_InvalidXml
source: The metadata XML is invalid.
de: Der Metadaten-XML-Code ist ungültig.
es: XML de metadatos no válido.
fr: Le XML de métadonnées n'est pas valide.
it: I metadati XML non sono validi.
ja: メタベース XML が無効です。
ko: 메타데이터 XML이 잘못되었습니다.
pt_br: O XML de metadados é inválido.
ru: Метаданные XML недействительны.
zh_hans: 元数据 XML 无效。
zh_hant: 中繼資料 XML 無效。

# MDF_InvalidXmlMissingColumn
source: The metadata XML is invalid. The {0} collection must contain a {1} column and it must be a string column.
de: Der Metadaten-XML-Code ist ungültig. Die Sammlung {0} muss die Spalte {1} enthalten, die eine Zeichenfolgenspalte sein muss.
es: XML de metadatos no válido. La colección {0} debe contener una columna {1} y debe ser una columna de cadena.
fr: Le XML de métadonnées n'est pas valide. La collection {0} doit comporter une colonne {1}. Il doit s'agir d'une colonne de chaîne.
it: I metadati XML non sono validi. La raccolta {0} deve contenere una colonna stringa {1}.
ja: メタデータの XML が無効です。{0} コレクションには、文字列の列である {1} 列が必要です。
ko: 메타데이터 XML이 잘못되었습니다. {0} 컬렉션에는 {1} 열이 있어야 하며 문자열 열이어야 합니다.
pt_br: O XML de metadados é inválido. A coleção {0} deve conter uma coluna {1} e ser uma coluna de cadeia de caracteres.
ru: Метаданные XML недействительны. Коллекция {0} должна содержать столбец {1} строкового типа.
zh_hans: 元数据 XML 无效。{0} 集合必须包含 {1} 列，并且必须为字符串列。
zh_hant: 中繼資料 XML 無效。{0} 集合必須包含 {1} 資料行，且必須包含字串資料行。

# MDF_InvalidXmlInvalidValue
source: The metadata XML is invalid. The {1} column of the {0} collection must contain a non-empty string.
de: Der Metadaten-XML-Code ist ungültig. Die Spalte {1} der Sammlung {0} muss eine nicht leere Zeichenfolge enthalten.
es: XML de metadatos no válido. La columna {1} de la colección {0} debe contener una cadena que no esté vacía.
fr: Le XML de métadonnées n'est pas valide. La colonne {1} de la collection {0} doit comporter une chaîne non vide.
it: I metadati XML non sono validi. La colonna {1} della raccolta {0} deve contenere una stringa non vuota.
ja: メタデータの XML が無効です。{0} コレクションの {1} 列には、空でない文字列が設定されている必要があります。
ko: 메타데이터 XML이 잘못되었습니다. {0} 컬렉션의 {1} 열에는 비어 있지 않은 문자열이 있어야 합니다.
pt_br: O XML de metadados é inválido. A coluna {1} da coleção {0} deve conter uma cadeia de caracteres não vazia.
ru: Метаданные XML недействительны. Столбец {1} коллекции {0} должен содержать непустую строку.
zh_hans: 元数据 XML 无效。{0} 集合的 {1} 列必须包含非空字符串。
zh_hant: 中繼資料 XML 無效。{0} 集合的 {1} 資料行必須包含非空的字串。

# DataCategory_Action
source: Action
de: Aktion
es: Acción
it: Azione
ja: アクション
ko: 동작
pt_br: Ação
ru: Действие
zh_hans: 操作
zh_hant: 動作

# DataCategory_Behavior
source: Behavior
de: Verhalten
es: Comportamiento
fr: Comportement
it: Comportamento
ja: 動作
ko: 동작
pt_br: Comportamento
ru: Режим работы
zh_hans: 行为
zh_hant: 行為

# DataCategory_Fill
source: Fill
de: Füllen
es: Relleno
fr: Remplissage
it: Riempimento
ja: 塗りつぶし
ko: 채우기
pt_br: Preenchimento
ru: Заливка
zh_hans: 填充
zh_hant: 填滿

# DataCategory_InfoMessage
source: InfoMessage
de: Informationsmeldung
es: Mensaje informativo
ja: 情報メッセージ

# DataCategory_Mapping
source: Mapping
de: Zuordnung
es: Asignación
fr: Mappage
ja: マッピング
ko: 매핑
pt_br: Mapeamento
ru: Сопоставление
zh_hans: 映射
zh_hant: 對應

# DataCategory_Notification
source: Notification
de: Benachrichtigung
es: Notificación
it: Notifica
ja: 通知
ko: 알림
pt_br: Notificação
ru: Уведомление
zh_hans: 通知
zh_hant: 通知

# DataCategory_Schema
source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
ko: 스키마
pt_br: Esquema
ru: Схема
zh_hans: 架构
zh_hant: 結構描述

# DataCategory_Advanced
source: Advanced
de: Erweitert
es: Opciones avanzadas
fr: Paramètres avancés
it: Avanzate
ja: 詳細
ko: 고급
pt_br: Avançado
ru: Дополнительно
zh_hans: 高级
zh_hant: 進階

# DataCategory_Context
source: Context
de: Kontext
es: Contexto
fr: Contexte
it: Contesto
ja: コンテキスト
ko: 컨텍스트
pt_br: Contexto
ru: Контекст
zh_hans: 上下文
zh_hant: 內容

# DataCategory_Initialization
source: Initialization
de: Initialisierung
es: Inicialización
fr: Initialisation
it: Inizializzazione
ja: 初期化
ko: 초기화
pt_br: Inicialização
ru: Инициализация
zh_hans: 初始化
zh_hant: 初始化

# DataCategory_Pooling
source: Pooling
es: Agrupación
fr: Regroupement
ja: プーリング
ko: 풀링
ru: Объединение
zh_hans: 池
zh_hant: 共用

# DataCategory_NamedConnectionString
source: Named ConnectionString
de: Benannter ConnectionString
es: ConnectionString con nombre
fr: ConnectionString nommé
it: ConnectionString denominata
ja: 名前付き ConnectionString
ko: 명명된 ConnectionString
pt_br: ConnectionString Nomeada
ru: Именованная строка ConnectionString
zh_hans: 命名 ConnectionString
zh_hant: 具名 ConnectionString

# DataCategory_Security
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
it: Sicurezza
ja: セキュリティ
ko: 보안
pt_br: Segurança
ru: Безопасность
zh_hans: 安全性
zh_hant: 安全性

# DataCategory_Source
source: Source
de: Quelle
es: Origen
it: Origine
ja: ソース
ko: 소스
pt_br: Origem
ru: Источник
zh_hans: 源
zh_hant: 來源

# DataCategory_Replication
source: Replication
de: Replikation
es: Replicación
fr: Réplication
it: Replica
ja: レプリケーション
ko: 복제
pt_br: Replicação
ru: Репликация
zh_hans: 复制
zh_hant: 複寫

# DataCategory_ConnectionResilency
source: Connection Resiliency
de: Verbindungsresilienz
es: Resistencia de la conexión
fr: Résilience de la connexion
it: Resilienza connessione
ja: 接続の復元性
ko: 연결 복구
pt_br: Resiliência da Conexão
ru: Устойчивость подключений
zh_hans: 连接弹性
zh_hant: 恢復連接

# ExtendedPropertiesDescr
source: The collection that holds custom user information.
de: Die Sammlung die Benutzerinformationen enthält.
es: Colección con la información de usuario personalizada.
fr: La collection qui contient les informations utilisateur personnalisées.
it: Raccolta che contiene le informazioni utente personalizzate.
ja: カスタム ユーザー情報を保有するコレクションです。
ko: 사용자 지정 사용자 정보를 보유하는 컬렉션입니다.
pt_br: A coleção que retém informações personalizadas sobre o usuário.
ru: Коллекция, содержащая особую информацию пользователя.
zh_hans: 保留自定义用户信息的集合。
zh_hant: 保存自訂使用者資訊的集合。

# DataSetCaseSensitiveDescr
source: Indicates whether comparing strings within the DataSet is case sensitive.
de: Gibt an, ob beim Vergleichen von Zeichenfolgen innerhalb des DataSets die Groß-/Kleinschreibung beachtet wird.
es: Indica si se distinguen mayúsculas y minúsculas en DataSet al comparar cadenas.
fr: Indique si la comparaison de chaînes dans le DataSet respecte la casse.
it: Indica se il confronto di stringhe all'interno del DataSet distingue tra maiuscole e minuscole.
ja: DataSet 内部で比較する文字列に関して、大文字小文字を区別するかどうかを示します。
ko: DataSet 내의 문자열을 비교하는 경우 대/소문자를 구분하는지 여부를 나타냅니다.
pt_br: Indica se cadeias de comparação dentro do DataSet diferenciam maiúsculas de minúsculas.
ru: Указывает, выполняется ли сравнение строк в DataSet с учетом регистра.
zh_hans: 指示在 DataSet 内比较字符串是否区分大小写。
zh_hant: 指定在資料集 (DataSet) 中比較字串時是否要區分大小寫。

# DataSetDataSetNameDescr
source: The name of this DataSet.
de: Der Name des DataSet.
es: Nombre de DataSet.
fr: Le nom de ce DataSet.
it: Nome di questo DataSet.
ja: この DataSet の名前です。
ko: 이 DataSet의 이름입니다.
pt_br: O nome deste DataSet.
ru: Имя этого DataSet.
zh_hans: 该 DataSet 的名称。
zh_hant: 這個 DataSet 的名稱。

# DataSetDefaultViewDescr
source: Indicates a custom "view" of the data contained by the DataSet. This view allows filtering, searching, and navigating through the custom data view.
de: Gibt die benutzerdefinierte Sicht der Daten an, die im DataSet enthalten sind. Diese Sicht ermöglicht das Filtern, Suchen und Navigieren in der benutzerdefinierten Sicht.
es: Indica una "vista" personalizada de los datos que contiene el DataSet. Esta vista permite filtrar, buscar y explorar la vista personalizada de datos.
fr: Indique une "vue" personnalisée des données contenues dans le DataSet. Cette vue permet le filtrage, la recherche et la navigation dans la vue de données personnalisée.
it: Indica una "vista" personalizzata dei dati contenuti nel DataSet. Tale vista consente di filtrare, eseguire ricerche ed esplorare all'interno della vista dei dati personalizzata.
ja: DataSet に含まれるデータのカスタム "ビュー" を示します。このビューを使うと、カスタム データ ビューでフィルター、検索およびナビゲーションを行うことができます。
ko: DataSet에 포함된 데이터의 사용자 지정 "뷰"를 나타냅니다. 이 뷰를 사용하면 사용자 지정 데이터 뷰를 통해 필터링, 검색, 탐색 등을 수행할 수 있습니다.
pt_br: Indica um "modo de exibição" personalizado dos dados contidos em DataSet. Este modo de exibição permite filtrar e pesquisar os dados, bem como navegar neles.
ru: Указывает особое "представление" данных, содержащихся в DataSet. Это представление позволяет выполнять фильтрацию, поиск и перемещение по особому представлению данных.
zh_hans: 指示 DataSet 中所包含数据的自定义“视图”。此视图允许通过自定义数据视图进行筛选、搜索和导航。
zh_hant: 表示 DataSet 中包含資料的自訂檢視表。這個檢視表允許透過自訂資料檢視表執行篩選、搜尋和瀏覽。

# DataSetEnforceConstraintsDescr
source: Indicates whether constraint rules are to be followed.
de: Gibt an, ob Einschränkungsregeln befolgt werden.
es: Indica si se siguen las reglas de restricción.
fr: Indique si les règles de contrainte doivent être suivies.
it: Indica se è necessario osservare regole di vincolo.
ja: 制約ルールを適用するかどうかを示します。
ko: 제약 조건 규칙이 적용되는지 여부를 나타냅니다.
pt_br: Indica se as regras de restrição devem ser seguidas.
ru: Указывает, следует ли соблюдать правила ограничений.
zh_hans: 指示是否遵循约束规则。
zh_hant: 指定是否要遵循條件約束規則。

# DataSetHasErrorsDescr
source: Indicates that the DataSet has errors.
de: Gibt an, dass das DataSet Fehler enthält.
es: Indica que el DataSet tiene errores.
fr: Indique que le DataSet contient des erreurs.
it: Indica la presenza di errori nel DataSet.
ja: DataSet にエラーがあることを示します。
ko: DataSet에 오류가 있음을 나타냅니다.
pt_br: Indica que o DataSet tem erros.
ru: Указывает, что DataSet содержит ошибки.
zh_hans: 指示 DataSet 有错误。
zh_hant: 表示 DataSet 有錯誤。

# DataSetLocaleDescr
source: Indicates a locale under which to compare strings within the DataSet.
de: Gibt einen Ort an, an dem Zeichenfolgen innerhalb des DataSet verglichen werden.
es: Indica una configuración regional con la que se pueden comparar las cadenas de DataSet.
fr: Indique des paramètres régionaux avec lesquels comparer des chaînes dans le DataSet.
it: Indica le impostazioni locali in base a cui confrontare le stringhe all'interno del DataSet.
ja: DataSet 内の文字列を比較するロケールを示します。
ko: DataSet 내의 문자열을 비교할 로케일을 나타냅니다.
pt_br: Indica uma localidade com a qual serão comparadas as cadeias de caracteres do DataSet.
ru: Указывает языковой стандарт, в соответствии с которым должны сравниваться строки в DataSet.
zh_hans: 指示在 DataSet 中比较字符串时所用的区域设置。
zh_hant: 表示在 DataSet 中比較字串時是否要使用地區設定。

# DataSetNamespaceDescr
source: Indicates the XML uri namespace for the root element pointed at by this DataSet.
de: Gibt den XML-URI-Namensbereich des Stammelements an, auf das dieses DataSet zeigt.
es: Indica el espacio de nombres del uri de XML para el elemento raíz que señala a este DataSet.
fr: Indique l'espace de noms URI XML pour l'élément racine vers lequel pointe ce DataSet.
it: Indica lo spazio dei nomi URI XML dell'elemento radice a cui si riferisce questo DataSet.
ja: この DataSet で指定されたルート要素の XML URI 名前空間を示します。
ko: 이 DataSet에서 가리키는 루트 요소의 XML URI 네임스페이스를 나타냅니다.
pt_br: Indica o espaço para nome do uri de XML para o elemento raiz apontado por este DataSet.
ru: Указывает пространство имен URI XML для корневого элемента, заданного этим DataSet.
zh_hans: 指示此 DataSet 指向的根元素的 XML URI 命名空间。
zh_hant: 表示這個 DataSet 所指向根元素的 XML URI 命名空間。

# DataSetPrefixDescr
source: Indicates the prefix of the namespace used for this DataSet.
de: Gibt das Präfix des Namensbereichs an, der für dieses DataSet verwendet wird.
es: Indica el prefijo del espacio de nombres utilizado en esta DataSet.
fr: Indique le préfixe de l'espace de noms utilisé pour ce DataSet.
it: Indica il prefisso dello spazio dei nomi utilizzato per questo DataSet.
ja: この DataSet に使われる名前空間のプレフィックスを示します。
ko: 이 DataSet에 사용되는 네임스페이스의 접두사를 나타냅니다.
pt_br: Indica o prefixo do espaço para nome usado neste DataSet.
ru: Указывает префикс пространства имен, используемого для этого DataSet.
zh_hans: 指示用于此 DataSet 的命名空间的前缀。
zh_hant: 表示這個 DataSet 所使用命名空間的前置詞。

# DataSetRelationsDescr
source: The collection that holds the relations for this DataSet.
de: Die Sammlung, welche die Beziehungen für diesen DataSet enthält.
es: La colección que contiene las relaciones de DataSet.
fr: Collection qui contient les relations pour ce DataSet.
it: Raccolta che contiene le relazioni per questo DataSet.
ja: この DataSet のリレーションシップを保有するコレクションです。
ko: 이 DataSet에 대한 관계를 보유하는 컬렉션입니다.
pt_br: A coleção que retém as relações deste DataSet.
ru: Коллекция, в которой хранятся отношения для этого DataSet.
zh_hans: 保存此 DataSet 的关系的集合。
zh_hant: 保存這個 DataSet 關聯的集合。

# DataSetTablesDescr
source: The collection that holds the tables for this DataSet.
de: Die Sammlung, welche die Tabellen für dieses DataSet enthält.
es: La colección que contiene las tablas de DataSet.
fr: La collection qui contient les tables pour ce DataSet.
it: Raccolta che contiene le tabelle per questo DataSet.
ja: この DataSet のテーブルを保持するコレクションです。
ko: 이 DataSet에 대한 테이블을 보유하는 컬렉션입니다.
pt_br: A coleção que retém as tabelas deste DataSet.
ru: Коллекция, в которой хранятся таблицы для этого DataSet.
zh_hans: 保存此 DataSet 的表的集合。
zh_hant: 保存這個 DataSet 資料表的集合。

# DataSetMergeFailedDescr
source: Occurs when it is not possible to merge schemas for two tables with the same name.
de: Tritt auf, wenn Schemen für zwei Tabellen mit dem gleichen Namen nicht zusammengeführt werden können.
es: Tiene lugar cuando no es posible combinar esquemas para dos tablas con el mismo nombre.
fr: Se produit lorsqu'il n'est pas possible de fusionner des schémas pour deux tables avec le même nom.
it: Generato quando è impossibile unire gli schemi per due tabelle con lo stesso nome.
ja: 同じ名前を持つ 2 つのテーブルに対してスキーマをマージできない場合に発生します。
ko: 이름이 같은 두 테이블의 스키마를 병합할 수 없는 경우 발생합니다.
pt_br: Ocorre quando não é possível mesclar esquemas para duas tabelas com o mesmo nome.
ru: Происходит, когда невозможно объединить схемы двух таблиц с одинаковыми именами.
zh_hans: 当无法合并具有相同名称的两个表的架构时发生。
zh_hant: 發生於不可能合併擁有相同名稱的兩個資料表的結構描述時。

# DataSetInitializedDescr
source: Occurs after Initialization is finished.
de: Erfolgt nach Beendigung der Initialization.
es: Ocurre al finalizar la Initialization.
fr: Intervient après la fin de l'Initialization.
it: Avviene quando Initialization è completato.
ja: Initialization の終了時に発生します。
ko: Initialization이 완료된 후 발생합니다.
pt_br: Ocorre após a conclusão da Initialization.
ru: Происходит после завершения инициализации Initialization.
zh_hans: 在 Initialization 完成之后发生。
zh_hant: 在完成 Initialization 之後發生。

# DataSetDescr
source: Represents an in-memory cache of data.
de: Stellt einen speicherresidenten Datencache dar.
es: Representa una caché de datos en memoria.
fr: Représente un cache de données en mémoire.
it: Rappresenta una cache di dati in memoria.
ja: データのメモリ内キャッシュを表します。
ko: 데이터의 인-메모리 캐시를 나타냅니다.
pt_br: Representa um cache de dados na memória.
ru: Представляет кэш данных в памяти.
zh_hans: 表示数据在内存中的缓存。
zh_hant: 代表資料的記憶體中快取。

# DataTableCaseSensitiveDescr
source: Indicates whether comparing strings within the table is case sensitive.
de: Gibt an, ob beim Vergleichen von Zeichenfolgen innerhalb der Tabelle Groß-/Kleinschreibung beachtet wird.
es: Indica si se distinguen mayúsculas y minúsculas en la tabla al comparar cadenas.
fr: Indique si les chaînes de comparaison contenues dans la table respectent la casse.
it: Indica se il confronto di stringhe all'interno della tabella distingue tra maiuscole e minuscole.
ja: このテーブル内で比較する文字列に対して大文字小文字を区別するかどうかを指定します。
ko: 테이블 내의 문자열을 비교하는 경우 대/소문자를 구분하는지 여부를 나타냅니다.
pt_br: Indica se a comparação de cadeias de caracteres dentro da tabela diferencia maiúsculas e minúsculas.
ru: Указывает, выполняется ли сравнение строк в таблице с учетом регистра.
zh_hans: 指示在表中比较字符串是否区分大小写。
zh_hant: 表示在資料表中比較字串時是否區分大小寫。
