Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SQL_SettingIntegratedWithCredential
source: Cannot use 'Authentication=Active Directory Integrated', if the Credential property has been set.
de: "Authentication=Active Directory Integrated" kann nicht verwendet werden, wenn die Eigenschaft "Credential" festgelegt wurde.
es: No se puede usar 'Authentication=Active Directory Integrated' si se ha establecido la propiedad Credential.
fr: Impossible d'utiliser 'Authentication=Active Directory Integrated', si la propriété Credential a été définie.
it: Non è possibile usare 'Authentication=Active Directory Integrated' se è stata impostata la proprietà Credential.
ja: Credential プロパティが設定されている場合は、'Authentication=Active Directory Integrated' を使用できません。
ko: Credential 속성이 설정된 경우 'Authentication=Active Directory Integrated'를 사용할 수 없습니다.
pt_br: Não é possível usar "Authentication=Active Directory Integrated", se a propriedade Credential tiver sido definida.
ru: Не удается использовать 'Authentication=Active Directory Integrated', если задано свойство «Credential».
zh_hans: 如果设置了 Credential 属性，则无法使用“Authentication=Active Directory Integrated”。
zh_hant: 如果已設定 Credential 屬性，則無法使用 'Authentication=Active Directory Integrated'。

# SQL_SettingCredentialWithIntegrated
source: Cannot set the Credential property if 'Authentication=Active Directory Integrated' has been specified in the connection string.
de: Die Eigenschaft "Credential " kann nicht festgelegt werden, wenn "Authentication=Active Directory Integrated" in der Verbindungszeichenfolge angegeben wurde.
es: No se puede establecer la propiedad Credential si se ha especificado 'Authentication=Active Directory Integrated' en la cadena de conexión.
fr: Impossible de définir la propriété Credential si 'Authentication=Active Directory Integrated' a été spécifié dans la chaîne de connexion.
it: Non è possibile impostare la proprietà Credential se nella stringa di connessione è stato specificato 'Authentication=Active Directory Integrated'.
ja: 接続文字列で 'Authentication=Active Directory Integrated' が指定されている場合は、Credential プロパティを設定できません。
ko: 'Authentication=Active Directory Integrated'가 연결 문자열에 지정된 경우 Credential 속성을 설정할 수 없습니다.
pt_br: Não é possível definir a propriedade Credential se "Authentication=Active Directory Integrated" for especificado na cadeia de conexão.
ru: Не удается задать свойство Credential, если в строке подключения указано Authentication=Active Directory Integrated'.
zh_hans: 如果在连接字符串中指定了“Authentication=Active Directory Integrated”，则无法设置 Credential 属性。
zh_hant: 如果連接字串中已指定 'Authentication=Active Directory Integrated'，則無法設定 Credential 屬性。

# SQL_Certificate
source: Incorrect authentication parameters specified with certificate authentication.
de: Bei der Zertifikatauthentifizierung wurden falsche Authentifizierungsparameter angegeben.
es: Se especificaron parámetros de autenticación incorrectos con la autenticación de certificado.
fr: Des paramètres d'authentification incorrects ont été spécifiés avec l'authentification par certificat.
it: Parametri di autenticazione non corretti specificati con l'autenticazione del certificato.
ja: 証明書認証で指定された認証パラメーターが正しくありません。
ko: 인증서 인증으로 지정된 인증 매개 변수가 잘못되었습니다.
pt_br: Parâmetros de autenticação incorretos especificados com a autenticação de certificado.
ru: Указаны неверные параметры проверки подлинности с использованием сертификата.
zh_hans: 使用证书身份验证指定的身份验证参数不正确。
zh_hant: 使用憑證驗證指定的驗證參數不正確。

# SQL_EncryptionNotSupportedByClient
source: The instance of SQL Server you attempted to connect to requires encryption but this machine does not support it.
de: Die Instanz von SQL Server, mit der Sie sich verbinden möchten, erfordert eine Verschlüsselung, die von diesem Computer jedoch nicht unterstützt wird.
es: La instancia de SQL Server con la que intenta conectar requiere cifrado, pero este equipo no lo admite.
fr: L'instance de SQL Server à laquelle vous avez tenté de vous connecter doit être cryptée, mais cet ordinateur ne prend pas en charge le cryptage.
it: L'istanza di SQL Server a cui si è tentato di connettersi richiede la crittografia, ma questo computer non la supporta.
ja: 接続しようとした SQL Server インスタンスでは暗号化が必要とされていますが、このコンピューターは暗号化をサポートしていません。
ko: 연결하려는 SQL Server 인스턴스에 암호화가 필요하지만 이 시스템에서 암호화를 지원하지 않습니다.
pt_br: A instância do SQL Server à qual você tentou se conectar requer criptografia, porém não há suporte para isso neste computador.
ru: Экземпляр SQL Server, к которому устанавливалось подключение, требует шифрования, но оно не поддерживается этим компьютером.
zh_hans: 您试图连接的 SQL Server 实例要求加密，但是此计算机不支持。
zh_hant: 您嘗試連接的 SQL Server 執行個體需要加密，但此電腦不支援。

# SQL_EncryptionNotSupportedByServer
source: The instance of SQL Server you attempted to connect to does not support encryption.
de: Die Instanz von SQL Server, mit der Sie sich verbinden möchten, unterstützt keine Verschlüsselung.
es: La instancia de SQL Server con la que intenta conectar no admite cifrado.
fr: L'instance de SQL Server à laquelle vous avez tenté de vous connecter ne prend pas en charge le cryptage.
it: L'istanza di SQL Server a cui si è tentato di connettersi non supporta la crittografia.
ja: 接続しようとした SQL Server インスタンスは暗号化をサポートしていません。
ko: 연결하려는 SQL Server 인스턴스에서 암호화를 지원하지 않습니다.
pt_br: A instância do SQL Server à qual você tentou se conectar não dá suporte para criptografia.
ru: Экземпляр SQL Server, к которому устанавливалось подключение, не поддерживает шифрования.
zh_hans: 您试图连接的 SQL Server 实例不支持加密。
zh_hant: 您嘗試連接的 SQL Server 執行個體不支援加密。

# SQL_CTAIPNotSupportedByServer
source: The instance of SQL Server you attempted to connect to does not support CTAIP.
de: Die Instanz von SQL Server, mit der Sie eine Verbindung herstellen möchten, unterstützt CTAIP nicht.
es: La instancia de SQL Server con la que intenta conectar no admite CTAIP.
fr: L'instance de SQL Server à laquelle vous avez tenté de vous connecter ne prend pas en charge CTAIP.
it: L'istanza di SQL Server a cui si è tentato di connettersi non supporta CTAIP.
ja: 接続しようとした SQL Server インスタンスは CTAIP をサポートしていません。
ko: 연결하려는 SQL Server 인스턴스에서 CTAIP를 지원하지 않습니다.
pt_br: A instância do SQL Server à qual você tentou se conectar não dá suporte ao CTAIP.
ru: Экземпляр SQL Server, к которому вы пытались подключиться, не поддерживает CTAIP.
zh_hans: 你试图连接的 SQL Server 实例不支持 CTAIP。
zh_hant: 您嘗試連線的目標 SQL Server 執行個體不支援 CTAIP。

# SQL_InvalidSQLServerVersionUnknown
source: Unsupported SQL Server version. The .NET Framework SqlClient Data Provider can only be used with SQL Server versions 7.0 and later.
de: Nicht unterstützte SQL Server-Version. Der .NET Framework-SqlClient-Datenanbieter kann nur mit SQL Server-Version 7.0 und höher verwendet werden.
es: Versión no compatible de SQL Server. El proveedor de datos SqlClient de .NET Framework solo se puede utilizar con SQL Server versión 7.0 o posterior.
fr: Version de SQL Server non prise en charge. Le fournisseur de données .NET Framework SqlClient peut être utilisé avec SQL Server version 7.0 ou ultérieure uniquement.
it: Versione di SQL Server non supportata. È possibile usare il provider di dati di .NET Framework SqlClient solo con SQL Server versioni 7.0 e successive.
ja: サポートされない SQL Server バージョンです。.NET Framework SqlClient データ プロバイダーは、SQL Server バージョン 7.0 以降でのみ使用できます。
ko: 지원되지 않는 SQL Server 버전입니다. .NET Framework SqlClient Data Provider는 SQL Server 버전 7.0 이상에서만 사용할 수 있습니다.
pt_br: Versão do SQL Server sem suporte. O Provedor de Dados .NET Framework para SqlClient pode ser usado somente com as versões 7.0 e posteriores do SQL Server.
ru: Неподдерживаемая версия SQL Server. Поставщик данных .NET Framework для SQL Server (SqlClient) поддерживает только SQL Server 7.0 и более поздние версии.
zh_hans: SQL Server 版本不受支持。.NET Framework SqlClient 数据提供程序只能用于 SQL Server 版本 7.0 及更高版本。
zh_hant: 不支援的 SQL Server 版本。.NET Framework SqlClient Data Provider 僅可搭配 SQL Server 7.0 版及更新版本使用。

# SQL_CannotModifyPropertyAsyncOperationInProgress
source: {0} cannot be changed while async operation is in progress.
de: {0} kann nicht geändert werden, während eine asynchrone Operation ausgeführt wird.
es: No se puede cambiar {0} mientras la operación asíncrona esté en proceso.
fr: {0} ne peut pas être modifié tant qu'une opération asynchrone est en cours.
it: {0} non può essere modificata mentre è in corso l'operazione asincrona.
ja: 非同期操作の実行中は、{0} を変更することはできません。
ko: 비동기 작업이 진행 중인 동안에는 {0}을(를) 변경할 수 없습니다.
pt_br: {0} não pode ser alterado enquanto a operação async está em andamento.
ru: Нельзя изменить {0}, когда выполняется асинхронная операция.
zh_hans: 在进行异步操作时无法更改 {0}。
zh_hant: 進行非同步操作時，{0} 無法變更。

# SQL_AsyncConnectionRequired
source: This command requires an asynchronous connection. Set "Asynchronous Processing=true" in the connection string.
de: Dieser Befehl erfordert eine asynchrone Verbindung. Legen Sie in der Verbindungszeichenfolge "Asynchronous Processing=true" fest.
es: Este comando requiere una conexión asincrónica. Establezca "Asynchronous Processing=true" en la cadena de conexión.
fr: Cette commande requiert une connexion asynchrone. Définissez "Asynchronous Processing=true" dans la chaîne de connexion.
it: Il comando richiede una connessione asincrona. Impostare "Asynchronous Processing=true" nella stringa di connessione.
ja: このコマンドには非同期接続が必要です。接続文字列に "Asynchronous Processing=true" を設定してください。
ko: 이 명령을 사용하려면 비동기 연결이 필요합니다. 연결 문자열에서 "Asynchronous Processing=true"로 설정하십시오.
pt_br: Este comando requer uma conexão assíncrona. Defina "Asynchronous Processing=true" na cadeia de conexão.
ru: Для этой команды необходимо асинхронное подключение. Укажите в строке подключения «Asynchronous Processing=true».
zh_hans: 此命令要求异步连接。请在连接字符串中设置“Asynchronous Processing=true”。
zh_hant: 此命令需要非同步連接。請在連接字串中設定 "Asynchronous Processing=true"。

# SQL_FatalTimeout
source: Timeout expired. The connection has been broken as a result.
de: Timeout abgelaufen. Die Verbindung wurde aus diesem Grund unterbrochen.
es: Valor de tiempo de espera caducado. Por ello, se ha interrumpido la conexión.
fr: Le délai d'attente est arrivé à expiration. Par conséquent, la connexion a été interrompue.
it: Timeout scaduto. La connessione è stata interrotta.
ja: タイムアウトに達しました。その結果、接続が切断されました。
ko: 제한 시간이 만료되었으므로 연결이 끊겼습니다.
pt_br: Tempo limite expirado. Como resultado a conexão foi quebrada.
ru: Истекло время ожидания. Подключение разорвано.
zh_hans: 超时时间已到。因此，连接被中断。
zh_hant: 等候逾時已過時。結果為已連接中斷。

# SQL_InstanceFailure
source: Instance failure.
de: Instanzausfall.
es: Error de instancia.
fr: Échec d'instance.
it: Errore dell'istanza.
ja: インスタンス エラーです。
ko: 인스턴스 오류입니다.
pt_br: Falha da instância.
ru: Сбой экземпляра.
zh_hans: 实例失败。
zh_hant: 執行個體失敗。

# SQL_CredentialsNotProvided
source: Either Credential or both 'User ID' and 'Password' (or 'UID' and 'PWD') connection string keywords must be specified, if 'Authentication={0}'.
de: Wenn "Authentication={0}", muss entweder das Schlüsselwort "Credential" oder die Schlüsselwörter "User ID" und "Password" (oder "UID" und "PWD") für die Verbindungszeichenfolge angegeben werden.
es: Se deben especificar Credential o las palabras clave de cadena de conexión 'User ID' y 'Password' (o 'UID' y 'PWD') si 'Authentication={0}'.
fr: Les mots clés de la chaîne de connexion Credential, ou bien 'User ID' et 'Password' (ou bien 'UID' et 'PWD'), doivent être spécifiés si 'Authentication={0}'.
it: Se 'Authentication={0}', è necessario specificare le parole chiave della stringa di connessione Credential oppure 'User ID' e 'Password' (o 'UID' e 'PWD').
ja: 'Authentication={0}' の場合は、接続文字列キーワード Credential か、'User ID' と 'Password' (または 'UID' と 'PWD') の両方を指定する必要があります。
ko: 'Authentication={0}'인 경우 Credential 또는 'User ID' 및 'Password'(또는 'UID' 및 'PWD') 연결 문자열을 지정해야 합니다.
pt_br: Se "Authentication={0}", é necessário usar Credential ou ambas as palavras-chave da cadeia de conexão "User ID" e "Password" (ou "UID" e "PWD").
ru: Должно быть задано либо значение Credential, либо ключевые слова строки подключения 'User ID' и 'Password' (или 'UID' и 'PWD'), если 'Authentication={0}'.
zh_hans: 如果“Authentication={0}”，则必须指定 Credential，或同时指定“User ID”和“Password”(或“UID”和“PWD”)连接字符串关键字。
zh_hant: 如果 'Authentication={0}'，則必須指定 Credential 或 'User ID' 和 'Password' (或 'UID' 和 'PWD') 等連接字串關鍵字。

# SQL_ChangePasswordArgumentMissing
source: The '{0}' argument must not be null or empty.
de: Das Argument '{0}' darf weder Null noch leer sein.
es: El argumento '{0}' no debe ser null o estar vacío.
fr: L'argument '{0}' ne doit pas être null ou vide.
it: L'argomento "{0}" non deve essere null o vuoto.
ja: '{0}' の引数は、Null や空にすることはできません。
ko: '{0}' 인수는 Null이거나 비워 둘 수 없습니다.
pt_br: O argumento '{0}' não pode ser nulo ou estar vazio.
ru: Аргумент "{0}" не должен быть пустым или неопределенным.
zh_hans: “{0}”参数不能为 Null 或空。
zh_hant: '{0}' 引數必不可為空值或空。

# SQL_ChangePasswordConflictsWithSSPI
source: ChangePassword can only be used with SQL authentication, not with integrated security.
de: ChangePassword kann nur mit der SQL-Authentifizierung und nicht mit der integrierten Sicherheit verwendet werden.
es: ChangePassword sólo se puede utilizar con autenticación SQL, pero no con seguridad integrada.
fr: ChangePassword ne peut être utilisé que dans le cadre d'une authentification SQL, et non dans celui de la sécurité intégrée.
it: È possibile utilizzare ChangePassword solo con l'autenticazione SQL, non con la sicurezza integrata.
ja: ChangePassword が使用できるのは SQL 認証のみです。統合セキュリティでは使用できません。
ko: ChangePassword는 통합 보안이 아닌 SQL 인증에서만 사용할 수 있습니다.
pt_br: A propriedade ChangePassword só pode ser usada com autenticação SQL, e não com segurança integrada.
ru: ChangePassword может использоваться только с аутентификацией SQL, но не со встроенной безопасностью.
zh_hans: ChangePassword 只可与 SQL 身份验证一起使用，而不能与集成安全一起使用。
zh_hant: ChangePassword 僅可與 SQL 授權搭配使用，而不可與整合的安全性搭配使用。

# SQL_ChangePasswordUseOfUnallowedKey
source: The keyword '{0}' must not be specified in the connectionString argument to ChangePassword.
de: Das Schlüsselwort '{0}' darf nicht im connectionString-Argument für ChangePassword angegeben werden.
es: No se debe especificar la palabra clave '{0}' en el argumento connectionString para ChangePassword.
fr: Le mot clé '{0}' ne doit pas figurer dans l'argument connectionString utilisé pour ChangePassword.
it: La parola chiave "{0}" non deve essere specificata nell'argomento connectionString per ChangePassword.
ja: キーワード '{0}' は、ChangePassword への connectionString 引数には指定できません。
ko: 키워드 '{0}'은(는) connectionString 인수에서 ChangePassword로 지정할 수 없습니다.
pt_br: A palavra-chave '{0}' não deve ser especificada no argumento connectionString para ChangePassword.
ru: Ключевое слово "{0}" не должно указываться в аргументе connectionString для ChangePassword.
zh_hans: 不能在 connectionString 参数中将关键字“{0}”指定为 ChangePassword。
zh_hant: 關鍵字 '{0}' 必不可在 connectionString 引數中指定以 ChangePassword。

# SQL_UnknownSysTxIsolationLevel
source: Unrecognized System.Transactions.IsolationLevel enumeration value: {0}.
de: Nicht erkannter System.Transactions.IsolationLevel-Enumerationswert: {0}.
es: Valor de enumeración System.Transactions.IsolationLevel no reconocido: {0}.
fr: Valeur d'énumération System.Transactions.IsolationLevel non reconnue : {0}.
it: Valore di enumerazione System.Transactions.IsolationLevel non riconosciuto: {0}.
ja: System.Transactions.IsolationLevel 列挙値 {0} は認識されていない値です。
ko: 인식할 수 없는 System.Transactions.IsolationLevel 열거형 값: {0}.
pt_br: Valor de enumeração System.Transactions.IsolationLevel não reconhecido: {0}.
ru: Неопознанное значение перечисления System.Transactions.IsolationLevel: {0}.
zh_hans: 未识别的 System.Transactions.IsolationLevel 枚举值: {0}。
zh_hant: 無法識別的 System.Transactions.IsolationLevel 列舉值: {0}。

# SQL_InvalidPartnerConfiguration
source: Server {0}, database {1} is not configured for database mirroring.
de: Server {0}, Datenbank {1} ist nicht für die Datenbankspiegelung konfiguriert.
es: Servidor {0}, la base de datos {1} no está configurada para el reflejo de bases de datos.
fr: Le serveur {0}, la base de données {1} n'est pas configuré(e) pour la mise en miroir des bases de données.
it: Server {0}, database {1} non è configurato per il mirroring del database.
ja: サーバー {0} のデータベース {1} は、データベース ミラーを行うようには構成されていません。
ko: 서버 {0}, 데이터베이스 {1}이(가) 데이터베이스 미러링을 위해 구성되지 않았습니다.
pt_br: Servidor {0}, banco de dados {1} não está configurado para espelhamento de banco de dados.
ru: Сервер {0}, база данных {1} не настроена для зеркального отражения.
zh_hans: 未将服务器 {0}、数据库 {1} 配置为用于数据库映像。
zh_hant: 伺服器 {0}、資料庫 {1} 未設定為資料庫鏡向翻轉。

# SQL_MarsUnsupportedOnConnection
source: The connection does not support MultipleActiveResultSets.
de: Die Verbindung unterstützt keine MultipleActiveResultSets.
es: La conexión no es compatible con MultipleActiveResultSets.
fr: La connexion ne prend pas en charge MultipleActiveResultSets.
it: La connessione non supporta MultipleActiveResultSets.
ja: 接続が MultipleActiveResultSets をサポートしていません。
ko: 연결이 MultipleActiveResultSets를 지원하지 않습니다.
pt_br: A conexão não dá suporte para MultipleActiveResultSets.
ru: Подключение не поддерживает MultipleActiveResultSets.
zh_hans: 此连接不支持 MultipleActiveResultSets。
zh_hant: 連接不支援 MultipleActiveResultSets。

# SQL_MSALFailure
source: Failed to authenticate the user {0} in Active Directory (Authentication={1}).
de: Fehler beim Authentifizieren des Benutzers "{0}" in Active Directory (Authentication={1}).
es: Error al autenticar el usuario {0} en Active Directory (Authentication={1}).
fr: Échec de l'authentification de l'utilisateur {0} dans Active Directory (Authentication={1}).
it: Non è possibile autenticare l'utente {0} in Active Directory (Authentication={1}).
ja: ユーザー {0} を Active Directory (Authentication={1}) で認証できませんでした。
ko: Active Directory의 {0} 사용자를 인증하지 못했습니다(Authentication={1}).
pt_br: Falha ao autenticar o usuário {0} no Active Directory (Authentication={1}).
ru: Не удалось проверить подлинность пользователя {0} в Active Directory (Authentication={1}).
zh_hans: 未能对 Active Directory 中的用户 {0} 进行身份验证(Authentication={1})。
zh_hant: 無法在 Active Directory (Authentication={1}) 中驗證使用者 {0}。

# SQL_MSALInnerException
source: Error code 0x{0}; state {1}
de: Fehlercode 0x{0}; Status {1}
es: Código de error 0x{0}; estado{1}
fr: Code d'erreur 0x{0} ; état {1}
it: Codice errore: 0x{0}. Stato: {1}
ja: エラー コード 0x{0}、状態 {1}
ko: 오류 코드 0x{0}, 상태 {1}
pt_br: Código do erro 0x{0}; estado {1}
ru: Код ошибки 0x{0}; состояние {1}
zh_hans: 错误代码 0x{0}；状态 {1}
zh_hant: 錯誤碼 0x {0}; 狀態 {1}

# SQL_ChangePasswordRequiresYukon
source: ChangePassword requires SQL Server 9.0 or later.
de: ChangePassword erfordert SQL Server 9.0 oder höher.
es: ChangePassword requiere SQL Server 9.0 o posterior.
fr: ChangePassword requiert SQL Server 9.0 ou version ultérieure.
it: ChangePassword richiede SQL Server 9.0 o versione successiva.
ja: ChangePassword を使用するには SQL Server 9.0 以降が必要です。
ko: ChangePassword를 사용하려면 SQL Server 9.0 이상이 필요합니다.
pt_br: ChangePassword requer SQL Server 9.0 ou posterior.
ru: Для ChangePassword требуется SQL Server 9.0 или более поздней версии.
zh_hans: ChangePassword 要求 SQL Server 9.0 或更高版本。
zh_hant: ChangePassword 需要 SQL Server 9.0 或更新的版本。

# SQL_NonLocalSSEInstance
source: SSE Instance re-direction is not supported for non-local user instances.
de: Die Umleitung der SSE-Instanz wird bei nicht lokalen Benutzerinstanzen nicht unterstützt.
es: Las instancias de usuario no locales no admiten la redirección SSE Instance.
fr: La redirection d'instance SSE n'est pas prise en charge pour les instances d'utilisateurs non locaux.
it: Il reindirizzamento dell'istanza SSE non è supportato per le istanze di utenti non locali.
ja: 非ローカル ユーザーのインスタンスでは、SSE インスタンスのリダイレクトを行うことはできません。
ko: SSE 인스턴스 리디렉션은 로컬이 아닌 사용자 인스턴스에는 지원되지 않습니다.
pt_br: Não há suporte para redirecionamento da Instância SSE para instâncias de usuários que não sejam locais.
ru: Перенаправление экземпляра SSE не поддерживается для нелокальных пользовательских интерфейсов.
zh_hans: 非本地用户实例不支持 SSE 实例重定向。
zh_hant: 不支援非本端使用者執行個體的 SSE 執行個體重新導向。

# SQL_UnsupportedAuthentication
source: The authentication '{0}' is not supported.
de: Die Authentifizierung "{0}" wird nicht unterstützt.
es: No se admite la autenticación "{0}".
fr: L'authentification '{0}' n'est pas prise en charge.
it: L'autenticazione '{0}' non è supportata.
ja: 認証 '{0}' はサポートされていません。
ko: '{0}' 인증을 사용할 수 없습니다.
pt_br: A autenticação '{0}' não tem suporte.
ru: Проверка подлинности "{0}" не поддерживается.
zh_hans: 不支持身份验证“{0}”。
zh_hant: 不支援驗證 '{0}'。

# SQL_UnsupportedSqlAuthenticationMethod
source: SQL authentication method '{0}' is not supported.
de: Die SQL-Authentifizierungsmethode "{0}" wird nicht unterstützt.
es: No se admite el método de autenticación SQL "{0}".
fr: La méthode d'authentification SQL '{0}' n'est pas prise en charge.
it: Il metodo di autenticazione SQL '{0}' non è supportato.
ja: SQL 認証方法 '{0}' はサポートされていません。
ko: SQL 인증 방법 '{0}'을(를) 사용할 수 없습니다.
pt_br: Não há suporte para o método de autenticação SQL '{0}'.
ru: Метод проверки подлинности SQL "{0}" не поддерживается.
zh_hans: 不支持 SQL 身份验证方法“{0}”。
zh_hant: 不支援 SQL 驗證方法 '{0}'。

# SQL_CannotCreateAuthProvider
source: Failed to instantiate an authentication provider with type '{1}' for '{0}'.
de: Fehler beim Instanziieren eines Authentifizierungsanbieters des Typs "{1}" für "{0}".
es: No se pudo crear una instancia de un proveedor de autenticación con el tipo "{1}" para "{0}".
fr: Échec de l'instanciation d'un fournisseur d'authentification ayant le type '{1}' pour '{0}'.
it: Non è stato possibile creare un'istanza di un provider di autenticazione di tipo '{1}' per '{0}'.
ja: '{0}' の種類 '{1}' の認証プロバイダーをインスタンス化できませんでした。
ko: '{0}'에 대해 '{1}' 형식을 사용하여 인증 공급자를 인스턴스화하지 못했습니다.
pt_br: Falha ao criar uma instância de um provedor de autenticação com o tipo '{1}' para '{0}'.
ru: Не удалось создать экземпляр поставщика проверки подлинности с типом "{1}" для "{0}".
zh_hans: 未能实例化“{0}”的类型为“{1}”的身份验证提供程序。
zh_hant: 無法為 '{0}' 具現化類型為 '{1}' 的驗證提供者。

# SQL_CannotCreateAuthInitializer
source: Failed to instantiate a SqlAuthenticationInitializer with type '{0}'.
de: Fehler beim Instanziieren eines SqlAuthenticationInitializer des Typs "{0}".
es: No se pudo crear una instancia de SqlAuthenticationInitializer con el tipo "{0}".
fr: Échec de l'instanciation d'un SqlAuthenticationInitializer ayant le type '{0}'.
it: Non è stato possibile creare un'istanza di un elemento SqlAuthenticationInitializer di tipo '{0}'.
ja: 種類 '{0}' の SqlAuthenticationInitializer をインスタンス化できませんでした。
ko: '{0}' 형식을 사용하여 SqlAuthenticationInitializer를 인스턴스화하지 못했습니다.
pt_br: Falha ao criar um SqlAuthenticationInitializer com o tipo '{0}'.
ru: Не удалось создать экземпляр SqlAuthenticationInitializer с типом "{0}".
zh_hans: 未能实例化类型为“{0}”的 SqlAuthenticationInitializer。
zh_hant: 無法將類型為 '{0}' 的 SqlAuthenticationInitializer 具現化。

# SQL_CannotInitializeAuthProvider
source: The provider '{0}' threw an exception while initializing.
de: Der Anbieter "{0}" hat bei der Initialisierung eine Ausnahme ausgelöst.
es: El proveedor "{0}" generó una excepción al inicializar.
fr: Le fournisseur '{0}' a levé une exception durant l'initialisation.
it: Il provider '{0}' ha generato un'eccezione durante l'inizializzazione.
ja: 初期化中にプロバイダー '{0}' が例外をスローしました。
ko: 초기화하는 동안 공급자 '{0}'에서 예외를 throw했습니다.
pt_br: O provedor '{0}' gerou uma exceção ao inicializar.
ru: При инициализации поставщика "{0}" возникло исключение.
zh_hans: 初始化时提供程序“{0}”引发了一个异常。
zh_hant: 提供者 '{0}' 在初始化期間擲回例外狀況。
