Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# Snix_Connect
source: A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections.
de: Netzwerkbezogener oder instanzspezifischer Fehler beim Herstellen einer Verbindung mit SQL Server. Der Server wurde nicht gefunden, oder auf ihn kann nicht zugegriffen werden. Überprüfen Sie, ob der Instanzname richtig ist und ob SQL Server Remoteverbindungen zulässt.
es: Error relacionado con la red o específico de la instancia mientras se establecía una conexión con el servidor SQL Server. No se encontró el servidor o éste no estaba accesible. Compruebe que el nombre de la instancia es correcto y que SQL Server está configurado para admitir conexiones remotas.
fr: Une erreur liée au réseau ou spécifique à l'instance s'est produite lors de l'établissement d'une connexion à SQL Server. Le serveur est introuvable ou n'est pas accessible. Vérifiez que le nom de l'instance est correct et que SQL Server est configuré pour autoriser les connexions distantes.
it: Si è verificato un errore di rete o specifico dell'istanza mentre si cercava di stabilire una connessione con SQL Server. Il server non è stato trovato o non è accessibile. Verificare che il nome dell'istanza sia corretto e che SQL Server sia configurato in modo da consentire connessioni remote.
ja: SQL Server への接続を確立しているときにネットワーク関連またはインスタンス固有のエラーが発生しました。サーバーが見つからないかアクセスできません。インスタンス名が正しいこと、および SQL Server がリモート接続を許可するように構成されていることを確認してください。
ko: SQL Server에 연결을 설정하는 중에 네트워크 관련 또는 인스턴스 관련 오류가 발생했습니다. 서버를 찾을 수 없거나 액세스할 수 없습니다. 인스턴스 이름이 올바르고 SQL Server가 원격 연결을 허용하도록 구성되어 있는지 확인하십시오.
pt_br: Erro de rede ou específico à instância ao estabelecer conexão com o SQL Server. O servidor não foi encontrado ou não estava acessível. Verifique se o nome da instância está correto e se o SQL Server está configurado para permitir conexões remotas.
ru: При установлении соединения с SQL Server произошла ошибка, связанная с сетью или с определенным экземпляром. Сервер не найден или недоступен. Убедитесь, что имя экземпляра указано правильно и что на SQL Server разрешены удаленные соединения.
zh_hans: 在与 SQL Server 建立连接时出现与网络相关的或特定于实例的错误。未找到或无法访问服务器。请验证实例名称是否正确并且 SQL Server 已配置为允许远程连接。
zh_hant: 建立連接至 SQL Server 時，發生網路相關或執行個體特定的錯誤。找不到或無法存取伺服器。確認執行個名稱是否正確，以及 SQL Server 是否設定為允許遠端連線。

# Snix_PreLoginBeforeSuccessfullWrite
source: The client was unable to establish a connection because of an error during connection initialization process before login. Possible causes include the following: the client tried to connect to an unsupported version of SQL Server; the server was too busy to accept new connections; or there was a resource limitation (insufficient memory or maximum allowed connections) on the server.
de: Aufgrund eines Fehlers während der Initialisierung der Verbindung vor der Anmeldung konnte der Client keine Verbindung mit dem Server herstellen. Mögliche Ursachen sind u. a. folgende: Der Client hat versucht, eine Verbindung mit einer nicht unterstützten Version von SQL Server herzustellen, der Server ist ausgelastet und kann keine neuen Verbindungen annehmen, oder die Ressourcen auf dem Server sind eingeschränkt (zu wenig Arbeitsspeicher oder maximal zulässige Verbindungen).
es: El cliente no pudo establecer una conexión debido a un error durante el proceso de inicialización de la conexión previo al inicio de sesión. Entre las causas posibles se incluyen: el cliente intentó conectar con una versión no compatible de SQL Server; el servidor estaba demasiado ocupado para aceptar nuevas conexiones; o bien, había una limitación de recursos (memoria insuficiente o número máximo de conexiones permitidas) en el servidor.
fr: Le client n'a pas été en mesure d'établir une connexion en raison d'une erreur lors du processus d'initialisation de la connexion. Parmi les causes courantes figurent les tentatives de connexion du client à une version non prise en charge de SQL Server, un serveur trop occupé pour accepter de nouvelles connexions ou une limitation de ressources (mémoire ou nombre maximal de connexions autorisées) sur le serveur.
it: Il client non è stato in grado di stabilire una connessione a causa di un errore durante il processo di inizializzazione della connessione prima dell'accesso. Cause possibili includono le seguenti: il client tenta di connettersi a una versione non supportata di SQL Server, il server è occupato e non è in grado di accettare nuove connessioni oppure ci sono limiti impostati per la risorsa (memoria insufficiente o numero massimo di connessioni consentito) nel server.
ja: ログイン前の接続初期化プロセス中に発生したエラーにより、クライアントは接続を確立できませんでした。エラーの原因として、サポートされていないバージョンの SQL Server にクライアントが接続しようとした、サーバーがビジーで新しい接続を受け入れられなかった、サーバーのリソースが制限されていた (メモリ不足や最大接続許可数) などの可能性があります。
ko: 로그인하기 전에 연결을 초기화하는 동안 오류가 발생하여 클라이언트에서 서버에 연결하지 못했습니다. 지원되지 않는 버전의 SQL Server를 연결하려고 했거나 서버가 사용 중이어서 새로운 연결을 허용하지 않았거나 서버의 리소스 제한(메모리 또는 최대 허용 연결 수) 때문에 이러한 문제가 발생할 수 있습니다.
pt_br: O cliente não pôde estabelecer uma conexão devido a um erro durante o processo de inicialização da conexão antes do logon. Possíveis causas incluem: o cliente tentou conectar-se a uma versão sem suporte do SQL Server; o servidor estava muito ocupado para aceitar novas conexões; ou havia uma limitação de recursos (memória insuficiente ou máximo de conexões permitidas) no servidor.
ru: Клиенту не удалось установить соединение из-за ошибки, возникшей во время инициализации соединения до входа в систему. Возможны следующие причины ошибки: клиент попытался соединиться с неподдерживаемой версией SQL Server; сервер был слишком загружен и не мог принимать новые соединения; ресурсы сервера были ограничены (недостаточно памяти или превышено допустимое число соединений).
zh_hans: 客户端无法建立连接，因为在登录前连接初始化进程中发生错误。可能的原因包括: 客户端尝试连接的 SQL Server 的版本不受支持; 服务器过忙，无法接受新连接; 或者，服务器上存在资源限制(内存不足或已达到允许的连接最大数量)。
zh_hant: 用戶端無法建立連線，因為在登入前的連線初始化期間發生錯誤。失敗的原因可能是，用戶端嘗試連線至 SQL Server 不支援的版本，伺服器太忙碌而無法接受新連線或伺服器上的資源限制 (記憶體不足或允許的連線上限)。

# Snix_PreLogin
source: A connection was successfully established with the server, but then an error occurred during the pre-login handshake.
de: Es konnte eine Verbindung mit dem Server hergestellt werden, doch während des Handshakes vor der Anmeldung trat ein Fehler auf.
es: Se ha establecido la conexión con el servidor correctamente, pero se ha producido un error durante el inicio de sesión previo del protocolo de enlace.
fr: Une connexion a été établie avec le serveur, mais une erreur s'est ensuite produite pendant la négociation préalable à l'ouverture de session.
it: La connessione con il server è stata stabilita correttamente, ma poi si è verificato un errore durante l'handshake pre-login.
ja: サーバーとの接続を正常に確立しましたが、ログイン前のハンドシェイク中にエラーが発生しました。
ko: 서버에 연결했지만 사전 로그인 핸드셰이크 중에 오류가 발생했습니다.
pt_br: Uma conexão com o servidor foi estabelecida com êxito, mas ocorreu um erro durante o handshake de pré-logon.
ru: Подключение к серверу успешно установлено, но затем произошла ошибка в процессе подтверждения, предшествующего входу.
zh_hans: 已成功与服务器建立连接，但是在登录前的握手期间发生错误。
zh_hant: 與伺服器的連接已成功建立，但在登入前的信號交換時發生錯誤。

# Snix_LoginSspi
source: A connection was successfully established with the server, but then an error occurred when obtaining the security/SSPI context information for integrated security login.
de: Es konnte eine Verbindung mit dem Server hergestellt werden, doch beim Abrufen der 'security'/SSPI-Kontextinformationen für integrierte Sicherheitsanmeldung trat ein Fehler auf.
es: La conexión con el servidor se ha establecido correctamente, pero se ha producido un error al obtener la información de contexto de seguridad/SSPI para el inicio de sesión de seguridad integrada.
fr: Une connexion a été établie avec le serveur, mais une erreur s'est ensuite produite lors de l'obtention des informations de contexte de sécurité/SSPI pour l'ouverture de session avec la sécurité intégrée.
it: La connessione con il server è stata stabilita correttamente, ma poi si è verificato un errore mentre si stavano richiedendo le informazioni sulla sicurezza/contesto SSPI per il login a sicurezza integrata.
ja: サーバーとの接続を正常に確立しましたが、統合セキュリティ ログインで必要な security/SSPI コンテキストの情報を取得しているときにエラーが発生しました。
ko: 서버에 연결했지만 통합 보안 로그인에 대해 보안/SSPI 컨텍스트 정보를 가져오는 동안 오류가 발생했습니다.
pt_br: Uma conexão com o servidor foi estabelecida com êxito, mas ocorreu um erro ao obter informações de segurança/contexto SSPI para o logon de segurança integrada.
ru: Подключение к серверу успешно установлено, но затем произошла ошибка при получении данных безопасности или контекста SSPI для входа с помощью встроенной безопасности.
zh_hans: 已成功与服务器建立连接，但是在为集成安全登录获取安全/SSPI 上下文信息时发生错误。
zh_hant: 與伺服器的連接已成功建立，但在取得整合安全性登錄的安全性/SSPI 內容資訊時發生錯誤。

# Snix_Login
source: A connection was successfully established with the server, but then an error occurred during the login process.
de: Es konnte eine Verbindung mit dem Server hergestellt werden, doch während des Anmeldevorgangs trat ein Fehler auf.
es: La conexión con el servidor se ha establecido correctamente, pero se ha producido un error durante el proceso de inicio de sesión.
fr: Une connexion a été établie avec le serveur, mais une erreur s'est ensuite produite pendant le processus d'ouverture de session.
it: La connessione con il server è stata stabilita correttamente, ma poi si è verificato un errore durante la procedura di login.
ja: サーバーとの接続を正常に確立しましたが、ログイン中にエラーが発生しました。
ko: 서버에 연결했지만 로그인하는 동안 오류가 발생했습니다.
pt_br: Uma conexão com o servidor foi estabelecida com êxito, mas ocorreu um erro durante o processo de logon.
ru: Подключение к серверу успешно установлено, но затем произошла ошибка при входе.
zh_hans: 已成功与服务器建立连接，但是在登录过程中发生错误。
zh_hant: 與伺服器的連接已成功建立，但在登入程序時發生錯誤。

# Snix_EnableMars
source: Connection open and login was successful, but then an error occurred while enabling MARS for this connection.
de: Bei offener Verbindung und nach erfolgreicher Anmeldung trat ein Fehler auf, als MARS für diese Verbindung aktiviert wurde.
es: La apertura de conexión e inicio de sesión se han realizado correctamente, pero se ha producido un error al habilitar a MARS para esta conexión.
fr: L'ouverture de la connexion et de la session a réussi, mais une erreur s'est produite lors de l'activation de MARS pour cette connexion.
it: Apertura e login connessione eseguite correttamente, ma poi si è verificato un errore mentre si stava abilitando MARS per questa connessione.
ja: 接続とログインに成功しましたが、この接続に必要な MARS を有効にしているときにエラーが発生しました。
ko: 연결을 열고 로그인했지만 이 연결에 대해 MARS를 설정하는 동안 오류가 발생했습니다.
pt_br: A abertura da conexão e o logon foram bem sucedidos, mas ocorreu um erro ao habilitar MARS para esta conexão.
ru: Подключение открыто и успешно выполнен вход, но затем произошла ошибка при попытке включения MARS для этого подключения.
zh_hans: 连接打开并且登录成功，但是在启用此连接的 MARS 时出错。
zh_hant: 連接的開啟與登入已經成功，但在啟用此連接的 MARS 時發生錯誤。

# Snix_AutoEnlist
source: Connection open and login was successful, but then an error occurred while enlisting the connection into the current distributed transaction.
de: Bei offener Verbindung und nach erfolgreicher Anmeldung trat ein Fehler auf, als die Verbindung in die aktuelle verteilte Transaktion eingetragen wurde.
es: La apertura de conexión e inicio de sesión se han realizado correctamente, pero se ha producido un error al unir la conexión a la transacción distribuida actual.
fr: L'ouverture de la connexion et de la session a réussi, mais une erreur s'est produite lors de l'inscription de la connexion dans la transaction distribuée en cours.
it: Apertura e login connessione eseguite correttamente, ma poi si è verificato un errore mentre si stava inserendo la connessione nella transazione attualmente distribuita.
ja: 接続とログインに成功しましたが、現在の分散トランザクションへの参加中にエラーが発生しました。
ko: 연결을 열고 로그인했지만 현재의 분산 트랜잭션에 연결을 참여시키는 동안 오류가 발생했습니다.
pt_br: A abertura da conexão e o logon foram bem sucedidos, mas ocorreu um erro durante a inscrição da conexão na transação atual distribuída.
ru: Подключение открыто и успешно выполнен вход, но затем произошла ошибка при внесении подключения в текущую распределенную транзакцию.
zh_hans: 连接打开并且登录成功，但是在将连接登记到当前分布式事务中时出错。
zh_hant: 連接的開啟與登入已經成功，但在將連接登記至目前的分散式交易時發生錯誤。

# Snix_GetMarsSession
source: Failed to establish a MARS session in preparation to send the request to the server.
de: Fehler beim Einrichten einer MARS-Sitzung als Vorbereitung zum Senden der Anforderung an den Server.
es: Fallo al establecer una sesión MARS en preparación para enviar la solicitud al servidor.
fr: Impossible d'établir une session MARS pendant la préparation de l'envoi de la requête au serveur.
it: Impossibile stabilire una sessione MARS in preparazione all'invio della richiesta al server.
ja: サーバーに要求を送信する準備段階で、MARS セッションを確立できませんでした。
ko: 서버로 요청을 보내는 동안 MARS 세션을 설정하지 못했습니다.
pt_br: Falha ao estabelecer uma sessão MARS na preparação do envio da solicitação ao servidor.
ru: Не удалось установить сеанс MARS в процессе подготовки к отправке запроса серверу.
zh_hans: 在准备向服务器发送请求时无法建立 MARS 会话。
zh_hant: 在準備傳送要求至伺服器時無法建立 MARS 工作階段。

# Snix_Execute
source: A transport-level error has occurred when sending the request to the server.
de: Fehler auf Übertragungsebene beim Senden der Anforderung an den Server.
es: Error en el nivel de transporte al enviar la solicitud al servidor.
fr: Une erreur de niveau transport s'est produite lors de l'envoi de la requête au serveur.
it: Si è verificato un errore a livello di trasporto mentre si stava inviando la richiesta al server.
ja: サーバーに要求を送信しているときに、トランスポート レベルのエラーが発生しました。
ko: 서버로 요청을 보내는 동안 전송 수준 오류가 발생했습니다.
pt_br: Um erro no nível de transporte ocorreu ao enviar a solicitação ao servidor.
ru: Ошибка на транспортном уровне при отправке запроса серверу.
zh_hans: 在向服务器发送请求时发生传输级错误。
zh_hant: 在傳送要求至伺服器時發生傳輸層級的錯誤。

# Snix_Read
source: A transport-level error has occurred when receiving results from the server.
de: Fehler auf Übertragungsebene beim Empfang von Ergebnissen vom Server.
es: Error en el nivel del transporte al recibir los resultados del servidor.
fr: Une erreur de niveau transport s'est produite lors de la réception des résultats du serveur.
it: Si è verificato un errore a livello di trasporto durante la ricezione dei risultati dal server.
ja: サーバーから結果を受信しているときに、トランスポート レベルのエラーが発生しました。
ko: 서버로부터 결과를 수신하는 동안 전송 수준 오류가 발생했습니다.
pt_br: Ocorreu um erro no nível de transporte durante o recebimento de resultados do servidor.
ru: Ошибка на транспортном уровне при получении результатов с сервера.
zh_hans: 在从服务器接收结果时发生传输级错误。
zh_hant: 在接收來自伺服器的要求時發生傳輸層級的錯誤。

# Snix_Close
source: A transport-level error has occurred during connection clean-up.
de: Fehler auf Übertragungsebene während des Verbindungscleanups.
es: Error en el nivel de transporte durante la limpieza de la conexión.
fr: Une erreur de niveau transport s'est produite pendant le nettoyage de la connexion.
it: Durante la pulizia della connessione si è verificato un errore a livello di trasporto.
ja: 接続のクリーンアップ中にトランスポート レベルのエラーが発生しました。
ko: 연결 정리 중에 전송 수준 오류가 발생했습니다.
pt_br: Ocorreu um erro no nível de transporte durante a limpeza da conexão.
ru: Ошибка на транспортном уровне в процессе очистки подключения.
zh_hans: 在连接清理期间发生传输级错误。
zh_hant: 在清除連接時發生傳輸層級的錯誤。

# Snix_SendRows
source: A transport-level error has occurred while sending information to the server.
de: Fehler auf Übertragungsebene beim Senden von Informationen an den Server.
es: Error en el nivel del transporte al enviar información al servidor.
fr: Une erreur de niveau transport s'est produite lors de l'envoi d'informations au serveur.
it: Si è verificato un errore a livello di trasporto durante l'invio di informazioni al server.
ja: サーバーに情報を送信しているときに、トランスポート レベルのエラーが発生しました。
ko: 서버로 정보를 보내는 동안 전송 수준 오류가 발생했습니다.
pt_br: Ocorreu um erro no nível de transporte ao enviar informações ao servidor.
ru: Ошибка на транспортном уровне при отправке данных на сервер.
zh_hans: 在向服务器发送信息时发生传输级错误。
zh_hant: 在傳送資訊至伺服器時發生傳輸層級的錯誤。

# Snix_ProcessSspi
source: A transport-level error has occured during SSPI handshake.
de: Fehler auf Übertragungsebene während des SSPI-Handshakes.
es: Error en el nivel del transporte durante el protocolo de enlace SSPI.
fr: Une erreur de niveau transport s'est produite pendant la négociation SSPI.
it: Si è verificato un errore a livello di trasporto durante l'handshake SSPI.
ja: SSPI ハンドシェイク中に、トランスポート レベルのエラーが発生しました。
ko: SSPI 핸드셰이크 중에 전송 수준 오류가 발생했습니다.
pt_br: Ocorreu um erro no nível de transporte durante um handshake SSPI.
ru: Ошибка на транспортном уровне в процессе подтверждения SSPI.
zh_hans: 在 SSPI 握手期间发生传输级错误。
zh_hant: 在 SSPI 信號交換時發生傳輸層級的錯誤。

# LocalDB_CreateFailed
source: Local Database Runtime: Cannot create named instance.
de: Local Database Runtime: Benannte Instanz kann nicht erstellt werden.
es: Local Database Runtime: no se puede crear una instancia con nombre.
fr: Local Database Runtime : Impossible de créer une instance nommée.
it: Local Database Runtime: impossibile creare l'istanza denominata.
ja: Local Database Runtime: 名前付きインスタンスを作成できません。
ko: Local Database Runtime: 이름이 지정된 인스턴스를 만들 수 없습니다.
pt_br: Local Database Runtime: não é possível criar uma instância nomeada.
ru: Local Database Runtime: не удается создать именованный экземпляр.
zh_hans: Local Database Runtime: 无法创建命名实例。
zh_hant: Local Database Runtime: 無法建立具名執行個體。

# LocalDB_BadConfigSectionType
source: Local Database Runtime: system.data.localdb configuration file section is of unknown type.
de: Local Database Runtime: Der Konfigurationsdateiabschnitt "system.data.localdb" besitzt einen unbekannten Typ.
es: Local Database Runtime: la sección del archivo de configuración system.data.localdb es de tipo desconocido.
fr: Local Database Runtime : la section du fichier de configuration system.data.localdb est de type inconnu.
it: Local Database Runtime: il tipo della sezione del file di configurazione system.data.localdb è sconosciuto.
ja: Local Database Runtime: system.data.localdb 構成ファイル セクションの型が不明です。
ko: Local Database Runtime: system.data.localdb 구성 파일 섹션이 알 수 없는 형식입니다.
pt_br: Local Database Runtime: a seção do arquivo de configuração system.data.localdb é de tipo desconhecido.
ru: Local Database Runtime: раздел файла конфигурации system.data.localdb имеет неизвестный тип.
zh_hans: Local Database Runtime: system.data.localdb 配置文件节的类型未知。
zh_hant: Local Database Runtime: system.data.localdb 組態檔區段屬於未知的型別。

# LocalDB_FailedGetDLLHandle
source: Local Database Runtime: Cannot load SQLUserInstance.dll.
de: Local Database Runtime: "SQLUserInstance.dll" kann nicht geladen werden.
es: Local Database Runtime: no se puede cargar SQLUserInstance.dll.
fr: Local Database Runtime : Impossible de charger SQLUserInstance.dll.
it: Local Database Runtime: impossibile caricare SQLUserInstance.dll.
ja: Local Database Runtime: SQLUserInstance.dll を読み込むことができません。
ko: Local Database Runtime: SQLUserInstance.dll을 로드할 수 없습니다.
pt_br: Local Database Runtime: não é possível carregar SQLUserInstance.dll.
ru: Local Database Runtime: не удается загрузить SQLUserInstance.dll.
zh_hans: Local Database Runtime: 无法加载 SQLUserInstance.dll。
zh_hant: Local Database Runtime: 無法載入 SQLUserInstance.dll。

# LocalDB_MethodNotFound
source: Invalid SQLUserInstance.dll found at the location specified in the registry. Verify that the Local Database Runtime feature of SQL Server Express is properly installed.
de: An dem Ort, der in der Registrierung angegeben ist, wurde eine ungültige "SQLUserInstance.dll" gefunden. Überprüfen Sie, ob die Funktion Local Database Runtime von SQL Server Express richtig installiert ist.
es: SQLUserInstance.dll no válido en la ubicación especificada en el Registro. Compruebe que la característica de Local Database Runtime de SQL Server Express se ha instalado correctamente.
fr: SQLUserInstance.dll non valide à l'emplacement spécifié dans le registre. Vérifiez que la fonctionnalité du Local Database Runtime de SQL Server Express est bien installée.
it: SQLUserInstance.dll non valido trovato nel percorso specificato nel Registro di sistema. Verificare che la funzionalità Local Database Runtime di SQL Server Express sia installata correttamente.
ja: レジストリに指定されている場所で無効な SQLUserInstance.dll が見つかりました。SQL Server Express の Local Database Runtime 機能が正しくインストールされていることを確認してください。
ko: 레지스트리에 지정된 위치에서 잘못된 SQLUserInstance.dll을 찾았습니다. SQL Server Express의 Local Database Runtime 기능이 올바르게 설치되었는지 확인하십시오.
pt_br: SQLUserInstance.dll inválido encontrado no local especificado no Registro. Verifique se o recurso Local Database Runtime do SQL Server Express está instalado corretamente.
ru: Недопустимый файл SQLUserInstance.dll по адресу, указанному в реестре. Проверьте, что компонент Local Database Runtime сервера SQL Server Express правильно установлен.
zh_hans: 在注册表中指定的位置找到了无效的 SQLUserInstance.dll。请验证 SQL Server Express 的 Local Database Runtime 功能是否正确安装。
zh_hant: 在登錄指定的位置找到無效的 SQLUserInstance.dll。請確認 SQL Server Express 的 Local Database Runtime 功能已正確安裝。

# LocalDB_UnobtainableMessage
source: Cannot obtain Local Database Runtime error message
de: Fehlermeldung von Local Database Runtime konnte nicht abgerufen werden.
es: No se puede obtener el mensaje de error de Local Database Runtime
fr: Impossible d'obtenir message d'erreur de Local Database Runtime
it: Impossibile ottenere il messaggio di errore di Local Database Runtime
ja: Local Database Runtime エラー メッセージを取得できません
ko: Local Database Runtime 오류 메시지를 가져올 수 없음
pt_br: Não é possível obter a mensagem de erro de Local Database Runtime
ru: Не удается получить сообщение об ошибке среды Local Database Runtime
zh_hans: 无法获取 Local Database Runtime 错误消息
zh_hant: 無法取得 Local Database Runtime 錯誤訊息

# LocalDB_InvalidVersion
source: Local Database Runtime: Invalid instance version specification found in the configuration file.
de: Local Database Runtime: In der Konfigurationsdatei wurde eine ungültige Angabe der Instanzversion gefunden.
es: Local Database Runtime: se detectó en el archivo de configuración una especificación de versión de instancia no válida.
fr: Local Database Runtime : Spécification de version instance non valide trouvée dans le fichier de configuration.
it: Local Database Runtime: specifica di versione dell'istanza non valida trovata nel file di configurazione.
ja: Local Database Runtime: 構成ファイルで無効なインスタンス バージョンの指定が見つかりました。
ko: Local Database Runtime: 구성 파일에서 잘못된 인스턴스 버전 지정을 찾았습니다.
pt_br: Local Database Runtime: especificação de versão de instância inválida encontrada no arquivo de configuração.
ru: Local Database Runtime: в файле конфигурации обнаружена недопустимая спецификация версии экземпляра.
zh_hans: Local Database Runtime: 在配置文件中找到了无效的实例版本规范。
zh_hant: Local Database Runtime: 在組態檔中找到無效的執行個體版本規格。

# TCE_InvalidKeyEncryptionAlgorithm
source: Invalid key encryption algorithm specified: '{0}'. Expected value: '{1}'.
de: Ungültiger Schlüsselverschlüsselungsalgorithmus angegeben: "{0}". Erwarteter Wert: "{1}".
es: Algoritmo de cifrado de clave especificado no válido: '{0}'. Valor esperado: '{1}'.
fr: L'algorithme de chiffrement de clé spécifié est non valide : « {0} ». La valeur attendue est « {1} ».
it: L'algoritmo di crittografia a chiave specificato non è valido: '{0}'. Valore previsto: '{1}'.
ja: 指定したキー暗号化アルゴリズム '{0}' は無効です。期待されている値は '{1}' です。
ko: 잘못된 키 암호화 알고리즘 '{0}'이(가) 지정되었습니다. 필요한 값은 '{1}'입니다.
pt_br: Algoritmo de criptografia de chave inválida especificado: '{0}'. Valor esperado: '{1}'.
ru: Указан неверный алгоритм шифрования ключа: "{0}". Ожидаемое значение: "{1}".
zh_hans: 指定的密钥加密算法无效:“{0}”。预期值:“{1}”。
zh_hant: 指定了無效的金鑰加密演算法: '{0}'。值應為: '{1}'。
