Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# OleDbCommandBuilder_DataAdapter
source: The DataAdapter for which to automatically generate OleDbCommands
de: DataAdapter für den automatisch OleDbCommands generiert werden.
es: DataAdapter para generar automáticamente OleDbCommands
fr: Le DataAdapter pour lequel générer automatiquement OleDbCommands
it: DataAdapter per cui generare automaticamente OleDbCommands
ja: 自動的に OleDbCommands を生成する DataAdapter です。
ko: OleDbCommands를 자동으로 생성하는 DataAdapter입니다.
pt_br: O DataAdapter para o qual OleDbCommands serão gerados automaticamente
ru: DataAdapter, для которого будут автоматически создаваться OleDbCommands
zh_hans: 要为其自动生成 OleDbCommands 的 DataAdapter
zh_hant: 自動產生 OleDbCommands 的 DataAdapter

# OleDbCommandBuilder_DecimalSeparator
source: The decimal separator used in numeric literals.
de: Das in numerischen Literalen verwendete Dezimaltrennzeichen.
es: Separador decimal utilizado en literales numéricos.
fr: Séparateur décimal utilisé dans les littéraux numériques.
it: Separatore decimale utilizzato nei letterali numerici.
ja: 数値リテラルで使用される桁区切り記号です。
ko: 숫자 리터럴에서 사용되는 소수 구분 기호입니다.
pt_br: Separador decimal usado em literais numéricos.
ru: Разделитель для десятичной дробной части, использующийся в числовых константах.
zh_hans: 用于十进制文本的十进制分隔符。
zh_hant: 用於數字的小數點分隔符號。

# OleDbCommandBuilder_QuotePrefix
source: The prefix string wrapped around sql objects
de: Die Präfixzeichenfolge um sql-Objekte
es: Cadena de prefijo que se ajusta alrededor de los objetos sql
fr: La chaîne de préfixe autour des objets sql
it: Stringa di prefisso utilizzata con gli oggetti sql.
ja: sql オブジェクトを囲むプレフィックス文字列です。
ko: 접두 문자열이 sql 개체 이름에 연결되었습니다.
pt_br: Cadeia de caracteres de prefixo encapsulada com objetos sql
ru: Строка префикса, маркирующая объекты sql
zh_hans: 环绕 sql 对象的前缀字符串
zh_hant: 在 sql 物件周圍包裝的前置詞字串

# OleDbCommandBuilder_QuoteSuffix
source: The suffix string wrapped around sql objects
de: Die Suffixzeichenfolge um sql-Objekte
es: Cadena de sufijo que se ajusta alrededor de los objetos sql
fr: La chaîne de suffixe autour des objets sql
it: Stringa di suffisso utilizzata con gli oggetti sql.
ja: sql オブジェクトを囲むサフィックス文字列です。
ko: 접미 문자열이 sql 개체 이름에 연결되었습니다.
pt_br: Cadeia de caracteres de sufixo encapsulada com objetos sql
ru: Строка суффикса, маркирующая объекты sql
zh_hans: 环绕 sql 对象的后缀字符串
zh_hant: 在 sql 物件周圍包裝的後置詞字串

# SqlCommandBuilder_DataAdapter
source: The DataAdapter for which to automatically generate SqlCommands
de: Der DataAdapter, für den automatisch SqlCommands generiert werden
es: DataAdapter para generar automáticamente SqlCommands
fr: Le DataAdapter pour lequel générer automatiquement SqlCommands
it: DataAdapter per cui generare automaticamente SqlCommands
ja: SqlCommands を自動的に生成する DataAdapter です。
ko: SqlCommands를 자동으로 생성하는 DataAdapter입니다.
pt_br: O DataAdapter para o qual SqlCommands serão gerados automaticamente
ru: DataAdapter, для которого будут автоматически создаваться SqlCommands
zh_hans: 自动为其生成 SqlCommands 的 DataAdapter
zh_hant: 自動產生 SqlCommands 項目的 DataAdapter

# SqlCommandBuilder_DecimalSeparator
source: The decimal separator used in numeric literals.
de: Das in numerischen Literalen verwendete Dezimaltrennzeichen.
es: Separador decimal utilizado en literales numéricos.
fr: Séparateur décimal utilisé dans les littéraux numériques.
it: Separatore decimale utilizzato nei letterali numerici.
ja: 数値リテラルで使用される桁区切り記号です。
ko: 숫자 리터럴에서 사용되는 소수 구분 기호입니다.
pt_br: Separador decimal usado em literais numéricos.
ru: Разделитель для десятичной дробной части, использующийся в числовых константах.
zh_hans: 用于十进制文本的十进制分隔符。
zh_hant: 用於數字的小數點分隔符號。

# SqlCommandBuilder_QuotePrefix
source: The character used in a text command as the opening quote for quoting identifiers that contain special characters.
de: Das Zeichen, das in einem Textbefehl als öffnendes Anführungszeichen für Bezeichner verwendet wird, die spezielle Zeichen verwenden.
es: El carácter utilizado en un comando de texto, como la comilla de apertura para los identificadores de comillas que contienen caracteres especiales.
fr: Caractère utilisé dans une commande de texte en tant que guillemet ouvrant pour les identificateurs qui contiennent des caractères spéciaux.
it: Carattere utilizzato come virgoletta di apertura, necessaria per inserire nei comandi di testo identificatori che contengono caratteri speciali.
ja: 特殊文字を含む識別子を引用符で囲むために開始引用符としてテキスト コマンドで使用される文字です。
ko: 텍스트 명령에서 특수 문자가 포함된 식별자를 따옴표로 묶을 때, 여는 따옴표로 사용되는 문자입니다.
pt_br: O caractere usado em um comando de texto como aspas de abertura para delimitar identificadores que contêm caracteres especiais.
ru: Знак, который используется в текстовых командах в качестве открывающей кавычки для заключения в кавычки идентификаторов, содержащих специальные знаки.
zh_hans: 在文本命令中用作左引号的字符，用于将包含特殊字符的标识符括起来。
zh_hant: 文字命令中，用來當作引號識別項 (其中包含特殊字元) 開頭引號的字元。

# SqlCommandBuilder_QuoteSuffix
source: The character used in a text command as the closing quote for quoting identifiers that contain special characters.
de: Das Zeichen, das in einem Textbefehl als schließendes Anführungszeichen für Bezeichner verwendet wird, die spezielle Zeichen enthalten.
es: El carácter utilizado en un comando de texto, como la comilla de cierre para los identificadores de comillas que contienen caracteres especiales.
fr: Caractère utilisé dans une commande de texte en tant que guillemet fermant pour les identificateurs qui contiennent des caractères spéciaux.
it: Carattere utilizzato come virgoletta di chiusura, necessaria per inserire nei comandi di testo identificatori che contengono caratteri speciali.
ja: 特別な文字を含む識別子を引用する際の閉じの引用符として、テキスト コマンドで使用される文字です。
ko: 텍스트 명령에서 특수 문자가 포함된 식별자를 따옴표로 묶을 때, 닫는 따옴표로 사용되는 문자입니다.
pt_br: O caractere usado em um comando de texto como aspas de fechamento para delimitar identificadores que contêm caracteres especiais.
ru: Знак, который используется в текстовых командах в качестве закрывающей кавычки для заключения в кавычки идентификаторов, содержащих специальные знаки.
zh_hans: 在文本命令中用作右引号的字符，用于将包含特殊字符的标识符括起来。
zh_hant: 文字命令中，用來當作引號識別項 (其中包含特殊字元) 結束引號的字元。

# DbDataParameter_Precision
source: Only necessary to set for decimal and numeric parameters when using with Prepare, FillSchema and CommandBuilder scenarios.
de: Nur erforderlich zum Festlegen für dezimale und numerische Parameter im Rahmen einer Verwendung bei den Szenarien 'Prepare', 'FillSchema' und 'CommandBuilder'.
es: Sólo es necesario establecerlo para parámetros numéricos y decimales al utilizar escenarios con Prepare, FillSchema y CommandBuilder.
fr: Définition nécessaire uniquement pour les paramètres décimaux et numériques en cas d'utilisation avec les scénarios Prepare, FillSchema et CommandBuilder.
it: Impostazione necessaria soltanto i parametri con valore decimal e numeric quando si utilizzano gli scenari Prepare, FillSchema e CommandBuilder.
ja: Prepare、FillSchema、および CommandBuilder シナリオで使用するときは、10 進パラメーターと数値パラメーターのみを設定する必要があります。
ko: Prepare, FillSchema 및 CommandBuilder 시나리오를 사용할 때는 decimal 및 numeric 매개 변수에 대해서만 설정해야 합니다.
pt_br: É necessário definir parâmetros numéricos e decimais somente ao usar cenários Prepare, FillSchema e CommandBuilder.
ru: Нужно устанавливать только для десятичных и числовых параметров в сценариях Prepare, FillSchema и CommandBuilder.
zh_hans: 只有在与 Prepare、FillSchema 和 CommandBuilder 方案一起使用时，才需要设置小数和数值参数。
zh_hant: 當與 Prepare、FillSchema 和 CommandBuilder 情節搭配使用時，只需要設定為十進位數字參數。

# DbDataParameter_Scale
source: Only necessary to set for decimal and numeric parameters when using with Prepare, FillSchema and CommandBuilder scenarios.
de: Nur erforderlich zum Festlegen für dezimale und numerische Parameter im Rahmen einer Verwendung bei den Szenarien 'Prepare', 'FillSchema' und 'CommandBuilder'.
es: Sólo es necesario establecerlo para parámetros numéricos y decimales al utilizar escenarios con Prepare, FillSchema y CommandBuilder.
fr: Définition nécessaire uniquement pour les paramètres décimaux et numériques en cas d'utilisation avec les scénarios Prepare, FillSchema et CommandBuilder.
it: Impostazione necessaria soltanto i parametri con valore decimal e numeric quando si utilizzano gli scenari Prepare, FillSchema e CommandBuilder.
ja: Prepare、FillSchema、および CommandBuilder シナリオで使用するときは、10 進パラメーターと数値パラメーターのみを設定する必要があります。
ko: Prepare, FillSchema 및 CommandBuilder 시나리오를 사용할 때는 decimal 및 numeric 매개 변수에 대해서만 설정해야 합니다.
pt_br: É necessário definir parâmetros numéricos e decimais somente ao usar cenários Prepare, FillSchema e CommandBuilder.
ru: Нужно устанавливать только для десятичных и числовых параметров в сценариях Prepare, FillSchema и CommandBuilder.
zh_hans: 只有在与 Prepare、FillSchema 和 CommandBuilder 方案一起使用时，才需要设置小数和数值参数。
zh_hant: 當與 Prepare、FillSchema 和 CommandBuilder 情節搭配使用時，只需要設定為十進位數字參數。

# OdbcParameter_OdbcType
source: The parameter native type.
de: Der native Parametertyp.
es: Parámetro de tipo nativo.
fr: Le type natif du paramètre.
it: Tipo nativo del parametro.
ja: ネイティブ型のパラメーターです。
ko: 기본 형식 매개 변수입니다.
pt_br: Tipo nativo do parâmetro.
ru: Собственный тип параметра.
zh_hans: 参数本机类型。
zh_hant: 參數原生型別。

# OleDbParameter_OleDbType
source: The parameter native type.
de: Der native Parametertyp.
es: Parámetro de tipo nativo.
fr: Le type natif du paramètre.
it: Tipo nativo del parametro.
ja: ネイティブ型のパラメーターです。
ko: 기본 형식 매개 변수입니다.
pt_br: Tipo nativo do parâmetro.
ru: Собственный тип параметра.
zh_hans: 参数本机类型。
zh_hant: 參數原生型別。

# SqlParameter_ParameterName
source: Name of the parameter, like '@p1'
de: Name des Parameters, z.B. '@p1'
es: Nombre del parámetro, formato '@p1'
fr: Nom du paramètre, par exemple '@p1'
it: Nome del parametro, ad esempio '@p1'.
ja: たとえば '@p1' のような、パラメーターの名前です。
ko: 매개 변수 이름입니다(예: '@p1').
pt_br: Nome do parâmetro, como '@p1'
ru: Имя данного параметра, например, "@p1"
zh_hans: 参数的名称，如“@p1”
zh_hant: 參數的名稱，例如 '@p1'

# SqlParameter_SqlDbType
source: The parameter native type.
de: Der native Parametertyp.
es: Parámetro de tipo nativo.
fr: Le type natif du paramètre.
it: Tipo nativo del parametro.
ja: ネイティブ型のパラメーターです。
ko: 기본 형식 매개 변수입니다.
pt_br: Tipo nativo do parâmetro.
ru: Собственный тип параметра.
zh_hans: 参数本机类型。
zh_hant: 參數原生型別。

# SqlParameter_TypeName
source: The server's name for the type.
de: Der Servername für den Typ.
es: Nombre del servidor para el tipo.
fr: Nom du serveur pour le type.
it: Il nome del server per il tipo.
ja: 型のサーバーの名前です。
ko: 해당 형식의 서버 이름입니다.
pt_br: O nome do servidor para o tipo.
ru: Имя сервера для типа.
zh_hans: 类型的服务器名称。
zh_hant: 型別的伺服器名稱。

# SqlParameter_Offset
source: Offset in variable length data types.
de: Offset in Datentypen variabler Länge.
es: Desplazamiento en tipos de datos de longitud variable.
fr: Offset dans les types de données de longueur variable.
it: Offset dei tipi di dati a lunghezza variabile.
ja: 可変長データ型のオフセットです。
ko: 가변 길이 데이터 형식의 오프셋입니다.
pt_br: Deslocamento em tipos de dados de comprimento variável.
ru: Смещение в типах данных переменной длины.
zh_hans: 可变长度数据类型中的偏移量。
zh_hant: 可變長度資料型別中的位移。

# SqlParameter_UnsupportedTVPOutputParameter
source: ParameterDirection '{0}' specified for parameter '{1}' is not supported. Table-valued parameters only support ParameterDirection.Input.
de: Die angegebene ParameterDirection '{0}' für Parameter '{1}' wird nicht unterstützt. Table-valued parameters unterstützen nur ParameterDirection.Input.
es: No se admite la ParameterDirection '{0}' especificada para el parámetro '{1}'. Table-valued parameters sólo admiten ParameterDirection.Input.
fr: Le ParameterDirection '{0}' spécifié pour le paramètre '{1}' n'est pas pris en charge. Les Table-valued parameters prennent uniquement en charge ParameterDirection.Input.
it: ParameterDirection '{0}' specificato per il parametro '{1}' non è supportato. Table-valued parameters supportano solo ParameterDirection.Input.
ja: パラメーター '{1}' に指定された ParameterDirection '{0}' はサポートされていません。Table-valued parameters では、ParameterDirection.Input だけがサポートされています。
ko: 지정된 ParameterDirection '{0}'은(는) 매개 변수 '{1}'에 대해 지원되지 않습니다. Table-valued parameters는 ParameterDirection.Input만 지원합니다.
pt_br: O ParameterDirection '{0}' especificado para o parâmetro '{1}' não tem suporte. Os Table-valued parameters somente têm suporte para ParameterDirection.Input.
ru: Для параметра "{1}" не поддерживается указанное значение ParameterDirection, равное "{0}". Возвращающие табличное значение параметры Table-valued parameters поддерживают только ParameterDirection.Input.
zh_hans: 不支持为参数“{1}”指定的 ParameterDirection“{0}”。Table-valued parameters 只支持 ParameterDirection.Input。
zh_hant: 不支援為參數 '{1}' 所指定的 ParameterDirection '{0}'。Table-valued parameters 只支援 support ParameterDirection.Input。

# SqlParameter_DBNullNotSupportedForTVP
source: DBNull value for parameter '{0}' is not supported. Table-valued parameters cannot be DBNull.
de: Der 'DBNull'-Wert für den Parameter '{0}' wird nicht unterstützt. Table-valued parameters dürfen nicht 'DBNull' sein.
es: No se admite el valor DBNull para el parámetro '{0}'. Table-valued parameters no pueden ser DBNull.
fr: La valeur DBNull pour le paramètre '{0}' n'est pas prise en charge. Les Table-valued parameters ne peuvent pas avoir la valeur DBNull.
it: Il valore DBNull per il parametro '{0}' non è supportato. Table-valued parameters non possono essere DBNull.
ja: パラメーター '{0}' では DBNull 値はサポートされていません。Table-valued parameters に DBNull を指定することはできません。
ko: 매개 변수 '{0}'에는 DBNull 값이 지원되지 않습니다. Table-valued parameters는 DBNull일 수 없습니다.
pt_br: O valor DBNull para o parâmetro '{0}' não tem suporte. Table-valued parameters não podem ser DBNull.
ru: Значение DBNull для параметра "{0}" не поддерживается. Имеющие табличное значение параметры Table-valued parameters не могут иметь значение DBNull.
zh_hans: 不支持对参数“{0}”使用 DBNull值。Table-valued parameters 不能为 DBNull。
zh_hant: 不支援參數 '{0}' 的 DBNull 值。Table-valued parameters 不可為 DBNull。

# SqlParameter_InvalidTableDerivedPrecisionForTvp
source: Precision '{0}' required to send all values in column '{1}' exceeds the maximum supported precision '{2}'. The values must all fit in a single precision.
de: Die zum Senden aller Werte in der Spalte '{1}' erforderliche Precision '{0}' überschreitet die maximal zulässige Genauigkeit von '{2}'. Alle Werte müssen einer einfachen Genauigkeit entsprechen.
es: La Precision '{0}' necesaria para enviar todos los valores de la columna '{1}' supera la precisión máxima admitida de '{2}'. Todos los valores deben ajustarse a una única precisión.
fr: La Precision '{0}' requise pour envoyer toutes les valeurs dans la colonne '{1}' dépasse la précision maximale prise en charge '{2}'. Les valeurs doivent toutes s'ajuster à une seule précision.
it: Precision '{0}' necessario per inviare tutti i valori nella colonna '{1}' supera la precisione massima supportata '{2}'. Tutti i valori devono essere inclusi in una precisione singola.
ja: 列 '{1}' のすべての値を送信するために必要な Precision '{0}' が、サポートされている最大有効桁数 '{2}' を超えています。値は、単一の有効桁数に適合する必要があります。
ko: 열 '{1}'에 모든 값을 보내야 하는 Precision '{0}'이(가) 지원되는 최대 정밀도 '{2}'을(를) 초과합니다. 모든 값은 단일 정밀도에 맞아야 합니다.
pt_br: A Precision '{0}' necessária para enviar todos os valores na coluna '{1}' excede a precisão máxima suportada '{2}'. Todos os valores devem se ajustar a um única precisão.
ru: Точность Precision "{0}", необходимая для отправки всех значений в столбце "{1}", превышает максимальную поддерживаемую точность "{2}". Все значения должны укладываться в одну точность.
zh_hans: 发送列“{1}”中的所有值所需要的 Precision“{0}”超过了所支持的最大精度“{2}”。这些值必须适合于一个精度。
zh_hant: 傳送資料行 '{1}' 中所有值所需的 Precision '{0}' 超過支援之精確度 '{2}' 的最大值。值必須必須配合單精確度。

# SqlParameter_UnexpectedTypeNameForNonStruct
source: TypeName specified for parameter '{0}'. TypeName must only be set for Structured parameters.
de: Der angegebene TypeName für Parameter '{0}'. TypeName darf nur für Structured-Parameter festgelegt werden.
es: Se especificó TypeName para el parámetro '{0}'. Solo se debe especificar TypeName para los parámetros Structured.
fr: TypeName spécifié pour le paramètre '{0}'. TypeName ne doit être défini que pour les paramètres Structured.
it: TypeName specificato per il parametro '{0}'. TypeName deve essere impostato solo per i parametri Structured.
ja: パラメーター '{0}' に TypeName が指定されました。TypeName は Structured パラメーターだけに設定してください。
ko: 매개 변수 '{0}'에 TypeName이 지정되었습니다. TypeName은 Structured 매개 변수에만 설정해야 합니다.
pt_br: O TypeName especificado para o parâmetro '{0}'. O TypeName deve ser estabelecido apenas por parâmetros Structured.
ru: Имя TypeName, заданное для параметра "{0}". Имя TypeName следует устанавливать только для структурных параметров Structured.
zh_hans: 为参数“{0}”指定了 TypeName。只能为 Structured 参数设置 TypeName。
zh_hant: 參數 '{0}' 指定的 TypeName。TypeName 必須只設定為 Structured 參數。

# MetaType_SingleValuedStructNotSupported
source: SqlDbType.Structured type is only supported for multiple valued types.
de: Der SqlDbType.Structured-Typ wird nur für Typen mit mehreren Werten unterstützt.
es: El tipo SqlDbType.Structured sólo es compatible con varios tipos con valores.
fr: Le type SqlDbType.Structured n'est pris en charge que pour plusieurs types avec valeur.
it: Il tipo SqlDbType.Structured è supportato solo per tipi con più valori.
ja: SqlDbType.Structured 型は、複数値型だけでサポートされています。
ko: SqlDbType.Structured 형식은 다중 값 형식에만 지원됩니다.
pt_br: O tipo SqlDbType.Structured só tem suporte para tipos de valores variados.
ru: Тип SqlDbType.Structured поддерживается только для многозначных типов.
zh_hans: 仅对多值类型支持 SqlDbType.Structured 类型。
zh_hant: SqlDbType.Structured 型別只支援多值的型別。

# NullSchemaTableDataTypeNotSupported
source: DateType column for field '{0}' in schema table is null. DataType must be non-null.
de: Die 'DateType'-Spalte für das Feld '{0}' in der Schematabelle ist NULL. 'DataType' darf nicht 'null' sein.
es: La columna DateType para el campo '{0}' en la tabla de esquema es null. DataType debe ser no null.
fr: La colonne DateType du champ '{0}' dans la table de schéma a la valeur null. Elle doit avoir une valeur autre que Null.
it: La colonna DateType per il campo '{0}' nello schema di tabella è null. Il valore di DataType deve essere non Null.
ja: スキーマ テーブルのフィールド '{0}' に対する DateType 列が Null です。DataType は、null 以外でなければなりません。
ko: 스키마 테이블의 '{0}' 필드의 DateType 열이 Null입니다. DataType은 null이 아니어야 합니다.
pt_br: A coluna DateType para o campo '{0}' na tabela do esquema é nula. A DataType não deve ser null.
ru: Столбец DateType для поля "{0}" в таблице схемы имеет значение NULL. Этот столбец должен иметь значение, отличное от null.
zh_hans: 架构表中的字段“{0}”的 DateType 列为 null。DataType 必须为非 null。
zh_hant: 結構描述資料表中欄位 '{0}' 的 DateType 資料行為 null。DataType 不可為 null。

# InvalidSchemaTableOrdinals
source: Invalid column ordinals in schema table. ColumnOrdinals, if present, must not have duplicates or gaps.
de: Ungültige Spaltenordinalzahlen in der Schematabelle. ColumnOrdinals dürfen, falls vorhanden, keine Duplikate oder Lücken enthalten.
es: Índices de columna no válidos en la tabla de esquema. Los ColumnOrdinals, si hay, no deben tener duplicados ni espacios.
fr: Numéros de colonne non valides dans la table de schéma. Les doublons ou intervalles ne sont pas autorisés dans les ColumnOrdinals éventuels.
it: Numeri di colonna ordinali non validi nella tabella dello schema. ColumnOrdinals, se presenti, non devono avere duplicati o spazi vuoti.
ja: スキーマ テーブルの列序数が無効です。ColumnOrdinals を設定する場合、重複やギャップがあってはいけません。
ko: 스키마 테이블의 열 서수가 잘못되었습니다. ColumnOrdinals가 있을 경우 중복되거나 공백이 있어서는 안 됩니다.
pt_br: Coluna ordinais inválida. Se definida, a ColumnOrdinals não deve ter duplicatas ou intervalos.
ru: Недопустимые номера столбцов в таблице схемы. Номера столбцов ColumnOrdinals (при их наличии) не должны повторяться, и между ними не должно быть разрывов.
zh_hans: 架构表中存在无效的列序号。如果存在 ColumnOrdinals，则不能存在重复项或者空白。
zh_hant: 結構描述資料表中的資料行序數無效。ColumnOrdinals (如果有出現) 不可以重複或有間隔。

# SQL_EnumeratedRecordMetaDataChanged
source: Metadata for field '{0}' of record '{1}' did not match the original record's metadata.
de: Die Metadaten für das Feld '{0}' des Datensatzes '{1}' stimmen nicht mit den Metadaten des ursprünglichen Datensatzes überein.
es: Los metadatos del campo '{0}' del registro '{1}' no coincidían con los metadatos del registro original.
fr: Les métadonnées du champ '{0}' de l'enregistrement '{1}' ne correspondent pas aux métadonnées de l'enregistrement d'origine.
it: I metadati per il campo '{0}' del record '{1}' non corrispondono ai metadati del record originale.
ja: レコード '{1}' のフィールド '{0}' のメタデータが、元のレコードのメタデータと一致しませんでした。
ko: '{1}' 레코드의 '{0}' 필드에 대한 메타데이터가 원본 레코드의 메타데이터와 일치하지 않습니다.
pt_br: Os metadados para o campo '{0}' do registro '{1}' não correspondem ao registro de metadados original.
ru: Метаданные для поля "{0}" записи "{1}" не совпадают с метаданными первоначальной записи.
zh_hans: 记录“{1}”的字段“{0}”的元数据与原始记录的元数据不符。
zh_hant: 記錄 '{1}' 之欄位 '{0}' 的中繼資料與原始記錄的中繼資料不符。

# SQL_EnumeratedRecordFieldCountChanged
source: Number of fields in record '{0}' does not match the number in the original record.
de: Die Anzahl der Felder im Datensatz '{0}' stimmt nicht mit der Anzahl in dem ursprünglichen Datensatz überein.
es: El número de campos del registro '{0}' no coincide con el número del registro original.
fr: Le nombre de champs de l'enregistrement '{0}' ne correspond pas au nombre de l'enregistrement d'origine.
it: Il numero di campi nel record '{0}' non corrisponde al numero contenuto nel record originale.
ja: レコード '{0}' のフィールド数が、元のレコードでの数と一致しません。
ko: '{0}' 레코드의 필드 수가 원본 레코드의 필드 수와 일치하지 않습니다.
pt_br: O número de campos no registro '{0}' não corresponde ao número do registro original.
ru: Число полей в записи "{0}" не совпадает с числом полей в первоначальной записи.
zh_hans: 记录“{0}”中的字段数与原始记录中字段数不符。
zh_hant: 記錄 '{0}' 中的欄位數目與原始記錄中的數目不符。

# SQLUDT_MaxByteSizeValue
source: range: 0-8000
de: Bereich: 0-8000
es: intervalo: 0-8000
fr: plage : 0-8 000
it: intervallo: 0-8000
ja: 範囲 : 0-8000
ko: 범위: 0-8000
pt_br: intervalo: 0-8000
ru: диапазон: 0-8000
zh_hans: 范围: 0-8000
zh_hant: 範圍: 0-8000

# SQLUDT_Unexpected
source: unexpected error encountered in SqlClient data provider. {0}
de: Im SqlClient-Datenprovider ist ein unerwarteter Fehler aufgetreten. {0}
es: error inesperado en el proveedor de datos SqlClient. {0}
fr: Une erreur inattendue a été détectée chez le fournisseur de données SqlClient. {0}
it: Errore imprevisto nel provider dati di SqlClient. {0}
ja: SqlClient データ プロバイダーに予期しないエラーが発生しました。{0}
ko: SqlClient 데이터 공급자에서 오류가 발생했습니다. {0}
pt_br: erro inesperado no provedor de dados SqlClient. {0}
ru: Непредвиденная ошибка в поставщике данных SqlClient: {0}
zh_hans: SqlClient 数据提供程序遇到意外错误。{0}
zh_hant: SqlClient 資料提供者發生無法預期的錯誤。{0}

# SQLUDT_InvalidDbId
source: Unable to get Type Info for {0},{1}
de: Type Info für {0},{1} kann nicht abgerufen werden
es: No se puede obtener Type Info para {0},{1}
fr: Impossible d'obtenir les Type Info pour {0},{1}
it: Impossibile ottenere Type Info per {0},{1}
ja: {0},{1} の Type Info を取得できません。
ko: {0},{1}에 대한 Type Info를 가져올 수 없습니다.
pt_br: Não é possível obter Type Info de {0},{1}
ru: Не удается получить данные о типе Type Info для {0},{1}
zh_hans: 无法获取 {0}、{1} 的 Type Info
zh_hant: 無法取得 {0}、{1} 的 Type Info

# SQLUDT_CantLoadAssembly
source: The provider has failed to load the following assembly: {0}
de: Der Provider hat folgende Assembly nicht geladen: {0}
es: El proveedor no puede cargar el siguiente ensamblado: {0}
fr: Le fournisseur n'est pas parvenu à charger l'assembly suivant : {0}
it: Il provider non è riuscito a caricare il seguente assembly: {0}
ja: プロバイダーが次のアセンブリを読み込めませんでした。{0}
ko: 공급자가 다음 어셈블리를 로드하지 못했습니다: {0}
pt_br: Falha do provedor ao carregar o seguinte assembly: {0}
ru: Поставщику не удалось загрузить следующую сборку {0}
zh_hans: 提供程序加载以下程序集失败: {0}
zh_hant: 提供者載入下列組件失敗: {0}
