Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# OleDb_Fill_EmptyRecord
source: Unable to retrieve the IRow interface from the ADODB.Record object.
de: Die IRow-Schnittstelle kann nicht vom ADODB.Record-Objekt abgefragt werden.
es: No se puede recuperar la interfaz IRow del objeto ADODB.Record.
fr: Impossible d'extraire une interface IRow de l'objet ADODB.Record.
it: Impossibile recuperare l'interfaccia IRow dall'oggetto ADODB.Record.
ja: ADODB.Record オブジェクトから IRow インターフェイスを取得することができません。
ko: ADODB.Record 개체에서 IRow 인터페이스를 검색할 수 없습니다.
pt_br: Não é possível recuperar a interface IRow do objeto ADODB.Record.
ru: Не удалось извлечь интерфейс IRow из объекта ADODB.Record.
zh_hans: 无法从 ADODB.Record 对象中检索 IRow 接口。
zh_hant: 無法擷取 ADODB.Record 物件中的 IRow 介面。

# OleDb_ISourcesRowsetNotSupported
source: Type does not support the OLE DB interface ISourcesRowset
de: Der Typ unterstützt nicht die OLE DB-Schnittstelle ISourcesRowset
es: Este tipo no es compatible con la interfaz OLE DB ISourcesRowset
fr: Le type ne prend pas en charge l'interface OLE DB ISourcesRowset
it: Il tipo non supporta l'interfaccia OLE DB ISourcesRowset
ja: 型は OLE DB インターフェイス ISourcesRowset をサポートしていません。
ko: 유형이 OLE DB 인터페이스 ISourcesRowset을 지원하지 않습니다.
pt_br: O tipo não dá suporte para o ISourcesRowset da interface OLE DB
ru: Тип не поддерживает интерфейс OLE DB ISourcesRowset
zh_hans: 类型不支持 OLE DB 接口 ISourcesRowset
zh_hant: 型別不支援 OLE DB 介面 ISourcesRowset

# OleDb_IDBInfoNotSupported
source: Cannot construct the ReservedWords schema collection because the provider does not support IDBInfo.
de: Die ReservedWords-Schema-Sammlung kann nicht erstellt werden, da der Provider IDBInfo nicht unterstützt.
es: No se puede crear la colección de esquemas ReservedWords porque el proveedor no es compatible con IDBInfo.
fr: Impossible de construire la collection de schémas ReservedWords car le fournisseur ne prend pas en charge IDBInfo.
it: Impossibile costruire la raccolta di schemi ReservedWords. Il provider non supporta IDBInfo.
ja: プロバイダーが IDBInfo をサポートしていないため、ReservedWords スキーマ コレクションを作成できません。
ko: 공급자가 IDBInfo를 지원하지 않기 때문에 ReservedWords 스키마 컬렉션을 생성할 수 없습니다.
pt_br: Não é possível construir a coleção de esquemas ReservedWords, pois o servidor não dá suporte para IDBInfo.
ru: Не удается создать коллекцию схемы ReservedWords, поскольку поставщик не поддерживает IDBInfo.
zh_hans: 因为提供程序不支持 IDBInfo，所以不能构造 ReservedWords 架构集合。
zh_hant: 無法建立 ReservedWords 結構描述集合，因為提供者不支援 IDBInfo。

# OleDb_PropertyNotSupported
source: The property's value was not set because the provider did not support the '{0}' property, or the consumer attempted to get or set values of properties not in the Initialization property group and the data source object is uninitialized.
de: Der Eigenschaftenwert wurde aus folgenden Gründen nicht festgelegt: der Anbieter unterstützt die Eigenschaft '{0}' nicht, oder der Consumer hat versucht, Werte von Eigenschaften, die nicht in der Eigenschaftengruppe 'Initialization' vorhanden sind, abzurufen oder festzulegen, ohne dass das Datenquellenobjekt initialisiert war.
es: No se estableció el valor de la propiedad porque el proveedor no admite la propiedad '{0}' o el consumidor ha intentado obtener o establecer valores de propiedades que no pertenecen al grupo de propiedades de inicialización y el objeto de origen de datos no se ha inicializado.
fr: La valeur de la propriété n'est pas définie car le fournisseur ne prend pas en charge la propriété '{0}', ou le consommateur a tenté d'obtenir ou de définir des valeurs de propriété manquantes dans le groupe de propriétés Initialization et l'objet source de données n'est pas initialisé.
it: Il valore della proprietà non è stato impostato perché il provider non supportava la proprietà "{0}" oppure il consumer ha tentato di ottenere o impostare valori di proprietà non incluse nel gruppo Initialization e l'oggetto origine dati non è stato inizializzato.
ja: プロパティの値は設定されませんでした。プロバイダーが '{0}' プロパティをサポートしていなかったか、Initialization プロパティ グループのメンバーではないプロパティの値をコンシューマーが取得または設定しようとしたときにデータ ソース オブジェクトが初期化されていませんでした。
ko: 공급자가 '{0}' 속성을 지원하지 않거나, 소비자가 Initialization 속성 그룹에 없는 속성의 값을 가져오거나 설정하려고 했으며 데이터 원본 개체가 초기화되지 않았기 때문에 속성의 값이 설정되지 않았습니다.
pt_br: O valor da propriedade não foi definido porque o provedor não dá suporte à propriedade '{0}', ou o consumidor tentou obter ou definir valores de propriedades fora do grupo de propriedades Initialization e o objeto de fonte de dados não foi inicializado.
ru: Значение свойства не задано, поскольку поставщик не поддерживает свойство "{0}" либо пользователь попытался получить или задать значения свойств, не входящих в группу свойств инициализации, после инициализации объекта источника данных.
zh_hans: 未设置属性的值，因为访问接口不支持“{0}”属性，或使用者尝试获取或设置的值所属的属性不在 Initialization 属性组中，并且未初始化数据源对象。
zh_hant: 未設定屬性值，因為提供者不支援 '{0}' 屬性，或消費者嘗試取得或設定的屬性值不在初始化屬性群組中，且資料來源物件未初始化。

# OleDb_PropertyBadValue
source: Failed to initialize the '{0}' property for one of the following reasons: The value data type was not the data type of the property or was not null. For example, the property was DBPROP_MEMORYUSAGE, which has a data type of Int32, and the data type was Int64. The value was not a valid value. For example, the property was DBPROP_MEMORYUSAGE and the value was negative. The value was a valid value for the property and the provider supports the property as a settable property, but the provider does not support the value specified. This includes the case where the value was added to the property in OLE DB after the provider was written.
de: Die Eigenschaft '{0}' konnte aus einem der folgenden Gründe nicht initialisiert werden: Der Wertdatentyp entsprach nicht dem Datentyp der Eigenschaft oder war ungleich Null. Beispiel: Die Eigenschaft war DBPROP_MEMORYUSAGE mit dem Datentyp Int32, der Datentyp dagegen war Int64. Der Wert war nicht gültig. Die Eigenschaft war DBPROP_MEMORYUSAGE, der Wert negativ. Der Wert war gültig für die Eigenschaft, und der Provider unterstützt die Eigenschaft als festlegbare Eigenschaft, ohne jedoch den angegebenen Wert zu unterstützen. Dies gilt auch dann, wenn der Wert der Eigenschaft in OLE DB hinzugefügt wurde, nachdem der Provider geschrieben wurde.
es: No se pudo inicializar la propiedad '{0}' debido a uno de los siguientes motivos: El tipo de dato del valor no coincidía con el tipo de dato de la propiedad o no era null. Por ejemplo, la propiedad era DBPROP_MEMORYUSAGE, que tiene un tipo de dato Int32, y el tipo de dato era Int64. El valor no era válido. Por ejemplo, la propiedad era DBPROP_MEMORYUSAGE y el valor era negativo. El valor era válido para la propiedad y el proveedor es compatible con la misma como propiedad que se puede establecer, pero el proveedor no admite el valor especificado. Esto incluye el caso en el que se ha agregado el valor a la propiedad en OLE DB una vez escrito el proveedor.
fr: Échec de l'initialisation de la propriété '{0}' pour l'une des raisons suivantes : Le type de données de valeur n'est pas le type de la propriété ou n'est pas null. Par exemple, la propriété est DBPROP_MEMORYUSAGE, qui a le type de données Int32. Or, le type de données est Int64. La valeur n'est pas valide. Par exemple, la propriété est DBPROP_MEMORYUSAGE et sa valeur est négative. La valeur de la propriété est valide et le fournisseur la prend en charge en tant que propriété définissable, mais il ne prend pas en charge la valeur spécifiée. Cela concerne les cas où la valeur est ajoutée à la propriété dans OLE DB après l'inscription du fournisseur.
it: Impossibile inizializzare la proprietà "{0}" per uno dei seguenti motivi: Il tipo di dati del valore non è il tipo di dati della proprietà oppure non era null. Ad esempio, la proprietà è DBPROP_MEMORYUSAGE, che ha un tipo di dati Int32, ma il tipo di dati è Int64. Il valore non è valido. Ad esempio, la proprietà è DBPROP_MEMORYUSAGE e il valore è negativo. Il valore è valido per la proprietà e il provider la supporta come proprietà impostabile, ma non supporta il valore specificato. Ad esempio, nel caso in cui il valore sia stato aggiunto alla proprietà in OLE DB dopo che sia stata eseguita un'operazione di scrittura nel provider.
ja: 次のいずれかの理由により、'{0}' プロパティを初期化できませんでした。 値のデータ型が、プロパティのデータ型ではないか、Null ではありません。たとえば、プロパティが DBPROP_MEMORYUSAGE で、このプロパティのデータ型は Int32 でしたが、値のデータ型は Int64 でした。 値が無効な値です。たとえば、プロパティが DBPROP_MEMORYUSAGE でしたが、値が負の値でした。 値はプロパティの有効な値で、プロバイダーはプロパティを値の設定可能なプロパティとしてサポートしていますが、プロバイダーが指定された値をサポートしていません。これは、プロバイダーの作成後に OLE DB のこのプロパティに値が追加された場合などが挙げられます。
ko: 다음과 같은 이유로 인해 '{0}' 속성을 초기화하지 못했습니다. 값 데이터 유형이 속성의 데이터 유형이 아니거나 Null이 아닙니다. 예를 들어 속성은 데이터 유형이 Int32인 DBPROP_MEMORYUSAGE이고 데이터 유형은 Int64인 경우입니다. 값이 잘못되었습니다. 예를 들어 속성은 DBPROP_MEMORYUSAGE이고 값은 음수인 경우입니다. 값은 속성에 유효한 값이고 공급자는 설정 가능한 속성으로 해당 속성을 지원하지만 공급자는 지정된 값을 지원하지 않습니다. 여기에는 공급자가 기록된 후 OLE DB의 속성에 값이 추가된 경우가 포함됩니다.
pt_br: Falha ao inicializar a propriedade '{0}' por uma das seguintes razões: O tipo de dados de valor não é o tipo de dados da propriedade ou não é nulo. Por exemplo, a propriedade é DBPROP_MEMORYUSAGE, cujo tipo de dados é Int32, e o tipo de dados é Int64. O valor é inválido. Por exemplo, a propriedade é DBPROP_MEMORYUSAGE e o valor é negativo. O valor é válido para a propriedade e o provedor dá suporte à propriedade como propriedade que pode ser definida, mas ele não dá suporte ao valor especificado. Isso inclui o caso em que o valor foi adicionado à propriedade em OLE DB após o provedor ter sido gravado.
ru: При попытке инициализации свойства "{0}" произошел сбой. Возможные причины: Тип данных значения не соответствовал типу данных свойства и был определен. Например, для свойства DBPROP_MEMORYUSAGE (тип данных Int32) указано значение с типом данных Int64. Недопустимое значение. Например, для свойства DBPROP_MEMORYUSAGE указано отрицательное значение. Указано действительное значение, но поставщик, поддерживая настройку свойства, не поддерживает именно этого значения. Например, значение добавлено к свойству в OLE DB после написания поставщика.
zh_hans: 由于下列原因之一，未能初始化“{0}”属性: 值数据类型不是属性的数据类型或者为非空。例如，属性为 DBPROP_MEMORYUSAGE，其数据类型为 Int32，而值数据类型为 Int64。 值不是有效值。例如，属性为 DBPROP_MEMORYUSAGE 而值为负值。 值为属性的有效值并且提供程序支持属性作为可设置的属性，但提供程序不支持指定的值。这包括在写入提供程序之后将值添加至 OLE DB 的属性中的情况。
zh_hant: 初始化 '{0}' 屬性失敗，理由為下列其中之一: 值資料型別並非屬性的資料型別或並非空值。例如，資料型別為 Int32 的 DBPROP_MEMORYUSAGE 屬性，但資料型別卻為 Int64。 值為無效值。例如，屬性為 DBPROP_MEMORYUSAGE 且值為負數。 值為屬性的有效值，且提供者支援可設定的屬性，但卻不支援指定的值。例如，在寫入提供者後才新增至 OLE DB 屬性的值。

# OleDb_PropertyBadOption
source: The value of Options was invalid.
de: Der Wert 'Options' war ungültig.
es: El valor de Options no es válido.
fr: La valeur de Options n'est pas valide.
it: Valore di Options non valido.
ja: Options の値が無効な値でした。
ko: Options의 값이 잘못되었습니다.
pt_br: O valor Options era inválido.
ru: Недействительное значение Options.
zh_hans: Options 值无效。
zh_hant: Options 值無效。

# OleDb_PropertyBadColumn
source: The ColumnID element was invalid.
de: Das ColumnID-Element war ungültig.
es: El elemento ColumnID no es válido.
fr: L'élément ColumnID n'est pas valide.
it: Elemento ColumnID non valido.
ja: ColumnID の要素が無効な要素でした。
ko: ColumnID 요소가 잘못되었습니다.
pt_br: O elemento ColumnID não era válido.
ru: Недействительный элемент ColumnID.
zh_hans: ColumnID 元素无效。
zh_hant: ColumnID 元素無效。

# OleDb_PropertyNotAllSettable
source: A '{0}' property was specified to be applied to all columns but could not be applied to one or more of them.
de: Die angegebene Eigenschaft '{0}' sollte auf alle Spalten angewendet werden, konnte jedoch auf eine oder mehrere Spalten nicht angewendet werden.
es: Se ha especificado la aplicación de una propiedad '{0}' en todas las columnas, pero no se ha podido aplicar a una o varias de ellas.
fr: Une propriété '{0}' a été spécifiée pour être appliquée à toutes les colonnes, mais n'a pas pu l'être à certaines colonnes.
it: La proprietà "{0}" è stata specificata per essere applicata a tutte le colonne, ma non è stato possibile applicarla a una o più colonne.
ja: '{0}' プロパティはすべての列に適用されるように指定されていましたが、1 つ以上の列に適用できませんでした。
ko: '{0}' 속성은 모든 열에 적용되도록 지정되었지만 하나 이상의 열에 적용할 수 없습니다.
pt_br: Uma propriedade '{0}' foi especificada para ser aplicada a todas as colunas, mas pode ser que isso não ocorra a uma ou mais delas.
ru: По определению свойство "{0}" должно применяться ко всем столбцам, но для одного или нескольких из них сделать это невозможно.
zh_hans: “{0}”属性被指定为应用到所有列，但实际上无法应用到一个或多个列。
zh_hant: 指定 '{0}' 屬性套用於所有資料行，但無法套用至一或多個資料行。

# OleDb_PropertyNotSettable
source: The '{0}' property was read-only, or the consumer attempted to set values of properties in the Initialization property group after the data source object was initialized. Consumers can set the value of a read-only property to its current value. This status is also returned if a settable column property could not be set for the particular column.
de: Die Eigenschaft '{0}' war schreibgeschützt, oder der Consumer hat versucht, Werte von Eigenschaften in der Eigenschaftengruppe 'Initialization' festzulegen, nachdem das Datenquellenobjekt initialisiert wurde. Consumer können den Wert einer schreibgeschützten Eigenschaft auf deren aktuellen Wert festlegen. Dieser Status wird auch zurückgegeben, wenn eine festlegbare Spalteneigenschaft für die bestimmte Spalte nicht festgelegt werden konnte.
es: La propiedad '{0}' es de solo lectura o el consumidor ha intentado establecer valores de propiedades en el grupo de propiedades de inicialización una vez inicializado el objeto de origen de datos. Los consumidores pueden establecer el valor de una propiedad de solo lectura en su valor actual. Este estado también se devuelve si no se puede establecer una propiedad de columna configurable para la columna en cuestión.
fr: La propriété '{0}' est en lecture seule ou le consommateur a tenté de définir des valeurs de propriété dans le groupe de propriétés Initialization après l'initialisation de l'objet source de données. Les consommateurs peuvent définir la valeur d'une propriété en lecture seule sur sa valeur actuelle. Cet état est également retourné si une propriété de colonne définissable n'a pas pu être définie pour la colonne en question.
it: La proprietà "{0}" è di sola lettura oppure il consumer ha provato a impostare valori di proprietà nel gruppo delle proprietà Initialization dopo l'inizializzazione dell'oggetto origine dati. I consumer possono impostare una proprietà di sola lettura sul valore corrente. Questo stato viene inoltre restituito se non è stato possibile impostare una proprietà impostabile di colonna per la colonna specifica.
ja: '{0}' プロパティが読み取り専用であるか、データ ソース オブジェクトが初期化された後に使用者側が Initialization プロパティ グループのプロパティの値を設定しようとしました。使用者は読み取り専用プロパティの値を現在の値に設定することはできます。この状態は、特定の列の値の設定が可能な列プロパティに値が設定できなかった場合も返されます。
ko: '{0}' 속성은 읽기 전용이거나 소비자가 데이터 원본 개체를 초기화한 후 Initialization 속성 그룹에서 속성의 값을 설정하려고 했습니다. 소비자는 읽기 전용 속성의 값을 현재 값으로 설정할 수 있습니다. 이 상태는 설정 가능한 열 속성을 특정 열에 대해 설정할 수 없는 경우에도 반환됩니다.
pt_br: A propriedade '{0}' é somente leitura ou o consumidor tentou definir valores de propriedades no grupo da propriedade Initialization após a inicialização do objeto de fonte de dados. Consumidores podem definir o valor de uma propriedade somente leitura para o valor atual. Esse status será retornado também se uma propriedade de coluna não puder ser definida para a coluna particular.
ru: Свойство "{0}" доступно только для чтения либо потребитель пытался установить значения свойств в группе Initialization уже после инициализации объекта источника данных. Потребитель может присвоить свойству, которое доступно только для чтения, его текущее значение. Это состояние возвращается также, если настраиваемое свойство столбца не может быть установлено для определенного столбца.
zh_hans: “{0}”属性是只读的，或者使用者试图在初始化数据源对象之后，在初始化属性组中设置属性值。使用者可以将只读属性的值设置为其当前值。如果不能将特定的列设置为可设置的列属性，则也会返回此状态。
zh_hant: '{0}' 屬性是唯讀的，或消費者在已初始化資料來源物件後，才嘗試在初始化屬性群組中設定屬性值。消費者可以將唯讀屬性的值設定為目前的值。若無法在特定的資料行中設定可設定的資料行屬性，也可以傳回此狀態。

# OleDb_PropertyNotSet
source: The optional '{0}' property's value was not set to the specified value and setting the property to the specified value was not possible.
de: Der Wert der optionalen Eigenschaft '{0}' wurde nicht auf den angegebenen Wert festgelegt. Das Festlegen der Eigenschaft auf den angegebenen Wert war nicht möglich.
es: No se ha podido establecer el valor especificado para la propiedad '{0}' opcional.
fr: La valeur de la propriété '{0}' facultative n'a pas été définie sur la valeur spécifiée. Ce type de définition est impossible.
it: Il valore della proprietà facoltativa "{0}" non è stato impostato sul valore specificato e non è stato possibile impostare la proprietà sul valore specificato.
ja: 任意の '{0}' プロパティの値は指定された値に設定されませんでした。このプロパティに指定された値を設定することはできません。
ko: 선택적인 '{0}' 속성의 값이 지정된 값으로 설정되지 않았으며 지정된 값으로 설정할 수 없습니다.
pt_br: O valor da propriedade '{0}' opcional não foi definido para o valor especificado e a configuração da propriedade para o valor especificado não foi possível.
ru: Необязательному свойству "{0}" указанное значение присвоено не было и это невозможно.
zh_hans: 可选的“{0}”属性值未设置为指定值，而且不可能将属性设置为指定值。
zh_hant: 選用的 '{0}' 屬性值未設定為指定值，且不可能設定屬性為指定值。

# OleDb_PropertyConflicting
source: The '{0}'property's value was not set because doing so would have conflicted with an existing property.
de: Der Wert der Eigenschaft '{0}' wurde nicht festgelegt, da dies zu einem Konflikt mit einer vorhandenen Eigenschaft geführt hätte.
es: No se ha establecido el valor de propiedad '{0}' porque entraría en conflicto con una propiedad existente.
fr: La valeur de la propriété '{0}' n'est pas définie pour ne pas entrer en conflit avec une propriété existante.
it: Il valore della proprietà "{0}" non è stato impostato, perché sarebbe stato in conflitto con una proprietà esistente.
ja: 既存のプロパティと競合する可能性があったため、'{0}' プロパティの値は設定されていません。
ko: '{0}' 속성의 값을 설정하면 기존 속성과 충돌하기 때문에 설정되지 않았습니다.
pt_br: O valor da propriedade '{0}' não foi definido pois isso geraria conflito com uma propriedade existente.
ru: Значение свойства "{0}" не было установлено, поскольку это привело бы к возникновению конфликта с существующим свойством.
zh_hans: 未设置“{0}”属性值，因为这样做将与现有属性冲突。
zh_hant: 未設定 '{0}' 屬性值，因為這樣做會與已存的屬性衝突。

# OleDb_PropertyNotAvailable
source: (Reserved).
de: (Reserviert)
es: Reservado
fr: (Réservé).
it: (Riservato).
ja: (予約済み)。
ko: (예약됨)
pt_br: (Reservado).
ru: (зарезервировано).
zh_hans: (已保留)。
zh_hant: (已保留)。

# OleDb_PropertyStatusUnknown
source: The provider returned an unknown DBPROPSTATUS_ value '{0}'.
de: Der Provider hat den unbekannten DBPROPSTATUS_-Wert '{0}' zurückgegeben.
es: El proveedor ha devuelto un valor DBPROPSTATUS_ desconocido '{0}'.
fr: Le fournisseur a retourné une valeur DBPROPSTATUS_ '{0}' inconnue.
it: Il provider ha restituito un valore DBPROPSTATUS_ value "{0}" sconosciuto.
ja: プロバイダーから不明な DBPROPSTATUS_ の値 '{0}' が返されました。
ko: 공급자가 알 수 없는 DBPROPSTATUS_ 값 '{0}'을(를) 반환했습니다.
pt_br: O provedor retornou um valor DBPROPSTATUS_ desconhecido '{0}'.
ru: Поставщик вернул неизвестное значение DBPROPSTATUS_ "{0}".
zh_hans: 提供程序返回未知的 DBPROPSTATUS_ 值“{0}”。
zh_hant: 提供者傳回未知的 DBPROPSTATUS_ value '{0}'。

# OleDb_BadAccessor
source: Accessor validation was deferred and was performed while the method returned data. The binding was invalid for this column or parameter.
de: Accessor-Validierung wurde verzögert und ausgeführt, während die Methode Daten zurückgegeben hat. Ungültige Bindung für diese Spalte oder diesen Parameter.
es: Se ha aplazado la validación del descriptor de acceso mientras el método devuelve datos. No se puede enlazar esta columna o parámetro.
fr: La validation de l'accesseur a été différée et a été effectuée lors du retour de données par la méthode. La liaison n'était pas valide pour cette colonne ou ce paramètre.
it: La convalida della funzione di accesso è stata rinviata ed eseguita mentre il metodo restituiva i dati. L'associazione per questa colonna o parametro non era valida.
ja: アクセサーの妥当性の確認は延期され、メソッドがデータを返す間に実行されました。この列またはパラメーターの連結は無効です。
ko: 접근자 유효성 검사가 지연되었으며 메서드가 데이터를 반환하는 동안 수행되었습니다. 바인딩이 이 열 또는 매개 변수에 적합하지 않습니다.
pt_br: Validação do acessador foi adiada e executada enquanto o método retornava dados. Associação inválida para esta coluna ou este parâmetro.
ru: Проверка корректности функции доступа была отложена и выполнена при возвращении методом данных. Для этого столбца или параметра привязка была недействительной.
zh_hans: 访问器验证被推迟，并在该方法返回数据时已执行。绑定对于此列或参数无效。
zh_hant: 當方法傳回資料時，已經延遲且執行存取子驗證。對這個資料行或參數的繫結無效。

# OleDb_BadStatusRowAccessor
source: OleDbDataAdapter internal error: invalid row set accessor: Ordinal={0} Status={1}.
de: Interner OleDbDataAdapter-Fehler: ungültiger RowSet-Accessor: Ordinal={0} Status={1}.
es: Error interno de OleDbDataAdapter: descriptor de acceso del conjunto de filas no válido: Ordinal={0} Status={1}.
fr: Erreur interne OleDbDataAdapter : accesseur d'ensemble de lignes non valide : Ordinal={0} Status={1}.
it: Errore interno di OleDbDataAdapter: funzione di accesso al set di righe non valida: Ordinal={0} Status={1}.
ja: OleDbDataAdapter の内部エラー : 行セット アクセサーが無効です。Ordinal={0} Status={1}
ko: OleDbDataAdapter 내부 오류: 행 집합 접근자가 잘못되었습니다. Ordinal={0} Status={1}.
pt_br: Erro interno de OleDbDataAdapter: acessador de definição de linha inválido: Ordinal={0} Status={1}.
ru: Внутренняя ошибка OleDbDataAdapter: недопустимая функция доступа к набору строк: Ordinal={0} Status={1}.
zh_hans: OleDbDataAdapter 内部错误: 无效的行集访问器: Ordinal={0} Status={1}。
zh_hant: OleDbDataAdapter 內部錯誤: 無效的資料列集存取子: Ordinal={0} Status={1}。

# OleDb_CantConvertValue
source: The data value could not be converted for reasons other than sign mismatch or data overflow. For example, the data was corrupted in the data store but the row was still retrievable.
de: Der Datenwert konnte aus anderen Gründen als Signaturübereinstimmungsfehler oder Datenüberlauf nicht konvertiert werden. Möglicherweise wurden die Daten im Datenspeicher beschädigt, aber die Zeile war weiterhin abrufbar.
es: No se puede convertir el valor de los datos por otras razones que no sean la falta de correspondencia de signo ni el desbordamiento de los datos. Por ejemplo, los datos están dañados en el almacén de datos aunque la fila se puede recuperar.
fr: La valeur des données n'a pas pu être convertie pour des raisons autres que l'incompatibilité de signe ou le dépassement de données. Par exemple, les données étaient endommagées dans le magasin de données mais la ligne pouvait toujours être extraite.
it: Il valore dei dati non può essere convertito per ragioni diverse dalla mancata corrispondenza dei segni o dall'overflow. È ad esempio possibile che i dati siano stati danneggiati nell'archivio pur restando possibile il recupero della riga.
ja: 符号の不一致またはデータ オーバーフロー以外の理由により、データ値を変換できませんでした。データ ストア内で破損しているデータが取得可能だった場合などが考えられます。
ko: 부호가 일치하지 않거나 데이터 오버플로 이외의 이유 때문에 데이터 값을 변환할 수 없습니다. 예를 들어, 데이터 저장소의 데이터는 손상되었지만 행을 계속 검색할 수 있는 경우입니다.
pt_br: O valor dos dados não pôde ser convertido por razões diferentes de sinais incompatíveis ou estouro de dados. Por exemplo, os dados estavam corrompidos no repositório de dados, mas a linha ainda era recuperável.
ru: Невозможно преобразовать значение данных по причине, отличной от несоответствия знака или переполнения данных. Например, данные были повреждены в хранилище данных, но строку все еще можно считать.
zh_hans: 由于符号不匹配或数据溢出以外的其他原因，未能转换数据值。例如，数据在数据存储区中已损坏，但该行仍可以检索。
zh_hant: 因為發生非正負號不符或資料溢位的原因，資料值無法轉換。例如，資料於資料儲存中已經損毀但資料列仍可擷取。
