Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SQL_SqlRecordReadOnly
source: '{0}' cannot be called when the record is read only.
de: '{0}' kann nicht aufgerufen werden, wenn der Datensatz schreibgeschützt ist.
es: No se puede llamar a '{0}' cuando el registro es de solo lectura.
fr: '{0}' ne peut pas être appelé lorsque l'enregistrement est en lecture seule.
it: Impossibile chiamare "{0}" se il record è di sola lettura.
ja: レコードが読み取り専用の場合は、'{0}' を呼び出すことはできません。
ko: 레코드가 읽기 전용이면 '{0}'을(를) 호출할 수 없습니다.
pt_br: '{0}' não pode ser chamado quando o registro é somente leitura.
ru: Нельзя вызвать "{0}", если запись доступна только для чтения.
zh_hans: 记录为只读时不能调用“{0}”。
zh_hant: 當記錄為唯讀時無法呼叫 '{0}'。

# SQL_SqlRecordReadOnly2
source: Operation cannot be completed because the record is read only.
de: Operation kann nicht abgeschlossen werden, da der Datensatz schreibgeschützt ist.
es: No se puede completar la operación porque el registro es de solo lectura.
fr: Opération impossible : l'enregistrement est en lecture seule.
it: Impossibile completare l'operazione. Il record è di sola lettura.
ja: レコードが読み取り専用のため、操作を完了できません。
ko: 레코드가 읽기 전용이므로 작업을 완료할 수 없습니다.
pt_br: A operação não pode ser concluída, pois o registro é somente leitura.
ru: Невозможно завершить операцию, поскольку запись доступна только для чтения.
zh_hans: 不能完成操作，因为记录为只读。
zh_hant: 無法完成操作，因為記錄為唯讀。

# SQL_SqlResultSetRowDeleted
source: Invalid attempt to call method {0} when the current row is deleted
de: Ungültiger Versuch des Aufrufs von Methode {0}, wenn die aktuelle Zeile gelöscht wurde
es: Intento no válido de llamar al método {0} cuando se ha eliminado la fila actual
fr: Tentative d'appel de la méthode {0} non valide si la ligne actuelle est supprimée
it: Tentativo non valido di chiamare il metodo {0} quando la riga corrente è stata eliminata
ja: 現在の行が削除されている場合は、メソッド {0} の呼び出しは無効です。
ko: 현재 행이 삭제되면 메서드 {0}을(를) 호출할 수 없습니다.
pt_br: Tentativa inválida para chamar o método {0} quando a linha atual foi excluída
ru: Недопустимая попытка вызвать метод {0}, когда текущая строка удалена.
zh_hans: 当前列被删除时，调用方法 {0} 的尝试无效
zh_hant: 當目前的資料列已刪除時，嘗試呼叫方法 {0} 無效

# SQL_SqlResultSetRowDeleted2
source: Operation cannot be completed because the current row is deleted
de: Operation kann nicht abgeschlossen werden, da die aktuelle Zeile gelöscht wurde
es: No se puede completar la operación porque se ha eliminado la fila actual
fr: Opération impossible : la ligne actuelle a été supprimée
it: Impossibile completare l'operazione perché la riga corrente è stata eliminata
ja: 現在の行が削除されているため、操作を完了できません。
ko: 현재 행이 삭제되었으므로 작업을 완료할 수 없습니다.
pt_br: A operação não foi concluída, pois a linha atual foi excluída
ru: Невозможно завершить операцию, поскольку текущая строка удалена.
zh_hans: 不能完成操作，因为当前列已被删除。
zh_hant: 無法完成操作，因為目前的資料列已刪除。

# SQL_SqlResultSetCommandNotInSameConnection
source: Operation cannot be completed because the command that created the SqlResultSet has been dissociated from the original connection. SqlResultSet is closed.
de: Operation kann nicht abgeschlossen werden, da der Befehl, der SqlResultSet erstellt hat, von der ursprünglichen Verbindung getrennt wurde. SqlResultSet ist geschlossen.
es: No se puede completar la operación porque el comando que creó SqlResultSet se ha disociado de la conexión original. SqlResultSet está cerrado.
fr: Opération impossible : la commande qui a créé le SqlResultSet est dissociée de la connexion d'origine. Le SqlResultSet est fermé.
it: Impossibile completare l'operazione. Il comando che ha creato SqlResultSet è stato dissociato dalla connessione originale. SqlResultSet è chiuso.
ja: SqlResultSet を作成したコマンドが元の接続から切断されているため、操作を完了できません。SqlResultSet は閉じています。
ko: SqlResultSet을 만든 명령이 원래 연결에서 분리되었기 때문에 작업을 완료할 수 없습니다. SqlResultSet이 닫혀 있습니다.
pt_br: A operação não pode ser concluída, pois o comando que criou o SqlResultSet foi dissociado da conexão original. O SqlResultSet está fechado.
ru: Невозможно завершить операцию, поскольку команда, создавшая SqlResultSet, отделена от исходного подключения. SqlResultSet закрыт.
zh_hans: 不能完成操作，因为创建 SqlResultSet 的命令已经与原始连接取消关联。SqlResultSet 已关闭。
zh_hant: 無法完成操作，因為已經從原始的連接中解除建立 SqlResultSet 命令的關聯。SqlResultSet 已關閉。

# SQL_SqlResultSetNoAcceptableCursor
source: SqlResultSet could not be created for the given query with the desired options.
de: SqlResultSet konnte für die angegebene Abfrage nicht mit den gewünschten Optionen erstellt werden.
es: No se puede crear SqlResultSet para la consulta proporcionada con las opciones deseadas.
fr: Impossible de créer le SqlResultSet pour la requête fournie avec les options souhaitées.
it: Impossibile creare SqlResultSet con le opzioni desiderate per la query specificata.
ja: 要求されたオプションを使用して指定されたクエリの SqlResultSet を作成できません。
ko: 지정된 쿼리에 대한 SqlResultSet을 원하는 옵션으로 만들 수 없습니다.
pt_br: O SqlResultSet não pôde ser criado para a consulta fornecida com as opções desejadas.
ru: Для данного запроса не удалось создать SqlResultSet с нужными параметрами.
zh_hans: 不能使用期望选项为给定查询创建 SqlResultSet。
zh_hant: 無法建立包含欲查選項指定查詢的 SqlResultSet。

# SQL_SqlUpdatableRecordReadOnly
source: '{0}' cannot be called when the SqlDataRecord is read only.
de: '{0}' kann nicht aufgerufen werden, wenn SqlDataRecord schreibgeschützt ist.
es: No se puede llamar a '{0}' cuando SqlDataRecord es de solo lectura.
fr: Impossible d'appeler '{0}' si le SqlDataRecord est en lecture seule.
it: Impossibile chiamare "{0}" quando SqlDataRecord è di sola lettura.
ja: SqlDataRecord が読み取り専用の場合は、'{0}' を呼び出すことはできません。
ko: SqlDataRecord가 읽기 전용이면 '{0}'을(를) 호출할 수 없습니다.
pt_br: '{0}' não pode ser chamado quando o SqlDataRecord é somente leitura.
ru: Нельзя вызвать "{0}", если SqlDataRecord доступна только для чтения.
zh_hans: SqlDataRecord 为只读时，不能调用“{0}”。
zh_hant: 當 SqlDataRecord 為唯讀時，無法呼叫 '{0}'。

# SQL_BulkLoadMappingInaccessible
source: The mapped collection is in use and cannot be accessed at this time;
de: Die zugeordnete Sammlung wird verwendet, weshalb zur Zeit kein Zugriff auf diese möglich ist.
es: La colección asignada está en uso o no se puede tener acceso a la misma en este momento;
fr: La collection mappée est utilisée et inaccessible pour l'instant ;
it: Non è possibile accedere alla raccolta mappata perché è attualmente in uso;
ja: マップされているコレクションは使用中であるため、現在アクセスできません。
ko: 매핑된 컬렉션이 사용 중이며 현재 액세스할 수 없습니다.
pt_br: A coleção mapeada está sendo usada e não pode ser acessada desta vez;
ru: Сопоставленная коллекция уже используется и сейчас недоступна;
zh_hans: 映射集合正在使用中，此时无法访问；
zh_hant: 對應的集合正在使用中且無法在此時存取;

# SQL_BulkLoadMappingsNamesOrOrdinalsOnly
source: Mappings must be either all name or all ordinal based.
de: Zuordnungen müssen entweder vollständig auf dem Namen oder der Ordinalzahl basieren.
es: Las asignaciones se deben basar sólo en nombres o en ordinales.
fr: Les mappages doivent tous être basés sur un nom ou un ordinal.
it: I mapping devono essere tutti basati sul nome o sull'ordinale.
ja: マッピングは、すべて名前ベースまたはすべて序数ベースのどちらかになります。
ko: 매핑은 모든 이름 또는 모든 서수 기반이어야 합니다.
pt_br: Os mapeamentos devem ser inteiramente baseados em nomes ou ordinais.
ru: Сопоставление должно основываться на всех именах или всех порядковых номерах.
zh_hans: 映射必须要么全部基于名称，要么全部基于序数。
zh_hant: 對應必須全部以名稱或序數為基礎。

# SQL_BulkLoadCannotConvertValue
source: The given value of type {0} from the data source cannot be converted to type {1} of the specified target column.
de: Der angegebene Wert vom Typ {0} aus der Datenquelle kann nicht in Typ {1} der angegebenen Zielspalte konvertiert werden.
es: El valor del tipo especificado {0} del origen de datos no se puede convertir al tipo {1} de la columna de destino especificada.
fr: Impossible de convertir la valeur de type {0} fournie pour la source de données en type {1} de la colonne cible spécifiée.
it: Impossibile convertire il valore specificato di tipo {0} dell'origine dati nel tipo {1} della colonna di destinazione specificata.
ja: データ ソースから与えられた {0} 型の値を、指定された列の型 {1} に変換できません。
ko: 데이터 원본의 유형 {0}에 지정된 값을 지정된 대상 열의 유형 {1}(으)로 변환할 수 없습니다.
pt_br: O tipo de valor fornecido {0} da origem de dados não pode ser convertido para o tipo {1} da coluna de destino especificada.
ru: Данное значение типа {0} из источника данных не может быть преобразовано в тип {1} указанного столбца назначения.
zh_hans: 来自数据源的 {0} 类型的给定值不能转换为指定目标列的类型 {1}。
zh_hant: 資料來源的型別 {0} 指定值無法轉換成指定目標資料行的型別 {1}。

# SQL_BulkLoadNonMatchingColumnMapping
source: The given ColumnMapping does not match up with any column in the source or destination.
de: Die angegebene ColumnMapping stimmt mit keiner Spalte in der Quelle oder dem Ziel überein.
es: La ColumnMapping proporcionada no coincide con ninguna columna del origen o del destino.
fr: Le ColumnMapping fourni ne correspond à aucune colonne de la source ou de la destination.
it: Il ColumnMapping specificato non corrisponde a nessuna colonna dell'origine o della destinazione.
ja: 指定された ColumnMapping はソースまたはターゲットのいずれの列とも一致しません。
ko: 지정된 ColumnMapping이 원본 또는 대상의 열과 일치하지 않습니다.
pt_br: A propriedade ColumnMapping fornecida não corresponde a nenhuma coluna na origem ou no destino.
ru: Указанное ColumnMapping не соответствует ни одному столбцу в источнике данных или в пункте назначения.
zh_hans: 给定的 ColumnMapping 与源或目标中的任意列均不匹配。
zh_hant: 指定的 ColumnMapping 與任何來源資料行或目的資料行均不相符。

# SQL_BulkLoadNonMatchingColumnName
source: The given ColumnName '{0}' does not match up with any column in data source.
de: Der angegebene ColumnName '{0}' entspricht keiner Spalte in der Datenquelle.
es: La ColumnName '{0}' no coincide con ninguna columna del origen de datos.
fr: Le ColumnName fourni '{0}' ne correspond à aucune colonne de la source de données.
it: Il ColumnName specificato "{0}" non corrisponde a nessuna colonna nell'origine dati.
ja: 指定された ColumnName '{0}' はデータ ソースのいずれの列とも一致しません。
ko: 지정된 ColumnName '{0}'이(가) 데이터 원본의 열과 일치하지 않습니다.
pt_br: A propriedade ColumnName '{0}' fornecida não corresponde a nenhuma coluna na origem de dados.
ru: Указанное ColumnName "{0}" не соответствует ни одному столбцу в источнике данных.
zh_hans: 给定的 ColumnName“{0}”与数据源中的任意列均不匹配。
zh_hant: 指定的 ColumnName '{0}' 欲任何資料來源的資料行不相符。

# SQL_BulkLoadStringTooLong
source: String or binary data would be truncated.
de: String- oder binary-Daten würden abgeschnitten.
es: Los datos binary o de tipo String se truncarían.
fr: Les données binary ou String seront tronquées.
it: I dati di tipo String o binary verrebbero troncati.
ja: String または binary データは切り詰められました。
ko: String 또는 binary 데이터가 잘립니다.
pt_br: String ou os dados binary estaria truncados.
ru: Строка String или двоичные данные binary будут усечены.
zh_hans: String 或 binary 数据将被截断。
zh_hant: String 或 binary 資料會被截斷。

# SQL_BulkLoadInvalidTimeout
source: Timeout Value '{0}' is less than 0.
de: Timeoutwert '{0}' ist kleiner 0.
es: El valor de Timeout '{0}' es inferior a 0.
fr: La valeur '{0}' de Timeout est inférieure à 0.
it: Il valore di Timeout "{0}" è minore di 0.
ja: Timeout 値 '{0}' が 0 未満です。
ko: Timeout 값 '{0}'이(가) 0보다 작습니다.
pt_br: O valor Timeout '{0}' é menor do que 0.
ru: Значение времени ожидания Timeout Value "{0}" меньше 0.
zh_hans: Timeout 值“{0}”小于 0。
zh_hant: Timeout 值 '{0}' 小於 0。

# SQL_BulkLoadInvalidVariantValue
source: Value cannot be converted to SqlVariant.
de: Wert kann nicht in SqlVariant konvertiert werden.
es: No se puede convertir el valor a SqlVariant.
fr: Impossible de convertir la valeur en SqlVariant.
it: Impossibile convertire il valore in SqlVariant.
ja: 値は SqlVariant に変換できません。
ko: 값을 SqlVariant로 변환할 수 없습니다.
pt_br: O valor não pode ser convertido para SqlVariant.
ru: Невозможно преобразовать значение в SqlVariant.
zh_hans: 值不能转换为 SqlVariant。
zh_hant: 無法將值轉換成 SqlVariant。

# SQL_BulkLoadExistingTransaction
source: Unexpected existing transaction.
de: Unerwartete vorhandene Transaktion.
es: Transacción existente inesperada.
fr: Transaction existante inattendue.
it: Transazione esistente imprevista.
ja: 既存のトランザクションは予期しないものです。
ko: 예기치 않은 기존 트랜잭션입니다.
pt_br: Transação existente inesperada.
ru: Непредусмотренная существующая транзакция.
zh_hans: 意外的现有事务。
zh_hant: 不必要的現存交易。

# SQL_BulkLoadNoCollation
source: Failed to obtain column collation information for the destination table. If the table is not in the current database the name must be qualified using the database name (e.g. [mydb]..[mytable](e.g. [mydb]..[mytable]); this also applies to temporary-tables (e.g. #mytable would be specified as tempdb..#mytable).
de: Es konnten keine Spaltenauflistungsinformationen für die Zieltabelle abgerufen werden. Wenn sich die Tabelle nicht in der aktuellen Datenbank befindet, muss ihr Name über den Datenbanknamen qualifiziert werden (z. B. [mydb]..[mytable](z. B. [mydb]..[mytable]). Dies gilt auch für temporäre Tabellen (z. B. würde '#mytable' angegeben als 'tempdb..#mytable').
es: Fallo al obtener la información de intercalación de columnas para la tabla de destino. Si la tabla no se encuentra en la base de datos actual el nombre se debe calificar utilizando el nombre de la base de datos (ej. [mydb]..[mytable](e.g. [mydb]..[mytable]); también se aplica a tablas temporales (ej. #mytable se especificaría como tempdb..#mytable).
fr: Impossible d'obtenir les informations de classement des colonnes de la table de destination. Si cette dernière n'est pas dans la base de données en cours, le nom doit être complet et comprendre celui de la base de données (ex. [mydb]..[mytable](ex. [mydb]..[mytable]) ; cela s'applique également aux tables temporaires (ex. #mytable serait spécifiée sous la forme tempdb..#mytable).
it: Impossibile ottenere le informazioni sulle regole di confronto delle colonne per la tabella di destinazione. Se la tabella non è nel database corrente, il nome deve essere specificato utilizzando il nome del database (es. [mydb]..[mytable](es. [mydb]..[mytable]); applicabile anche alle tabelle temporanee (es. #mytable verrà specificata come tempdb..#mytable).
ja: 目的のテーブルに対する列の照合順序情報を取得できませんでした。テーブルが現在のデータベースにない場合は、名前についてデータベース名の使用を制限する必要があります(例 : [mydb]..[mytable](e.g. [mydb]..[mytable]);。これはまた一時テーブルにも適用します (例 : #mytable は tempdb..#mytable としても指定されます)。
ko: 대상 테이블에 대한 열 데이터 정렬 정보를 가져오지 못했습니다. 테이블이 현재 데이터베이스에 없는 경우 이름은 데이터베이스 이름(예: [mydb]..[mytable](예: [mydb]..[mytable])을 사용하여 지정해야 합니다. 이 이름은 임시 테이블에도 적용됩니다. 예를 들어 #mytable을 tempdb..#mytable로 지정할 수 있습니다.
pt_br: Falha ao obter informações sobre a intercalação de colunas para a tabela de destino. Se a tabela não estiver no banco de dados atual, o nome deverá ser qualificado usando o nome do banco de dados (por exemplo: [mydb]..[mytable](e.g. [mydb]..[mytable]); isso também se aplica a tabelas temporárias (por exemplo: #mytable seria especificado como tempdb..#mytable).
ru: Не удалось получить сведений о порядке следования столбцов в таблице назначения. Если таблица не входит в состав текущей базы данных, то имя необходимо указать с использованием имени базы данных (например, [mydb]..[mytable]); это относится и к временным таблицам (например #mytable будет указана как tempdb..#mytable).
zh_hans: 无法获取目标表的列排序信息。如果该表不在当前数据库中，名称必须使用数据库名称限定(例如 [mydb]..[mytable])；此规则也适用于临时表(例如 #mytable 将指定为 tempdb..#mytable)。
zh_hant: 無法取得目的地資料表的資料行定序資訊。若資料表不在目前的資料庫中，則必須使用合格的資料庫名稱 (也就是 [mydb]..[mytable](例如 [mydb]..[mytable]); 這也適用於暫存資料表 (例如 #mytable 會定為 tempdb..#mytable)。

# SQL_BulkLoadConflictingTransactionOption
source: Must not specify SqlBulkCopyOption.UseInternalTransaction and pass an external Transaction at the same time.
de: Sie dürfen nicht gleichzeitig SqlBulkCopyOption.UseInternalTransaction angeben und eine externe Transaktion übergeben.
es: No se debe especificar SqlBulkCopyOption.UseInternalTransaction y pasar una transacción externa al mismo tiempo.
fr: Vous ne devez pas spécifier SqlBulkCopyOption.UseInternalTransaction et transmettre une transaction externe en même temps.
it: Non si deve specificare SqlBulkCopyOption.UseInternalTransaction e simultaneamente passare una transazione esterna.
ja: SqlBulkCopyOption.UseInternalTransaction を指定しているときは、外部 Transaction を渡すことはできません。
ko: SqlBulkCopyOption.UseInternalTransaction을 지정하고 동시에 외부 트랜잭션을 전달해서는 안 됩니다.
pt_br: Não deve especificar SqlBulkCopyOption.UseInternalTransaction e passar uma Transação externa ao mesmo tempo.
ru: Не нужно указывать SqlBulkCopyOption.UseInternalTransaction и одновременно передавать внешнюю транзакцию.
zh_hans: 不能同时指定 SqlBulkCopyOption.UseInternalTransaction 和传递外部事务。
zh_hant: 必須不指定 SqlBulkCopyOption.UseInternalTransaction 且同時傳遞外部 Transaction。

# SQL_BulkLoadInvalidOperationInsideEvent
source: Function must not be called during event.
de: Die Funktion darf nicht während des Ereignisses aufgerufen werden.
es: No se debe llamar a una función durante el evento.
fr: Une fonction ne doit pas être appelée lors d'un événement.
it: La funzione non deve essere chiamata durante l'evento.
ja: イベントの処理中は関数を呼び出せません。
ko: 이벤트 중에 함수를 호출해서는 안 됩니다.
pt_br: A função não deve ser chamada durante o evento.
ru: Функция не должна вызываться в процессе события.
zh_hans: 不能在事件发生期间调用函数。
zh_hant: 在事件進行期間必不可呼叫函式。

# SQL_BulkLoadMissingDestinationTable
source: The DestinationTableName property must be set before calling this method.
de: Die DestinationTableName-Eigenschaft muss vor dem Aufruf dieser Methode festgelegt werden.
es: Se debe establecer la propiedad DestinationTableName antes de llamar a este método.
fr: Vous devez définir la propriété DestinationTableName avant d'appeler cette méthode.
it: Prima di chiamare questo metodo, è necessario impostare la proprietà DestinationTableName.
ja: このメソッドを呼び出すには、DestinationTableName プロパティが設定されている必要があります。
ko: 이 메서드를 호출하려면 먼저 DestinationTableName 속성을 설정해야 합니다.
pt_br: A propriedade DestinationTableName deve ser definida antes de chamar esse método.
ru: Перед вызовом этого метода необходимо присвоить значение свойству DestinationTableName.
zh_hans: 调用此方法之前必须设置 DestinationTableName 属性。
zh_hant: DestinationTableName 屬性必須先設定才能呼叫此方法。

# SQL_BulkLoadInvalidDestinationTable
source: Cannot access destination table '{0}'.
de: Zugriff auf Zieltabelle '{0}' nicht möglich.
es: No se puede tener acceso a la tabla de destino '{0}'.
fr: Impossible d'accéder à la table de destination '{0}'.
it: Impossibile accedere alla tabella di destinazione "{0}".
ja: 目的のテーブル '{0}' にアクセスできません。
ko: 대상 테이블 '{0}'에 액세스할 수 없습니다.
pt_br: Não é possível acessar a tabela de destino '{0}'.
ru: Не удается получить доступ к таблице назначения "{0}".
zh_hans: 无法访问目标表“{0}”。
zh_hant: 無法存取目的地資料表 '{0}'。

# SQL_BulkLoadNotAllowDBNull
source: Column '{0}' does not allow DBNull.Value.
de: Die Spalte '{0}' lässt DBNull.Value nicht zu.
es: La columna '{0}' no admite DBNull.Value.
fr: La colonne '{0}' n'autorise pas DBNull.Value.
it: DBNull.Value non consentito per la colonna '{0}'.
ja: 列 '{0}' で DBNull.Value を使用できません。
ko: 열 '{0}'에는 DBNull.Value를 사용할 수 없습니다.
pt_br: A coluna '{0}' não permite DBNull.Value.
ru: Для столбца "{0}" использование DBNull.Value не разрешено.
zh_hans: 列“{0}”不允许 DBNull.Value。
zh_hant: 資料行 '{0}' 不允許 DBNull.Value。

# Sql_BulkLoadLcidMismatch
source: The locale id '{0}' of the source column '{1}' and the locale id '{2}' of the destination column '{3}' do not match.
de: Die Gebietsschemakennung '{0}' der Quellspalte '{1}' und die Gebietsschemakennung '{2}' der Zielspalte '{3}' stimmen nicht überein.
es: El id de configuración regional '{0}' de la columna de origen '{1}' y el id de configuración regional '{2}' de la columna de destino '{3}' no coinciden.
fr: L'ID '{0}' des paramètres régionaux de la colonne source '{1}' ne correspond pas à l'ID '{2}' des paramètres régionaux de la colonne de destination '{3}'.
it: L'ID delle impostazioni locali '{0}' della colonna di origine '{1}' e L'ID delle impostazioni locali '{2}' della colonna di destinazione '{3}' non corrispondono.
ja: ソース列 '{1}' のロケール ID '{0}' とターゲット列 '{3}' のロケール ID '{2}' は一致していません。
ko: 원본 열 '{1}'의 로캘 ID '{0}'과(와) 대상 열 '{3}'의 로캘 ID '{2}'이(가) 일치하지 않습니다.
pt_br: O id '{0}' local da coluna de origem '{1}' e o id '{2}' local da coluna de destino '{3}' não são correspondentes.
ru: Идентификатор языка "{0}" исходного столбца "{1}" и идентификатор языка "{2}" столбца назначения "{3}" не совпадают.
zh_hans: 源列“{1}”的区域设置 ID“{0}”和目标列“{3}”的区域设置 ID“{2}”不匹配。
zh_hant: 來源資料行 '{1}' 的位置識別項 '{0}' 與目的資料行 '{3}' 的位置識別項 '{2}' 不相符。

# SQL_BulkLoadPendingOperation
source: Attempt to invoke bulk copy on an object that has a pending operation.
de: Es wurde versucht, einen Massenkopiervorgang für ein Objekt auszuführen, für das ein Vorgang aussteht.
es: Intento de invocar una copia masiva en un objeto que tiene una operación pendiente.
fr: Tentative d'appel d'une copie en bloc sur un objet comportant une opération en attente.
it: Tentativo di richiamare la copia bulk su un oggetto per cui è in sospeso un'operazione.
ja: 保留中の操作があるオブジェクトで一括コピーを呼び出そうとしました。
ko: 보류 중인 작업이 있는 개체에 대해 대량 복사를 호출하려고 했습니다.
pt_br: Tentativa de invocar cópia em massa em um objeto que tem uma operação pendente.
ru: Попытка совершить массовое копирование с объектом, с которым выполняется операция.
zh_hans: 尝试对具有挂起的操作的对象调用大容量复制。
zh_hant: 嘗試針對具有暫止作業的物件叫用大量複製。

# SQL_ConnectionDoomed
source: The requested operation cannot be completed because the connection has been broken.
de: Die angeforderte Operation kann nicht abgeschlossen werden, da die Verbindung unterbrochen wurde.
es: No se puede completar la operación solicitada, la conexión se ha cortado.
fr: L'opération demandée ne peut pas être terminée car la connexion a été rompue.
it: L'operazione richiesta non può essere completata perché la connessione è stata interrotta.
ja: 接続が切断されているため、要求された操作を完了できません。
ko: 연결이 끊겨서 요청한 작업을 완료할 수 없습니다.
pt_br: A operação solicitada não pode ser concluída, pois a conexão foi quebrada.
ru: Затребованная операция не может быть завершена из-за разрыва подключения.
zh_hans: 所请求的操作无法完成，因为连接已断开。
zh_hant: 要求的操作無法完成，因為連接已中斷。

# SQL_OpenResultCountExceeded
source: Open result count exceeded.
de: Maximale Anzahl offener Ergebnisse überschritten.
es: Se ha superado el recuento de resultados abierto.
fr: Dépassé du nombre de résultats ouvert.
it: È stato superato il numero di risultati aperti.
ja: 開く結果の数が上限を超えました。
ko: 열려 있는 결과 카운트가 초과되었습니다.
pt_br: Contagem de resultados abertos excedida.
ru: Превышено число открытых результатов.
zh_hans: 已超过打开的结果计数。
zh_hant: 開啟結果計數已超過。

# GT_Disabled
source: Global Transactions are not enabled for this Azure SQL Database. Please contact Azure SQL Database support for assistance.
de: Globale Transaktionen sind für diese Azure SQL-Datenbank-Instanz nicht aktiviert. Wenden Sie sich an den Azure SQL-Datenbank-Support, um Unterstützung zu erhalten.
es: Las transacciones globales no están habilitadas para esta base de datos SQL de Azure. Para obtener ayuda, póngase en contacto con el soporte técnico de Azure SQL Database.
fr: Les transactions globales ne sont pas activées pour cette base de données Azure SQL. Contactez le support d'Azure SQL Database pour obtenir de l'aide.
it: Le transazioni globali non sono abilitate per questo database SQL di Azure. Per assistenza, contattare il supporto del database SQL di Azure.
ja: この Azure SQL Database では、グローバル トランザクションは有効ではありません。Azure SQL Database サポートにお問い合わせください。
ko: 이 Azure SQL Database에 대해 전역 트랙잭션을 사용하도록 설정되어 있지 않습니다. 도움이 필요하면 Azure SQL Database 지원 팀에 문의하세요.
pt_br: As Transações Globais não estão habilitadas para esse Banco de Dados SQL do Azure. Entre em contato com o suporte do Banco de Dados SQL do Azure para obter assistência.
ru: Для этой базы данных SQL Azure глобальные транзакции не включены. Обратитесь за помощью в службу поддержки по базам данных SQL Azure.
zh_hans: 尚未为此 Azure SQL 数据库启用全局事务。若要获取帮助，请联系 Azure SQL 数据库支持人员。
zh_hant: 此 Azure SQL Database 未啟用全域交易。請連絡 Azure SQL Database 支援以取得協助。
