Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_EmptyCngName
source: Empty Microsoft Cryptography API: Next Generation (CNG) provider name specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{1}<Key Identifier>.
de: Es wurde ein leerer Microsoft CNG-Anbietername (Cryptography API Next Generation) im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{1}<Schlüsselbezeichner>.
es: Se especificó un nombre de proveedor de Cryptography API: Next Generation (CNG) de Microsoft vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{1}<Identificador clave>.
fr: Le nom du fournisseur CNG de l'API de chiffrement Microsoft spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{1}<Identificateur de clé>.
it: L'API di crittografia Microsoft è vuota. Nome del provider CNG di prossima generazione specificato nel percorso della chiave master di colonna: '{0}'. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{1}<identificatore chiave>.
ja: 空の Microsoft Cryptography API: Next Generation (CNG) プロバイダー名が列マスター キーのパス: '{0}' で指定されています。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{1}<キー識別子>。
ko: 열 마스터 키 경로 '{0}'에 빈 Microsoft CNG(Cryptography API: Next Generation) 공급자 이름이 지정되었습니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Nome do provedor CNG (Cryptography API: Next Generation) da Microsoft especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada em um provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{1}<Identificador de Chave>.
ru: Указано пустое имя поставщика Microsoft Cryptography API: Next Generation (CNG) в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{1}<идентификатор ключа>.
zh_hans: 列主密钥路径 {0} 中指定的 Microsoft API 下一代加密技术(CNG)提供程序名称为空。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{1}<密钥标识符>。
zh_hant: 在資料行主要金鑰路徑 '{0}' 中指定了空白的 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者名稱。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{1}<金鑰識別碼>。

# TCE_EmptyCngNameSysErr
source: Internal error. Empty Microsoft Cryptography API: Next Generation (CNG) provider name specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{1}<Key Identifier>.
de: Interner Fehler. Es wurde ein leerer Microsoft CNG-Anbietername (Cryptography API Next Generation) im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{1}<Schlüsselbezeichner>.
es: Error interno. Se especificó un nombre de proveedor de Cryptography API: Next Generation (CNG) de Microsoft vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{1}<Identificador clave>.
fr: Erreur interne. Le nom du fournisseur CNG de l'API de chiffrement Microsoft spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{1}<Identificateur de clé>.
it: Errore interno. L'API di crittografia Microsoft è vuota. Nome del provider CNG di prossima generazione specificato nel percorso della chiave master di colonna: '{0}'. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{1}<identificatore chiave>.
ja: 内部エラー。空の Microsoft Cryptography API: Next Generation (CNG) プロバイダー名が列マスター キーのパス: '{0}' で指定されています。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{1}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로 '{0}'에 빈 Microsoft CNG(Cryptography API: Next Generation) 공급자 이름이 지정되었습니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. Nome do provedor CNG (Cryptography API: Next Generation) da Microsoft vazio especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada no provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{1}<Identificador de Chave>.
ru: Внутренняя ошибка. Указано пустое имя поставщика Microsoft Cryptography API: Next Generation (CNG) в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{1}<идентификатор ключа>.
zh_hans: 内部错误。列主密钥路径 {0} 中指定的 Microsoft API 下一代加密技术(CNG)提供程序名称为空。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{1}<密钥标识符>。
zh_hant: 內部錯誤。在資料行主要金鑰路徑 '{0}' 中指定了空白的 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者名稱。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{1}<金鑰識別碼>。

# TCE_EmptyCspKeyId
source: Empty key identifier specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{1}<Key Identifier>.
de: Es wurde ein leerer Schlüsselbezeichner im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter (Cryptographic Service Provider, Kryptografiedienstanbieter) gespeicherten Schlüssel: <CSP-Anbietername>{1}<Schlüsselbezeichner>.
es: Se especificó un identificador clave vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{1}<Identificador clave>.
fr: L'identificateur de clé spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement>{1}<Identificateur de clé>.
it: Nel percorso della chiave master di colonna è stato specificato un identificatore chiave vuoto: '{0}'. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{1}<identificatore chiave>.
ja: 空のキー識別子が列マスター キーのパス: '{0}' で指定されています。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{1}<キー識別子>。
ko: 열 마스터 키 경로 '{0}'에 빈 키 식별자가 지정되었습니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Identificador de chave vazio especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada em um CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CSP>{1}<Identificador de Chave>.
ru: Указан пустой идентификатор ключа в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CSP>{1}<идентификатор ключа>.
zh_hans: 列主密钥路径 {0} 中指定的密钥标识符为空。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{1}<密钥标识符>。
zh_hant: 在資料行主要金鑰路徑 '{0}' 中指定了空白的金鑰識別碼。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{1}<金鑰識別碼>。

# TCE_EmptyCspKeyIdSysErr
source: Internal error. Empty key identifier specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft cryptographic service provider (CSP): <CSP Provider Name>{1}<Key Identifier>.
de: Interner Fehler. Es wurde ein leerer Schlüsselbezeichner im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CSP-Anbieter (Cryptographic Service Provider, Kryptografiedienstanbieter) gespeicherten Schlüssel: <CSP-Anbietername>{1}<Schlüsselbezeichner>.
es: Error interno. Se especificó un identificador clave vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor de servicios criptográficos (CSP) de Microsoft: <Nombre de proveedor CSP>{1}<Identificador clave>.
fr: Erreur interne. L'identificateur de clé spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans un fournisseur de service de chiffrement Microsoft : <Nom du fournisseur de service de chiffrement>{1}<Identificateur de clé>.
it: Errore interno. Nel percorso della chiave master di colonna è stato specificato un identificatore chiave vuoto: '{0}'. Usare il formato seguente per una chiave archiviata in un provider del servizio di crittografia Microsoft (CSP): <nome provider CSP>{1}<identificatore chiave>.
ja: 内部エラー。空のキー識別子が列マスター キーのパス: '{0}' で指定されています。Microsoft 暗号化サービス プロバイダー (CSP) に保存されるキーには、次の形式を使用してください: <CSP プロバイダー名>{1}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로 '{0}'에 빈 키 식별자가 지정되었습니다. Microsoft CSP(암호화 서비스 공급자)에 저장된 키에 대해 <CSP 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. Identificador de chave vazio especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada em um CSP (Provedor de Serviços de Criptografia) da Microsoft: <Nome do Provedor de CSP>{1}<Identificador de Chave>.
ru: Внутренняя ошибка. Указан пустой идентификатор ключа в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике служб шифрования Microsoft (CSP): <имя поставщика CSP>{1}<идентификатор ключа>.
zh_hans: 内部错误。列主密钥路径 {0} 中指定的密钥标识符为空。请对 Microsoft 加密服务提供程序(CSP)中存储的密钥使用以下格式: <CSP 提供程序名称>{1}<密钥标识符>。
zh_hant: 內部錯誤。在資料行主要金鑰路徑 '{0}' 中指定了空白的金鑰識別碼。對於儲存在 Microsoft 密碼編譯服務提供者 (CSP) 中的金鑰，請使用下列格式: <CSP 提供者名稱>{1}<金鑰識別碼>。

# TCE_EmptyCngKeyId
source: Empty key identifier specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{1}<Key Identifier>.
de: Es wurde ein leerer Schlüsselbezeichner im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{1}<Schlüsselbezeichner>.
es: Se especificó un identificador clave vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{1}<Identificador clave>.
fr: L'identificateur de clé spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{1}<Identificateur de clé>.
it: Nel percorso della chiave master di colonna è stato specificato un identificatore chiave vuoto: '{0}'. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{1}<identificatore chiave>.
ja: 空のキー識別子が列マスター キーのパス: '{0}' で指定されています。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{1}<キー識別子>。
ko: 열 마스터 키 경로 '{0}'에 빈 키 식별자가 지정되었습니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Identificador de chave vazio especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada em um provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{1}<Identificador de Chave>.
ru: Указан пустой идентификатор в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{1}<идентификатор ключа>.
zh_hans: 列主密钥路径 {0} 中指定的密钥标识符为空。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{1}<密钥标识符>。
zh_hant: 在資料行主要金鑰路徑 '{0}' 中指定了空白的金鑰識別碼。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{1}<金鑰識別碼>。

# TCE_EmptyCngKeyIdSysErr
source: Internal error. Empty key identifier specified in column master key path: '{0}'. Use the following format for a key stored in a Microsoft Cryptography API: Next Generation (CNG) provider: <CNG Provider Name>{1}<Key Identifier>.
de: Interner Fehler. Es wurde ein leerer Schlüsselbezeichner im Masterschlüsselpfad der Spalte angegeben: '{0}'. Verwenden Sie das folgende Format für einen in einem Microsoft CNG-Anbieter (Cryptography API Next Generation) gespeicherten Schlüssel: <CNG-Anbietername>{1}<Schlüsselbezeichner>.
es: Error interno. Se especificó un identificador clave vacío en la ruta de la clave maestra de la columna '{0}'. Use el siguiente formato para una clave almacenada en un proveedor Cryptography API: Next Generation (CNG) de Microsoft: <Nombre de proveedor CNG>{1}<Identificador clave>.
fr: Erreur interne. L'identificateur de clé spécifié dans le chemin d'accès de la clé principale de la colonne '{0}' est vide. Utilisez le format suivant pour une clé stockée dans une API de chiffrement Microsoft : Fournisseur CNG : <Nom du fournisseur CNG>{1}<Identificateur de clé>.
it: Errore interno. Nel percorso della chiave master di colonna è stato specificato un identificatore chiave vuoto: '{0}'. Usare il formato seguente per una chiave archiviata in un provider dell'API Criptography Next Generation (CNG) Microsoft: <nome provider CNG>{1}<identificatore chiave>.
ja: 内部エラー。空のキー識別子が列マスター キーのパス: '{0}' で指定されています。Microsoft Cryptography API: Next Generation (CNG) プロバイダーに保存されるキーには、次の形式を使用してください: <CNG プロバイダー名>{1}<キー識別子>。
ko: 내부 오류입니다. 열 마스터 키 경로 '{0}'에 빈 키 식별자가 지정되었습니다. Microsoft CNG(Cryptography API: Next Generation) 공급자에 저장된 키에 대해 <CNG 공급자 이름>{1}<키 식별자> 형식을 사용하세요.
pt_br: Erro interno. Identificador de chave vazio especificado no caminho de chave mestra da coluna: '{0}'. Use o formato a seguir para uma chave armazenada em um provedor CNG (Cryptography API: Next Generation) da Microsoft: <Nome do Provedor CNG>{1}<Identificador de Chave>.
ru: Внутренняя ошибка. Указан пустой идентификатор в пути к столбцу главного ключа: "{0}". Используйте следующий формат для ключа, хранимого в поставщике Microsoft Cryptography API: Next Generation (CNG): <имя поставщика CNG>{1}<идентификатор ключа>.
zh_hans: 内部错误。列主密钥路径 {0} 中指定的密钥标识符为空。请对 Microsoft API 下一代加密技术(CNG)提供程序中存储的密钥使用以下格式: <CNG 提供程序名称>{1}<密钥标识符>。
zh_hant: 內部錯誤。在資料行主要金鑰路徑 '{0}' 中指定了空白的金鑰識別碼。對於儲存在 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 提供者中的金鑰，請使用下列格式: <CNG 提供者名稱>{1}<金鑰識別碼>。

# TCE_InvalidCspName
source: Invalid Microsoft cryptographic service provider (CSP) name: '{0}'. Verify that the CSP provider name in column master key path: '{1}' is valid and installed on the machine.
de: Ungültiger Microsoft CSP-Name (Cryptographic Service Provider, Kryptografiedienstanbieter): '{0}'. Vergewissern Sie sich, dass der CSP-Anbietername im Masterschlüsselpfad '{1}' der Spalte gültig und auf dem Computer installiert ist.
es: Nombre de proveedor de servicios criptográficos (CSP) de Microsoft '{0}' no válido. Compruebe que el nombre de proveedor de servicios criptográficos en la ruta de la clave maestra de la columna '{1}' sea válido y esté instalado en el equipo.
fr: Le nom du fournisseur de service de chiffrement Microsoft '{0}' n'est pas valide. Vérifiez que le nom du fournisseur de service de chiffrement dans le chemin d'accès de la clé principale de la colonne '{1}' est valide et est installé sur l'ordinateur.
it: Il nome del provider del servizio di crittografia (CSP) Microsoft non è valido: '{0}'. Verificare che il nome del provider CSP specificato nel percorso della chiave master di colonna '{1}' sia valido e installato nel computer.
ja: Microsoft 暗号化サービス プロバイダー (CSP) 名: '{0}' が無効です。列マスター キーのパス: '{1}' の CSP プロバイダー名が有効であり、コンピューターにインストールされていることを確認してください。
ko: Microsoft CSP(암호화 서비스 공급자) 이름 '{0}'이(가) 잘못되었습니다. 열 마스터 키 경로의 CSP 공급자 이름 '{1}'이(가) 올바르고 컴퓨터에 설치되어 있는지 확인하세요.
pt_br: Nome inválido do CSP (Provedor de Serviços de Criptografia) da Microsoft: '{0}'. Verifique se o nome do provedor de CSP em um caminho de chave mestra da coluna: '{1}' está válido e instalado no computador.
ru: Недопустимое имя поставщика служб шифрования Microsoft (CSP): "{0}". Убедитесь, что имя поставщика CSP в пути к главному ключу столбца "{1}" является допустимым и установлено на машине.
zh_hans: 无效的 Microsoft 加密服务提供程序(CSP)名称:“{0}”。请验证列主密钥路径“{1}”中的 CSP 提供程序名称是否有效且已安装在计算机上。
zh_hant: Microsoft 密碼編譯服務提供者 (CSP) 名稱 '{0}' 無效。請確認資料行主要金鑰路徑 '{1}' 中的 CSP 提供者名稱有效，並已安裝在電腦上。

# TCE_InvalidCspNameSysErr
source: Internal error. Invalid Microsoft cryptographic service provider (CSP) name: '{0}'. Verify that the CSP provider name in column master key path: '{1}' is valid and installed on the machine.
de: Interner Fehler. Ungültiger Microsoft CSP-Name (Cryptographic Service Provider, Kryptografiedienstanbieter): '{0}'. Vergewissern Sie sich, dass der CSP-Anbietername im Masterschlüsselpfad '{1}' der Spalte gültig und auf dem Computer installiert ist.
es: Error interno. Nombre de proveedor de servicios criptográficos (CSP) de Microsoft '{0}' no válido. Compruebe que el nombre de CSP en la ruta de la clave maestra de la columna '{1}' sea válido y esté instalado en el equipo.
fr: Erreur interne. Le nom du fournisseur de service de chiffrement Microsoft '{0}' n'est pas valide. Vérifiez que le nom du fournisseur de service de chiffrement dans le chemin d'accès de la clé principale de la colonne '{1}' est valide et est installé sur l'ordinateur.
it: Errore interno. Il nome del provider del servizio di crittografia (CSP) Microsoft non è valido: '{0}'. Verificare che il nome del provider CSP specificato nel percorso della chiave master di colonna '{1}' sia valido e installato nel computer.
ja: 内部エラー。Microsoft 暗号化サービス プロバイダー (CSP) 名: '{0}' が無効です。列マスター キーのパス: '{1}' の CSP プロバイダー名が有効であり、コンピューターにインストールされていることを確認してください。
ko: 내부 오류입니다. Microsoft CSP(암호화 서비스 공급자) 이름 '{0}'이(가) 잘못되었습니다. 열 마스터 키 경로의 CSP 공급자 이름 '{1}'이(가) 올바르고 컴퓨터에 설치되어 있는지 확인하세요.
pt_br: Erro interno. Nome inválido do CSP (Provedor de Serviços de Criptografia) da Microsoft: '{0}'. Verifique se o nome do provedor de CSP em um caminho de chave mestra da coluna: '{1}' está válido e instalado no computador.
ru: Внутренняя ошибка. Недопустимое имя поставщика служб шифрования Microsoft (CSP): "{0}". Убедитесь, что имя поставщика CSP в пути к главному ключу столбца "{1}" является допустимым и установлено на машине.
zh_hans: 内部错误。无效的 Microsoft 加密服务提供程序(CSP)名称:“{0}”。请验证列主密钥路径“{1}”中的 CSP 提供程序名称是否有效且已安装在计算机上。
zh_hant: 內部錯誤。Microsoft 密碼編譯服務提供者 (CSP) 名稱 '{0}' 無效。請確認資料行主要金鑰路徑 '{1}' 中的 CSP 提供者名稱有效，並已安裝在電腦上。

# TCE_InvalidCspKeyId
source: Invalid key identifier: '{0}'. Verify that the key identifier in column master key path: '{1}' is valid and exists in the CSP.
de: Ungültiger Schlüsselbezeichner: '{0}'. Vergewissern Sie sich, dass der Schlüsselbezeichner im Masterschlüsselpfad '{1}' der Spalte gültig und im CSP vorhanden ist.
es: Identificador clave no válido: '{0}'. Compruebe que el identificador clave en la ruta de la clave maestra de la columna '{1}' sea válido y exista en el CSP.
fr: L'identificateur de clé '{0}' n'est pas valide. Vérifiez que l'identificateur de clé dans le chemin d'accès de la clé principale de la colonne '{1}' est valide et existe dans le fournisseur de service de chiffrement.
it: L'identificatore chiave non è valido: '{0}'. Verificare che l'identificatore chiave nel percorso della chiave master di colonna '{1}' sia valido e presente nel provider CSP.
ja: キー識別子: '{0}' が無効です。列マスター キーのパス: '{1}' のキー識別子が有効であり、CSP に存在することを確認してください。
ko: 키 식별자 '{0}'이(가) 잘못되었습니다. 열 마스터 키 경로의 키 식별자 '{1}'이(가) 올바르고 CSP에 있는지 확인하세요.
pt_br: Identificador de chave inválido: '{0}'. Verifique se o identificador de chave no caminho da chave mestra de coluna: '{1}' é válido e existe no CSP.
ru: Недопустимый идентификатор ключа: "{0}". Убедитесь, что идентификатор ключа в пути к главному ключу столбца "{1}" является допустимым и существует в CSP.
zh_hans: 无效的密钥标识符:“{0}”。请验证列主密钥路径“{1}”中的密钥标识符是否有效且存储在 CSP 中。
zh_hant: 金鑰識別碼 '{0}' 無效。請確認資料行主要金鑰路徑 '{1}' 中的金鑰識別碼有效，且其存在於 CSP 中。

# TCE_InvalidCspKeyIdSysErr
source: Internal error. Invalid key identifier: '{0}'. Verify that the key identifier in column master key path: '{1}' is valid and exists in the CSP.
de: Interner Fehler. Ungültiger Schlüsselbezeichner: '{0}'. Vergewissern Sie sich, dass der Schlüsselbezeichner im Masterschlüsselpfad '{1}' der Spalte gültig und im CSP vorhanden ist.
es: Error interno. Identificador clave no válido: '{0}'. Compruebe que el identificador clave en la ruta de la clave maestra de la columna '{1}' sea válido y exista en el CSP.
fr: Erreur interne. L'identificateur de clé '{0}' n'est pas valide. Vérifiez que l'identificateur de clé dans le chemin d'accès de la clé principale de la colonne '{1}' est valide et existe dans le fournisseur de service de chiffrement.
it: Errore interno. L'identificatore chiave non è valido: '{0}'. Verificare che l'identificatore chiave nel percorso della chiave master di colonna '{1}' sia valido e presente nel provider CSP.
ja: 内部エラー。キー識別子: '{0}' が無効です。列マスター キーのパス: '{1}' のキー識別子が有効であり、CSP に存在することを確認してください。
ko: 내부 오류입니다. 키 식별자 '{0}'이(가) 잘못되었습니다. 열 마스터 키 경로의 키 식별자 '{1}'이(가) 올바르고 CSP에 있는지 확인하세요.
pt_br: Erro interno. Identificador de chave inválido: '{0}'. Verifique se o identificador de chave no caminho da chave mestra de coluna: '{1}' é válido e existe no CSP.
ru: Внутренняя ошибка. Недопустимый идентификатор ключа: "{0}". Убедитесь, что идентификатор ключа в пути к главному ключу столбца "{1}" является допустимым и существует в CSP.
zh_hans: 内部错误。无效的密钥标识符:“{0}”。请验证列主密钥路径“{1}”中的密钥标识符是否有效且存储在 CSP 中。
zh_hant: 內部錯誤。金鑰識別碼 '{0}' 無效。請確認資料行主要金鑰路徑 '{1}' 中的金鑰識別碼有效，且其存在於 CSP 中。
