Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SqlMisc_FormatMessage
source: The input wasn't in a correct format.
de: Die Eingabe hatte nicht das richtige Format.
es: La entrada no está en un formato correcto.
fr: L'entrée n'était pas dans un format correct.
it: Input in formato non corretto.
ja: 入力の形式が正しくありません。
ko: 입력 형식이 잘못되었습니다.
pt_br: A entrada não estava em um formato correto.
ru: Входные данные имели неверный формат.
zh_hans: 输入采用的格式不正确。
zh_hant: 輸入格式錯誤。

# SqlMisc_SqlTypeMessage
source: SqlType error.
de: SqlType-Fehler.
es: Error de SqlType.
fr: Erreur SqlType.
it: Errore di SqlType.
ja: SqlType エラーが発生しました。
ko: SqlType 오류입니다.
pt_br: Erro de SqlType.
ru: Ошибка SqlType.
zh_hans: SqlType 错误。
zh_hant: SqlType 錯誤。

# SqlMisc_LenTooLargeMessage
source: The SqlBytes and SqlChars don't support length of more than 2GB in this version.
de: SqlBytes und SqlChars unterstützten in dieser Version nur eine maximale Länge von 2GB.
es: SqlBytes y SqlChars no admiten longitudes superiores a los 2GB en esta versión.
fr: Les SqlBytes et SqlChars ne prennent pas en charge de longueur supérieure à 2GB dans cette version.
it: SqlBytes e SqlChars non supportano una lunghezza superiore a 2GB in questa versione.
ja: このバージョンでは、SqlBytes および SqlChars は 2GB までしかサポートしていません。
ko: 이 버전에서는 SqlBytes와 SqlChars가 2GB 이상의 길이를 지원하지 않습니다.
pt_br: SqlBytes e SqlChars não oferecem suporte a mais de 2GB nesta versão.
ru: В этой версии SqlBytes и SqlChars не поддерживают длину, превышающую 2 ГБ (2GB).
zh_hans: 此版本中的 SqlBytes 和 SqlChars 不支持超过 2GB 的长度。
zh_hant: 在此版本中 SqlBytes 及 SqlChars 不支援大於 2GB 的長度。

# SqlMisc_StreamErrorMessage
source: An error occurred while reading.
de: Fehler beim Lesen.
es: Error al leer.
fr: Erreur lors de la lecture.
it: Errore durante la lettura.
ja: 読み取り中にエラーが発生しました。
ko: 읽는 동안 오류가 발생했습니다.
pt_br: Erro durante a leitura.
ru: Возникла ошибка при чтении.
zh_hans: 读取时出错。
zh_hant: 讀取時發生錯誤。

# SqlMisc_StreamClosedMessage
source: Stream has been closed or disposed.
de: Stream wurde geschlossen oder entfernt.
es: Se ha cerrado o desechado Stream.
fr: Le Stream a été fermé ou supprimé.
it: Stream è stato chiuso o eliminato.
ja: Stream は閉じられているか後処理されています。
ko: Stream을 닫거나 삭제했습니다.
pt_br: O Stream foi fechado ou descartado.
ru: Поток Stream закрыт или удален.
zh_hans: Stream 已关闭或已处理。
zh_hant: Stream 已關閉或處置。

# SqlMisc_NoBufferMessage
source: There is no buffer. Read or write operation failed.
de: Kein Puffer vorhanden. Lese- bzw. Schreiboperation fehlgeschlagen.
es: No hay búfer. Error al realizar la operación de lectura o escritura.
fr: La mémoire tampon est manquante. Échec de l'opération de lecture ou d'écriture.
it: Nessun buffer presente. Operazione di lettura o scrittura non riuscita.
ja: バッファーがありません。読み取りまたは書き込み操作が失敗しました。
ko: 버퍼가 없습니다. 읽기 또는 쓰기 작업이 실패했습니다.
pt_br: Não há buffer. Falha na operação de leitura ou gravação.
ru: Нет буфера. Сбой операции чтения или записи.
zh_hans: 没有缓冲区。读或写操作失败。
zh_hant: 沒有緩衝區。讀取或寫入作業失敗。

# SqlMisc_SetNonZeroLenOnNullMessage
source: Cannot set to non-zero length, because current value is Null.
de: Eine Länge ungleich Null kann nicht festgelegt werden, da der aktuelle Wert Null ist.
es: No se puede establecer una longitud distinta de cero porque el valor actual es Null.
fr: Définition sur une longueur non nulle impossible : la valeur actuelle est Null.
it: Impossibile impostare una lunghezza diversa da zero. Il valore corrente è Null.
ja: 現在の値は Null であるため、0 以外の長さを設定することはできません。
ko: 현재 값이 Null이므로 0이 아닌 길이로 설정할 수 없습니다.
pt_br: Não é possível definir o tamanho como não nulo, pois o valor atual é Null.
ru: Невозможно назначить ненулевую длину, поскольку текущее значение равно Null.
zh_hans: 无法设置非零长度，因为当前值为 Null。
zh_hant: 無法設定非零的長度，因為目前的值是 Null。

# SqlMisc_BufferInsufficientMessage
source: The buffer is insufficient. Read or write operation failed.
de: Der Puffer ist unzureichend. Lese- bzw. Schreiboperation fehlgeschlagen.
es: Tamaño de búfer insuficiente. Error al realizar la operación de lectura o escritura.
fr: La mémoire tampon est insuffisante. Échec de l'opération de lecture ou d'écriture.
it: Il buffer non è sufficiente. Operazione di lettura o scrittura non riuscita.
ja: バッファーが十分にありません。読み取りまたは書き込み操作が失敗しました。
ko: 버퍼가 부족합니다. 읽기 또는 쓰기 작업이 실패했습니다.
pt_br: Buffer insuficiente. Falha na operação de leitura ou gravação.
ru: Недостаточный размер буфера. Сбой операции чтения или записи.
zh_hans: 缓冲区不足。读或写操作失败。
zh_hant: 緩衝無效。讀取或寫入作業失敗。

# SqlMisc_WriteNonZeroOffsetOnNullMessage
source: Cannot write to non-zero offset, because current value is Null.
de: Schreiben in einen Offset ungleich Null nicht möglich, da der aktuelle Wert Null ist.
es: No se puede escribir en un desplazamiento distinto de cero porque el valor actual es Null.
fr: Écriture dans l'offset non nul impossible : la valeur actuelle est Null.
it: Impossibile scrivere su un offset diverso da zero. Il valore corrente è Null.
ja: 現在の値は Null であるため、0 以外のオフセットに書き込むことはできません。
ko: 현재 값이 Null이므로 0이 아닌 오프셋에 쓸 수 없습니다.
pt_br: Não é possível gravar em deslocamento não nulo, pois o valor atual é Null.
ru: Невозможно выполнить запись с ненулевым смещением, поскольку текущее значение равно Null.
zh_hans: 无法写入非零偏移量，因为当前值为 Null。
zh_hant: 無法寫入非零的位移，因為目前的值是 Null。

# SqlMisc_WriteOffsetLargerThanLenMessage
source: Cannot write from an offset that is larger than current length. It would leave uninitialized data in the buffer.
de: Schreiben aus einem Offset, der größer als die aktuelle Länge ist, nicht möglich. Es würden nicht initialisierte Daten im Puffer verbleiben.
es: No se puede escribir desde un desplazamiento mayor que la longitud actual, ya que dejaría datos no inicializados en el búfer.
fr: Aucune donnée ne peut être écrite à partir d'un offset supérieur à la longueur actuelle. Sinon, la mémoire tampon risque de contenir des données non initialisées.
it: Impossibile scrivere da un offset di dimensioni maggiori della lunghezza corrente. Resterebbero dati non inizializzati nel buffer.
ja: 現在のサイズを越えるオフセットからは書き込めません。このため、初期化されなかったデータがバッファーに残されます。
ko: 현재 길이보다 큰 오프셋에서 쓸 수 없습니다. 따라서 버퍼에 초기화되지 않은 데이터가 남게 됩니다.
pt_br: Não é possível gravar um deslocamento que seja maior que o tamanho atual. Dados não inicializados seriam deixados no buffer.
ru: Невозможно выполнить запись со смещением, которое превышает текущую длину. При этом в буфере останутся неинициализированные данные.
zh_hans: 无法从超出当前长度的偏移位置执行写操作。这将在缓冲区中留下未初始化的数据。
zh_hant: 無法從大於目前長度的位移寫入。將會在緩衝區留下未初始化的資料。

# SqlMisc_TruncationMaxDataMessage
source: Data returned is larger than 2Gb in size. Use SequentialAccess command behavior in order to get all of the data.
de: Die Größe der zurückgegebenen Daten beträgt mehr als 2Gb. Verwenden Sie das SequentialAccess-command behavior, um alle Daten abzurufen.
es: El tamaño de los datos devueltos supera los 2Gb. Utilice SequentialAccess command behavior para obtener todos los datos.
fr: La taille des données retournées est supérieure à 2Gb. Utilisez le command behavior SequentialAccess pour obtenir l'ensemble de ces données.
it: I dati restituiti hanno una dimensione maggiore di 2Gb. Utilizzare SequentialAccess command behavior per ottenere tutti i dati.
ja: 返されたデータのサイズが 2Gb を超えています。すべてのデータを取得するには、SequentialAccess command behavior を使用してください。
ko: 반환된 데이터의 크기가 2Gb보다 큽니다. 모든 데이터를 가져오려면 SequentialAccess command behavior를 사용하십시오.
pt_br: O volume dos dados retornados são maiores do que 2Gb. Use SequentialAccess command behavior para obter todos os dados.
ru: Размер возвращенных данных превышает 2 ГБ (2Gb). Используйте поведение command behavior SequentialAccess для получения всех данных.
zh_hans: 返回的数据大小超出了 2Gb。请使用 SequentialAccess command behavior，以获取所有数据。
zh_hant: 傳回的資料大小大於 2Gb。請使用 SequentialAccess command behavior 以取得所有資料。

# SqlMisc_InvalidFirstDayMessage
source: Argument to GetDayOfWeek must be integer between 1 and 7.
de: Argument für GetDayOfWeek muss eine Ganzzahl von 1 bis 7 sein.
es: El argumento de GetDayOfWeek debe ser un número entero entre 1 y 7.
fr: L'argument utilisé pour GetDayOfWeek doit être un entier compris entre 1 et 7.
it: L'argomento per GetDayOfWeek deve essere un integer compreso tra 1 e 7.
ja: GetDayOfWeek の引数は 1 ～ 7 の整数である必要があります。
ko: GetDayOfWeek에 대한 인수는 1에서 7 사이의 정수여야 합니다.
pt_br: O argumento para GetDayOfWeek deve ser um número inteiro entre 1 e 7.
ru: Аргументом для GetDayOfWeek должно быть целое число в диапазоне от 1 до 7.
zh_hans: GetDayOfWeek 的参数必须是介于 1 与 7 之间的整数。
zh_hant: GetDayOfWeek 的引數必須為介於 1 與 7 間的整數。

# SqlMisc_NotFilledMessage
source: SQL Type has not been loaded with data.
de: SQL Type wurde nicht mit Daten geladen.
es: No se ha cargado el Type SQL con datos.
fr: Le Type SQL n'a pas été chargé avec les données.
it: SQL Type non è stato caricato con i dati.
ja: SQL Type にはデータが読み込まれていません。
ko: SQL Type이 데이터와 함께 로드되지 않았습니다.
pt_br: SQL Type não foi carregado com dados.
ru: SQL Type не был загружен с данными.
zh_hans: SQL Type 尚未与数据一起加载。
zh_hant: SQL Type 尚未載入資料。

# SqlMisc_AlreadyFilledMessage
source: SQL Type has already been loaded with data.
de: SQL Type wurde bereits mit Daten geladen.
es: El Type SQL ya se ha cargado con datos.
fr: Le Type SQL a déjà été chargé avec les données.
it: SQL Type è già stato caricato con i dati.
ja: SQL Type には既にデータが読み込まれています。
ko: SQL Type이 데이터와 함께 로드되었습니다.
pt_br: SQL Type já foi carregado com dados.
ru: SQL Type был загружен с данными.
zh_hans: SQL Type 已与数据一起加载。
zh_hant: SQL Type 已經載入資料。

# SqlMisc_ClosedXmlReaderMessage
source: Invalid attempt to access a closed XmlReader.
de: Ungültiger Versuch des Zugriffs auf einen geschlossenen XmlReader.
es: Intento no válido de obtener acceso a un XmlReader cerrado.
fr: Tentative d'accès à un XmlReader fermé non valide.
it: Tentativo non valido di accedere a un XmlReader chiuso.
ja: 閉じられている XmlReader にアクセスしようとしましたが無効です。
ko: 닫힌 XmlReader에 액세스할 수 없습니다.
pt_br: Tentativa inválida de acessar um XmlReader fechado.
ru: Недопустимая попытка получить доступ к закрытому XmlReader.
zh_hans: 访问已关闭的 XmlReader 的尝试无效。
zh_hant: 嘗試存取關閉的 XmlReader 無效。

# SqlMisc_InvalidOpStreamClosed
source: Invalid attempt to call {0} when the stream is closed.
de: Ungültiger Versuch des Aufrufs von {0}, wenn der Datenstrom geschlossen ist.
es: Intento no válido de llamar a {0} cuando la secuencia está cerrada.
fr: Tentative d'appel de {0} non valide si le flux est fermé.
it: Tentativo non valido di chiamare {0} quando il flusso è chiuso.
ja: ストリームが閉じているときに {0} を呼び出そうとしましたが無効です。
ko: 스트림이 닫혀 있으면 {0}을(를) 호출할 수 없습니다.
pt_br: Tentativa inválida de chamar {0} quando o fluxo está fechado.
ru: Недопустимая попытка вызвать {0} при закрытом потоке.
zh_hans: 流关闭时，调用 {0} 的尝试无效。
zh_hant: 當資料流已關閉時，嘗試呼叫 {0} 失敗。

# SqlMisc_InvalidOpStreamNonWritable
source: Invalid attempt to call {0} when the stream non-writable.
de: Ungültiger Versuch des Aufrufs von {0}, wenn nicht in den Datenstrom geschrieben werden kann.
es: Intento no válido de llamar a {0} cuando no se puede escribir en la secuencia.
fr: Tentative d'appel de {0} non valide si des données ne peuvent pas être écrites dans le flux.
it: Tentativo non valido di chiamare {0} quando il flusso non è scrivibile.
ja: ストリームの書き込みができないときに {0} を呼び出そうとしましたが無効です。
ko: 스트림을 쓸 수 없으면 {0}을(를) 호출할 수 없습니다.
pt_br: Tentativa inválida de chamar {0} quando o fluxo não pode ser gravado.
ru: Недопустимая попытка вызвать {0}, когда поток не поддерживает записи.
zh_hans: 流不可写时，调用 {0} 的尝试无效。
zh_hant: 當無法寫入資料流時，嘗試呼叫 {0} 失敗。

# SqlMisc_InvalidOpStreamNonReadable
source: Invalid attempt to call {0} when the stream non-readable.
de: Ungültiger Versuch des Aufrufs von {0}, wenn der Datenstrom nicht lesbar ist.
es: Intento no válido de llamar a {0} cuando no se puede leer la secuencia.
fr: Tentative d'appel de {0} non valide lorsque le flux ne peut pas être lu.
it: Tentativo non valido di chiamare {0} quando il flusso non è leggibile.
ja: ストリームの読み取りができないときに {0} を呼び出そうとしましたが無効です。
ko: 스트림을 읽을 수 없으면 {0}을(를) 호출할 수 없습니다.
pt_br: Tentativa inválida de chamar {0} quando o fluxo está ilegível.
ru: Недопустимая попытка вызвать {0}, когда поток не поддерживает чтения.
zh_hans: 流不可读时，调用 {0} 的尝试无效。
zh_hant: 當無法讀取資料流時，嘗試呼叫 {0} 失敗。

# SqlMisc_InvalidOpStreamNonSeekable
source: Invalid attempt to call {0} when the stream is non-seekable.
de: Ungültiger Versuch des Aufrufs von {0}, wenn der Datenstrom nicht durchsuchbar ist.
es: Intento no válido de llamar a {0} cuando no se puede buscar en la secuencia.
fr: Tentative d'appel de {0} non valide lorsque le flux ne peut pas être recherché.
it: Tentativo non valido di chiamare {0} quando il flusso non è ricercabile.
ja: ストリームの検索ができないときに {0} を呼び出そうとしましたが無効です。
ko: 스트림을 검색할 수 없으면 {0}을(를) 호출할 수 없습니다.
pt_br: Tentativa inválida de chamar {0} quando o fluxo não pode ser buscado.
ru: Недопустимая попытка вызвать {0}, когда поток не поддерживает поиска.
zh_hans: 流不可查找时，调用 {0} 的尝试无效。
zh_hant: 當找不到資料流時，嘗試呼叫 {0} 失敗。

# SqlMisc_SubclassMustOverride
source: Subclass did not override a required method.
de: Die Unterklasse hat keine erforderliche Methode überschrieben.
es: La subclase no invalidó un método requerido.
fr: La sous-classe n'a pas substituée une méthode requise.
it: La sottoclasse non ha eseguito l'override di un metodo di richiesta.
ja: サブクラスが、必要なメソッドをオーバーライドしませんでした。
ko: 서브클래스에서 필요한 메서드를 재정의하지 않았습니다.
pt_br: A subclasse não substituiu um método necessário.
ru: Подклассы не переопределяют необходимый метод.
zh_hans: 子类未覆盖所需方法。
zh_hant: 子類別並未覆寫所需的方法。

# Sql_CanotCreateNormalizer
source: Cannot create normalizer for '{0}'.
de: Die Normalisierungsfunktion für '{0}' kann nicht erstellt werden.
es: No se puede crear un normalizador para '{0}'.
fr: Impossible de créer un normaliseur pour '{0}'.
it: Impossibile creare un normalizzatore per '{0}'.
ja: '{0}' のノーマライザーを作成できません。
ko: '{0}'에 대한 노멀라이저를 만들 수 없습니다.
pt_br: Não é possível criar o normalizador para '{0}'.
ru: Не удается создать нормализатор для "{0}".
zh_hans: 无法为“{0}”创建标准化程序。
zh_hant: 無法建立 '{0}' 的正規器。

# Sql_InternalError
source: Internal Error
de: Interner Fehler
es: Error interno
fr: Erreur interne
it: Errore interno
ja: 内部エラー
ko: 내부 오류
pt_br: Erro Interno
ru: Внутренняя ошибка
zh_hans: 内部错误
zh_hant: 內部錯誤

# Sql_NullCommandText
source: Command parameter must have a non null and non empty command text.
de: Der Befehlstext von Befehlsparametern darf weder Null noch leer sein.
es: El parámetro de comando debe tener un texto de comando que no sea null o no esté vacío.
fr: Un paramètre de commande doit contenir un texte de commande non null et non vide.
it: Il parametro del comando deve avere un testo del comando non null e non vuoto.
ja: コマンド パラメーターには、Null でも空でもないコマンド テキストを使用する必要があります。
ko: Command 매개 변수에는 Null이 아니며 비어 있지 않은 명령 텍스트가 있어야 합니다.
pt_br: O parâmetro de comando deve ter um texto de comando não nulo e não vazio.
ru: Параметр команды должен содержать непустой и определенный текст.
zh_hans: 命令参数必须有一个非 Null 和非空的命令文本。
zh_hant: 命令參數必須有一個非空值且非空的命令文字。

# Sql_MismatchedMetaDataDirectionArrayLengths
source: MetaData parameter array must have length equivalent to ParameterDirection array argument.
de: Die Länge des MetaData-Parameterarrays muss dem ParameterDirection-Arrayargument entsprechen.
es: La matriz del parámetro MetaData debe tener una longitud equivalente al argumento de la matriz ParameterDirection.
fr: La longueur du tableau de paramètres MetaData doit être équivalente à celle de l'argument de tableau ParameterDirection.
it: La lunghezza della matrice dei parametri MetaData deve essere equivalente all'argomento di matrice ParameterDirection.
ja: MetaData パラメーター配列の長さは、ParameterDirection 配列引数の長さと同じである必要があります。
ko: MetaData 매개 변수 배열의 길이는 ParameterDirection 배열 인수와 같아야 합니다.
pt_br: A matriz do parâmetro MetaData deve ter o comprimento equivalente ao argumento da matriz ParameterDirection.
ru: Длина массива параметров MetaData должна быть равна аргументу массива ParameterDirection.
zh_hans: MetaData 参数数组的长度必须等于 ParameterDirection 数组参数。
zh_hant: MetaData 參數陣列必須有等同於 ParameterDirection 陣列引數的長度。

# ADP_AdapterMappingExceptionMessage
source: Data adapter mapping error.
de: Datenadapter-Zuordnungsfehler.
es: Error de asignación de adaptador de datos.
fr: Erreur de mappage de l'adaptateur de données.
it: Errore di mappatura dell'adattatore dati.
ja: データ アダプターのマッピング エラーが発生しました。
ko: 제공된 시간 범위가 총 14시간을 초과합니다.
pt_br: Erro de mapeamento do adaptador de dados.
ru: Ошибка сопоставления адаптера данных.
zh_hans: 数据适配器映射错误。
zh_hant: 資料配接器對應錯誤。

# ADP_DataAdapterExceptionMessage
source: Data adapter error.
de: Datenadapterfehler.
es: Error del adaptador de datos.
fr: Erreur de l'adaptateur de données.
it: Errore adattatore dati.
ja: データ アダプターのエラーが発生しました。
ko: 데이터 어댑터 오류입니다.
pt_br: Erro de adaptador de dados.
ru: Ошибка адаптера данных.
zh_hans: 数据适配器错误。
zh_hant: 資料配接器錯誤。

# ADP_DBConcurrencyExceptionMessage
source: DB concurrency violation.
de: DB-Parallelitätsverletzung.
es: Infracción de simultaneidad de la base de datos.
fr: Violation de l'accès concurrentiel à la base de données.
it: Violazione di concorrenza DB.
ja: DB の同時実行違反が発生しました。
ko: DB 동시성 위반입니다.
pt_br: Violação de concorrência DB.
ru: Нарушение параллелизма БД.
zh_hans: DB 并发性违规。
zh_hant: 資料庫並行違規。

# ADP_OperationAborted
source: Operation aborted.
de: Operation abgebrochen.
es: Operación cancelada.
fr: Opération abandonnée.
it: Operazione interrotta.
ja: 操作は中止されました。
ko: 작업이 중단되었습니다.
pt_br: Operação anulada.
ru: Операция прервана.
zh_hans: 操作已中止。
zh_hant: 操作已中止。

# ADP_OperationAbortedExceptionMessage
source: Operation aborted due to an exception (see InnerException for details).
de: Operation aufgrund einer Ausnahme abgebrochen (Details finden Sie in der InnerException).
es: Operación cancelada debido a una excepción (consulte InnerException para obtener detalles).
fr: Opération abandonnée en raison d'une exception (pour plus de détails, consultez InnerException).
it: Operazione interrotta a causa di un eccezione (per ulteriori informazioni, vedere InnerException).
ja: 例外が発生したため、操作は中止されました。詳細については、InnerException を確認してください。
ko: 예외가 발생하여 작업이 중단되었습니다. 자세한 내용은 InnerException을 참조하십시오.
pt_br: Operação anulada devido a uma exceção (consulte InnerException para obter detalhes).
ru: Операция прервана из-за исключения (дополнительные сведения см. в InnerException).
zh_hans: 由于异常，操作已中止(有关详细信息，请参阅 InnerException)。
zh_hant: 由於例外狀況操作已中止 (請參閱 InnerException 以取得詳細資訊)。

# DataAdapter_AcceptChangesDuringFill
source: Whether or not Fill will call DataRow.AcceptChanges.
de: Gibt an, ob Fill DataRow.AcceptChanges aufruft.
es: Indica si se realiza Fill con una llamada a DataRow.AcceptChanges.
fr: Indique si Fill appelle DataRow.AcceptChanges.
it: Indica se Fill chiamerà o meno DataRow.AcceptChanges.
ja: Fill が DataRow.AcceptChanges を呼び出すかどうかを示します。
ko: Fill에서 DataRow.AcceptChanges를 호출할지 여부를 지정합니다.
pt_br: Se Fill chamará ou não DataRow.AcceptChanges.
ru: Будет ли Fill вызывать DataRow.AcceptChanges.
zh_hans: Fill 是否调用 DataRow.AcceptChanges。
zh_hant: Fill 是否將呼叫 DataRow.AcceptChanges。

# DataAdapter_AcceptChangesDuringUpdate
source: Whether or not Update will call DataRow.AcceptChanges.
de: Gibt an, ob DataRow.AcceptChanges von Update aufgerufen wird.
es: Indica si se realiza Update con una llamada a DataRow.AcceptChanges.
fr: Indique si Update appelle DataRow.AcceptChanges.
it: Indica se Update chiamerà o meno DataRow.AcceptChanges.
ja: Update が DataRow.AcceptChanges を呼び出すかどうかを示します。
ko: Update에서 DataRow.AcceptChanges를 호출할지 여부입니다.
pt_br: Se Update chamará ou não DataRow.AcceptChanges.
ru: Будет ли Update вызывать DataRow.AcceptChanges.
zh_hans: Update 将是否调用 DataRow.AcceptChanges。
zh_hant: Update 是否會呼叫 DataRow.AcceptChanges。

# DataAdapter_ContinueUpdateOnError
source: Whether or not to continue to the next DataRow when the Update events, RowUpdating and RowUpdated, Status is UpdateStatus.ErrorsOccurred.
de: Gibt an, ob mit der nächsten DataRow fortgesetzt wird, wenn der Status der Updateereignisse RowUpdating and RowUpdated 'UpdateStatus.ErrorsOccurred' ist.
es: Si puede continuar o no al siguiente DataRow cuando los eventos Update, RowUpdating y RowUpdated y Status es UpdateStatus.ErrorsOccurred.
fr: Indique s'il faut aller au DataRow suivant lorsque Status égale UpdateStatus.ErrorsOccurred pour les événements Update, RowUpdating et RowUpdated.
it: Indica se continuare o meno con il DataRow successivo quando si verificano gli eventi Update, RowUpdating e RowUpdated. Status è UpdateStatus.ErrorsOccurred.
ja: Update イベント、RowUpdating および RowUpdated Status が UpdateStatus.ErrorsOccurred のとき、次の DataRow に進むかどうかを指示します。
ko: Update 이벤트, RowUpdating과 RowUpdated, 그리고 Status가 UpdateStatus.ErrorsOccurred인 경우에 다음 DataRow로 이동할지 여부를 결정합니다.
pt_br: Indica se deve ou não continuar com a DataRow seguinte quando o Status dos eventos Update (RowUpdating e RowUpdated) for UpdateStatus.ErrorsOccurred.
ru: Переходить ли к следующему DataRow, когда при выполнении Update после событий RowUpdating и RowUpdated возникает Status: UpdateStatus.ErrorsOccurred.
zh_hans: 当 Update 事件(RowUpdating 和 RowUpdated)的 Status 是 UpdateStatus.ErrorsOccurred 时，是否继续到下一个 DataRow。
zh_hant: 當 Update 事件 (RowUpdating 和 RowUpdated) 的 Status 為 UpdateStatus.ErrorsOccurred 時，是否要繼續執行下一個 DataRow。

# DataAdapter_FillLoadOption
source: How the adapter fills the DataTable from the DataReader.
de: Bestimmt, wie der Adapter die DataTable aus dem DataReader auffüllt.
es: Cómo rellena el adaptador la tabla DataTable de DataReader.
fr: Indique comment l'adaptateur remplit DataTable à partir de DataReader.
it: Indica il modo in cui l'adattatore riempirà la DataTable dal DataReader.
ja: アダプターが DataReader から DataTable に値を読み込む方法を示します。
ko: 어댑터가 DataReader에서 DataTable을 채우는 방법입니다.
pt_br: Como o adaptador preenche DataTable de DataReader.
ru: Как адаптер заполняет DataTable из DataReader.
zh_hans: 适配器从 DataReader 填充 DataTable 的方式。
zh_hant: 配接器如何從 DataReader 填滿 DataTable。

# DataAdapter_MissingMappingAction
source: The action taken when a table or column in the TableMappings is missing.
de: Die Aktion, die unternommen wird, wenn eine Tabelle oder Spalte in TableMappings fehlt.
es: Acción realizada cuando falta una tabla o una columna en TableMappings.
fr: L'action entreprise lorsqu'une table ou une colonne de TableMappings manque.
it: Azione intrapresa quando manca una tabella o una colonna di TableMappings.
ja: TableMappings にテーブルまたは列が見つからない場合に実行する動作です。
ko: TableMappings의 테이블 또는 열이 없는 경우 수행되는 작업입니다.
pt_br: A ação tomada quando uma tabela ou coluna de TableMappings estiver ausente.
ru: Действие, выполняемое при отсутствии таблицы или столбца в TableMappings.
zh_hans: 当 TableMappings 中缺少表或列时将采取的措施。
zh_hant: 當在 TableMappings 中的資料表或資料行遺漏時所採取的動作。

# DataAdapter_MissingSchemaAction
source: The action taken when a table or column in the DataSet is missing.
de: Die Aktion, die unternommen wird, wenn eine Tabelle oder Spalte im DataSet fehlt.
es: Acción realizada cuando falta una tabla o una columna en DataSet.
fr: L'action entreprise lorsqu'une table ou une colonne dans DataSet manque.
it: Azione intrapresa quando manca una tabella o una colonna del DataSet.
ja: DataSet にテーブルまたは列が見つからない場合に実行する動作です。
ko: DataSet의 테이블 또는 열이 없는 경우 수행되는 작업입니다.
pt_br: A ação tomada quando uma tabela ou coluna de DataSet estiver ausente.
ru: Действие, выполняемое при отсутствии таблицы или столбца в DataSet.
zh_hans: 当 DataSet 中缺少表或列时将采取的措施。
zh_hant: 當在 DataSet 中的資料表或資料行遺漏時所採取的動作。

# DataAdapter_TableMappings
source: How to map source table to DataSet table.
de: Zeigt, wie eine Quelltabelle einer DataSet-Tabelle zugeordnet wird.
es: Cómo asignar la tabla de origen a la tabla de DataSet.
fr: Comment mapper une table source à une table DataSet.
it: Indica come effettuare il mapping di una tabella di origine sulla tabella DataSet.
ja: ソース テーブルを DataSet テーブルにどのように割り当てるかを指定します。
ko: DataSet 테이블에 소스 테이블을 매핑하는 방법을 지정합니다.
pt_br: Como mapear a tabela de origem para a tabela de DataSet.
ru: Как исходная таблица отображается в таблицу DataSet.
zh_hans: 如何将源表映射到 DataSet 表。
zh_hant: 如何將來源資料表對應至 DataSet 資料表。
