Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_InvalidSignatureInEncryptedCEKCsp
source: The specified encrypted column encryption key's signature length: {0} does not match the signature length: {1} when using column master key (asymmetric key) in '{2}'. The encrypted column encryption key may be corrupt, or the specified Microsoft cryptographic service provider (CSP) path may be incorrect.
de: Die angegebene Länge {0} der Signatur des Verschlüsselungsschlüssels der verschlüsselten Spalte stimmt nicht mit der Länge {1} der Signatur überein, wenn der Masterschlüssel der Spalte (asymmetrischer Schlüssel) in '{2}' verwendet wird. Der Verschlüsselungsschlüssel der verschlüsselten Spalte ist ggf. fehlerhaft, oder der angegebene Microsoft CSP-Pfad (Cryptographic Service Provider, Kryptografiedienstanbieter) ist ggf. falsch.
es: La longitud de la firma de clave de cifrado de la columna cifrada especificada {0} no coincide con la longitud de la firma {1} al usar la clave maestra de la columna (clave asimétrica) en '{2}'. La clave de cifrado de la columna cifrada puede estar dañada o la ruta especificada del proveedor de servicios criptográficos (CSP) de Microsoft puede no ser correcta.
fr: La longueur de la signature de la clé de chiffrement de la colonne chiffrée spécifiée {0} ne correspond pas à la longueur de la signature {1} lors de l'utilisation de la clé principale de la colonne (clé asymétrique) dans '{2}'. La clé de chiffrement de la colonne chiffrée est peut-être endommagée ou le chemin d'accès du fournisseur de service de chiffrement Microsoft spécifié est peut-être incorrect.
it: La lunghezza {0} della firma della chiave di crittografia di colonna crittografata specificata non corrisponde alla lunghezza {1} della firma quando si usa la chiave master di colonna (chiave asimmetrica) in '{2}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato per il provider del servizio di crittografia (CSP) Microsoft potrebbe essere errato.
ja: 指定された暗号化列の暗号化キーの署名の長さ: {0} が、'{2}' にある列マスター キー (非対称キー) を使った署名の長さ: {1} と一致しません 。暗号化列の暗号化キーが壊れているか、指定された Microsoft 暗号化サービス プロバイダー (CSP) のパスが正しくない可能性があります。
ko: '{2}'의 열 마스터 키(비대칭 키)를 사용할 때 지정한 암호화된 열 암호화 키의 서명 길이 {0}이(가) 서명 길이 {1}과(와) 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정된 Microsoft CSP(암호화 서비스 공급자) 경로가 잘못되었을 수 있습니다.
pt_br: O tamanho da assinatura de chave de criptografia da coluna criptografada especificada: {0} não corresponde ao tamanho da assinatura: {1} ao usar a chave mestra da coluna (chave assimétrica) em '{2}'. A chave de criptografia da coluna criptografada pode estar corrompida ou o caminho de CSP (Provedor de Serviços de Criptografia) da Microsoft pode estar incorreto.
ru: Указанная длина подписи ({0}) ключа шифрования зашифрованного столбца не соответствует длине подписи ({1}) при использовании главного ключа столбца (асимметричного ключа) в "{2}". Ключ шифрования зашифрованного столбца может быть поврежден, или указанный путь к поставщику служб шифрования Microsoft (CSP) может быть неверным.
zh_hans: 使用 {2} 中的列主密钥(非对称密钥)时，指定的已加密列加密密钥的签名长度 {0} 与签名长度 {1} 不匹配。已加密列加密密钥可能已损坏，或指定的 Microsoft 加密服务提供程序(CSP)路径可能不正确。
zh_hant: 使用 '{2}' 中的資料行主要金鑰 (非對稱金鑰) 時，指定之加密資料行加密金鑰的特徵標記長度 {0} 不符合特徵標記長度 {1}。可能是加密資料行加密金鑰已毀損，或指定的 Microsoft 密碼編譯服務提供者 (CSP) 路徑不正確。

# TCE_InvalidSignatureInEncryptedCEKCng
source: The specified encrypted column encryption key's signature length: {0} does not match the signature length: {1} when using column master key (asymmetric key) in '{2}'. The encrypted column encryption key may be corrupt, or the specified Microsoft Cryptography API: Next Generation (CNG) provider path may be incorrect.
de: Die angegebene Länge {0} der Signatur des Verschlüsselungsschlüssels der verschlüsselten Spalte stimmt nicht mit der Länge {1} der Signatur überein, wenn der Masterschlüssel der Spalte (asymmetrischer Schlüssel) in '{2}' verwendet wird. Der Verschlüsselungsschlüssel der verschlüsselten Spalte ist ggf. fehlerhaft, oder der Pfad des angegebenen Microsoft CNG-Anbieters (Cryptography API Next Generation) ist ggf. falsch.
es: La longitud de la firma de clave de cifrado de la columna cifrada especificada {0} no coincide con la longitud de la firma {1} al usar la clave maestra de la columna (clave asimétrica) en '{2}'. La clave de cifrado de la columna cifrada puede estar dañada o la ruta especificada del proveedor Cryptography API: Next Generation (CNG) de Microsoft puede no ser correcta.
fr: La longueur de la signature de la clé de chiffrement de la colonne chiffrée spécifiée {0} ne correspond pas à la longueur de la signature {1} lors de l'utilisation de la clé principale de la colonne (clé asymétrique) dans '{2}'. La clé de chiffrement de la colonne chiffrée est peut-être endommagée ou le chemin d'accès du fournisseur CNG de l'API de chiffrement Microsoft spécifié est peut-être incorrect.
it: La lunghezza {0} della firma della chiave di crittografia di colonna crittografata specificata non corrisponde alla lunghezza {1} della firma quando si usa la chiave master di colonna (chiave asimmetrica) in '{2}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato per il provider dell'API Criptography Next Generation (CNG) Microsoft potrebbe essere errato.
ja: 指定された暗号化列の暗号化キーの署名の長さ: {0} が、'{2}' にある列マスター キー (非対称キー) を使った署名の長さ: {1} と一致しません 。暗号化列の暗号化キーが壊れているか、指定された Microsoft Cryptography API: Next Generation (CNG) プロバイダーのパスが正しくない可能性があります。
ko: '{2}'의 열 마스터 키(비대칭 키)를 사용할 때 지정한 암호화된 열 암호화 키의 서명 길이 {0}이(가) 서명 길이 {1}과(와) 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정된 Microsoft CNG(Cryptography API: Next Generation) 공급자 경로가 잘못되었을 수 있습니다.
pt_br: O tamanho da assinatura de chave de criptografia da coluna criptografada especificada: {0} não corresponde ao tamanho da assinatura: {1} ao usar a chave mestra da coluna (chave assimétrica) em '{2}'. A chave de criptografia da coluna criptografada pode estar corrompida ou o caminho do provedor CNG (Cryptography API: Next Generation) da Microsoft pode estar incorreto.
ru: Указанная длина подписи ({0}) ключа шифрования зашифрованного столбца не соответствует длине подписи ({1}) при использовании главного ключа столбца (асимметричного ключа) в "{2}". Ключ шифрования зашифрованного столбца может быть поврежден, или указанный путь к поставщику Microsoft Cryptography API: Next Generation (CNG) может быть неверным.
zh_hans: 使用 {2} 中的列主密钥(非对称密钥)时，指定的已加密列加密密钥的签名长度 {0} 与签名长度 {1} 不匹配。已加密列加密密钥可能已损坏，或指定的 Microsoft API 下一代加密技术(CNG)提供程序路径可能不正确。
zh_hant: 使用 '{2}' 中的資料行主要金鑰 (非對稱金鑰) 時，指定之加密資料行加密金鑰的特徵標記長度 {0} 不符合特徵標記長度 {1}。可能是加密資料行加密金鑰已毀損，或指定的 Microsoft 密碼編譯 API: 新一代密碼編譯 (CNG) 路徑不正確。

# TCE_InvalidCertificateSignature
source: The specified encrypted column encryption key signature does not match the signature computed with the column master key (certificate) in '{0}'. The encrypted column encryption key may be corrupt, or the specified path may be incorrect.
de: Die angegebene Verschlüsselungsschlüsselsignatur der verschlüsselten Spalte entspricht nicht der Signatur, die mit dem Spaltenhauptschlüssel (Zertifikat) in '{0}' berechnet wurde. Der Verschlüsselungsschlüssel der verschlüsselten Spalte ist möglicherweise beschädigt, oder der angegebene Pfad ist falsch.
es: La firma de clave de cifrado de columna cifrada especificada no coincide con la firma calculada con la clave maestra de columna (certificado) en "{0}". Puede que la clave de cifrado de la columna cifrada esté dañada o que la ruta del certificado especificada no sea correcta.
fr: La signature de clé de chiffrement de colonne chiffrée ne correspond pas à la signature calculée avec la clé principale de colonne (certificat) dans « {0} ». Il se peut que la clé de chiffrement de colonne chiffrée soit endommagée ou que le chemin d’accès spécifié soit incorrect.
it: La firma della chiave di crittografia di colonna crittografata specificata non corrisponde a quella calcolata con la chiave master di colonna (certificato) in '{0}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato potrebbe essere errato.
ja: 指定した暗号化された列暗号化キーの署名が、'{0}' にある列マスター キー (証明書) を使って計算された署名と一致しません 。暗号化された列暗号化キーが壊れているか、指定されたパスが正しくない可能性があります。
ko: 지정한 암호화된 열 암호화 키 서명이 '{0}'의 열 마스터 키(인증서)를 사용하여 계산된 서명과 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정한 경로가 올바르지 않을 수 있습니다.
pt_br: A assinatura da chave de criptografia especificada na coluna criptografada não corresponde à assinatura calculada pela chave mestra da coluna (certificado) em '{0}'. A chave de criptografia da coluna criptografada pode estar corrompida ou o caminho especificado pode estar errado.
ru: Подпись указанного ключа шифрования зашифрованного столбца не совпадает с подписью, вычисленной с помощью главного ключа столбца (сертификата) в "{0}". Ключ шифрования зашифрованного столбца может быть поврежден или неверно указан путь.
zh_hans: 指定的加密列的加密密钥签名与“{0}”中使用的列的主密钥(证书)计算的签名不匹配。加密列的加密密钥可能已损坏，或指定的证书路径可能不正确。
zh_hant: 指定的加密資料行加密金鑰簽章，不符合從 '{0}' 中資料行主要金鑰 (憑證) 計算所得的簽章。可能是該加密資料行加密金鑰已損毀，或指定的路徑不正確。

# TCE_InvalidSignature
source: The specified encrypted column encryption key signature does not match the signature computed with the column master key (asymmetric key) in '{0}'. The encrypted column encryption key may be corrupt, or the specified path may be incorrect.
de: Die angegebene Signatur des Verschlüsselungsschlüssels der verschlüsselten Spalte stimmt nicht mit dem Masterschlüssel der Spalte (asymmetrischer Schlüssel) in '{0}' überein. Der Verschlüsselungsschlüssel der verschlüsselten Spalte ist ggf. fehlerhaft, oder der angegebene Pfad ist ggf. falsch.
es: La firma de clave de cifrado de la columna cifrada especificada no coincide con la firma calculada mediante la clave maestra de la columna (clave asimétrica) en '{0}'. La clave de cifrado de la columna cifrada puede estar dañada o la ruta especificada puede no ser correcta.
fr: La signature de la clé de chiffrement de la colonne chiffrée spécifiée ne correspond pas à la signature calculée avec la clé principale de la colonne (clé asymétrique) dans '{0}'. La clé de chiffrement de la colonne chiffrée est peut-être endommagée ou le chemin d'accès spécifié est peut-être incorrect.
it: La firma della chiave di crittografia di colonna crittografata specificata non corrisponde a quella calcolata con la chiave master di colonna (chiave asimmetrica) in '{0}'. La chiave di crittografia di colonna crittografata potrebbe essere danneggiata oppure il percorso specificato potrebbe essere errato.
ja: 指定された暗号化列の暗号化キーの署名が、'{0}' にある列マスター キー (非対称キー) を使って計算された署名と一致しません 。暗号化列の暗号化キーが壊れているか、指定されたパスが正しくない可能性があります。
ko: 지정한 암호화된 열 암호화 키 서명이 '{0}'에 있는 열 마스터 키(비대칭 키)로 계산된 서명과 일치하지 않습니다. 암호화된 열 암호화 키가 손상되었거나 지정된 경로가 잘못되었을 수 있습니다.
pt_br: A assinatura de chave de criptografia da coluna criptografada especificada não corresponde à assinatura computada com a chave mestra da coluna (chave assimétrica) em '{0}'. A chave de criptografia da coluna criptografada pode estar corrompida ou o caminho especificado pode estar incorreto.
ru: Указанная подпись ключа шифрования зашифрованного столбца не соответствует подписи, вычисленной с помощью главного ключа шифрования (асимметричного ключа) в "{0}". Ключ шифрования зашифрованного столбца может быть поврежден, или указанный путь может быть неверным.
zh_hans: 指定的已加密列加密密钥签名与通过“{0}”中的列主密钥(非对称密钥)计算出的签名不匹配。已加密列加密密钥可能已损坏，或指定路径可能不正确。
zh_hant: 指定的加密資料行加密金鑰特徵標記長度，不符合 '{0}' 中由資料行主要金鑰 (非對稱金鑰) 計算而來的特徵標記長度。可能是因為加密資料行加密金鑰已毀損，或指定的路徑不正確。

# TCE_CertificateWithNoPrivateKey
source: Certificate specified in key path '{0}' does not have a private key to encrypt a column encryption key. Verify the certificate is imported correctly.
de: Unter dem Schlüsselpfad '{0}' festgelegtes Zertifikat verfügt nicht über einen privaten Schlüssel zur Verschlüsselung eines Spaltenverschlüsselungsschlüssels. Stellen Sie sicher, dass das Zertifikat korrekt importiert wurde.
es: El certificado especificado en la ruta de claves "{0}" no tiene una clave privada para cifrar una clave de cifrado de columnas. Compruebe que el certificado se ha importado correctamente.
fr: Le certificat spécifié dans le chemin d’accès à la clé « {0} » ne dispose pas d’une clé privée permettant de chiffrer une clé de chiffrement de colonne. Assurez-vous que le certificat a été importé correctement.
it: Il certificato specificato nel percorso chiave '{0}' non include una chiave privata per crittografare una chiave di crittografia di colonna. Verificare che il certificato sia stato importato correttamente.
ja: キーのパス '{0}' で指定された証明書には、列暗号化キーを暗号化する秘密キーがありません。証明書が正常にインポートされていることを確認してください。
ko: 키 경로 '{0}'의 지정된 인증서에 열 암호화 키를 암호화할 개인 키가 없습니다. 인증서를 올바로 가져왔는지 확인하세요.
pt_br: O certificado especificado no caminho da chave '{0}' não tem uma chave privada para criptografar uma chave de criptografia de coluna. Verifique se que o certificado for importado corretamente.
ru: У сертификата, указанного в пути ключа "{0}", отсутствует закрытый ключ для шифрования ключа шифрования столбца. Убедитесь, что сертификат был импортирован правильно.
zh_hans: 密钥路径“{0}”中指定的证书没有用于加密列加密密钥的私钥。验证证书是否正确导入。
zh_hant: 金鑰路徑 '{0}' 中所指定的憑證沒有可將資料行加密金鑰加密的私密金鑰。請確認憑證已正確匯入。

# TCE_CertificateWithNoPrivateKeySysErr
source: Certificate specified in key path '{0}' does not have a private key to decrypt a column encryption key. Verify the certificate is imported correctly.
de: Unter dem Schlüsselpfad '{0}' festgelegtes Zertifikat verfügt nicht über einen privaten Schlüssel zur Entschlüsselung eines Spaltenverschlüsselungsschlüssels. Stellen Sie sicher, dass das Zertifikat korrekt importiert wurde.
es: El certificado especificado en la ruta de claves "{0}" no tiene una clave privada para descifrar una clave de cifrado de columna. Compruebe que el certificado se ha importado correctamente.
fr: Le certificat spécifié dans le chemin d’accès à la clé « {0} » ne dispose pas d’une clé privée permettant de déchiffrer une clé de chiffrement de colonne. Assurez-vous que le certificat a été importé correctement.
it: Il certificato specificato nel percorso chiave '{0}' non include una chiave privata per decrittografare una chiave di crittografia di colonna. Verificare che il certificato sia stato importato correttamente.
ja: キーのパス '{0}' で指定された証明書には、列暗号化キーを暗号化解除する秘密キーがありません。証明書が正常にインポートされていることを確認してください。
ko: 키 경로 '{0}'의 지정된 인증서에 열 암호화 키의 암호를 해독할 개인 키가 없습니다. 인증서를 올바로 가져왔는지 확인하세요.
pt_br: O certificado especificado no caminho da chave '{0}' não tem uma chave privada para descriptografar uma chave de criptografia de coluna. Verifique se que o certificado for importado corretamente.
ru: У сертификата, указанного в пути ключа "{0}", отсутствует закрытый ключ для расшифровки ключа шифрования столбца. Убедитесь, что сертификат был импортирован правильно.
zh_hans: 密钥路径“{0}”中指定的证书没有用于解密列加密密钥的私钥。验证证书是否正确导入。
zh_hant: 金鑰路徑 '{0}' 中所指定的憑證沒有可將資料行加密金鑰解密的私密金鑰。請確認憑證已正確匯入。

# TCE_NullColumnEncryptionKeySysErr
source: Internal error. Column encryption key cannot be null.
de: Interner Fehler. Spaltenverschlüsselungsschlüssel darf nicht NULL sein.
es: Error interno. La clave de cifrado de columnas no puede ser nula.
fr: Erreur interne. La clé de chiffrement de colonne ne peut pas avoir la valeur null.
it: Errore interno. La chiave di crittografia di colonna non può essere Null.
ja: 内部エラー。列暗号化キーを Null にすることはできません。
ko: 내부 오류입니다. 열 암호화 키는 null일 수 없습니다.
pt_br: Erro interno. A chave de criptografia da coluna não pode ser nula.
ru: Внутренняя ошибка. Ключ шифрования столбца не может иметь значение Null.
zh_hans: 内部错误。列加密密钥不能为 null。
zh_hant: 內部錯誤。資料行加密金鑰不能是 Null。

# TCE_InvalidKeySize
source: The column encryption key has been successfully decrypted but it's length: {1} does not match the length: {2} for algorithm '{0}'. Verify the encrypted value of the column encryption key in the database.
de: Der Spaltenverschlüsselungsschlüssel wurde erfolgreich entschlüsselt. Seine Länge von {1} entspricht jedoch nicht der Länge von {2} für den Algorithmus '{0}'. Prüfen Sie den verschlüsselten Wert des Spaltenverschlüsselungsschlüssels in der Datenbank.
es: La clave de cifrado de columna se ha descifrado correctamente, pero su longitud ({1}) no coincide con la longitud ({2}) del algoritmo "{0}". Compruebe el valor cifrado de la clave de cifrado de columna en la base de datos.
fr: La clé de chiffrement de colonne a bien été déchiffrée, mais sa longueur {1} ne correspond pas à la longueur {2} de l’algorithme « {0} ». Vérifiez la valeur chiffrée de la clé de chiffrement de colonne dans la base de données.
it: La chiave di crittografia di colonna è stata decrittografata ma la relativa lunghezza {1} non corrisponde alla lunghezza {2} per l'algoritmo '{0}'. Verificare il valore crittografato della chiave di crittografia di colonna nel database.
ja: 列暗号化キーは正常に暗号化解除されましたが、その長さ {1} がアルゴリズム '{0}' の長さ {2} と一致しません。データベースにある列暗号化キーの暗号化された値を確認してください。
ko: 열 암호화 키의 암호가 해독되었지만 길이 {1}이(가) '{0}' 알고리즘에 대한 길이 {2}과(와) 일치하지 않습니다. 데이터베이스에서 열 암호화 키의 암호화된 값을 확인하세요.
pt_br: A chave de criptografia da coluna criptografada foi descriptografada com sucesso, mas seu comprimento {1} não corresponde ao comprimento {2} do algoritmo '{0}'. Verifique o valor criptografado da chave de criptografia de coluna no banco de dados.
ru: Ключ шифрования столбца успешно расшифрован, но его длина ({1}) не совпадает с длиной ({2}) для алгоритма "{0}". Проверьте зашифрованное значение ключа шифрования столбца в базе данных.
zh_hans: 列加密密钥已成功解密，但其长度“{1}”与算法“{0}”的长度“{2}”不匹配。请验证数据库中列加密密钥的加密值。
zh_hant: 已成功解密資料行加密金鑰，但其長度 {1} 不符合演算法 '{0}' 的長度 {2}。請確認資料庫中該資料行加密金鑰的加密值。

# TCE_InvalidEncryptionType
source: Encryption type '{1}' specified for the column in the database is either invalid or corrupted. Valid encryption types for algorithm '{0}' are: {2}.
de: Der für die Spalte in der Datenbank festgelegte Verschlüsselungstyp '{1}' ist entweder ungültig oder beschädigt. Gültige Verschlüsselungstypen für den Algorithmus '{0}' sind: {2}.
es: El tipo de cifrado "{1}" especificado para la columna en la base de datos no es válido o está corrupto. Los tipos de cifrado válidos para el algoritmo "{0}" son: {2}.
fr: Le type de chiffrement « {1} » spécifié pour la colonne dans la base de données n’est pas valide ou est endommagé. Les types de chiffrement valides pour l’algorithme « {0} » sont : {2}.
it: Il tipo di crittografia '{1}' specificato per la colonna nel database non è valido oppure è danneggiato. I tipi di crittografia validi per l'algoritmo '{0}' sono: {2}.
ja: データベースの列に指定された暗号化の種類 '{1}' は、無効か破損しています。アルゴリズム '{0}' に対して有効な暗号化の種類は {2} です。
ko: 데이터베이스의 열에 대해 지정된 암호화 유형 '{1}'이(가) 잘못되었거나 손상되었습니다. '{0}' 알고리즘에 대해 유효한 암호화 유형은 {2}입니다.
pt_br: O tipo de criptografia '{1}' especificado para a coluna no banco de dados é inválido ou está corrompido. Os tipos de criptografia válidos para o algoritmo '{0}' são: {2}.
ru: Тип шифрования "{1}", указанный для столбца в базе данных, недействителен или поврежден. Следующие типы шифрования являются допустимыми для алгоритма "{0}": {2}
zh_hans: 为数据库中的列指定的加密类型“{1}”无效或已损坏。算法“{0}”的有效加密类型是: {2}。
zh_hant: 為資料庫中資料行指定的加密類型 '{1}' 無效或已損毀。演算法 '{0}' 的有效加密類型為: {2}

# TCE_NullPlainText
source: Internal error. Plaintext value cannot be null.
de: Interner Fehler. Wert für Klartext darf nicht NULL sein.
es: Error interno. El valor de texto no cifrado no puede ser nulo.
fr: Erreur interne. La valeur en texte en clair ne peut pas être null.
it: Errore interno. Il valore del testo normale non può essere Null.
ja: 内部エラー。プレーンテキストの値を Null にすることはできません。
ko: 내부 오류입니다. 일반 텍스트 값은 null일 수 없습니다.
pt_br: Erro interno. O valor de texto sem formatação não pode ser nulo.
ru: Внутренняя ошибка. Открытый текст не может иметь значение Null.
zh_hans: 内部错误。纯文本值不能为 null。
zh_hant: 內部錯誤。Plaintext 值不能是 Null。

# TCE_VeryLargeCiphertext
source: Cannot encrypt. Encrypting resulted in {0} bytes of ciphertext which exceeds the maximum allowed limit of {1} bytes. The specified plaintext value is likely too large (plaintext size is: {2} bytes).
de: Verschlüsselung nicht möglich. Die Verschlüsselung ergab {0} Bytes an Chiffretext, womit der maximal mögliche Wert von {1} Bytes überschritten ist. Der angegebene Klartextwert ist wahrscheinlich zu groß (Klartextgröße ist: {2} Bytes).
es: No se puede cifrar. El cifrado dio como resultado {0} bytes de texto cifrado, lo que supera el límite máximo permitido de {1} bytes. Probablemente, el valor de texto sin cifrar especificado es demasiado grande (tamaño de texto sin cifrar: {2} bytes).
fr: Impossible d’effectuer le chiffrement. À l’issue du chiffrement, {0} octets de texte de chiffrement dépassent la limite maximale autorisée de {1} octets. La valeur en texte clair spécifiée est probablement trop grande (taille du texte en clair : {2} octets).
it: Non è possibile crittografare. In seguito alla crittografia sono stati restituiti {0} byte di testo crittografato oltre il limite massimo consentito pari a {1} byte. Il valore del testo normale specificato è probabilmente troppo grande (dimensioni del testo normale: {2} byte).
ja: 暗号化できません。暗号化の結果、暗号化テキストが {0} バイトになりました。これは、最大許容サイズの {1} バイトを超えています。指定されたプレーンテキストの値が大きすぎる可能性があります (プレーンテキストのサイズは {2} バイトです)。
ko: 암호화할 수 없습니다. 암호화로 허용되는 제한인 {1}바이트를 초과하는 {0}바이트의 암호 텍스트가 생성되었습니다. 지정된 일반 텍스트 값은 너무 큰 것 같습니다(일반 텍스트 크기: {2}바이트).
pt_br: Não é possível criptografar. A criptografia resultou em {0} bytes de texto cifrado que excedem o limite máximo permitido de {1} bytes. O valor especificado em texto sem formatação provavelmente é muito grande (tamanho de texto sem formatação é: {2} bytes).
ru: Не удается зашифровать. В результате шифрования было создано {0} байт зашифрованных данных, что превышает максимально допустимое значение, равное {1} байтам. Указанное значение открытого текста вероятнее всего превышает максимально допустимый размер (размер открытого текста: {2} байт).
zh_hans: 无法加密。加密生成了 {0} 字节的已加密文本，该大小超出允许的最大限制({1} 字节)。指定纯文本值可能太大(纯文本大小是: {2} 字节)。
zh_hant: 無法加密。加密結果為 {0} 個位元組的 ciphertext，這超出了 {1} 個位元組的允許上限。指定的 plaintext 值可能太大 (plaintext 大小為: {2} 個位元組)。

# TCE_NullCipherText
source: Internal error. Ciphertext value cannot be null.
de: Interner Fehler. Wert des Chiffretexts darf nicht NULL sein.
es: Error interno. El valor del texto cifrado no puede ser nulo.
fr: Erreur interne. La valeur du texte de chiffrement ne peut pas être null.
it: Errore interno. Il valore del testo crittografato non può essere Null.
ja: 内部エラー。暗号化テキストの値を Null にすることはできません。
ko: 내부 오류입니다. 암호 텍스트 값은 null일 수 없습니다.
pt_br: Erro interno. O valor do texto sem formatação não pode ser nulo.
ru: Внутренняя ошибка. Зашифрованные данные не могут иметь значение Null.
zh_hans: 内部错误。已加密文本值不能为 null。
zh_hant: 內部錯誤。Ciphertext 值不能是 Null。
