Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_MissingTableMapping
source: Missing SourceTable mapping: '{0}'
de: Fehlende SourceTable-Zuordnung: '{0}'
es: Falta la asignación de SourceTable: '{0}'
fr: Mappage SourceTable manquant : '{0}'
it: Mapping di SourceTable mancante: '{0}'
ja: SourceTable マップ : '{0}' が見つかりません。
ko: SourceTable 매핑이 없습니다. '{0}'
pt_br: Mapeamento de SourceTable inexistente: '{0}'
ru: Отсутствует сопоставление для SourceTable: "{0}"
zh_hans: 缺少 SourceTable 映射:“{0}”
zh_hant: 遺漏 SourceTable 對應: '{0}'

# ADP_CommandTextRequired
source: {0}: CommandText property has not been initialized
de: {0}: CommandText-Eigenschaft wurde nicht initialisiert.
es: {0}: no se ha inicializado la propiedad CommandText
fr: {0} : la propriété CommandText n'a pas été initialisée
it: {0}: la proprietà CommandText non è stata inizializzata
ja: {0}: CommandText プロパティは初期化されていません。
ko: {0}: CommandText 속성이 초기화되지 않았습니다.
pt_br: {0}: propriedade CommandText não foi inicializada
ru: {0}: Свойство CommandText не инициализировано
zh_hans: {0}: CommandText 属性尚未初始化
zh_hant: {0}: CommandText 屬性尚未初始化

# ADP_ConnectionRequired
source: {0}: Connection property has not been initialized.
de: {0}: Connection-Eigenschaft wurde nicht initialisiert.
es: {0}: la propiedad Connection no se ha inicializado.
fr: {0} : la propriété Connection n'a pas été initialisée.
it: {0}: la proprietà Connection non è stata inizializzata.
ja: {0}: Connection プロパティは初期化されていません。
ko: {0}: Connection 속성이 초기화되지 않았습니다.
pt_br: {0}: propriedade Connection não foi inicializada.
ru: {0}: Свойство Connection не инициализировано.
zh_hans: {0}: Connection 属性尚未初始化。
zh_hant: {0}: Connection 屬性尚未初始化。

# ADP_OpenConnectionRequired
source: {0} requires an open and available Connection. {1}
de: {0} erfordert eine geöffnete und verfügbare Connection. {1}
es: {0} requiere una Connection abierta y disponible. {1}
fr: {0} nécessite une Connection ouverte et disponible. {1}
it: {0} richiede una oggetto Connection aperto e disponibile. {1}
ja: {0} には Connection が開かれていて使用可能なことが必要です。{1}
ko: {0}을(를) 사용하려면 Connection이 열려 있고 사용 가능해야 합니다. {1}
pt_br: {0} requer uma Connection aberta e disponível. {1}
ru: Для {0} нужно открытое и доступное подключение Connection. {1}
zh_hans: {0} 要求已打开且可用的 Connection。{1}
zh_hant: {0} 必須有開啟與可用的 Connection。{1}

# ADP_ConnectionRequired_Fill
source: Fill: SelectCommand.Connection property has not been initialized.
de: Fill: SelectCommand.Connection-Eigenschaft wurde nicht initialisiert.
es: Fill: la propiedad SelectCommand.Connection no se ha inicializado.
fr: Fill : la propriété SelectCommand.Connection n'a pas été initialisée.
it: Fill: la proprietà SelectCommand.Connection non è stata inizializzata.
ja: Fill: SelectCommand.Connection プロパティが初期化されていません。
ko: Fill: SelectCommand.Connection 속성이 초기화되지 않았습니다.
pt_br: Fill: Propriedade SelectCommand.Connection não foi inicializada.
ru: Fill: Свойство SelectCommand.Connection не инициализировано.
zh_hans: Fill: SelectCommand.Connection 属性尚未初始化。
zh_hant: Fill: SelectCommand.Connection 屬性尚未初始化。

# ADP_ConnectionRequired_FillPage
source: FillPage: SelectCommand.Connection property has not been initialized.
de: FillPage: SelectCommand.Connection-Eigenschaft wurde nicht initialisiert.
es: FillPage: la propiedad SelectCommand.Connection no se ha inicializado.
fr: FillPage : la propriété SelectCommand.Connection n'a pas été initialisée.
it: FillPage: la proprietà SelectCommand.Connection non è stata inizializzata.
ja: FillPage: SelectCommand.Connection プロパティが初期化されていません。
ko: FillPage: SelectCommand.Connection 속성이 초기화되지 않았습니다.
pt_br: FillPage: Propriedade SelectCommand.Connection não foi inicializada.
ru: FillPage: Свойство SelectCommand.Connection не инициализировано.
zh_hans: FillPage: SelectCommand.Connection 属性尚未初始化。
zh_hant: FillPage: SelectCommand.Connection 屬性尚未初始化。

# ADP_ConnectionRequired_FillSchema
source: FillSchema: SelectCommand.Connection property has not been initialized.
de: FillSchema: SelectCommand.Connection-Eigenschaft wurde nicht initialisiert.
es: FillSchema: la propiedad SelectCommand.Connection no se ha inicializado.
fr: FillSchema : la propriété SelectCommand.Connection n'a pas été initialisée.
it: FillSchema: la proprietà SelectCommand.Connection non è stata inizializzata.
ja: FillSchema: SelectCommand.Connection プロパティが初期化されていません。
ko: FillSchema: SelectCommand.Connection 속성이 초기화되지 않았습니다.
pt_br: FillSchema: Propriedade SelectCommand.Connection não foi inicializada.
ru: FillSchema: Свойство SelectCommand.Connection не инициализировано.
zh_hans: FillSchema: SelectCommand.Connection 属性尚未初始化。
zh_hant: FillSchema: SelectCommand.Connection 屬性尚未初始化。

# ADP_ConnectionRequired_Insert
source: Update requires the InsertCommand to have a connection object. The Connection property of the InsertCommand has not been initialized.
de: Für ein Update benötigt der InsertCommand ein Verbindungsobjekt. Die Connection-Eigenschaft des InsertCommand wurde nicht initialisiert.
es: La actualización requiere que InsertCommand tenga un objeto de conexión. La propiedad Connection de InsertCommand no se ha inicializado.
fr: Pour la mise à jour, la propriété InsertCommand doit posséder un objet connection. La propriété Connection de InsertCommand n'a pas été initialisée.
it: Update richiede che InsertCommand abbia un oggetto connessione. La proprietà Connection di InsertCommand non è stata inizializzata.
ja: 更新には、InsertCommand に接続オブジェクトを指定する必要があります。InsertCommand の Connection プロパティは初期化されていません。
ko: 업데이트하려면 InsertCommand에 연결 개체가 있어야 합니다. InsertCommand의 Connection 속성이 초기화되지 않았습니다.
pt_br: Atualização requer que InsertCommand tenha um objeto de conexão. A propriedade Connection de InsertCommand não foi inicializada.
ru: Для обновления требуется, чтобы InsertCommand имел объект подключения. Свойство Connection для InsertCommand не инициализировано.
zh_hans: 更新要求 InsertCommand 具有连接对象。InsertCommand 的 Connection 属性尚未初始化。
zh_hant: 更新需要具有連接物件的 InsertCommand。InsertCommand 的 Connection 屬性尚未初始化。

# ADP_ConnectionRequired_Update
source: Update requires the UpdateCommand to have a connection object. The Connection property of the UpdateCommand has not been initialized.
de: Für ein Update benötigt der UpdateCommand ein Verbindungsobjekt. Die Connection-Eigenschaft von UpdateCommand wurde nicht initialisiert.
es: La actualización requiere que UpdateCommand tenga un objeto de conexión. La propiedad Connection de UpdateCommand no se ha inicializado.
fr: UpdateCommand doit avoir un objet connection pour la mise à jour. La propriété Connection de UpdateCommand n'a pas été initialisée.
it: Update richiede che UpdateCommand abbia un oggetto connessione. La proprietà Connection di UpdateCommand non è stata inizializzata.
ja: 更新には、UpdateCommand に接続オブジェクトを指定する必要があります。UpdateCommand の Connection プロパティは初期化されていません。
ko: 업데이트하려면 UpdateCommand에서 연결 개체를 사용해야 합니다. UpdateCommand의 Connection 속성이 초기화되지 않았습니다.
pt_br: A atualização exige que UpdateCommand tenha um objeto de conexão. A propriedade Connection de UpdateCommand não foi inicializada.
ru: Для обновления требуется, чтобы UpdateCommand имел объект подключения. Свойство Connection для UpdateCommand не инициализировано.
zh_hans: 更新要求 UpdateCommand 命令具有连接对象。UpdateCommand 的 Connection 属性尚未初始化。
zh_hant: 更新需要具有連接物件的 UpdateCommand。UpdateCommand 的 Connection 屬性尚未初始化。

# ADP_ConnectionRequired_Delete
source: Update requires the DeleteCommand to have a connection object. The Connection property of the DeleteCommand has not been initialized.
de: Für ein Update benötigt der DeleteCommand ein Verbindungsobjekt. Die Connection-Eigenschaft von DeleteCommand wurde nicht initialisiert.
es: La actualización requiere que DeleteCommand tenga un objeto de conexión. La propiedad Connection de DeleteCommand no se ha inicializado.
fr: DeleteCommand doit avoir un objet connection pour la mise à jour. La propriété Connection de DeleteCommand n'a pas été initialisée.
it: Update richiede che DeleteCommand abbia un oggetto connessione. La proprietà Connection di DeleteCommand non è stata inizializzata.
ja: 更新には、DeleteCommand に接続オブジェクトを指定する必要があります。DeleteCommand の Connection プロパティは初期化されていません。
ko: 업데이트하려면 DeleteCommand에서 연결 개체를 사용해야 합니다. DeleteCommand의 Connection 속성이 초기화되지 않았습니다.
pt_br: A atualização exige que DeleteCommand tenha um objeto de conexão. A propriedade Connection de DeleteCommand não foi inicializada.
ru: Для обновления требуется, чтобы свойство DeleteCommand имело объект подключения. Свойство Connection для DeleteCommand не инициализировано.
zh_hans: 更新要求 DeleteCommand 具有连接对象。该 DeleteCommand 的 Connection 属性尚未初始化。
zh_hant: 更新需要具有連接物件的 DeleteCommand。DeleteCommand 的 Connection 屬性尚未初始化。

# ADP_ConnectionRequired_Batch
source: Update requires a connection object. The Connection property has not been initialized.
de: Für ein Update ist ein Verbindungsobjekt erforderlich. Die Connection-Eigenschaft wurde nicht initialisiert.
es: La actualización requiere un objeto de conexión. La propiedad Connection no se ha inicializado.
fr: Un objet de connexion doit être utilisé pour la mise à jour. La propriété Connection n'a pas été initialisée.
it: Update richiede un oggetto connessione. La proprietà Connection non è stata inizializzata.
ja: 更新には接続オブジェクトが必要ですが、Connection プロパティが初期化されていません。
ko: 업데이트하려면 연결 개체가 필요합니다. Connection 속성이 초기화되지 않았습니다.
pt_br: A atualização exige um objeto de conexão. A propriedade Connection não foi inicializada.
ru: Для обновления требуется объект подключения. Свойство Connection не инициализировано.
zh_hans: 更新要求连接对象。Connection 属性尚未初始化。
zh_hant: 更新需要連接物件。Connection 屬性尚未初始化。

# ADP_ConnectionRequired_Clone
source: Update requires the command clone to have a connection object. The Connection property of the command clone has not been initialized.
de: Für ein Update benötigt der Befehlsklon ein Verbindungsobjekt. Die Connection-Eigenschaft des Befehlsklons wurde nicht initialisiert.
es: La actualización requiere que el clon del comando tenga un objeto de conexión. La propiedad Connection del clon del comando no se ha inicializado.
fr: Le clone de commande a besoin d'un objet connection pour la mise à jour. La propriété Connection du clone de la commande n'a pas été initialisée.
it: Update richiede che il duplicato di comando abbia un oggetto connessione. La proprietà Connection del duplicato di comando non è stata inizializzata.
ja: 更新には、コマンドの複製に接続オブジェクトを指定する必要があります。コマンドの複製の Connection プロパティは初期化されていません。
ko: 업데이트하려면 명령 복제에서 연결 개체를 사용해야 합니다. 명령 복제의 Connection 속성이 초기화되지 않았습니다.
pt_br: A atualização exige que o clone de comando tenha um objeto de conexão. A propriedade Connection do clone de comando não foi inicializada.
ru: Для обновления требуется, чтобы клон команды имел объект подключения. Свойство Connection для клона команды не инициализировано.
zh_hans: 更新要求命令克隆具有连接对象。该命令克隆的 Connection 属性尚未初始化。
zh_hant: 更新需要具有連接物件的命令複製。命令複製的 Connection 屬性尚未初始化。

# ADP_ConnecitonRequired_UpdateRows
source: Update requires a connection.
de: Für ein Update ist eine Verbindung erforderlich.
es: La actualización requiere una conexión.
fr: Une connexion doit être établie pour la mise à jour.
it: Update richiede una connessione.
ja: 更新には接続が必要です。
ko: 업데이트하려면 연결이 필요합니다.
pt_br: A atualização exige conexão.
ru: Для обновления требуется подключение.
zh_hans: 更新要求连接。
zh_hant: 更新需要連接。

# ADP_OpenConnectionRequired_Insert
source: Update requires the {0}Command to have an open connection object. {1}
de: Für ein Update muss der {0}Command über ein geöffnetes Verbindungsobjekt verfügen. {1}
es: Update requiere que {0}Command tenga un objeto de conexión abierta. {1}
fr: {0}Command doit avoir un objet open connection pour Update. {1}
it: Update richiede che {0}Command abbia un oggetto Connection aperto. {1}
ja: Update は {0}Command を使用して、開かれた接続オブジェクトを持つ必要があります。{1}
ko: Update하려면 {0}Command에서 열린 연결 개체를 사용해야 합니다. {1}
pt_br: Update exige que o {0}Command tenha um objeto de conexão aberta. {1}
ru: Для элемента Update требуется, чтобы команда {0}Command имела открытый объект подключения {1}
zh_hans: Update 要求 {0}Command 具有打开的连接对象。{1}
zh_hant: Update 需要具有開啟的連接物件的 {0}Command。{1}

# ADP_OpenConnectionRequired_Update
source: Update requires the {0}Command to have an open connection object. {1}
de: Für ein Update muss der {0}Command über ein geöffnetes Verbindungsobjekt verfügen. {1}
es: Update requiere que {0}Command tenga un objeto de conexión abierta. {1}
fr: {0}Command doit avoir un objet open connection pour Update. {1}
it: Update richiede che {0}Command abbia un oggetto Connection aperto. {1}
ja: Update は {0}Command を使用して、開かれた接続オブジェクトを持つ必要があります。{1}
ko: Update하려면 {0}Command에서 열린 연결 개체를 사용해야 합니다. {1}
pt_br: Update exige que o {0}Command tenha um objeto de conexão aberta. {1}
ru: Для элемента Update требуется, чтобы команда {0}Command имела открытый объект подключения {1}
zh_hans: Update 要求 {0}Command 具有打开的连接对象。{1}
zh_hant: Update 需要具有開啟的連接物件的 {0}Command。{1}

# ADP_OpenConnectionRequired_Delete
source: Update requires the {0}Command to have an open connection object. {1}
de: Für ein Update muss der {0}Command über ein geöffnetes Verbindungsobjekt verfügen. {1}
es: Update requiere que {0}Command tenga un objeto de conexión abierta. {1}
fr: {0}Command doit avoir un objet open connection pour Update. {1}
it: Update richiede che {0}Command abbia un oggetto Connection aperto. {1}
ja: Update は {0}Command を使用して、開かれた接続オブジェクトを持つ必要があります。{1}
ko: Update하려면 {0}Command에서 열린 연결 개체를 사용해야 합니다. {1}
pt_br: Update exige que o {0}Command tenha um objeto de conexão aberta. {1}
ru: Для элемента Update требуется, чтобы команда {0}Command имела открытый объект подключения {1}
zh_hans: Update 要求 {0}Command 具有打开的连接对象。{1}
zh_hant: Update 需要具有開啟的連接物件的 {0}Command。{1}

# ADP_OpenConnectionRequired_Clone
source: Update requires the updating command to have an open connection object. {1}
de: Für ein Update muss der Updatebefehl über ein geöffnetes Verbindungsobjekt verfügen. {1}
es: Update requiere un comando de actualización para tener un objeto de conexión abierta. {1}
fr: La commande de mise à jour doit avoir un objet open connection pour Update. {1}
it: Update richiede che il comando di aggiornamento abbia un oggetto Connection aperto. {1}
ja: Update は更新コマンドを使用して、開かれた接続オブジェクトを持つ必要があります。{1}
ko: Update하려면 업데이트 명령에서 열린 연결 개체를 사용해야 합니다. {1}
pt_br: Update exige que o comando de atualização tenha um objeto de conexão aberta. {1}
ru: Для элемента Update требуется, чтобы команда обновления имела открытый объект подключения. {1}
zh_hans: Update 要求更新命令具有打开的连接对象。{1}
zh_hant: Update 需要具有開啟的連接物件的更新命令。{1}

# ADP_NoStoredProcedureExists
source: The stored procedure '{0}' doesn't exist.
de: Die gespeicherte Prozedur '{0}' ist nicht vorhanden.
es: No existe el procedimiento almacenado '{0}'.
fr: La procédure stockée '{0}' n'existe pas.
it: Stored procedure '{0}' inesistente.
ja: ストアド プロシージャ '{0}' は存在しません。
ko: '{0}' 저장 프로시저가 없습니다.
pt_br: O procedimento armazenado '{0}' não existe.
ru: Сохраненная процедура "{0}" не существует.
zh_hans: 存储过程“{0}”不存在。
zh_hant: 預存程序 '{0}' 不存在。

# ADP_TransactionCompleted
source: The transaction assigned to this command must be the most nested pending local transaction.
de: Die dem Befehl zugewiesene Transaktion muss die geschachtelste lokale Transaktion sein, die ansteht.
es: La transacción asignada a este comando debe ser la transacción local pendiente más anidada.
fr: La transaction assignée à cette commande doit être la transaction locale en attente la plus imbriquée.
it: La transazione assegnata a questo comando deve essere la transazione locale in sospeso più annidata.
ja: このコマンドに割り当てられたトランザクションは、最下層で入れ子にされた保留中のローカル トランザクションでなければなりません。
ko: 이 명령에 할당된 트랜잭션은 최대 중첩된 보류 중인 로컬 트랜잭션이어야 합니다.
pt_br: A transação atribuída a este comando deve ser a transação local pendente mais aninhada.
ru: Транзакция, назначенная этой команде, должна быть отложенной локальной транзакцией с наибольшим уровнем вложенности.
zh_hans: 分配给该命令的事务必须是最深层嵌套的本地挂起事务。
zh_hant: 指派給這個命令的交易必須是最內層的暫止本機交易。

# ADP_TransactionConnectionMismatch
source: The transaction is either not associated with the current connection or has been completed.
de: Die Transaktion ist entweder nicht der aktuellen Verbindung zugeordnet oder wurde abgeschlossen.
es: La transacción no está asociada a la conexión actual o se ha completado.
fr: La transaction n'est pas associée à la connexion en cours ou s'est terminée.
it: La transazione non è associata alla connessione corrente oppure è stata completata.
ja: トランザクションが、現在の接続に関連付けられていないか、完了していません。
ko: 트랜잭션이 현재 연결과 연결되어 있지 않거나 완료되었습니다.
pt_br: A transação não está associada à conexão atual ou já foi concluída.
ru: Транзакция не связана текущим соединением или уже завершена.
zh_hans: 事务要么与当前连接无关联，要么已完成。
zh_hant: 交易可能與目前連接無關，或是已完成。

# ADP_TransactionCompletedButNotDisposed
source: The transaction associated with the current connection has completed but has not been disposed. The transaction must be disposed before the connection can be used to execute SQL statements.
de: Die der aktuellen Verbindung zugeordnete Transaktion wurde abgeschlossen, jedoch nicht verworfen. Die Transaktion muss verworfen werden, bevor die Verbindung zum Ausführen von SQL-Anweisungen verwendet werden kann.
es: La transacción asociada con la conexión actual se ha completado, pero no se ha desechado. Debe desecharse antes de utilizar la conexión para ejecutar instrucciones SQL.
fr: La transaction associée à la connexion active est terminée mais n'a pas été supprimée. Pour pouvoir utiliser la transaction pour exécuter des instructions SQL vous devez la supprimer.
it: La transazione associata alla connessione corrente è stata completata, ma non è stata eliminata. Per poter utilizzare la connessione per eseguire istruzioni SQL, è necessario eliminare la transazione.
ja: 現在の接続と関連付けられているトランザクションは完了しましたが、破棄されていません。トランザクションは、接続が SQL ステートメントの実行に使用される前に破棄されなければなりません。
ko: 현재 연결에 연결된 트랜잭션은 완료되었지만 삭제되지 않았습니다. 이 연결이 SQL 문을 실행하는 데 사용될 수 있으려면 먼저 트랜잭션이 삭제되어야 합니다.
pt_br: A transação associada à conexão atual foi concluída, mas não foi descartada. A transação deve ser descartada antes do uso da conexão para executar as instruções SQL.
ru: Транзакция, связанная с текущим соединением, завершена, но не удалена. Это соединение можно будет использовать для выполнения инструкций SQL только после удаления транзакции.
zh_hans: 与当前连接相关联的事务已经完成，但尚未释放。必须先释放该事务，然后才能使用该连接来执行 SQL 语句。
zh_hant: 與目前連接關聯的交易已完成，但尚未處置。必須先處置交易，才能使用連接來執行 SQL 陳述式。

# ADP_TransactionRequired
source: {0} requires the command to have a transaction when the connection assigned to the command is in a pending local transaction. The Transaction property of the command has not been initialized.
de: {0} erfordert, dass der Befehl über eine Transaktion verfügt, wenn die dem Befehl zugewiesene Verbindung eine ausstehende lokale Verbindung ist. Die Transaction-Eigenschaft des Befehls wurde nicht initialisiert.
es: {0} requiere que el comando tenga una transacción cuando la conexión asignada al mismo está en una transacción local pendiente. No se ha inicializado la propiedad Transaction del comando.
fr: {0} implique que la commande comporte une transaction lorsque la connexion attribuée à la commande se trouve dans une transaction locale en attente. La propriété Transaction de la commande n'a pas été initialisée.
it: {0} richiede che il comando abbia una transazione quando la connessione assegnata al comando è in una transazione locale in sospeso. La proprietà Transaction del comando non è stata inizializzata.
ja: {0} は、コマンドに割り当てられた接続が保留状態であるローカルのトランザクションにあるとき、トランザクション オブジェクトを持つコマンドが必要です。コマンドの Transaction プロパティがまだ初期化されていません。
ko: 명령에 할당된 연결이 보류 중인 로컬 트랜잭션에 연결되어 있는 경우 {0}을(를) 사용하려면 트랜잭션이 있어야 합니다. 명령의 Transaction 속성이 초기화되지 않았습니다.
pt_br: {0} requer que o comando tenha uma transação quando a conexão atribuída ao comando estiver em uma transação local pendente. A propriedade Transaction do comando não foi inicializada.
ru: {0} требует, чтобы команда имела транзакцию, если подключение, назначенное команде, находится в отложенной локальной транзакции Свойство Transaction для команды не инициализировано.
zh_hans: 如果分配给命令的连接位于本地挂起事务中，{0} 要求命令拥有事务。命令的 Transaction 属性尚未初始化。
zh_hant: 當指定給命令的連接為擱置的本機交易時，{0} 需要連接以交易。命令的 Transaction 屬性尚未初始化。

# ADP_OpenResultSetExists
source: There is already an open SqlResultSet associated with this command which must be closed first.
de: Diesem Befehl ist bereits ein geöffnetes SqlResultSet zugeordnet, das zuerst geschlossen werden muss.
es: Hay abierto un SqlResultSet asociado a este comando que debe cerrarse antes.
fr: Un SqlResultSet associé à cette commande est déjà ouvert. Il doit d'abord être fermé.
it: Al comando è già associato un SqlResultSet aperto, che deve essere chiuso.
ja: このコマンドに関連付けられている SqlResultSet が既に開かれています。これを先に閉じる必要があります。
ko: 이 명령과 연결된 SqlResultSet이 이미 열려 있습니다. 먼저 닫아야 합니다.
pt_br: Já existe um SqlResultSet aberto associado a este comando que deve ser fechado primeiro.
ru: Существует назначенный этой команде открытый SqlResultSet, который требуется предварительно закрыть.
zh_hans: 已有一个打开的 SqlResultSet 与必须先关闭的此命令相关联。
zh_hant: 已經開啟一個與這個命令相關的 SqlResultSet，必須先將它關閉。

# ADP_OpenReaderExists
source: There is already an open DataReader associated with this {0} which must be closed first.
de: Diesem Command ist bereits ein geöffneter DataReader zugeordnet, der zuerst geschlossen werden muss.
es: Ya hay un DataReader abierto asociado a este Command, debe cerrarlo primero.
fr: Un DataReader associé à cette Command est déjà ouvert. Il doit d'abord être fermé.
it: A Command è già associato un DataReader aperto, che deve essere chiuso.
ja: この Command に関連付けられている DataReader が既に開かれています。このコマンドを最初に閉じる必要があります。
ko: 이 Command와 연결된 DataReader가 이미 열려 있습니다. 먼저 닫아야 합니다.
pt_br: Já existe um DataReader aberto associado a este Command que deve ser fechado primeiro.
ru: Существует назначенный этой команде Command открытый DataReader, который требуется предварительно закрыть.
zh_hans: 已有打开的与此 Command 相关联的 DataReader，必须首先将它关闭。
zh_hant: 已經開啟一個與這個 Command 相關的 DataReader，必須先將它關閉。

# ADP_DeriveParametersNotSupported
source: {0} DeriveParameters only supports CommandType.StoredProcedure, not CommandType.{1}.
de: {0} DeriveParameters unterstützen nur CommandType.StoredProcedure, nicht CommandType.{1}.
es: {0} DeriveParameters sólo admite CommandType.StoredProcedure, no CommandType.{1}.
fr: DeriveParameters {0} ne prend en charge que CommandType.StoredProcedure, et pas CommandType.{1}.
it: DeriveParameters {0} supporta solo CommandType.StoredProcedure, non CommandType.{1}.
ja: {0} DeriveParameters は、CommandType.{1} ではなく、 CommandType.StoredProcedure のみサポートします。
ko: {0} DeriveParameters는 CommandType.StoredProcedure만 지원하며 CommandType.{1}은(는) 지원하지 않습니다.
pt_br: {0} DeriveParameters só dá suporte para CommandType.StoredProcedure, e não para CommandType.{1}.
ru: DeriveParameters {0} поддерживает только CommandType.StoredProcedure, но не поддерживает CommandType.{1}.
zh_hans: {0} DeriveParameters 仅支持 CommandType.StoredProcedure，不支持 CommandType.{1}。
zh_hant: {0} DeriveParameters 只支援 CommandType.StoredProcedure，不支援 CommandType.{1}。

# ADP_CalledTwice
source: The method '{0}' cannot be called more than once for the same execution.
de: Die Methode '{0}' kann für dieselbe Ausführung nicht mehr als einmal aufgerufen werden.
es: No se puede llamar al método '{0}' más de una vez para la misma ejecución.
fr: La méthode '{0}' ne peut être appelée qu'une fois pour la même exécution.
it: Impossibile chiamare il metodo "{0}" più di una volta per la stessa esecuzione.
ja: 同じ実行操作に対して、メソッド '{0}' を複数回呼び出すことはできません。
ko: 메서드 '{0}'은(는) 같은 실행에 대해 두 번 이상 호출할 수 없습니다.
pt_br: O método '{0}' não pode ser chamado mais de uma vez para a mesma execução.
ru: Метод "{0}" не может быть вызван больше одного раза в одном и том же сеансе.
zh_hans: 同一次执行不能多次调用方法“{0}”。
zh_hant: 執行同樣的動作時，僅可呼叫方法 '{0}' 一次。
