Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_InvalidCipherTextSize
source: Specified ciphertext has an invalid size of {0} bytes, which is below the minimum {1} bytes required for decryption.
de: Angegebener Chiffretext weist eine ungültige Größe von {0} Bytes auf, die unter der für die Entschlüsselung erforderlichen Mindestanzahl von {1} Bytes liegt.
es: El texto cifrado tiene un tamaño no válido de {0} bytes, un valor inferior a los {1} bytes mínimos requeridos para el descifrado.
fr: Le texte de chiffrement spécifié a une taille non valide de {0} octets, ce qui est inférieur au minimum de {1} octets requis pour le déchiffrement.
it: Le dimensioni del testo crittografato specificato sono pari a {0} byte e non sono valide perché questo valore è inferiore al minimo di {1} byte richiesto per la decrittografia.
ja: 指定された暗号化テキストのサイズが {0} バイトであり、暗号化解除に最低限必要な {1} バイトを下回っています。これは無効です。
ko: 지정된 암호 텍스트는 크기가 {0}바이트로 잘못되었습니다. 이 크기는 암호 해독에 필요한 최소 {1}바이트보다 작습니다.
pt_br: O texto cifrado especificado tem um tamanho inválido de {0} bytes, que está abaixo do mínimo {1} bytes necessários para descriptografia.
ru: Указанные зашифрованные данные имеют недопустимый размер — {0} байт, что меньше минимального допустимого значения, требуемого для расшифровки и составляющего {1} байт.
zh_hans: 指定已加密文本具有无效的大小({0} 字节)，该大小低于解密所需的最小值({1} 字节)。
zh_hant: 指定的 ciphertext 具有無效的大小 ({0} 個位元組)，這低於解密所需的下限 ({1} 個位元組)。

# TCE_InvalidAlgorithmVersion
source: The specified ciphertext's encryption algorithm version '{0}' does not match the expected encryption algorithm version '{1}'.
de: Der Verschlüsselungsalgorithmus '{0}' des angegebenen Chiffretexts entspricht nicht der erwarteten Version '{1}'.
es: La versión del algoritmo de cifrado del texto de cifrado especificado "{0}" no coincide con la versión del algoritmo de cifrado esperado "{1}".
fr: La version spécifiée (« {0} ») de l’algorithme de chiffrement du texte de chiffrement ne correspond pas à la version attendue (« {1} ») .
it: La versione '{0}' specificata per l'algoritmo di crittografia del testo crittografato non corrisponde alla versione prevista '{1}'.
ja: 指定された暗号化テキストの暗号化アルゴリズム バージョン '{0}' は、予期されているバージョン '{1}' と一致しません。
ko: 지정된 암호 텍스트의 암호화 알고리즘 버전 '{0}'이(가) 필요한 암호화 알고리즘 버전 '{1}'과(와) 일치하지 않습니다.
pt_br: O texto cifrado especificado contém a versão '{0}' do algoritmo de criptografia, que não corresponde a '{1}', a versão esperada.
ru: Указанная версия алгоритма шифрования зашифрованных данных "{0}" не совпадает с ожидаемой версией алгоритма шифрования "{1}".
zh_hans: 指定的加密文本的加密算法版本“{0}”与预期加密算法版本“{1}”不匹配。
zh_hant: 指定的加密文字加密演算法版本 '{0}' 不符合預期的加密演算法版本 '{1}'。

# TCE_InvalidAuthenticationTag
source: Specified ciphertext has an invalid authentication tag.
de: Der angegebene Chiffretext weist ein ungültiges Authentifizierungstag auf.
es: El texto cifrado especificado tiene una etiqueta de autenticación que no es válida.
fr: La balise d'authentification du texte chiffré spécifié n'est pas valide.
it: Il testo crittografato specificato contiene un tag di autenticazione non valido.
ja: 指定された暗号化テキストに無効な認証タグが含まれています。
ko: 지정된 암호 텍스트에 잘못된 인증 태그가 있습니다.
pt_br: O texto cifrado especificado tem uma marca de autenticação inválida.
ru: Указанный зашифрованный текст имеет недопустимый тег проверки подлинности.
zh_hans: 指定的已加密文本具有无效的身份验证标记。
zh_hant: 指定的加密文字具有無效的驗證標記。

# TCE_NullColumnEncryptionAlgorithm
source: Internal error. Encryption algorithm cannot be null. Valid algorithms are: {0}.
de: Interner Fehler. Verschlüsselungsalgorithmus darf nicht NULL sein. Gültige Algorithmen sind: {0}.
es: Error interno. El algoritmo de cifrado no puede ser nulo. Los algoritmos válidos son: {0}.
fr: Erreur interne. L’algorithme de chiffrement ne peut pas avoir la valeur null. Les algorithmes valides sont : {0}.
it: Errore interno. L'algoritmo di crittografia non può essere Null. Algoritmi validi: {0}.
ja: 内部エラー。暗号化アルゴリズムを Null にすることはできません。有効なアルゴリズムは {0} です。
ko: 내부 오류입니다. 암호화 알고리즘은 null일 수 없습니다. 유효한 알고리즘은 {0}입니다.
pt_br: Erro interno. O algoritmo de criptografia não pode ser nulo. Os algoritmos válidos são: {0}.
ru: Внутренняя ошибка. Алгоритм шифрования не может иметь значение Null. Допустимые алгоритмы: {0}.
zh_hans: 内部错误。加密算法不能为空。有效算法是: {0}。
zh_hant: 內部錯誤。加密演算法不得為 Null。有效的演算法為: {0}。

# TCE_UnexpectedDescribeParamFormatParameterMetadata
source: Internal error. The result returned by '{0}' is invalid. The parameter metadata resultset is missing.
de: Interner Fehler. Das von "{0}" zurückgegebene Ergebnis ist ungültig. Das Resultset mit Parametermetadaten fehlt.
es: Error interno. El resultado devuelto por "{0}" no es válido. El conjunto de resultados de metadatos de parámetro no existe.
fr: Erreur interne. Le résultat retourné par '{0}' est non valide. Le jeu de résultats des métadonnées de paramètre est manquant.
it: Errore interno. Il risultato restituito da '{0}' non è valido. Manca il set di risultati dei metadati dei parametri.
ja: 内部エラーです。'{0}' によって返された結果が無効です。パラメーター メタデータの結果セットが見つかりません。
ko: 내부 오류가 발생했습니다. '{0}'에서 반환하는 결과가 잘못되었습니다. 매개 변수 메타데이터 결과 집합이 없습니다.
pt_br: Erro interno. O resultado retornado por '{0}' é inválido. O conjunto de resultados de metadados de parâmetro está ausente.
ru: Внутренняя ошибка. Результат, возвращенный "{0}", недопустим. Отсутствует результирующий набор метаданных параметров.
zh_hans: 出现内部错误。“{0}”返回的结果无效。参数元数据结果集缺失。
zh_hant: 內部錯誤。'{0}' 傳回的結果無效。沒有參數中繼資料結果集。

# TCE_UnexpectedDescribeParamFormatAttestationInfo
source: Internal error. The result returned by '{0}' is invalid. The attestation information resultset is missing for enclave type '{1}'.
de: Interner Fehler. Das von "{0}" zurückgegebene Ergebnis ist ungültig. Das Resultset mit Nachweisinformationen für den Enclave-Typ "{1}" fehlt.
es: Error interno. El resultado devuelto por "{0}" no es válido. El conjunto de resultados de información de atestación no existe para el tipo de enclave "{1}".
fr: Erreur interne. Le résultat retourné par '{0}' est non valide. Le jeu de résultats des informations d'attestation est manquant pour le type d'enclave '{1}'.
it: Errore interno. Il risultato restituito da '{0}' non è valido. Manca il set di risultati delle informazioni dell'attestazione per il tipo di enclave '{1}'.
ja: 内部エラーです。'{0}' によって返された結果が無効です。エンクレーブ型 '{1}' に対する構成証明情報の結果セットが見つかりません。
ko: 내부 오류가 발생했습니다. '{0}'에서 반환하는 결과가 잘못되었습니다. enclave 형식 '{1}'에 대해 증명 정보 결과 집합이 없습니다.
pt_br: Erro interno. O resultado retornado por '{0}' é inválido. O conjunto de resultados de informações de atestado está ausente para o tipo de enclave '{1}'.
ru: Внутренняя ошибка. Результат, возвращенный "{0}", недопустим. Отсутствует результирующий набор со сведениями об аттестации для типа анклава "{1}".
zh_hans: 出现内部错误。“{0}”返回的结果无效。Enclave 类型“{1}”缺少证明信息结果集。
zh_hant: 內部錯誤。'{0}' 傳回的結果無效。enclave 類型 '{1}' 沒有證明資訊結果集。

# TCE_InvalidEncryptionKeyOrdinalEnclaveMetadata
source: Internal error. Error occurred when populating enclave metadata. The referenced column encryption key ordinal '{0}' is missing in the encryption metadata returned by SQL Server. Max ordinal is '{1}'.
de: Interner Fehler. Fehler beim Auffüllen der Enclave-Metadaten. Die Verschlüsselungsschlüssel-Ordnungszahl {0} der referenzierten Spalte fehlt in den Verschlüsselungsmetadaten, die von SQL Server zurückgegeben wurden. Die maximal zulässige Ordnungszahl lautet {1}.
es: Error interno. Error al rellenar metadatos del enclave. Falta el ordinal de la clave de cifrado de columna al que se hace referencia "{0}" en los metadatos de cifrado devueltos por SQL Server. El ordinal máx. es "{1}".
fr: Erreur interne. Une erreur s'est produite durant le remplissage des métadonnées de l'enclave. Le numéro ordinal de la clé de chiffrement de colonne référencée '{0}' est manquant dans les métadonnées de chiffrement retournées par SQL Server. Le numéro ordinal maximal est '{1}'.
it: Errore interno. Si è verificato un errore durante il popolamento dei metadati dell'enclave. Nei metadati di crittografia restituiti da SQL Server manca l'ordinale di chiave di crittografia di colonna di riferimento '{0}' L'ordinale massimo è '{1}'.
ja: 内部エラーです。エンクレーブのメタデータに値を設定するときにエラーが発生しました。参照されている列暗号化キーの序数 '{0}' が、SQL Server から返された暗号化メタデータの中に存在しません。最大の序数は '{1}' です。
ko: 내부 오류가 발생했습니다. enclave 메타데이터를 채울 때 오류가 발생했습니다. 참조된 열 암호화 키 서수 '{0}'이(가) SQL Server에서 반환하는 암호화 메타데이터에 없습니다. 최대 서수는 '{1}'입니다.
pt_br: Erro interno. Ocorreu um erro ao preencher os metadados de enclave. O ordinal da chave de criptografia de coluna referenciada '{0}' está faltando nos metadados de criptografia retornados pelo SQL Server. O ordinal máximo é '{1}'.
ru: Внутренняя ошибка. Произошла ошибка при заполнении метаданных анклава. Порядковый номер ключа шифрования указанного столбца "{0}" отсутствует в метаданных шифрования, которые вернул SQL Server. Максимальный порядковый номер — "{1}".
zh_hans: 出现内部错误。填充 enclave 元数据时出错。SQL Server 返回的加密元数据中缺少引用的列加密密钥序号“{0}”。最大序号为“{1}”。
zh_hant: 內部錯誤。填入 enclave 中繼資料時發生錯誤。SQL Server 傳回的加密中繼資料不具參考資料行的加密金鑰序數 '{0}'。最大序數為 '{1}'。

# TCE_InvalidEncryptionKeyOrdinalParameterMetadata
source: Internal error. Error occurred when populating parameter metadata. The referenced column encryption key ordinal '{0}' is missing in the encryption metadata returned by SQL Server. Max ordinal is '{1}'.
de: Interner Fehler. Fehler beim Auffüllen der Parametermetadaten. Die Verschlüsselungsschlüssel-Ordnungszahl {0} der referenzierten Spalte fehlt in den Verschlüsselungsmetadaten, die von SQL Server zurückgegeben wurden. Die maximal zulässige Ordnungszahl lautet {1}.
es: Error interno. Error al rellenar metadatos del parámetro. Falta el ordinal de la clave de cifrado de columna al que se hace referencia "{0}" en los metadatos de cifrado devueltos por SQL Server. El ordinal máx. es "{1}".
fr: Erreur interne. Une erreur s'est produite durant le remplissage des métadonnées de paramètre. Le numéro ordinal de la clé de chiffrement de colonne référencée '{0}' est manquant dans les métadonnées de chiffrement retournées par SQL Server. Le numéro ordinal maximal est '{1}'.
it: Errore interno. Si è verificato un errore durante il popolamento dei metadati dei parametri. Nei metadati di crittografia restituiti da SQL Server manca l'ordinale di chiave di crittografia di colonna di riferimento '{0}' L'ordinale massimo è '{1}'.
ja: 内部エラーです。パラメーターのメタデータに値を設定するときにエラーが発生しました。参照されている列暗号化キーの序数 '{0}' が、SQL Server から返された暗号化メタデータの中に存在しません。最大の序数は '{1}' です。
ko: 내부 오류가 발생했습니다. 매개 변수 메타데이터를 채울 때 오류가 발생했습니다. 참조된 열 암호화 키 서수 '{0}'이(가) SQL Server에서 반환하는 암호화 메타데이터에 없습니다. 최대 서수는 '{1}'입니다.
pt_br: Erro interno. Ocorreu um erro ao preencher os metadados de parâmetro. O ordinal da chave de criptografia de coluna referenciada '{0}' está faltando nos metadados de criptografia retornados pelo SQL Server. O ordinal máximo é '{1}'.
ru: Внутренняя ошибка. Произошла ошибка при заполнении метаданных параметров. Порядковый номер ключа шифрования указанного столбца "{0}" отсутствует в метаданных шифрования, которые вернул SQL Server. Максимальный порядковый номер — "{1}".
zh_hans: 出现内部错误。填充参数元数据时出错。SQL Server 返回的加密元数据中缺少引用的列加密密钥序号“{0}”。最大序号为“{1}”。
zh_hant: 內部錯誤。填入參數中繼資料時發生錯誤。SQL Server 傳回的加密中繼資料不具參考資料行的加密金鑰序數 '{0}'。最大序數為 '{1}'。

# TCE_MultipleRowsReturnedForAttestationInfo
source: Internal error. Error occurred when parsing the results of '{0}'. The attestation information resultset is expected to contain only one row, but it contains multiple rows.
de: Interner Fehler. Fehler beim Analysieren der Ergebnisse von "{0}". Im Resultset mit Nachweisinformationen wird nur eine Zeile erwartet, aber es enthält mehrere Zeilen.
es: Error interno. Error al analizar los resultados de "{0}". Se espera que el conjunto de resultados de información de la atestación contenga solo una fila, pero contiene varias filas.
fr: Erreur interne. Une erreur s'est produite durant l'analyse des résultats de '{0}'. Le jeu de résultats des informations d'attestation ne doit contenir qu'une seule ligne, mais il en contient plusieurs.
it: Errore interno. Si è verificato un errore durante l'analisi dei risultati di '{0}'. Il set di risultati delle informazioni dell'attestazione dovrebbe contenere una sola riga, ma ne contiene di più.
ja: 内部エラーです。'{0}' の結果を解析しているときにエラーが発生しました。構成証明情報の結果セットには行が 1 つだけ含まれている必要がありますが、複数の行が含まれています。
ko: 내부 오류가 발생했습니다. '{0}'의 결과를 구문 분석할 때 오류가 발생했습니다. 증명 정보 결과 집합에는 행이 한 개만 포함되어야 하는데 행이 여러 개 포함되어 있습니다.
pt_br: Erro interno. Erro ao analisar os resultados de '{0}'. O conjunto de resultados de informações de atestado deve conter apenas uma linha, mas contém várias linhas.
ru: Внутренняя ошибка. Произошла ошибка при анализе результатов "{0}". Ожидается, что результирующий набор со сведениями об аттестации будет содержать только одну строку, но он содержит несколько.
zh_hans: 出现内部错误。分析“{0}”的结果时出错。证明信息结果集应只包含一行，但它包含多行。
zh_hant: 內部錯誤。剖析 '{0}' 的結果時發生錯誤。證明資訊結果集只可包含一個資料列，但卻包含了多個資料列。

# TCE_ParamEncryptionMetaDataMissing
source: Internal error. Metadata for parameter '{1}' in statement or procedure '{2}' is missing in resultset returned by {0}.
de: Interner Fehler. Metadaten für Parameter '{1}' in der Anweisung oder Prozedur '{2}' fehlen im Resultset, das von {0} zurückgegeben wurde.
es: Error interno. En el ResultSet devuelto por {0} faltan los metadatos del parámetro "{1}" en la instrucción o procedimiento "{2}".
fr: Erreur interne. Les métadonnées associées au paramètre « {1} » dans l’instruction ou la procédure « {2} » sont manquantes dans le jeu de résultats retourné par {0}.
it: Errore interno. Nel set di risultati restituito da {0} mancano i metadati per il parametro '{1}' nell'istruzione o nella routine '{2}'.
ja: 内部エラー。{0} から返された結果セットに、ステートメントのパラメーター '{1}' またはプロシージャ '{2}' のメタデータがありません。
ko: 내부 오류입니다. {0}에서 반환된 결과 집합에 '{2}' 문 또는 프로시저의 '{1}' 매개 변수에 대한 메타데이터가 없습니다.
pt_br: Erro interno. Os metadados para o parâmetro '{1}' na instrução ou no procedimento '{2}' estão ausentes no conjunto de resultados retornado por {0}.
ru: Внутренняя ошибка. Метаданные для параметра "{1}" в инструкции или процедуре "{2}" отсутствуют в результирующем наборе, возвращенном {0}.
zh_hans: 内部错误。{0} 返回的结果集中缺少语句或程序“{2}”中的参数“{1}”的元数据。
zh_hant: 內部錯誤。{0} 傳回的結果集中遺漏陳述式或程序 '{2}' 中的參數 '{1}' 中繼資料。

# TCE_ProcEncryptionMetaDataMissing
source: Internal error. Metadata for parameters for command '{1}' in a batch is missing in the resultset returned by {0}.
de: Interner Fehler. Metadaten für Parameter des Befehls '{1}' in einem Batch fehlen im Resultset, das von {0} zurückgegeben wurde.
es: Error interno. En el ResultSet devuelto por {0} faltan los metadatos para los parámetros del comando "{1}" en un lote.
fr: Erreur interne. Les métadonnées associées aux paramètres de la commande « {1} » dans un traitement par lots sont manquantes dans le jeu de résultats retourné par {0}.
it: Errore interno. Nel set di risultati restituito da {0} mancano i metadati per i parametri del comando '{1}' in un batch.
ja: 内部エラー。{0} から返された結果セットに、バッチ内のコマンド '{1}' のパラメーターのメタデータがありません。
ko: 내부 오류입니다. {0}에서 반환된 결과 집합에 배치에 있는 '{1}' 명령의 매개 변수에 대한 메타데이터가 없습니다.
pt_br: Erro interno. Os metadados dos parâmetros do comando '{1}' em um lote estão ausentes no conjunto de resultados retornado por {0}.
ru: Внутренняя ошибка. Метаданные для параметров команды "{1}" в пакете отсутствуют в результирующем наборе, возвращенном {0}.
zh_hans: 内部错误。{0} 返回的结果集中缺少批处理中命令“{1}”的参数元数据。
zh_hant: 內部錯誤。{0} 傳回的結果集中遺漏批次內命令 '{1}' 的參數中繼資料。

# TCE_ColumnMasterKeySignatureVerificationFailed
source: The signature returned by SQL Server for the column master key, specified in key path '{0}', is invalid (does not match the computed signature). Recreate column master key metadata, making sure the signature inside the metadata is computed using the column master key being referenced in the metadata. If the error persists, please contact Microsoft for assistance.
de: Die von SQL Server zurückgegebene Signatur für den im Schlüsselpfad "{0}" angegebenen Spaltenhauptschlüssel ist ungültig (entspricht nicht der berechneten Signatur). Erstellen Sie die Metadaten für den Spaltenhauptschlüssel neu, und stellen Sie hierbei sicher, dass die Signatur in den Metadaten mithilfe des Spaltenhauptschlüssels berechnet wird, der in den Metadaten referenziert wird. Wenden Sie sich an Microsoft, falls der Fehler weiterhin besteht.
es: La firma devuelta por SQL Server para la clave principal de columna, especificada en la ruta de acceso de la clave "{0}", no es válida (no coincide con la firma calculada). Vuelva a crear los metadatos de la clave principal de columna, asegurándose de que la firma dentro de los metadatos se calcule utilizando la clave maestra de columna a la que se hace referencia en los metadatos. Si el error persiste, póngase en contacto con Microsoft para obtener ayuda.
fr: La signature retournée par SQL Server pour la clé principale de colonne, spécifiée dans le chemin de clé '{0}', est non valide (elle ne correspond pas à la signature calculée). Recréez les métadonnées de la clé principale de colonne, en vérifiant que la signature présente dans les métadonnées est calculée à l'aide de la clé principale de colonne référencée dans les métadonnées. Si l'erreur persiste, contactez Microsoft pour obtenir de l'aide.
it: La firma restituita da SQL Server per la chiave master di colonna, specificata nel percorso chiave '{0}', non è valida, ovvero non corrisponde alla firma calcolata. Ricreare i metadati della chiave master di colonna, assicurandosi che la firma all'interno dei metadati sia calcolata usando la chiave master di colonna a cui viene fatto riferimento nei metadati. Se l'errore persiste, contattare Microsoft per richiedere assistenza.
ja: キー パス '{0}' で指定された列マスター キーに対して SQL Server から返された署名が無効です (計算された署名と一致しません)。メタデータで参照されている列マスター キーを使用してメタデータ内の署名が計算されていることを確認し、列マスター キーのメタデータを再作成してください。このエラーが解決しない場合は、Microsoft にお問い合わせください。
ko: 키 경로 '{0}'에 지정된 열 마스터 키에 대해 SQL Server에서 반환한 시그니처가 잘못되었습니다(계산된 시그니처와 일치하지 않음). 열 마스터 키 메타데이터를 다시 만들고 메타데이터 내의 시그니처가 메타데이터에서 참조되는 열 마스터 키를 사용하여 계산되도록 합니다. 오류가 계속되는 경우 Microsoft에 문의하세요.
pt_br: A assinatura retornada pelo SQL Server para a chave mestre de coluna, especificada no caminho da chave '{0}', é inválida (não coincide com a assinatura calculada). Recrie os metadados da chave mestra da coluna, certificando-se de que a assinatura nos metadados seja calculada usando a chave mestra de coluna que está sendo referenciada nos metadados. Se o erro persistir, entre em contato com a Microsoft para obter assistência.
ru: Подпись, которую SQL Server вернул для главного ключа столбца, указанного в пути ключа "{0}", недопустима (не соответствует вычисляемой подписи). Повторно создайте метаданные главного ключа столбца, чтобы подпись в метаданных вычислялась с помощью главного ключа столбца, на который указывает ссылка в метаданных. Если ошибка сохраняется, обратитесь в Майкрософт за помощью.
zh_hans: SQL Server 为在密钥路径“{0}”处指定的列主密钥返回的签名无效(与计算的签名不匹配)。重新创建列主密钥元数据，确保使用元数据中引用的列主密钥计算元数据内的签名。如果此错误仍然存在，请与 Microsoft 联系获取帮助。
zh_hant: SQL Server 為資料行主要金鑰傳回的簽章 (在金鑰路徑 '{0}' 中指定) 無效 (不符合計算的簽章)。請重新建立資料行主要金鑰中繼資料，並務必使用中繼資料參考的資料行主要金鑰，計算中繼資料內的簽章。若持續發生此錯誤，請連絡 Microsoft 尋求協助。

# TCE_ColumnMasterKeySignatureNotFound
source: Internal error. The signature returned by SQL Server for enclave-enabled column master key, specified at key path '{0}', cannot be null or empty.
de: Interner Fehler. Die von SQL Server zurückgegebene Signatur für den im Schlüsselpfad "{0}" angegebenen Enclave-fähigen Spaltenhauptschlüssel darf nicht NULL oder leer sein.
es: Error interno. La firma devuelta por SQL Server para la clave principal de columna habilitada para el enclave, especificada en la ruta de acceso de la clave "{0}", no puede ser nula ni estar vacía.
fr: Erreur interne. La signature retournée par SQL Server pour la clé principale de colonne d'enclave, spécifiée dans le chemin de clé '{0}', ne peut pas avoir une valeur null ou être vide.
it: Errore interno. La firma restituita da SQL Server per la chiave master di colonna abilitata per l'enclave, specificata nel percorso di chiave '{0}', non può essere Null o vuota.
ja: 内部エラーです。エンクレーブが有効な列マスター キー (キー パス '{0}' によって指定) に対して SQL Server から返される署名は、null や空であってはなりません。
ko: 내부 오류가 발생했습니다. 키 경로 '{0}'에 지정된, enclave 사용 열의 마스터 키에 대해 SQL Server에서 반환하는 시그니처는 null이거나 비워둘 수 없습니다.
pt_br: Erro interno. A assinatura retornada pelo SQL Server para a chave mestra da coluna habilitada para enclave, especificada no caminho da chave '{0}', não pode ser nula nem vazia.
ru: Внутренняя ошибка. Подпись, возвращенная SQL Server для главного ключа столбца с поддержкой анклава, указанного в пути к ключу "{0}", не может быть пустой или равной NULL.
zh_hans: 内部错误。SQL Server 为在密钥路径“{0}”处指定的 enclave 启用的列主密钥返回的签名不能为 null 或为空。
zh_hant: 內部錯誤。SQL Server 為可使用 enclave 之資料行主要金鑰 (於金鑰路徑 '{0}' 指定) 而傳回的特徵標記不得為 null 或空白。

# TCE_UnableToVerifyColumnMasterKeySignature
source: Unable to verify a column master key signature. Error message: {0}
de: Die Signatur des Spaltenhauptschlüssels kann nicht überprüft werden. Fehlermeldung: {0}
es: No se puede comprobar una firma de la clave principal de columna. Mensaje de error: {0}
fr: Impossible de vérifier la signature de la clé principale de colonne. Message d'erreur : {0}
it: Non è possibile verificare una firma della chiave master di colonna. Messaggio di errore: {0}
ja: 列マスター キーの署名を検証できません。エラー メッセージ: {0}
ko: 열 마스터 키 시그니처를 확인할 수 없습니다. 오류 메시지: {0}
pt_br: Não é possível verificar uma assinatura de chave mestra de coluna. Mensagem de erro: {0}
ru: Не удалось проверить подпись главного ключа столбца. Сообщение об ошибке: {0}
zh_hans: 无法验证列主密钥签名。错误消息: {0}
zh_hant: 無法確認資料行主要金鑰簽章。錯誤訊息: {0}

# TCE_ParamEncryptionFailed
source: Failed to encrypt parameter '{0}'.
de: Verschlüsselung des Parameters '{0}' fehlgeschlagen.
es: Error al cifrar el parámetro "{0}".
fr: Échec du chiffrement du paramètre « {0} ».
it: Non è possibile crittografare il parametro '{0}'.
ja: パラメーター '{0}' を暗号化できませんでした。
ko: '{0}' 매개 변수를 암호화하지 못했습니다.
pt_br: Falha ao criptografar parâmetro '{0}'.
ru: Не удается зашифровать параметр "{0}".
zh_hans: 未能加密参数“{0}”。
zh_hant: 無法加密參數 '{0}'。

# TCE_ColumnDecryptionFailed
source: Failed to decrypt column '{0}'.
de: Entschlüsseln der Spalte '{0}' fehlgeschlagen.
es: Error al descifrar la columna "{0}".
fr: Échec du déchiffrement de la colonne « {0} ».
it: Non è possibile decrittografare la colonna '{0}'.
ja: 列 '{0}' を暗号化解除できませんでした。
ko: '{0}' 열의 암호를 해독하지 못했습니다.
pt_br: Falha ao descriptografar coluna '{0}'.
ru: Не удалось расшифровать столбец "{0}".
zh_hans: 未能解密列“{0}”。
zh_hant: 無法解密資料行 '{0}'。

# TCE_ParamDecryptionFailed
source: Failed to decrypt parameter '{0}'.
de: Entschlüsselung des Parameters '{0}' fehlgeschlagen.
es: Error al descifrar el parámetro "{0}".
fr: Échec du déchiffrement du paramètre « {0} ».
it: Non è possibile decrittografare il parametro '{0}'.
ja: パラメーター '{0}' を暗号化解除できませんでした。
ko: '{0}' 매개 변수의 암호를 해독하지 못했습니다.
pt_br: Falha ao descriptografar parâmetro '{0}'.
ru: Не удается расшифровать параметр "{0}".
zh_hans: 未能解密参数“{0}”。
zh_hant: 無法解密參數 '{0}'。
