Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SQLUDT_InvalidUdtTypeName
source: UdtTypeName property must be set for UDT parameters.
de: Die UdtTypeName-Eigenschaft muss für UDT-Parameter festgelegt werden.
es: Debe establecerse la propiedad UdtTypeName para los parámetros UDT.
fr: La propriété UdtTypeName doit être définie pour les paramètres UDT.
it: È necessario impostare la proprietà UdtTypeName per i parametri UDT.
ja: UDT パラメーターには、UdtTypeName プロパティを設定する必要があります。
ko: UdtTypeName 속성은 UDT 매개 변수에 대해 설정해야 합니다.
pt_br: A propriedade UdtTypeName deve ser definida como parâmetros UDT.
ru: Свойство UdtTypeName для параметров UDT должно быть установлено.
zh_hans: 必须为 UDT 参数设置 UdtTypeName 属性。
zh_hant: 必須為 UDT 參數設定 UdtTypeName 屬性。

# SQLUDT_UnexpectedUdtTypeName
source: UdtTypeName property must be set only for UDT parameters.
de: Die UdtTypeName-Eigenschaft muss nur für UDT-Parameter festgelegt werden.
es: La propiedad UdtTypeName debe establecerse sólo para los parámetros UDT.
fr: La propriété UdtTypeName ne doit être définie que pour les paramètres UDT.
it: È necessario impostare la proprietà UdtTypeName property solo per i parametri UDT.
ja: UdtTypeName プロパティは、UDT パラメーターに対してのみ設定する必要があります。
ko: UdtTypeName 속성은 UDT 매개 변수에 대해서만 설정해야 합니다.
pt_br: A propriedade UdtTypeName deve ser definida apenas como parâmetros UDT.
ru: Свойство UdtTypeName должно быть установлено только для параметров UDT.
zh_hans: 只可为 UDT 参数设置 UdtTypeName 属性。
zh_hant: 僅可為 UDT 參數設定 UdtTypeName 屬性。

# SQLUDT_InvalidSqlType
source: Specified type is not registered on the target server.{0}.
de: Der angegebene Typ ist nicht auf dem Zielserver {0} registriert.
es: El tipo especificado no está registrado en el servidor de destino.{0}.
fr: Le type spécifié n'est pas inscrit sur le serveur cible. {0}.
it: I tipo specificato non è registrato sul server di destinazione.{0}.
ja: 指定された型は、対象サーバー {0} に登録されていません。
ko: 지정한 유형이 대상 서버에 등록되어 있지 않습니다.{0}.
pt_br: O tipo especificado não está registrado no servidor de destino.{0}.
ru: Указанный тип не зарегистрирован на сервере назначения.{0}.
zh_hans: 指定类型未在目标服务器上注册。{0}。
zh_hant: 指定的型別並未在目標伺服器上註冊。{0}。

# SQLUDT_InWhereClause
source: UDT parameters not permitted in the where clause unless part of the primary key.
de: UDT-Parameter sind in der WHERE-Klausel nur dann zulässig, wenn sie Teil des Primärschlüssels sind.
es: No se permiten parámetros UDT en la cláusula where, salvo que formen parte de la clave principal.
fr: Les paramètres UDT ne sont pas autorisés dans la clause WHERE, sauf s'ils font partie de la clé primaire.
it: Parametri UDT non consentiti nella clausola WHERE a meno che non facciano parte della chiave primaria.
ja: UDT パラメーターは主キーの一部でない限り where 句では使用できません。
ko: 기본 키의 일부가 아닌 경우 UDT 매개 변수는 where 절에서 허용되지 않습니다.
pt_br: Os parâmetros UDT não são permitidos na cláusula where, a menos que façam parte da chave primária.
ru: Не допускается использование параметров UDT в составе конструкции Where, кроме случаев, когда они являются частью первичного ключа.
zh_hans: 除主键的一部分外，Where 子句中不允许 UDT 参数。
zh_hant: 除非 UDT 參數為主索引鍵的一部分，否則不允許出現在 where 子句中。

# SqlUdt_InvalidUdtMessage
source: '{0}' is an invalid user defined type, reason: {1}.
de: '{0}' ist ein ungültiger benutzerdefinierter Typ. Grund: {1}.
es: '{0}' es un tipo no válido definido por el usuario, motivo: {1}.
fr: '{0}' est un type défini par l'utilisateur non valide, raison : {1}.
it: "{0}" non è un tipo definito dall'utente valido. Motivo: {1}.
ja: '{0}' は、無効なユーザー定義型です。理由 : {1}
ko: '{0}'은(는) 잘못된 사용자 정의 유형입니다. 이유: {1}.
pt_br: '{0}' é um tipo definido pelo usuário inválido. Motivo: {1}.
ru: "{0}" представляет собой недопустимый определенный пользователем тип, причина: {1}.
zh_hans: “{0}”是无效的用户定义类型，原因: {1}。
zh_hant: '{0}' 是無效的使用者定義型別，理由是: {1}。

# SqlUdtReason_MultipleSerFormats
source: supports both in-memory and user-defined formats
de: unterstützt sowohl speicherresidente als auch benutzerdefinierte Formate
es: compatible con formatos en memoria y definidos por el usuario
fr: prend en charge les formats en mémoire et ceux définis par l'utilisateur
it: supporta sia formati in memoria che formati definiti dall'utente
ja: インメモリ形式とユーザー定義形式の両方をサポートしています
ko: 인 메모리 및 사용자 정의 형식 모두를 지원합니다.
pt_br: oferece suporte a formatos de memória e definidos pelo usuário
ru: поддерживаются и форматы в памяти, и форматы, определенные пользователем.
zh_hans: 同时支持内存中格式和用户定义的格式
zh_hant: 同時支援記憶體中格式與使用者定義格式

# SqlUdtReason_CannotSupportNative
source: Native format can't be supported.
de: Das native Format kann nicht unterstützt werden.
es: No se puede admitir el formato nativo.
fr: Le format natif ne peut pas être pris en charge.
it: Impossibile supportare il formato nativo.
ja: ネイティブ形式はサポートできません。
ko: 네이티브 형식을 지원할 수 없습니다.
pt_br: Não há suporte para formato nativo.
ru: Собственный формат не поддерживается.
zh_hans: 不支持本地格式。
zh_hant: 不支援負數格式。

# SqlUdtReason_CannotSupportUserDefined
source: does not implement IBinarySerialize
de: implementiert nicht IBinarySerialize
es: no implementa IBinarySerialize
fr: n'implémente pas IBinarySerialize
it: non implementa IBinarySerialize
ja: IBinarySerialize を実装できません
ko: IBinarySerialize를 구현하지 않습니다.
pt_br: não implementa IBinarySerialize
ru: Отсутствует реализация IBinarySerialize
zh_hans: 未实现 IBinarySerialize
zh_hant: 未實作 IBinarySerialize

# SqlUdtReason_NotSerializable
source: not serializable
de: nicht serialisierbar
es: no serializable
fr: non sérialisable
it: non serializzabile
ja: シリアル化できません
ko: serialize할 수 없음
pt_br: não pode ser serializado
ru: не подлежит сериализации
zh_hans: 不可序列化
zh_hant: 非連續的

# SqlUdtReason_NoPublicConstructors
source: no public constructors
de: keine öffentlichen Constructors
es: sin constructores públicos
fr: aucun constructeur public
it: nessun costruttore pubblico disponibile
ja: パブリック コンストラクターがありません
ko: public 생성자 없음
pt_br: nenhum construtor público
ru: нет публичных конструкторов
zh_hans: 没有公共构造函数
zh_hant: 無公用建構函式

# SqlUdtReason_NotNullable
source: does not implement INullable
de: implementiert nicht INullable
es: no implementa INullable
fr: n'implémente pas INullable
it: non implementa INullable
ja: INullable を実装できません
ko: INullable을 구현하지 않습니다.
pt_br: não implementa INullable
ru: Отсутствует реализация INullable
zh_hans: 没有实现 INullable
zh_hant: 沒有實作 INullable

# SqlUdtReason_NoPublicConstructor
source: does not have a public constructor
de: hat keinen öffentlichen Constructor
es: no tiene un constructor público
fr: ne dispose d'aucun constructeur public
it: non dispone di costruttori pubblici
ja: パブリック コンストラクターがありません
ko: public 생성자가 없습니다.
pt_br: não tem um construtor público
ru: не имеет общего конструктора
zh_hans: 没有公共构造函数
zh_hant: 沒有公用建構函式

# SqlUdtReason_NoUdtAttribute
source: no UDT attribute
de: kein UDT-Attribut
es: sin atributo UDT
fr: aucun attribut UDT
it: nessun attributo UDT disponibile
ja: UDT 属性がありません
ko: UDT 특성 없음
pt_br: nenhum atributo UDT
ru: нет атрибута UDT
zh_hans: 没有 UDT 特性
zh_hant: 無 UDT 屬性

# SqlUdtReason_MaplessNotYetSupported
source: Serialization without mapping is not yet supported.
de: Serialisierung ohne Zuordnung wird noch nicht unterstützt.
es: La serialización sin asignación no se admite aún.
fr: La sérialisation sans mappage n'est pas encore prise en charge.
it: Non è ancora supportata la serializzazione senza il mapping.
ja: マップなしのシリアル化は、現時点ではサポートされていません。
ko: 매핑 없는 serialization은 아직 지원되지 않습니다.
pt_br: Ainda não há suporte para serialização sem mapeamento.
ru: Сериализация без сопоставления пока не поддерживается.
zh_hans: 尚不支持没有映射的序列化。
zh_hant: 尚未支援無對應的序列化。

# SqlUdtReason_ParseMethodMissing
source: 'public static x Parse(System.Data.SqlTypes.SqlString)' method is missing
de: 'public static x Parse(System.Data.SqlTypes.SqlString)'-Methode fehlt
es: falta el método 'public static x Parse(System.Data.SqlTypes.SqlString)'
fr: la méthode 'public static x Parse(System.Data.SqlTypes.SqlString)' est manquante
it: Metodo "public static x Parse(System.Data.SqlTypes.SqlString)" mancante
ja: 'public static x Parse(System.Data.SqlTypes.SqlString)' メソッドが見つかりません
ko: 'public static x Parse(System.Data.SqlTypes.SqlString)' 메서드가 없습니다.
pt_br: O método 'public static x Parse(System.Data.SqlTypes.SqlString)' é inexistente
ru: Отсутствует метод "public static x Parse(System.Data.SqlTypes.SqlString)"
zh_hans: 缺少“public static x Parse(System.Data.SqlTypes.SqlString)”方法
zh_hant: 'public static x Parse(System.Data.SqlTypes.SqlString)' 方法遺失

# SqlUdtReason_ToStringMethodMissing
source: 'public override string ToString()' method is missing
de: 'public override string ToString()'-Methode fehlt
es: falta el método 'public override string ToString()'
fr: la méthode 'public override string ToString()' est manquante
it: Metodo "public override string ToString()" mancante
ja: 'public override string ToString()' メソッドが見つかりません
ko: 'public override string ToString()' 메서드가 없습니다.
pt_br: O método 'public override string ToString()' é inexistente
ru: Отсутствует метод "public override string ToString()"
zh_hans: 缺少“public override string ToString()”方法
zh_hant: 'public override string ToString()' 方法遺失

# SqlUdtReason_NullPropertyMissing
source: 'public static x Null { get; }' method is missing
de: 'public static x Null { get; }'-Methode fehlt
es: falta el método 'public static x Null { get; }'
fr: la méthode 'public static x Null { get; }' est manquante
it: Metodo "public static x Null { get; }" mancante
ja: 'public static x Null { get; }' メソッドが見つかりません
ko: 'public static x Null { get; }' 메서드가 없습니다.
pt_br: O método 'public static x Null { get; }' é inexistente
ru: Отсутствует метод "public static x Null { get; }"
zh_hans: 缺少“public static x Null { get; }”方法
zh_hant: 'public static x Null { get; }' 方法遺失

# SqlUdtReason_NativeFormatNoFieldSupport
source: Native format does not support fields (directly or through another field) of type '{0}'
de: Das Format 'Native' unterstützt keine Felder (direkt oder über ein anderes Feld) vom Typ '{0}'
es: El formato nativo no es compatible con los campos del tipo '{0}' (directamente o a través de otro campo)
fr: Le format natif ne prend pas en charge les champs (directement ou via un autre champ) de type '{0}'
it: Il formato nativo non supporta i campi (in modo diretto o attraverso un altro campo) di tipo "{0}"
ja: ネイティブ形式では、'{0}' 型のフィールド (直接または別のフィールドから) をサポートしていません。
ko: 네이티브 형식은 유형 '{0}'의 필드를 직접적으로나 다른 필드를 통해 지원하지 않습니다.
pt_br: O formato nativo não oferece suporte a campos (diretamente ou por meio de outro campo) de tipo '{0}'
ru: Собственный формат не поддерживает полей (напрямую или через другое поле) типа "{0}"
zh_hans: Native 格式不支持“{0}”类型的字段(直接或通过另一字段)
zh_hant: Native 不支援型別 '{0}' (直接或經由其他欄位) 的欄位

# SqlUdtReason_TypeNotPublic
source: Type is not public
de: Typ ist nicht öffentlich
es: El tipo no es público
fr: Type non public
it: Tipo non pubblico
ja: 型がパブリック型ではありません
ko: 유형이 public이 아닙니다.
pt_br: O tipo não é público
ru: Не публичный тип
zh_hans: 不是公共类型
zh_hant: Type 並非公用的

# SqlUdtReason_NativeUdtNotSequentialLayout
source: Native UDT not sequential layout due to type '{0}'
de: Native UDT nicht sequenzielles Layout aufgrund von Typ '{0}'
es: Native UDT sin diseño secuencial debido al tipo '{0}'
fr: Native UDT n'est pas une disposition séquentielle en raison du type '{0}'
it: Layout non sequenziale Native UDT a causa del tipo "{0}"
ja: Native UDT は、'{0}' 型のためシーケンシャル レイアウトをサポートできません
ko: Native UDT는 유형 '{0}'(으)로 인해 순차적 레이아웃이 아닙니다.
pt_br: A Native UDT não apresenta layout sequencial devido ao tipo '{0}'
ru: Native UDT имеет непоследовательный макет из-за типа "{0}"
zh_hans: 因为类型为“{0}”，所以 Native UDT 不是序列布局
zh_hant: Native UDT 並非連續的配置，因為型別為 '{0}'

# SqlUdtReason_NativeUdtMaxByteSize
source: Native UDT specifies a max byte size
de: Native UDT gibt eine maximale byte-Größe an
es: Native UDT especifica un tamaño máximo de byte
fr: Native UDT spécifie une taille maximale, en byte
it: Native UDT specifica le dimensioni massime in byte
ja: Native UDT は最大サイズ (byte) を指定しています。
ko: Native UDT는 최대 byte 크기를 지정합니다.
pt_br: A Native UDT especifica o tamanho máximo de byte
ru: Элемент Native UDT указывает максимальный размер в байтах (byte size)
zh_hans: Native UDT 指定最大 byte 大小
zh_hant: Native UDT 指定最大 byte 大小

# SqlUdtReason_NonSerializableField
source: field '{0}' is marked non-serialized
de: Feld '{0}' ist als nicht serialisiert markiert
es: el campo '{0}' está marcado como no serializado
fr: le champ '{0}' est marqué comme étant non sérialisé
it: il campo "{0}" è contrassegnato come non serializzato
ja: フィールド '{0}' は、シリアル化されていないとマークされています。
ko: 필드 '{0}'이(가) serialize되지 않은 것으로 표시되어 있습니다.
pt_br: o campo '{0}' está marcado como não serializado
ru: поле "{0}" отмечено как несериализованное
zh_hans: 字段“{0}”被标记为非序列化
zh_hant: 欄位 '{0}' 已標示為非連續

# SqlUdtReason_NativeFormatExplictLayoutNotAllowed
source: The type of field '{0}' is marked as explicit layout which is not allowed in Native format
de: Der Typ des Feldes '{0}' ist als explizites Layout markiert, was im Format 'Native' nicht zulässig ist
es: El tipo de campo '{0}' está marcado como diseño explícito; este diseño no se permite en formato Native
fr: Le type de champ '{0}' est marqué comme étant une disposition explicite non autorisée au format Native
it: Il tipo di campo "{0}" è contrassegnato come layout esplicito. Questo non è consentito in formato Native
ja: フィールド '{0}' の型は明示的なレイアウトとしてマークされていますが、これは Native 形式では許可されません。
ko: 필드 '{0}'의 유형이 Native 형식에서 허용되지 않는 명시적 레이아웃으로 표시되어 있습니다.
pt_br: O tipo de campo '{0}' está marcado como layout explícito, o que não é permitido no formato Native
ru: Тип поля "{0}" имеет макет с явно заданным смещением, что недопустимо в собственном формате Native.
zh_hans: 字段“{0}”的类型被标记为显式布局，而 Native 格式不支持
zh_hant: 欄位 '{0}' 的型別已標示為明確的配置，不允許為 Native 格式

# SqlUdtReason_MultivaluedAssemblyId
source: Multiple valued assembly references must have a nonzero Assembly Id.
de: Mehrere mit Werten versehene Assembly-Verweise müssen über eine Assembly-ID ungleich Null verfügen.
es: Las referencias de ensamblado con varios valores deben tener un identificador de ensamblado distinto de cero.
fr: Plusieurs références d'assembly avec valeur doivent avoir un ID d'assembly non nul.
it: I riferimenti con più valori agli assembly devono avere un ID assembly diverso da zero.
ja: 複数の値をとるアセンブリ参照には、ゼロ以外のアセンブリ ID が必要です。
ko: 값이 여러 개인 어셈블리 참조에는 0이 아닌 어셈블리 ID가 있어야 합니다.
pt_br: Referências de assembly com valores múltiplos devem ter uma identificação de Assembly diferente de zero.
ru: Многозначные ссылки на сборку должны иметь ненулевой идентификатор сборки.
zh_hans: 有多个值的程序集引用必须有一个非零程序集 ID。
zh_hant: 多值的組件參考必須有非零的 Assembly Id。

# SQLTVP_TableTypeCanOnlyBeParameter
source: Structured, multiple-valued types can only be used for parameters, and cannot be nested within another type.
de: Structured-Typen mit mehreren Werten können nur für Parameter verwendet und nicht in einem anderen Typ verschachtelt werden.
es: Los tipos estructurados con varios valores sólo se pueden utilizar para parámetros y no se pueden anidar dentro de otro tipo.
fr: Les types structurés à plusieurs valeurs ne peuvent être utilisés que pour les paramètres, et ne peuvent pas être imbriqués dans un autre type.
it: I tipi strutturati con più valori possono essere utilizzati solo per i parametri e non possono essere annidati in un altro tipo.
ja: 構造化された複数値型は、パラメーターだけで使用でき、他の型の内部で入れ子にすることはできません。
ko: Structured 다중 값 형식은 매개 변수에만 사용할 수 있으며 다른 형식 내에 중첩할 수 없습니다.
pt_br: Tipos Estruturados ou de valores múltiplos somente podem ser usados para parâmetros e não podem ser aninhados dentro de outro tipo.
ru: Многозначные типы Structured можно использовать лишь для параметров, их нельзя вложить в другой тип.
zh_hans: 可以对参数使用结构化的、多值的类型，且不能将这些类型嵌套在其他类型中。
zh_hant: 結構化、多值型別只可以用於參數。不可以巢狀方式置於其他型別中。

# SqlFileStream_InvalidPath
source: The path name is not valid.
de: Der Pfadname ist ungültig.
es: El nombre de la ruta de acceso no es válido.
fr: Le nom du chemin d'accès n'est pas valide.
it: Nome di percorso non valido.
ja: パス名が無効です。
ko: 경로 이름이 잘못되었습니다.
pt_br: O nome do caminho não é válido.
ru: Недопустимый путь.
zh_hans: 路径名无效。
zh_hant: 路徑名稱無效。

# SqlFileStream_InvalidParameter
source: An invalid parameter was passed to the function.
de: Es wurde ein ungültiger Parameter an die Funktion übergeben.
es: Se pasó un parámetro no válido a la función.
fr: Un paramètre non valide a été transmis à la fonction.
it: Parametro non valido passato a una funzione.
ja: 無効なパラメーターが関数に渡されました。
ko: 잘못된 매개 변수가 함수에 전달되었습니다.
pt_br: Um parâmetro inválido foi passado para a função.
ru: Функции был передан недопустимый параметр.
zh_hans: 向该函数传递了无效参数。
zh_hant: 無效的參數已傳遞至函式。

# SqlFileStream_FileAlreadyInTransaction
source: The process cannot access the file specified because it has been opened in another transaction.
de: Der Prozess kann nicht auf die angegebene Datei zugreifen, da sie bereits in einer anderen Transaktion geöffnet ist.
es: El proceso no tiene acceso al archivo especificado porque se ha abierto en otra transacción.
fr: Le processus ne peut pas accéder au fichier spécifié, car il est ouvert dans une autre transaction.
it: Il processo non può accedere al file specificato perché è stato aperto in un'altra transazione.
ja: 指定されたファイルは、別のトランザクションで開かれているため、プロセスがアクセスできません。
ko: 지정한 파일이 다른 트랜잭션에서 열렸으므로 프로세스에서 파일에 액세스할 수 없습니다.
pt_br: O processo não pode acessar o arquivo especificado porque foi aberto em outra transação.
ru: Процесс не может получить доступ к указанному файлу, поскольку файл открыт в другой транзакции.
zh_hans: 该进程无法访问指定的文件，因为另一事务已打开了该进程。
zh_hant: 由於處理序已在另一個異動中開啟，所以無法存取該檔案。

# SqlFileStream_PathNotValidDiskResource
source: The path name is invalid or does not point to a disk file.
de: Der Pfadname ist ungültig oder zeigt nicht auf eine Datenträgerdatei.
es: El nombre de la ruta de acceso no es válido o no señala al archivo del disco.
fr: Le nom du chemin d'accès n'est pas valide ou ne pointe pas vers un fichier de disque.
it: Il nome del percorso non è valido o non punta a un file del disco.
ja: パス名が無効であるか、ディスク上のファイルを指していません。
ko: 경로 이름이 잘못되었거나 디스크 파일을 가리키지 않습니다.
pt_br: O nome do caminho é inválido ou não aponta para um arquivo de disco.
ru: Путь является недопустимым или не указывает на файл на диске.
zh_hans: 路径名无效或未指向磁盘文件。
zh_hant: 路徑名稱無效或未指向磁碟檔。

# SqlDelegatedTransaction_PromotionFailed
source: Failure while attempting to promote transaction.
de: Fehler beim Versuch, die Transaktion heraufzustufen.
es: Error al intentar promover la transacción.
fr: Échec lors de la tentative de promotion de la transaction.
it: Errore durante il tentativo di promuovere la transazione.
ja: トランザクションを進めるときにエラーが発生しました。
ko: 트랜잭션을 확장하는 동안 오류가 발생했습니다.
pt_br: Falha ao tentar promover transação.
ru: Сбой при попытке активизации транзакции.
zh_hans: 试图提升事务时失败。
zh_hant: 嘗試升級交易時失敗。

# SqlDependency_SqlDependency
source: Dependency object used to receive query notifications.
de: Abhängigkeitsobjekt, das zum Empfangen von Abfragebenachrichtigungen verwendet wird.
es: Objeto dependiente utilizado para recibir notificaciones de consulta.
fr: Objet de dépendance permettant de recevoir des notifications de requête.
it: Oggetto dipendenza utilizzato per ricevere notifiche di query.
ja: クエリ通知の受信に使用される従属オブジェクトです。
ko: 쿼리 알림을 수신하는 데 사용되는 종속 개체입니다.
pt_br: Objeto de dependência usado para receber notificações de consulta.
ru: Объект зависимости, использующийся для получения уведомлений о запросах.
zh_hans: 用于接收查询通知的相关性对象。
zh_hant: 用於接收查詢通知的依存物件。

# SqlDependency_HasChanges
source: Property to indicate if this dependency is invalid.
de: Eigenschaft, die angibt, ob diese Abhängigkeit ungültig ist.
es: Propiedad para indicar si esta dependencia no es válida.
fr: Propriété permettant d'indiquer si cette dépendance est non valide.
it: Proprietà per indicare se la dipendenza non è valida.
ja: この依存関係が無効であるかどうかを示すプロパティです。
ko: 이 종속 관계가 잘못되었는지 여부를 나타내는 속성입니다.
pt_br: Propriedade para indicar se essa dependência é inválida.
ru: Свойство, позволяющее определить, допустима ли данная зависимость.
zh_hans: 用于指示此相关性是否无效的属性。
zh_hant: 表示此相依性無效的屬性。

# SqlDependency_Id
source: A string that uniquely identifies this dependency object.
de: Eine Zeichenfolge, die dieses Abhängigkeitsobjekt eindeutig bestimmt.
es: Cadena que identifica de forma exclusiva este objeto dependiente.
fr: Chaîne identifiant de façon unique cet objet de dépendance.
it: Una stringa per identificare in modo univoco l'oggetto dipendenza.
ja: この従属オブジェクトを一意に識別する文字列です。
ko: 이 종속 개체를 고유하게 식별하는 문자열입니다.
pt_br: Cadeia de caracteres que identifica de forma exclusiva esse objeto de dependência.
ru: Строка, однозначно идентифицирующая данный объект зависимости.
zh_hans: 唯一标识此相关性对象的字符串。
zh_hant: 唯一識別此相依性的字串。

# SqlDependency_OnChange
source: Event that can be used to subscribe for change notifications.
de: Ereignis, das zum Abonnieren von Änderungsbenachrichtigungen verwendet werden kann.
es: Evento que se puede utilizar para suscribir para notificaciones de cambio.
fr: Événement permettant de s'abonner aux notifications de modification.
it: Evento che può essere utilizzato per richiedere l'invio di notifiche di variazione.
ja: 変更通知の定期受信に使用できるイベントです。
ko: 변경 내용 알림 구독에 사용할 수 있는 이벤트입니다.
pt_br: Evento que pode ser usado na assinatura para o recebimento de notificações de alteração.
ru: Событие, которое может быть использовано для подписки на уведомления об изменениях.
zh_hans: 可以用于预订更改通知的事件。
zh_hant: 可用於訂閱變更通知的事件。

# SqlDependency_AddCommandDependency
source: To add a command to existing dependency object.
de: Zum Hinzufügen eines Befehls zu einem vorhandenen Abhängigkeitsobjekt.
es: Para agregar un comando a un objeto dependiente existente.
fr: Permet d'ajouter une commande à un objet de dépendance existant.
it: Per aggiungere un comando all'oggetto dipendenza esistente.
ja: 既存の従属オブジェクトにコマンドを追加します。
ko: 기존 종속 개체에 명령을 추가합니다.
pt_br: Para adicionar um comando a um objeto de dependência existente.
ru: Для добавления команды к существующему объекту зависимости.
zh_hans: 向现有的相关性对象中添加命令。
zh_hant: 新增命令至現存的依存物件。

# SqlDependency_Duplicate
source: Command is already associated with another dependency object. Can not overwrite.
de: Command ist bereits mit einem anderen Abhängigkeitsobjekt verknüpft. Überschreiben nicht möglich.
es: El Command ya está asociado a otro objeto dependiente. No se puede sobrescribir.
fr: Command déjà associée à un autre objet de dépendance. Remplacement impossible.
it: Command è già associato a un altro oggetto dipendenza. Impossibile sovrascrivere.
ja: Command が既に別の従属オブジェクトに関連付けられています。上書きできません。
ko: Command가 이미 다른 종속 개체에 연결되어 있습니다. 덮어쓸 수 없습니다.
pt_br: O Command já está associado a outro objeto de dependência. Não é possível substituir.
ru: Команда Command уже назначена другому объекту зависимости. Переопределение невозможно.
zh_hans: Command 已与另一个相关性对象建立关联。不能覆盖。
zh_hant: Command 已與其他依存的物件關聯。無法覆寫。

# SQLNotify_AlreadyHasCommand
source: This SqlCommand object is already associated with another SqlDependency object.
de: Dieses SqlCommand-Objekt ist bereits mit einem anderen SqlDependency-Objekt verknüpft.
es: Este objeto SqlCommand ya está asociado a otro objeto SqlDependency.
fr: Cet objet SqlCommand est déjà associé à un autre objet SqlDependency.
it: L'oggetto SqlCommand è già associato a un altro oggetto SqlDependency.
ja: この SqlCommand オブジェクトは、既に別の SqlDependency オブジェクトに関連付けられています。
ko: 이 SqlCommand 개체는 이미 다른 SqlDependency 개체에 연결되어 있습니다.
pt_br: Esse objeto SqlCommand já está associado a outro objeto SqlDependency.
ru: Этот объект SqlCommand уже связан с другим объектом SqlDependency.
zh_hans: 此 SqlCommand 对象已与另一 SqlDependency 对象关联。
zh_hant: SqlCommand 物件已與其他 SqlDependency 物件關聯。
