Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SNI_ERROR_41
source: Cannot open a Shared Memory connection to a remote SQL server
de: Es konnte keine Shared Memory-Verbindung mit einem Remote-SQL server hergestellt werden.
es: No se puede abrir una conexión de Shared Memory a un servidor SQL server remoto.
fr: Impossible d'ouvrir une connexion entre Shared Memory et un SQL server distant
it: Impossibile aprire una connessione a Shared Memory con un SQL server remoto
ja: リモート SQL server への Shared Memory 接続を開くことができません
ko: 원격 SQL server에 Shared Memory를 연결할 수 없습니다.
pt_br: Não é possível abrir uma conexão de Shared Memory com um SQL server remoto
ru: Не удается открыть подключение общей памяти Shared Memory к удаленному серверу SQL server
zh_hans: 无法打开与远程 SQL server 的 Shared Memory 连接
zh_hant: 無法開啟至遠端 SQL server Shared Memory 的連接

# SNI_ERROR_42
source: Could not establish dedicated administrator connection (DAC) on default port. Make sure that DAC is enabled
de: Es konnte keine dedizierte Administratorverbindung (Dedicated Administrator Connection, DAC) auf dem Standardport hergestellt werden. Vergewissern Sie sich, dass DAC aktiviert ist.
es: No se ha podido establecer una conexión de administrador dedicada (DAC) en el puerto predeterminado. Asegúrese de que DAC está habilitada
fr: Impossible d'établir une connexion administrateur dédiée (DAC) sur le port par défaut. Assurez-vous que l'option DAC est activée
it: Impossibile stabilire una connessione amministrativa dedicata (DAC) sulla porta predefinita. Assicurarsi che la DAC sia abilitata.
ja: 既定のポートで DAC (専用管理者接続) を確立できませんでした。DAC が有効であることを確認してください
ko: 기본 포트에서 DAC(관리자 전용 연결)를 설정할 수 없습니다. DAC를 사용할 수 있는지 확인하십시오.
pt_br: Não foi possível estabelecer conexão de administrador dedicada (DAC) na porta padrão. Verifique se o DAC está habilitado
ru: Не удалось установить выделенное административное соединение (DAC) для порта по умолчанию. Убедитесь, что использование DAC разрешено
zh_hans: 无法在默认端口建立专用管理员连接(DAC)。确保已启用 DAC
zh_hant: 無法在預設的連接埠上建立專用管理員連接 (DAC)。請確定已啟用 DAC

# SNI_ERROR_43
source: An error occurred while obtaining the dedicated administrator connection (DAC) port. Make sure that SQL Browser is running, or check the error log for the port number
de: Fehler beim Anfordern des Ports für die dedizierte Administratorverbindung (Dedicated Administrator Connection, DAC). Vergewissern Sie sich, dass SQL Browser ausgeführt wird, oder überprüfen Sie das Fehlerprotokoll auf die Portnummer.
es: Error al obtener el puerto de conexión de administrador dedicada (DAC). Asegúrese de que el SQL Browser se está ejecutando o compruebe el número de puerto en el registro de errores
fr: Une erreur s'est produite lors de l'obtention du port de connexion administrateur dédiée (DAC). Assurez-vous que l'explorateur SQL est en service ou recherchez le numéro du port dans le journal des erreurs
it: Si è verificato un errore durante il recupero della porta della connessione amministrativa dedicata (DAC). Assicurarsi che il visualizzatore SQL sia in esecuzione oppure controllare il numero di porta nel log degli errori.
ja: DAC (専用管理者接続) のポートの取得中に、エラーが発生しました。SQL Browser が実行中であることを確認してください。または、エラー ログでポート番号を確認してください。
ko: DAC(관리자 전용 연결) 포트를 가져오는 동안 오류가 발생했습니다. SQL 브라우저를 실행 중인지 확인하고 해당 포트 번호의 오류 로그를 검사하십시오.
pt_br: Erro ao obter a porta de conexão de administrador dedicada (DAC). Verifique se o SQL Browser está em execução ou verifique o log de erros do número de porta
ru: Ошибка при получении порта для выделенного административного соединения (DAC). Убедитесь, что служба "браузер SQL" запущена, или найдите номер порта в журнале ошибок
zh_hans: 获取专用管理员连接(DAC)端口时发生错误。确保已运行 SQL 浏览器，或者检查错误日志以获取端口编号
zh_hant: 在取得專用管理員連接 (DAC) 連接埠時發生錯誤。請確定 SQL 瀏覽器正在執行，或檢查連接埠編號的錯誤記錄檔

# SNI_ERROR_44
source: Could not compose Service Principal Name (SPN) for Windows Integrated Authentication. Possible causes are server(s) incorrectly specified to connection API calls, Domain Name System (DNS) lookup failure or memory shortage
de: SPN (Service Principle Name) für integrierte Windows-Authentifizierung konnte nicht erstellt werden. Mögliche Gründe sind für Verbindungs-API-Aufrufe falsch angegebene Server, Fehler bei der DNS (Domain Name System)-Suche oder unzureichender Speicherplatz
es: No se pudo escribir el nombre principal del servicio (SPN) para la Autenticación integrada en Windows. Es posible que los servidores no se especificaran correctamente para las llamadas a API de conexión, que se generara un error al buscar en el Sistema de nombres de dominio (DNS) o que no hubiera memoria suficiente
fr: Impossible de composer le nom de principal du service (SPN) pour l'authentification intégrée Windows pour l'une des raisons suivantes : un ou plusieurs serveurs spécifiés de façon incorrecte pour des appels d'API de connexion, une défaillance de la recherche DNS (Domain Name System) ou une mémoire insuffisante
it: Impossibile creare il nome SPN per l'autenticazione integrata di Windows. È possibile che i server siano specificati in modo non corretto nelle chiamate API di connessione, si sia verificato un errore di ricerca DNS (Domain Name System) o un'insufficienza di memoria.
ja: Windows 統合認証のための SPN (Service Principal Name) を作成できませんでした。サーバーの接続 API 呼び出しの間違い、DNS (Domain Name System) の参照の失敗、メモリ不足などの原因が考えられます。
ko: Windows 통합 인증용 SPN(서비스 사용자 이름)을 작성하지 못했습니다. 연결 API 호출에 잘못 지정된 서버, DNS(도메인 이름 시스템) 조회 오류 또는 메모리 부족이 원인일 수 있습니다.
pt_br: Não foi possível compor o SPN (nome da entidade de serviço) para a Autenticação Integrada do Windows. As possíveis causas são: servidores incorretamente especificados para chamadas à API de conexão, falha na pesquisa do DNS (Sistema de Nomes de Domínio) ou insuficiência de memória
ru: Не удалось составить имя участника-службы (SPN) для встроенной проверки подлинности Windows. Возможные причины: неправильно указанные серверы для API-вызовов соединения, сбой при поиске в системе доменных имен (DNS) или недостаток памяти
zh_hans: 无法形成 Windows 集成身份验证的服务主体名称(SPN)。这可能是由于没有正确地为连接 API 调用指定服务器、域名系统(DNS)查找失败或内存不足
zh_hant: 無法撰寫 Windows 整合式驗證的服務主要名稱 (SPN)。可能的原因是伺服器未正確指定連接 API 呼叫、網域名稱系統 (DNS) 查閱失敗或記憶體不足。

# SNI_ERROR_47
source: Connecting with the MultiSubnetFailover connection option to a SQL Server instance configured with more than 64 IP addresses is not supported.
de: Die Verbindung mit einer SQL Server-Instanz, für die mehr als 64 IP-Adressen konfiguriert sind, wird unter Verwendung der MultiSubnetFailover-Verbindungsoption nicht unterstützt.
es: No se admite la conexión con la opción de conexión MultiSubnetFailover a una instancia de SQL Server configurada con más de 64 direcciones IP.
fr: La connexion à une instance de SQL Server configurée avec plus de 64 adresses IP à l'aide de l'option de connexion MultiSubnetFailover n'est pas prise en charge.
it: La connessione a un'istanza di SQL Server configurata con più di 64 indirizzi IP utilizzando l'opzione di connessione ServerMultiSubnetFailover non è supportata.
ja: 64 個を超える IP アドレスが構成された SQL Server インスタンスへの MultiSubnetFailover 接続オプションを使用した接続はサポートされていません。
ko: MultiSubnetFailover 연결 옵션을 사용하여 64개가 넘는 IP 주소로 구성된 SQL Server 인스턴스에 연결이 지원되지 않습니다.
pt_br: Não há suporte para o uso da opção de conexão MultiSubnetFailover para conectar uma instância do SQL Server configurada com mais de 64 endereços IP.
ru: Подключение с использованием параметра MultiSubnetFailover к экземпляру SQL Server, настроенному с использованием более 64 IP-адресов, не поддерживается.
zh_hans: 不支持使用 MultiSubnetFailover 连接选项连接到配置了 64 个以上的 IP 地址的 SQL Server 实例。
zh_hant: 不支援使用 MultiSubnetFailover 連接選項連接到設定了超過 64 個 IP 位址的 SQL Server 執行個體。

# SNI_ERROR_48
source: Connecting to a named SQL Server instance using the MultiSubnetFailover connection option is not supported.
de: Die Verbindungsoption "MultiSubnetFailover" wird nicht unterstützt, wenn eine Verbindung mit einer benannten SQL Server-Instanz hergestellt wird.
es: No se admiten conexiones a una instancia con nombre de SQL Server mediante la opción MultiSubnetFailover.
fr: La connexion à une instance de SQL Server à l'aide de l'option de connexion MultiSubnetFailover n'est pas prise en charge.
it: La connessione a un'istanza denominata di SQL Server con l'opzione MultiSubnetFailover non è supportata.
ja: MultiSubnetFailover 接続オプションを使用して名前付き SQL Server インスタンスに接続することはできません。
ko: MultiSubnetFailover 연결 옵션을 사용하여 이름이 지정된 SQL Server 인스턴스에 연결할 수 없습니다.
pt_br: Não há suporte para a operação de conectar-se a uma instância nomeada do SQL Server usando a opção de conexão MultiSubnetFailover.
ru: Соединение с именованным экземпляром SQL Server с параметром MultiSubnetFailover не поддерживается.
zh_hans: 不支持使用 MultiSubnetFailover 连接选项连接到命名的 SQL Server 实例。
zh_hant: 不支援使用 MultiSubnetFailover 連接選項連接到 SQL Server 具名執行個體。

# SNI_ERROR_49
source: Connecting to a SQL Server instance using the MultiSubnetFailover connection option is only supported when using the TCP protocol.
de: Die Verbindung mit einer SQL Server-Instanz unter Verwendung der MultiSubnetFailover-Verbindungsoption wird nur beim TCP-Protokoll unterstützt.
es: La conexión a una instancia de SQL Server reflejada mediante la opción de conexión MultiSubnetFailover solo se admite al usar el protocolo TCP.
fr: La connexion à une instance de SQL Server à l'aide de l'option de connexion MultiSubnetFailover n'est prise en charge qu'avec le protocole TCP.
it: La connessione a un'istanza di SQL Server utilizzando l'opzione di connessione MultiSubnetFailover è supportata unicamente con il protocollo TCP.
ja: SQL Server インスタンスへの MultiSubnetFailover 接続オプションを使用した接続がサポートされるのは、TCP プロトコルを使用している場合のみです。
ko: TCP 프로토콜을 사용할 경우에만 MultiSubnetFailover 연결 옵션을 사용하여 SQL Server 인스턴스에 연결할 수 있습니다.
pt_br: Só há suporte para a conexão com uma instância do SQL Server usando a opção de conexão MultiSubnetFailover quando o protocolo TCP é usado.
ru: Подключение к экземпляру SQL Server с использованием параметра MultiSubnetFailover поддерживается только при использовании протокола TCP.
zh_hans: 仅当在使用 TCP 协议时才支持使用 MultiSubnetFailover 连接选项连接到 SQL Server 实例。
zh_hant: 只有使用 TCP 通訊協定時才支援使用 MultiSubnetFailover 連接選項連接到 SQL Server 執行個體。

# SNI_ERROR_50
source: Local Database Runtime error occurred.
de: Fehler in der Local Database Runtime.
es: Se produjo un error de Local Database Runtime.
fr: Erreur de Local Database Runtime s'est produite.
it: Errore di Local Database Runtime.
ja: Local Database Runtime エラーが発生しました。
ko: Local Database Runtime 오류가 발생했습니다.
pt_br: Ocorreu um erro de Local Database Runtime.
ru: Произошла ошибка Local Database Runtime.
zh_hans: 发生了 Local Database Runtime 错误。
zh_hant: Local Database Runtime 發生錯誤。

# SNI_ERROR_51
source: An instance name was not specified while connecting to a Local Database Runtime. Specify an instance name in the format (localdb)\instance_name.
de: Bei der Verbindung mit der Local Database Runtime wurde kein Instanzname angegeben. Geben Sie einen Instanznamen im Format "(localdb)\instance_name" an.
es: No se especificó un nombre de instancia al realizar la conexión a Local Database Runtime. Especifique un nombre de instancia con el formato (localdb)\instance_name.
fr: Le nom d'instance n'a pas été spécifié lors de la connexion à un Local Database Runtime. Spécifiez un nom d'instance au format (localdb)\instance_name.
it: Nome istanza non specificato durante la connessione a Local Database Runtime. Specificare un nome di istanza nel formato (localdb)\instance_name.
ja: Local Database Runtime に接続するときにインスタンス名が指定されませんでした。(localdb)\instance_name の形式でインスタンス名を指定してください。
ko: Local Database Runtime에 연결할 때 인스턴스 이름이 지정되지 않았습니다. (localdb)\instance_name 형식으로 인스턴스 이름을 지정하십시오.
pt_br: Um nome de instância não foi especificado durante a conexão com um Local Database Runtime. Especifique um nome de instância no formato (localdb)\instance_name.
ru: Не указано имя экземпляра при соединении с Local Database Runtime. Укажите имя экземпляра в формате (localdb)\instance_name.
zh_hans: 连接到 Local Database Runtime 未指定实例名称。请以 (localdb)\instance_name 格式指定一个实例名称。
zh_hant: 連接到 Local Database Runtime 時未指定執行個體名稱。請以 (localdb)\instance_name 格式指定執行個體名稱。

# SNI_ERROR_52
source: Unable to locate a Local Database Runtime installation. Verify that SQL Server Express is properly installed and that the Local Database Runtime feature is enabled.
de: Es konnte keine Installation der Local Database Runtime gefunden werden. Überprüfen Sie, ob SQL Server Express richtig installiert und die Funktion Local Database Runtime aktiviert ist.
es: No se puede ubicar la instalación de Local Database Runtime. Compruebe que SQL Server Express se ha instalado correctamente y que se ha habilitado la característica de tiempo de ejecución de la base de datos local.
fr: Impossible de localiser l'installation d'un Local Database Runtime. Vérifiez que SQL Server Express est bien installé et que la fonctionnalité de runtime de base de données locale est activé.
it: Impossibile individuare l'installazione di Local Database Runtime. Verificare che SQL Server Express sia installato correttamente e che la funzionalità Local Database Runtime sia abilitata.
ja: Local Database Runtime のインストールが見つかりません。SQL Server Express が正しくインストールされていること、および Local Database Runtime 機能が有効になっていることを確認してください。
ko: Local Database Runtime 설치를 찾을 수 없습니다. SQL Server Express가 올바르게 설치되었고 로컬 데이터베이스 런타임 기능이 설정되었는지 확인하십시오.
pt_br: Não é possível localizar uma instalação de Local Database Runtime. Verifique se o SQL Server Express está instalado corretamente e se o recurso Tempo de Execução de Banco de Dados Local está habilitado.
ru: Не найден компонент Local Database Runtime. Проверьте, что сервер SQL Server Express правильно установлен и использование компонента Local Database Runtime включено.
zh_hans: 无法定位 Local Database Runtime 安装。请验证 SQL Server Express 是否正确安装以及本地数据库运行时功能是否已启用。
zh_hant: 找不到 Local Database Runtime 安裝。請確認 SQL Server Express 已正確安裝且 Local Database Runtime 功能已啟用。

# SNI_ERROR_53
source: Invalid Local Database Runtime registry configuration found. Verify that SQL Server Express is properly installed.
de: Es wurde eine ungültige Registrierungskonfiguration für die Local Database Runtime gefunden. Überprüfen Sie, ob SQL Server Express richtig installiert ist.
es: La configuración del Registro de Local Database Runtime no es válida. Compruebe que SQL Server Express se ha instalado correctamente.
fr: Configuration de registre de Local Database Runtime non valide. Vérifiez que SQL Server Express est bien installé.
it: Rilevata configurazione del Registro di sistema di Local Database Runtime non valida. Verificare che SQL Server Express sia installato correttamente.
ja: 無効な Local Database Runtime レジストリ構成が見つかりました。SQL Server Express が正しくインストールされていることを確認してください。
ko: 잘못된 Local Database Runtime 레지스트리 구성을 찾았습니다. SQL Server Express가 올바르게 설치되었는지 확인하십시오.
pt_br: Configuração de Registro inválida de Local Database Runtime encontrada. Verifique se o SQL Server Express está instalado corretamente.
ru: Недопустимая конфигурация реестра для компонента Local Database Runtime. Убедитесь, что SQL Server Express правильно установлен.
zh_hans: 找到了无效的 Local Database Runtime 注册表配置。请验证 SQL Server Express 是否正确安装。
zh_hant: 找到無效的 Local Database Runtime 登錄組態。請確認 SQL Server Express 已正確安裝。

# SNI_ERROR_54
source: Unable to locate the registry entry for SQLUserInstance.dll file path. Verify that the Local Database Runtime feature of SQL Server Express is properly installed.
de: Der Registrierungseintrag für den Dateipfad zur Datei "SQLUserInstance.dll" wurde nicht gefunden. Überprüfen Sie, ob die Funktion Local Database Runtime von SQL Server Express richtig installiert ist.
es: No se puede encontrar la entrada del Registro para la ruta del archivo SQLUserInstance.dll.Compruebe que la característica de Local Database Runtime de SQL Server Express se ha instalado correctamente.
fr: Impossible de localiser l'entrée de registre pour le chemin de fichier SQLUserInstance.dll. Vérifiez que la fonctionnalité de Local Database Runtime de SQL Server Express est bien installé.
it: Impossibile individuare la voce del Registro di sistema per il percorso del file SQLUserInstance.dll. Verificare che la funzionalità Local Database Runtime di SQL Server Express sia installata correttamente.
ja: SQLUserInstance.dll ファイル パスのレジストリ エントリが見つかりません。SQL Server Express の Local Database Runtime 機能が正しくインストールされていることを確認してください。
ko: SQLUserInstance.dll 파일 경로에 대한 레지스트리 항목을 찾을 수 없습니다. SQL Server Express의 Local Database Runtime 기능이 올바르게 설치되었는지 확인하십시오.
pt_br: Não é possível localizar a entrada do Registro para o caminho de arquivo de SQLUserInstance.dll. Verifique se o recurso Local Database Runtime do SQL Server Express está instalado corretamente.
ru: Не найден параметр реестра для пути к файлу SQLUserInstance.dll. Проверьте, что компонент Local Database Runtime сервера SQL Server Express правильно установлен.
zh_hans: 无法定位 SQLUserInstance.dll 文件路径的注册表项。请验证 SQL Server Express 的本 Local Database Runtime 功能是否正确安装。
zh_hant: 找不到 SQLUserInstance.dll 檔案路徑的登錄項目。請確認 SQL Server Express 的 Local Database Runtime 功能已正確安裝。

# SNI_ERROR_55
source: Registry value contains an invalid SQLUserInstance.dll file path. Verify that the Local Database Runtime feature of SQL Server Express is properly installed.
de: Der Registrierungswert enthält einen ungültigen Dateipfad für "SQLUserInstance.dll". Überprüfen Sie, ob die Funktion Local Database Runtime von SQL Server Express richtig installiert ist.
es: El valor del Registro contiene una ruta de acceso para el archivo SQLUserInstance.dll no válida. Compruebe que la característica de Local Database Runtime de SQL Server Express se ha instalado correctamente.
fr: La valeur du registre contient un chemin de fichier SQLUserInstance.dll non valide. Vérifiez que la fonctionnalité de Local Database Runtime de SQL Server Express est bien installée.
it: Il valore del Registro di sistema contiene un percorso del file SQLUserInstance.dll non valido. Verificare che la funzionalità Local Database Runtime di SQL Server Express sia installata correttamente.
ja: レジストリ値に含まれている SQLUserInstance.dll ファイル パスが無効です。SQL Server Express の Local Database Runtime 機能が正しくインストールされていることを確認してください。
ko: 레지스트리 값에 잘못된 SQLUserInstance.dll 파일 경로가 들어 있습니다. SQL Server Express의 Local Database Runtime 기능이 올바르게 설치되었는지 확인하십시오.
pt_br: O valor do Registro contém um caminho de arquivo de SQLUserInstance.dll inválido. Verifique se o recurso Local Database Runtime do SQL Server Express está instalado corretamente.
ru: Значение реестра содержит недопустимый путь к файлу SQLUserInstance.dll. Проверьте, что компонент Local Database Runtime сервера SQL Server Express правильно установлен.
zh_hans: 注册表值包含无效的 SQLUserInstance.dll 文件路径。请验证 SQL Server Express 的 Local Database Runtime 功能是否正确安装。
zh_hant: 登錄值包含無效的 SQLUserInstance.dll 檔案路徑。請確認 SQL Server Express 的 Local Database Runtime 功能已正確安裝。

# SNI_ERROR_56
source: Unable to load the SQLUserInstance.dll from the location specified in the registry. Verify that the Local Database Runtime feature of SQL Server Express is properly installed.
de: "SQLUserInstance.dll" kann nicht von dem in der Registrierung angegebenen Ort geladen werden. Überprüfen Sie, ob die Funktion Local Database Runtime von SQL Server Express richtig installiert ist.
es: No se puede cargar SQLUserInstance.dll desde la ubicación que se especificó en el Registro. Compruebe que la característica de Local Database Runtime de SQL Server Express se ha instalado correctamente.
fr: Impossible de charger SQLUserInstance.dll à partir de l'emplacement spécifié dans le registre. Vérifiez que la fonctionnalité de Local Database Runtime de SQL Server Express est bien installée.
it: Impossibile caricare SQLUserInstance.dll dal percorso specificato nel Registro di sistema. Verificare che la funzionalità Local Database Runtime di SQL Server Express sia installata correttamente.
ja: レジストリに指定されている場所から SQLUserInstance.dll を読み込むことができません。SQL Server Express の Local Database Runtime 機能が正しくインストールされていることを確認してください。
ko: 레지스트리에 지정된 위치에서 SQLUserInstance.dll을 로드할 수 없습니다. SQL Server Express의 Local Database Runtime 기능이 올바르게 설치되었는지 확인하십시오.
pt_br: Não é possível carregar SQLUserInstance.dll a partir do local especificado no Registro. Verifique se o recurso Local Database Runtime do SQL Server Express está instalado corretamente.
ru: Не удается загрузить файл SQLUserInstance.dll из местоположения, указанного в реестре. Проверьте, что компонент Local Database Runtime сервера SQL Server Express правильно установлен.
zh_hans: 无法从注册表中指定的位置加载 SQLUserInstance.dll。请验证 SQL Server Express 的 Local Database Runtime 功能是否正确安装。
zh_hant: 無法從登錄指定的位置載入 SQLUserInstance.dll。請確認 SQL Server Express 的 Local Database Runtime 功能已正確安裝。

# SNI_ERROR_57
source: Invalid SQLUserInstance.dll found at the location specified in the registry. Verify that the Local Database Runtime feature of SQL Server Express is properly installed.
de: An dem Ort, der in der Registrierung angegeben ist, wurde eine ungültige "SQLUserInstance.dll" gefunden. Überprüfen Sie, ob die Funktion Local Database Runtime von SQL Server Express richtig installiert ist.
es: SQLUserInstance.dll no válido en la ubicación especificada en el Registro. Compruebe que la característica de Local Database Runtime de SQL Server Express se ha instalado correctamente.
fr: SQLUserInstance.dll non valide à l'emplacement spécifié dans le registre. Vérifiez que la fonctionnalité du Local Database Runtime de SQL Server Express est bien installée.
it: SQLUserInstance.dll non valido trovato nel percorso specificato nel Registro di sistema. Verificare che la funzionalità Local Database Runtime di SQL Server Express sia installata correttamente.
ja: レジストリに指定されている場所で無効な SQLUserInstance.dll が見つかりました。SQL Server Express の Local Database Runtime 機能が正しくインストールされていることを確認してください。
ko: 레지스트리에 지정된 위치에서 잘못된 SQLUserInstance.dll을 찾았습니다. SQL Server Express의 Local Database Runtime 기능이 올바르게 설치되었는지 확인하십시오.
pt_br: SQLUserInstance.dll inválido encontrado no local especificado no Registro. Verifique se o recurso Local Database Runtime do SQL Server Express está instalado corretamente.
ru: Недопустимый файл SQLUserInstance.dll по адресу, указанному в реестре. Проверьте, что компонент Local Database Runtime сервера SQL Server Express правильно установлен.
zh_hans: 在注册表中指定的位置找到了无效的 SQLUserInstance.dll。请验证 SQL Server Express 的 Local Database Runtime 功能是否正确安装。
zh_hant: 在登錄指定的位置找到無效的 SQLUserInstance.dll。請確認 SQL Server Express 的 Local Database Runtime 功能已正確安裝。
