Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_CannotCreateSqlColumnEncryptionEnclaveProvider
source: Failed to instantiate an enclave provider with type '{1}' for name '{0}'. Error message: {2}
de: Fehler beim Instanziieren eines Enclave-Anbieters mit dem Typ "{1}" für den Namen "{0}". Fehlermeldung: {2}
es: No se pudo crear una instancia de un proveedor de enclave con el tipo "{1}" para el nombre "{0}". Mensaje de error: {2}
fr: Échec de l'instanciation d'un fournisseur d'enclave ayant le type '{1}' pour le nom '{0}'. Message d'erreur : {2}
it: Non è stato possibile creare un'istanza di un provider di enclave con il tipo '{1}' per il nome '{0}'. Messaggio di errore: {2}
ja: 型 '{1}'、名前 '{0}' のエンクレーブ プロバイダーをインスタンス化できませんでした。エラー メッセージ: {2}
ko: 이름 '{0}'에 대해 '{1}' 형식을 사용하여 enclave 공급자를 인스턴스화하지 못했습니다. 오류 메시지: {2}
pt_br: Falha ao criar uma instância de um provedor de enclave com tipo '{1}' para o nome '{0}'. Mensagem de erro: {2}
ru: Не удалось создать экземпляр поставщика анклава с типом "{1}" для имени "{0}". Сообщение об ошибке: {2}
zh_hans: 未能实例化类型为“{1}”，名称“{0}”为的 enclave 提供程序。错误消息: {2}
zh_hant: 無法具現化名稱為 '{0}' 類型為 '{1}' 的 enclave 提供者。錯誤訊息: {2}

# TCE_SqlColumnEncryptionEnclaveProviderNameCannotBeEmpty
source: Internal Error. SqlColumnEncryptionEnclaveProviderName cannot be null or empty.
de: Interner Fehler. SqlColumnEncryptionEnclaveProviderName darf nicht NULL oder leer sein.
es: Error interno. SqlColumnEncryptionEnclaveProviderName no puede ser nulo ni estar vacío.
fr: Erreur interne. SqlColumnEncryptionEnclaveProviderName ne peut pas avoir une valeur null ou être vide.
it: Errore interno. l'elemento SqlColumnEncryptionEnclaveProviderName non può essere Null o vuoto.
ja: 内部エラーです。SqlColumnEncryptionEnclaveProviderName を null または空にすることはできません。
ko: 내부 오류입니다. SqlColumnEncryptionEnclaveProviderName은 null이거나 비워둘 수 없습니다.
pt_br: Erro Interno. SqlColumnEncryptionEnclaveProviderName não pode ser nulo ou vazio.
ru: Внутренняя ошибка. SqlColumnEncryptionEnclaveProviderName не может быть пустым или иметь значение NULL.
zh_hans: 出现内部错误。SqlColumnEncryptionEnclaveProviderName 不能为 null 或为空。
zh_hant: 內部錯誤。SqlColumnEncryptionEnclaveProviderName 不得為 null 或空白。

# TCE_NoAttestationUrlSpecifiedForEnclaveBasedQuerySpDescribe
source: Error occured when reading '{0}' resultset. Attestation URL has not been specified in the connection string, but the query requires enclave computations. Enclave type is '{1}'.
de: Fehler beim Lesen des Resultsets "{0}". Die Nachweis-URL wurde nicht in der Verbindungszeichenfolge angegeben, aber die Abfrage erfordert Enclave-Berechnungen. Der Enclave-Typ lautet "{1}".
es: Error al leer el conjunto de resultados "{0}. La dirección URL de atestación no se ha especificado en la cadena de conexión, pero la consulta requiere cálculos de enclave. El tipo de enclave es "{1}".
fr: Une erreur s'est produite durant la lecture du jeu de résultats '{0}'. L'URL d'attestation n'a pas été spécifiée dans la chaîne de connexion alors que la requête nécessite des calculs d'enclave. Le type d'enclave est '{1}'.
it: Si è verificato un errore durante la lettura del set di risultati '{0}'. L'URL di attestazione non è stato specificato nella stringa di connessione, ma la query richiede calcoli enclave. Il tipo di enclave è '{1}'.
ja: '{0}' の結果セットの読み取り中にエラーが発生しました。接続文字列では構成証明 URL が指定されていませんが、クエリではエンクレーブ計算が必要です。エンクレーブ型は '{1}' です。
ko: '{0}' 결과 집합을 읽을 때 오류가 발생했습니다. 증명 URL이 연결 문자열에 지정되지 않았지만 쿼리에 enclave 계산이 필요합니다. enclave 형식은 '{1}'입니다.
pt_br: Ocorreu um erro ao ler o conjunto de resultados '{0}'. A URL de atestado não foi especificada na cadeia de conexão, mas a consulta requer cálculos de enclave. O tipo de enclave é '{1}'.
ru: Произошла ошибка при чтении результирующего набора "{0}". URL-адрес аттестации не указан в строке подключения, но для запроса требуются вычисления анклава. Тип анклава — "{1}".
zh_hans: 读取“{0}”结果集时出错。尚未在连接字符串中指定证明 URL，但查询需要 enclave 计算。Enclave 类型为“{1}”。
zh_hant: 讀取 '{0}' 結果集時發生錯誤。連接字串中未指定證明 URL，但查詢需要 enclave 計算。enclave 類型為 '{1}'。

# TCE_NoAttestationUrlSpecifiedForEnclaveBasedQueryGeneratingEnclavePackage
source: Error occured when generating enclave package. Attestation URL has not been specified in the connection string, but the query requires enclave computations. Enclave type is '{0}'.
de: Fehler beim Generieren des Enclave-Pakets. Die Nachweis-URL wurde nicht in der Verbindungszeichenfolge angegeben, aber die Abfrage erfordert Enclave-Berechnungen. Der Enclave-Typ lautet "{0}".
es: Error al generar el paquete de enclave. La dirección URL de atestación no se ha especificado en la cadena de conexión, pero la consulta requiere cálculos de enclave. El tipo de enclave es "{0}".
fr: Une erreur s'est produite durant la génération du package de l'enclave. L'URL d'attestation n'a pas été spécifiée dans la chaîne de connexion alors que la requête nécessite des calculs d'enclave. Le type d'enclave est '{0}'.
it: Si è verificato un errore durante la generazione del pacchetto dell'enclave. L'URL di attestazione non è stato specificato nella stringa di connessione, ma la query richiede calcoli enclave. Il tipo di enclave è '{0}'.
ja: エンクレーブ パッケージの生成中にエラーが発生しました。接続文字列の中では構成証明 URL が指定されていませんが、クエリではエンクレーブ計算が必要です。エンクレーブ型は '{0}' です。
ko: enclave 패키지를 생성할 때 오류가 발생했습니다. 증명 URL이 연결 문자열에 지정되지 않았지만 쿼리에 enclave 계산이 필요합니다. enclave 형식은 '{0}'입니다.
pt_br: Ocorreu um erro ao gerar o pacote de enclave. A URL de atestado não foi especificada na cadeia de conexão, mas a consulta requer cálculos de enclave. O tipo de enclave é '{0}'.
ru: Произошла ошибка при создании пакета анклава. URL-адрес аттестации не указан в строке подключения, но для запроса требуются вычисления анклава. Тип анклава — "{0}".
zh_hans: 生成 enclave 包时出错。尚未在连接字符串中指定证明 URL，但查询需要 enclave 计算。Enclave 类型为“{0}”。
zh_hant: 產生 enclave 套件時發生錯誤。連接字串中未指定證明 URL，但查詢需要 enclave 計算。enclave 類型為 '{0}'。

# TCE_EnclaveTypeNullForEnclaveBasedQuery
source: Internal Error. Enclave type received from SQL Server is null or empty when executing a query requiring enclave computations.
de: Interner Fehler. Beim Ausführen einer Abfrage, die Enclave-Berechnungen erfordert, war der von SQL Server empfangene Enclave-Typ leer oder NULL.
es: Error interno. El tipo de enclave recibido de SQL Server es nulo o está vacío al ejecutar una consulta que requiere cálculos de enclave.
fr: Erreur interne. Le type d'enclave reçu de la part de SQL Server a une valeur null ou est vide durant l'exécution d'une requête qui nécessite des calculs d'enclave.
it: Errore interno. Il tipo di enclave ricevuto da SQL Server è Null o vuoto quando si esegue una query che richiede calcoli enclave.
ja: 内部エラーです。エンクレーブ計算が必要なクエリを実行するときに SQL Server から受信したエンクレーブ型が null または空です。
ko: 내부 오류가 발생했습니다. enclave 계산이 필요한 쿼리를 실행할 때 SQL Server에서 수신된 enclave 형식이 null이거나 비어 있습니다.
pt_br: Erro Interno. O tipo de enclave recebido do SQL Server é nulo ou vazio ao executar uma consulta que requer cálculos de enclave.
ru: Внутренняя ошибка. При выполнении запроса, требующего вычислений анклава, из SQL Server получен пустой или равный NULL тип.
zh_hans: 出现内部错误。执行需要 enclave 计算的查询时，接收自 SQL Server 的 enclave 类型为 null 或为空。
zh_hant: 內部錯誤。執行需要 enclave 計算的查詢時，從 SQL Server 收到了 null 或空白的 enclave 類型。

# TCE_EnclaveProvidersNotConfiguredForEnclaveBasedQuery
source: Executing a query requires enclave computations, but the application configuration is missing the enclave provider section.
de: Das Ausführen einer Abfrage erfordert Enclave-Berechnungen, aber die Anwendungskonfiguration enthält keinen Abschnitt zum Enclave-Anbieter.
es: La ejecución de una consulta requiere cálculos de enclave, pero falta la sección de proveedor de enclave en la configuración de la aplicación.
fr: L'exécution d'une requête nécessite des calculs d'enclave. Toutefois, il manque la section relative aux fournisseurs d'enclaves dans la configuration de l'application.
it: Per eseguire una query, sono richiesti calcoli enclave, ma nella configurazione dell'applicazione manca la sezione relativa al provider di enclave.
ja: クエリを実行するためにエンクレーブ計算が必要ですが、アプリケーション構成にエンクレーブ プロバイダー セクションがありません。
ko: 쿼리를 실행하려면 enclave 계산이 필요하지만 응용 프로그램 구성에 enclave 공급자 섹션이 없습니다.
pt_br: Executar uma consulta requer cálculos de enclave, mas na configuração do aplicativo está faltando a seção de provedor de enclave.
ru: Для выполнения запроса требуются вычисления анклава, но в конфигурации приложения отсутствует раздел поставщика анклава.
zh_hans: 需要 enclave 计算才可执行查询，但应用程序配置缺少 enclave 提供程序节。
zh_hant: 執行查詢需要 enclave 計算，但應用程式組態沒有 enclave 提供者區段。

# TCE_EnclaveProviderNotFound
source: No enclave provider found for enclave type '{0}'. Please specify the provider in the application configuration.
de: Für den Enclave-Typ "{0}" wurde kein Enclave-Anbieter gefunden. Geben Sie den Anbieter in der Anwendungskonfiguration an.
es: No se encontró ningún proveedor de enclave para el tipo de enclave "{0}". Especifique el proveedor en la configuración de la aplicación.
fr: Fournisseur d'enclave introuvable pour le type d'enclave '{0}'. Spécifiez le fournisseur dans la configuration de l'application.
it: Non è stato trovato alcun provider di enclave per il tipo di enclave '{0}'. Specificare il provider nella configurazione dell'applicazione.
ja: エンクレーブ型 '{0}' のエンクレーブ プロバイダーが見つかりません。アプリケーション構成でプロバイダーを指定してください。
ko: enclave 형식 '{0}'에 대해 enclave 공급자를 찾지 못했습니다. 응용 프로그램 구성에서 공급자를 지정하세요.
pt_br: Nenhum provedor de enclave encontrado para o tipo de enclave '{0}'. Especifique o provedor na configuração do aplicativo.
ru: Поставщик анклава не найден для типа анклава "{0}". Укажите поставщик в конфигурации приложения.
zh_hans: 找不到 enclave 类型“{0}”的 enclave 提供程序。请在应用程序配置中指定提供程序。
zh_hant: 找不到 enclave 類型為 '{0}' 的 enclave 提供者。請在應用程式組態中指定提供者。

# TCE_NullEnclaveSessionReturnedFromProvider
source: Unable to communicate with the enclave. Null enclave session information received from the enclave provider. Enclave type is '{0}' and enclave attestation URL is '{1}'.
de: Kommunikation mit Enclave nicht möglich. Die vom Enclave-Anbieter empfangenen Enclave-Sitzungsinformationen lauteten NULL. Enclave-Typ: {0}, Enclave-Nachweis-URL: {1}.
es: No se ha podido comunicar con el enclave. Se ha recibido información de sesión de enclave nula del proveedor de enclave. El tipo de enclave es "{0}" y la dirección URL de atestación de enclave es "{1}".
fr: Impossible de communiquer avec l'enclave. Des informations de session d'enclave ayant une valeur null ont été reçues de la part du fournisseur d'enclave. Le type d'enclave est '{0}' et l'URL d'attestation d'enclave est '{1}'.
it: Non è possibile comunicare con l'enclave. Le informazioni sulla sessione dell'enclave ricevute dal provider di enclave sono Null. Il tipo di enclave è '{0}' e l'URL di attestazione dell'enclave è '{1}'.
ja: エンクレーブと通信できません。エンクレーブ プロバイダーから受信したエンクレーブ セッション情報が null です。エンクレーブ型は '{0}' で、エンクレーブ構成証明 URL は '{1}' です。
ko: enclave와 통신할 수 없습니다. Null enclave 세션 정보를 enclave 공급자로부터 받았습니다. enclave 형식은 '{0}'이고 enclave 증명 URL은 '{1}'입니다.
pt_br: Não é possível se comunicar com o enclave. Informações da sessão nula de enclave recebidas do provedor de enclave. O tipo de enclave é '{0}' e a URL do atestado de enclave é '{1}'.
ru: Не удалось связаться с анклавом. Сведения о сеансе анклава, равные NULL, получены от поставщика анклава. Тип анклава — "{0}", а URL-адрес аттестации анклава — "{1}".
zh_hans: 无法与 enclave 通信。接收自 enclave 提供程序的 enclave 会话信息为 null。Enclave 类型为“{0}”，enclave 证明 URL 为“{1}”。
zh_hant: 無法與 enclave 通訊。從 enclave 提供者接收到 null enclave 工作階段資訊。enclave 類型為 '{0}'，enclave 證明 URL 為 '{1}'。

# TCE_ParamInvalidForceColumnEncryptionSetting
source: Cannot set {0} for {3} '{1}' because encryption is not enabled for the statement or procedure '{2}'.
de: {0} kann nicht für {3} '{1}' festgelegt werden, da für die Anweisung oder Prozedur '{2}' keine Verschlüsselung aktiviert ist.
es: No se puede establecer {0} para {3} "{1}" porque el cifrado no está habilitado para la instrucción o el procedimiento "{2}".
fr: Impossible de définir {0} pour {3} « {1} », car le chiffrement n’est pas activé pour l’instruction ou la procédure « {2} ».
it: Non è possibile impostare {0} per {3} '{1}' perché la crittografia non è abilitata per l'istruzione o la routine '{2}'.
ja: ステートメントまたはプロシージャ '{2}' の暗号化が有効ではないため、{0} を {3} '{1}' に設定できません。
ko: '{2}' 문 또는 프로시저에 암호화를 사용할 수 없으므로 {3} '{1}'에 대해 {0}을(를) 설정할 수 없습니다.
pt_br: Não é possível definir {0} para {3} '{1}' porque a criptografia não foi habilitada para a instrução ou o procedimento '{2}'.
ru: Не удается задать значение {0} для {3} "{1}", так как шифрование не включено для инструкции или процедуры "{2}".
zh_hans: 不能将 {0} 设置为 {3}“{1}”，因为该语句或程序“{2}”未启用加密。
zh_hant: 因為未對陳述式或程序 '{2}' 啟用加密，所以無法為 {3} '{1}' 設定 {0}。

# TCE_ParamUnExpectedEncryptionMetadata
source: Cannot execute statement or procedure '{1}' because {2} was set for {3} '{0}' and the database expects this parameter to be sent as plaintext. This may be due to a configuration error.
de: Die Anweisung oder die Prozedur '{1}' kann nicht ausgeführt werden, da {2} für {3} '{0}' festgelegt wurde und die Datenbank erwartet, dass dieser Parameter als Klartext gesendet wird. Dies kann auf einen Konfigurationsfehler zurückzuführen sein.
es: No se puede ejecutar la instrucción o el procedimiento "{1}" porque {2} se estableció para {3} "{0}" y la base de datos espera que este parámetro se envíe como texto sin formato. Esto puede deberse a un error de configuración.
fr: Impossible d’exécuter l’instruction ou la procédure « {1} », car {2} a été défini pour {3} « {0} » et la base de données s’attend à ce que ce paramètre soit envoyé sous forme de texte brut. Cela peut être dû à une erreur de configuration.
it: Non è possibile eseguire l'istruzione o la routine '{1}' perché è stato impostato {2} per {3} '{0}' e il database prevede che questo parametro venga inviato come testo normale. Il problema potrebbe dipendere da un errore di configurazione.
ja: {2} が {3} '{0}' として設定されており、データベースはこのパラメーターがプレーン テキストとして送信されることを想定しているので、ステートメントまたはプロシージャ '{1}' を実行することはできません。これは構成エラーが原因と考えられます。
ko: {2}이(가) {3} '{0}'에 대해 설정되어 있고 데이터베이스에서 이 매개 변수가 일반 텍스트로 전송되어야 하기 때문에 '{1}' 문 또는 프로시저를 실행할 수 없습니다. 이는 구성 오류 때문일 수 있습니다.
pt_br: Não é possível executar a instrução ou o procedimento '{1}' porque {2} foi definido como {3} '{0}' e o banco de dados espera que esse parâmetro esteja em texto simples. Isso pode ter sido causado por um erro de configuração.
ru: Не удается выполнить инструкцию или процедуру "{1}", так как для параметра {3} "{0}" было задано значение {2}, и база данных ожидает, что этот параметр будет отправлен в виде простого текста. Такая ситуация может возникнуть из-за ошибки конфигурации.
zh_hans: 无法执行语句或程序“{1}”，因为 {2} 被设置为 {3}“{0}”，并且数据库要求此参数以纯文本的形式发送。这可能是由于配置错误引起的。
zh_hant: 因為已為 {3} '{0}' 設定 {2}，且資料庫需要此參數才可用純文字傳送，因此無法執行陳述式或程序 '{1}'。可能是組態錯誤所致。

# TCE_NotSupportedByServer
source: {0} instance in use does not support column encryption.
de: Verwendete {0}-Instanz unterstützt die Spaltenverschlüsselung nicht.
es: La instancia de {0} en uso no admite el cifrado de columnas.
fr: L’instance {0} utilisée ne prend pas en charge le chiffrement de colonne.
it: L'istanza {0} in uso non supporta la crittografia di colonna.
ja: 使用中の {0} インスタンスは列暗号化をサポートしていません。
ko: 사용 중인 {0} 인스턴스에서 열 암호화를 지원하지 않습니다.
pt_br: A instância {0} não dá suporte à criptografia de coluna.
ru: Используемый экземпляр {0} не поддерживает шифрование столбцов.
zh_hans: 使用的 {0} 实例不支持列加密。
zh_hant: 使用中的 {0} 執行個體不支援資料行加密。

# TCE_EnclaveComputationsNotSupported
source: You have specified the enclave attestation URL in the connection string, but the SQL Server instance in use does not support enclave based computations.
de: Sie haben die Enclave-Nachweis-URL in der Verbindungszeichenfolge angegeben, aber die SQL Server-Instanz unterstützt keine Enclave-basierten Berechnungen.
es: Ha especificado la dirección URL de atestación de enclave en la cadena de conexión, pero la instancia de SQL Server en uso no admite cálculos basados en enclave.
fr: Vous avez spécifié l'URL d'attestation d'enclave dans la chaîne de connexion, mais l'instance SQL Server utilisée ne prend pas en charge les calculs basés sur des enclaves.
it: L'URL di attestazione dell'enclave è stato specificato nella stringa di connessione, ma l'istanza di SQL Server non supporta i calcoli basati su enclave.
ja: 接続文字列の中でエンクレーブ構成証明 URL が指定されていますが、使用中の SQL Server インスタンスではエンクレーブに基づく計算がサポートされていません。
ko: 연결 문자열에 enclave 증명 URL을 지정했지만 사용 중인 SQL Server 인스턴스가 enclave 기반 계산을 지원하지 않습니다.
pt_br: Você especificou a URL de atestado do enclave na cadeia de conexão, mas a instância do SQL Server não dá suporte para cálculos baseados em enclave.
ru: В строке подключения указан URL-адрес аттестации анклава, но используемый экземпляр SQL Server не поддерживает вычисления на основе анклава.
zh_hans: 已在连接字符串中指定 enclave 证明 URL，但正在使用的 SQL Server 实例不支持基于 enclave 的计算。
zh_hant: 您在連接字串中指定了 enclave 證明 URL，但使用的 SQL Server 執行個體不支援 enclave 類型的計算。

# TCE_EnclaveTypeNotReturned
source: You have specified the enclave attestation URL in the connection string, but the SQL Server instance did not return an enclave type. Please make sure the enclave type is correctly configured in your instance.
de: Sie haben die Enclave-Nachweis-URL in der Verbindungszeichenfolge angegeben, aber die SQL Server-Instanz hat keinen Enclave-Typ zurückgegeben. Stellen Sie sicher, dass der Enclave-Typ ordnungsgemäß in Ihrer Instanz konfiguriert wurde.
es: Ha especificado la dirección URL de atestación de enclave en la cadena de conexión, pero la instancia de SQL Server no devolvió un tipo de enclave. Asegúrese de que el tipo de enclave está configurado correctamente en la instancia.
fr: Vous avez spécifié l'URL d'attestation d'enclave dans la chaîne de connexion, mais l'instance SQL Server n'a pas retourné de type d'enclave. Vérifiez que le type d'enclave est correctement configuré dans votre instance.
it: L'URL di attestazione dell'enclave è stato specificato nella stringa di connessione, ma l'istanza di SQL Server non ha restituito un tipo di enclave. Assicurarsi che il tipo di enclave sia configurato correttamente nell'istanza.
ja: 接続文字列の中でエンクレーブ構成証明 URL が指定されていますが、SQL Server インスタンスからはエンクレーブ型が返されませんでした。お使いのインスタンスでエンクレーブ型が正しく構成されていることをご確認ください。
ko: 연결 문자열에 enclave 증명 URL을 지정했지만 SQL Server 인스턴스는 enclave 형식을 반환하지 않았습니다. enclave 형식이 인스턴스에 올바르게 구성되어 있는지 확인하세요.
pt_br: Você especificou a URL de atestado do enclave na cadeia de conexão, mas a instância do SQL Server não retornou um tipo de enclave. Certifique-se de que o tipo de enclave esteja configurado corretamente na sua instância.
ru: В строке подключения указан URL-адрес аттестации анклава, но экземпляр SQL Server не вернул тип анклава. Убедитесь, что тип анклава правильно настроен в вашем экземпляре.
zh_hans: 连接字符串中已指定 enclave 证明 URL，但 SQL Server 实例未返回 enclave 类型。请确保在实例中正确配置 enclave 类型。
zh_hant: 您在連接字串中指定了 enclave 證明 URL，但 SQL Server 執行個體未傳回 enclave 類型。請確定您執行個體中的 enclave 類型設定正確。

# TCE_BatchedUpdateColumnEncryptionSettingMismatch
source: {0} should be identical on all commands ({1}, {2}, {3}, {4}) when doing batch updates.
de: {0} muss beim Durchführen von Batchupdates für alle Befehle ({1}, {2}, {3}, {4}) identisch sein.
es: {0} debería ser idéntico en todos los comandos ({1}, {2}, {3}, {4}) cuando se ejecutan actualizaciones en lote.
fr: {0} doit être identique dans toutes les commandes ({1}, {2}, {3}, {4}) pendant la réalisation de mises à jour par lot.
it: Quando si eseguono aggiornamenti in batch, {0} deve essere identico in tutti i comandi ({1}, {2}, {3}, {4}).
ja: バッチ更新を実行する際は、{0} を全コマンド ({1}、{2}、{3}、{4}) 上で一致させる必要があります。
ko: 일괄 업데이트를 수행할 때 {0}이(가) 모든 명령({1}, {2}, {3}, {4})에서 동일해야 합니다.
pt_br: {0} deve corresponder em todos os comandos ({1}, {2}, {3}, {4}) nas atualizações em lote.
ru: Параметр {0} должен быть одинаковым для всех команд ({1}, {2}, {3}, {4}) при выполнении пакетных обновлений.
zh_hans: 执行批更新时，{0} 的执行方式应与所有命令({1}、{2}、{3}、{4})的执行方式相同。
zh_hant: 執行批次更新時，所有命令 ({1}、{2}、{3}、{4}) 中的 {0} 必須一致。

# TCE_StreamNotSupportOnEncryptedColumn
source: Retrieving encrypted column '{0}' as a {1} is not supported.
de: Das Abrufen der verschlüsselten Spalte '{0}' als {1} wird nicht unterstützt.
es: La recuperación de la columna cifrada "{0}" como {1} no es compatible.
fr: La récupération de la colonne chiffrée « {0} » comme {1} n’est pas prise en charge.
it: Il recupero della colonna crittografata '{0}' come {1} non è supportato.
ja: 暗号化列 '{0}' を {1} として取得することはサポートされていません。
ko: 암호화된 열 '{0}'을(를) {1}(으)로 검색하는 것은 지원되지 않습니다.
pt_br: A recuperação da coluna criptografada '{0}' como {1} não tem suporte
ru: Получение зашифрованного столбца "{0}" в виде {1} не поддерживается.
zh_hans: 不支持将加密的列“{0}”作为 {1} 进行检索。
zh_hant: 正在擷取加密資料行 '{0}'，因為 {1} 不受支援。

# TCE_SequentialAccessNotSupportedOnEncryptedColumn
source: Retrieving encrypted column '{0}' with {1} is not supported.
de: Das Abrufen der verschlüsselten Spalte '{0}' mit {1} wird nicht unterstützt.
es: La recuperación de la columna cifrada "{0}" con {1} no es compatible.
fr: La récupération de la colonne chiffrée « {0} » avec {1} n’est pas prise en charge.
it: Il recupero della colonna crittografata '{0}' con {1} non è supportato.
ja: {1} による暗号化列 '{0}' の取得はサポートされていません。
ko: {1}을(를) 사용하여 암호화된 열 '{0}'을(를) 검색하는 것은 지원되지 않습니다.
pt_br: A recuperação da coluna criptografada '{0}' com {1} não é compatível.
ru: Получение зашифрованного столбца "{0}" с помощью {1} не поддерживается.
zh_hans: 不支持使用 {1} 检索加密的列“{0}”。
zh_hant: 正在擷取加密資料行 '{0}'，因為 {1} 不受支援。

# TCE_CanOnlyCallOnce
source: Key store providers cannot be set more than once.
de: Schlüsselspeicheranbieter dürfen nicht mehrfach festgelegt werden.
es: Los proveedores de almacenamiento de claves no se pueden establecer más de una vez.
fr: Impossible de définir plusieurs fois les fournisseurs de magasins de clés.
it: Non è possibile impostare i provider dell'archivio chiavi più di una volta.
ja: キー ストア プロバイダーを複数回設定することはできません。
ko: 키 저장소 공급자를 두 번 이상 설정할 수 없습니다.
pt_br: Os provedores de armazenamento de chave não podem ser definidos mais de uma vez.
ru: Невозможно задать поставщиков хранилища ключей более одного раза.
zh_hans: 不能多次设置密钥存储提供程序。
zh_hant: 金鑰存放區提供者不能設定超過一次。

# TCE_NullCustomKeyStoreProviderDictionary
source: Column encryption key store provider dictionary cannot be null. Expecting a non-null value.
de: Schlüsselverzeichnis des Spaltenverschlüsselungsschlüsselanbieters darf nicht NULL sein. Es wird ein Nicht-Null-Wert erwartet.
es: El diccionario del proveedor de almacenamiento de claves de cifrado de columnas no puede ser nulo. Se espera un valor no nulo.
fr: Le dictionnaire du fournisseur de magasins de clés de chiffrement de colonne ne peut pas avoir la valeur null. Une valeur non-null est attendue.
it: Il dizionario del provider dell'archivio chiavi di crittografia di colonna non può essere Null. È previsto un valore non Null.
ja: 列暗号化キー ストア プロバイダー ディクショナリを Null にすることはできません。Null 以外の値が必要です。
ko: 열 암호화 키 저장소 공급자 사전은 null일 수 없습니다. Null이 아닌 값이 필요합니다.
pt_br: O dicionário do provedor de armazenamento da chave de criptografia da coluna não pode ser nulo. Esperado um valor não nulo.
ru: Словарь поставщика хранилища ключей шифрования столбцов не может иметь значение Null. Ожидается значение, отличное от Null.
zh_hans: 列加密密钥存储提供程序字典不能为 null。应是非 null 值。
zh_hant: 資料行加密金鑰存放區提供者字典不能是 Null。應為非 Null 的值。
