Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataTableChildRelationsDescr
source: Returns the child relations for this table.
de: Gibt die untergeordneten Beziehungen für diese Tabelle zurück.
es: Devuelve las relaciones secundarias de esta tabla.
fr: Retourne les relations enfants pour cette table.
it: Restituisce le relazioni figlio per questa tabella.
ja: このテーブルの子リレーションシップを返します。
ko: 이 테이블에 대한 자식 관계를 반환합니다.
pt_br: Retorna as relações filho desta tabela.
ru: Возвращает для этой таблицы дочерние отношения.
zh_hans: 返回此表的子关系。
zh_hant: 傳回這個資料表的子關聯。

# DataTableColumnsDescr
source: The collection that holds the columns for this table.
de: Die Sammlung, die die Spalten für diese Tabelle enthält.
es: La colección que contiene las columnas para esta tabla.
fr: La collection qui contient les colonnes pour cette table.
it: Raccolta che contiene le colonne per questa tabella.
ja: このテーブルの列を含むコレクションです。
ko: 이 테이블에 대한 열을 보유하는 컬렉션입니다.
pt_br: A coleção que retém as colunas desta tabela.
ru: Коллекция, в которой содержатся столбцы для этой таблицы.
zh_hans: 保留该表的列的集合。
zh_hant: 保存這個資料表中資料行的集合。

# DataTableConstraintsDescr
source: The collection that holds the constraints for this table.
de: Die Sammlung, die die Einschränkungen für diese Tabelle enthält.
es: La colección que contiene las restricciones para esta tabla.
fr: La collection qui contient les contraintes pour cette table.
it: Raccolta che contiene i vincoli per questa tabella.
ja: このテーブルの制約を含むコレクションです。
ko: 이 테이블에 대한 제약 조건을 보유하는 컬렉션입니다.
pt_br: A coleção que retém as restrições desta tabela.
ru: Коллекция, в которой содержатся ограничения для этой таблицы.
zh_hans: 保留该表的约束的集合。
zh_hant: 保存這個資料表中條件約束的集合。

# DataTableDataSetDescr
source: Indicates the DataSet to which this table belongs.
de: Gibt das DataSet an, zu dem diese Tabelle gehört.
es: Indica la DataSet a la que pertenece esta tabla.
fr: Indique le DataSet auquel appartient cette table.
it: Indica il DataSet a cui appartiene questa tabella.
ja: このテーブルが属する DataSet を示します。
ko: 이 테이블이 속해 있는 DataSet을 나타냅니다.
pt_br: Indica o DataSet a que pertence esta tabela.
ru: Указывает DataSet, которому принадлежит эта таблица.
zh_hans: 指示此表所属的 DataSet。
zh_hant: 表示這個 DataSet 所屬的資料集。

# DataTableDefaultViewDescr
source: This is the default DataView for the table.
de: Dies ist die standardmäßige DataView für diese Tabelle.
es: DataView predeterminado de la tabla.
fr: DataView par défaut pour la table.
it: DataView predefinito per la tabella.
ja: これは、テーブルの既定 DataView です。
ko: 테이블에 대한 기본 DataView입니다.
pt_br: Este é o DataView padrão da tabela.
ru: DataView по умолчанию для данной таблицы.
zh_hans: 这是该表的默认 DataView。
zh_hant: 這是資料表的預設 DataView。

# DataTableDisplayExpressionDescr
source: The expression used to compute the data-bound value of this row.
de: Der Ausdruck, der verwendet wird, um den datengebundenen Wert dieser Zeile zu berechnen.
es: La expresión utilizada para calcular el valor enlazado a datos de esta fila.
fr: L'expression utilisée pour calculer la valeur liée aux données de cette ligne.
it: Espressione utilizzata per calcolare il valore con associazione a dati di questa riga.
ja: この行のデータ連結値の計算に使用する式です。
ko: 이 행의 데이터 바인딩된 값을 계산하는 데 사용되는 식입니다.
pt_br: A expressão usada para calcular o valor de limite de dados desta linha.
ru: Выражение для вычисления привязанного к данным значения этой строки.
zh_hans: 用于计算此行的数据绑定值的表达式。
zh_hant: 用來計算這個資料列資料繫結值的運算式。

# DataTableHasErrorsDescr
source: Returns whether the table has errors.
de: Gibt zurück, ob die Tabelle Fehler enthält.
es: Indica si la tabla tiene errores.
fr: Indique si la table contient des erreurs.
it: Restituisce informazioni su eventuali errori della tabella.
ja: テーブルにエラーがあるかどうかを返します。
ko: 테이블에 오류가 있는지 여부를 반환합니다.
pt_br: Retorna se há erros na tabela.
ru: Возвращает признак того, содержит ли таблица ошибки.
zh_hans: 返回该表是否有错误。
zh_hant: 傳回資料表是否有錯誤。

# DataTableLocaleDescr
source: Indicates a locale under which to compare strings within the table.
de: Gibt einen Ort an, an dem Zeichenfolgen innerhalb der Tabelle verglichen werden.
es: Indica una configuración regional con la que se pueden comparar las cadenas de la tabla.
fr: Indique des paramètres régionaux avec lesquels comparer des chaînes dans la table.
it: Indica le impostazioni locali in base a cui confrontare le stringhe all'interno della tabella.
ja: テーブル内の文字列を比較するロケールを示します。
ko: 테이블 내의 문자열을 비교할 로케일을 나타냅니다.
pt_br: Indica uma localidade com a qual serão comparadas as cadeias de caracteres da tabela.
ru: Указывает языковой стандарт, в соответствии с которым должны сравниваться строки в данной таблице.
zh_hans: 指示在表中比较字符串时所用的区域设置。
zh_hant: 指定在資料表中比較字串時的使用地區設定。

# DataTableMinimumCapacityDescr
source: Indicates an initial starting size for this table.
de: Gibt eine Startgröße für diese Tabelle an.
es: Indica el tamaño inicial para esta tabla.
fr: Indique une taille de début initiale pour cette table.
it: Indica una dimensione iniziale per questa tabella.
ja: このテーブルの初期の開始サイズを示します。
ko: 이 테이블의 초기 시작 크기를 나타냅니다.
pt_br: Indica o tamanho inicial desta tabela.
ru: Указывает исходный начальный размер этой таблицы.
zh_hans: 指示此表最初的起始大小。
zh_hant: 表示這個資料表的初始開始大小。

# DataTableNamespaceDescr
source: Indicates the XML uri namespace for the elements contained in this table.
de: Gibt den XML-URI-Namensbereich für die Elemente an, die sich in dieser Tabelle befinden.
es: Indica el espacio de nombres del uri de XML para los elementos contenidos en esta tabla.
fr: Indique l'espace de noms URI XML pour les éléments contenus dans cette table.
it: Indica lo spazio dei nomi URI XML per gli elementi contenuti in questa tabella.
ja: このテーブルに含まれる要素の XML URI 名前空間を示します。
ko: 이 테이블에 포함된 요소에 대한 XML URI 네임스페이스를 나타냅니다.
pt_br: Indica o espaço para nome do uri de XML para o elemento contido nesta tabela.
ru: Указывает пространство имен URI XML для элементов, содержащихся в этой таблице.
zh_hans: 指示此表中所包含元素的 XML URI 命名空间。
zh_hant: 表示這個資料表中所包含元素的 XML URI 命名空間。

# DataTablePrefixDescr
source: Indicates the Prefix of the namespace used for this table in XML representation.
de: Gibt das Präfix des Namensbereichs an, der für diese Tabelle in der XML-Darstellung verwendet wird.
es: Indica el prefijo del espacio de nombres utilizado para esta tabla en representación XML.
fr: Indique le préfixe de l'espace de noms utilisé pour cette table dans la représentation XML.
it: Indica il prefisso dello spazio dei nomi utilizzato per questa tabella nella rappresentazione XML.
ja: このテーブルに使われる名前空間のプレフィックスを XML で示します。
ko: 이 테이블에 사용된 네임스페이스의 접두사를 XML 표현으로 나타냅니다.
pt_br: Indica o prefixo do espaço para nome usado para esta tabela na representação XML.
ru: Указывает префикс пространства имен, используемого для этой таблицы в XML-представлении.
zh_hans: 指示 XML 表示形式中用于此表的命名空间的前缀。
zh_hant: 代表在 XML 表示中這個資料表所使用命名空間的前置詞。

# DataTableParentRelationsDescr
source: Returns the parent relations for this table.
de: Gibt die übergeordneten Beziehungen für diese Tabelle zurück.
es: Devuelve las relaciones primarias para esta tabla.
fr: Retourne les relations parentes pour cette table.
it: Restituisce le relazioni padre per questa tabella.
ja: このテーブルの親リレーションシップを返します。
ko: 이 테이블에 대한 부모 관계를 반환합니다.
pt_br: Retorna as relações pai desta tabela.
ru: Возвращает для этой таблицы родительские отношения.
zh_hans: 返回此表的父关系。
zh_hant: 傳回這個資料表的父關聯。

# DataTablePrimaryKeyDescr
source: Indicates the column(s) that represent the primary key for this table.
de: Gibt die Spalte(n) an, die den Primärschlüssel für diese Tabelle darstellen.
es: Indica las columnas que representan la clave principal para esta tabla.
fr: Indique les colonnes qui représentent la clé primaire pour cette table.
it: Indica una o più colonne che rappresentano la chiave primaria di questa tabella.
ja: このテーブルの主キーを示す列を示します。
ko: 이 테이블의 기본 키를 표현하는 열을 나타냅니다.
pt_br: Indica a(s) coluna(s) que representa(m) a chave primária desta tabela.
ru: Указывает столбцы, где представлен первичный ключ этой таблицы.
zh_hans: 指示表示此表主键的列。
zh_hant: 表示提供這個資料表主索引鍵的資料行。

# DataTableRowsDescr
source: Indicates the collection that holds the rows of data for this table.
de: Gibt die Sammlung an, die die Datenzeilen für diese Tabelle enthält.
es: Indica la colección que contiene las filas de datos de esta tabla.
fr: Indique la collection qui contient les lignes de données pour cette table.
it: Indica la raccolta che contiene le righe di dati di questa tabella.
ja: このテーブルのデータの行を保持するコレクションを示します。
ko: 이 테이블에 대한 데이터 행을 보유하는 컬렉션을 나타냅니다.
pt_br: Indica a coleção que retém as linhas de dados desta tabela.
ru: Указывает коллекцию, в которой содержатся строки данных для этой таблицы.
zh_hans: 指示保留此表的数据行的集合。
zh_hant: 表示儲存這個資料表內資料的資料列的集合。

# DataTableTableNameDescr
source: Indicates the name used to look up this table in the Tables collection of a DataSet.
de: Gibt den Namen an, der verwendet wird, um diese Tabelle in der Tables-Sammlung eines DataSets zu suchen.
es: Indica el nombre utilizado para buscar esta tabla en la colección Tables de un DataSet.
fr: Indique le nom utilisé pour rechercher dans cette table dans la collection Tables d'un DataSet.
it: Indica il nome utilizzato per cercare questa tabella nella raccolta Tables di un DataSet.
ja: DataSet の Tables コレクションでこのテーブルを照合するために使う名前を示します。
ko: DataSet의 Tables 컬렉션에서 이 테이블을 찾는 데 사용되는 이름을 나타냅니다.
pt_br: Indica o nome usado para pesquisar esta tabela na coleção Tables de um DataSet.
ru: Указывает имя, используемое для поиска этой таблицы в коллекции таблиц Tables из DataSet.
zh_hans: 指示在 DataSet 的 Tables 集合中查找此表时所用的表名称。
zh_hant: 表示用來在 DataSet 的 Tables 集合中查詢這個資料表的名稱。

# DataTableRowChangedDescr
source: Occurs after a row in the table has been successfully edited.
de: Tritt auf, wenn eine Zeile in der Tabelle erfolgreich bearbeitet wurde.
es: Tiene lugar después de que se edite correctamente una fila en la tabla.
fr: Se produit lorsqu'une ligne de la table a été modifiée avec succès.
it: Generato in seguito alla modifica di una riga della tabella.
ja: テーブルの行が正常に編集された後に発生します。
ko: 테이블에서 행을 편집한 후에 발생합니다.
pt_br: Ocorre após a edição com êxito de uma linha da tabela.
ru: Происходит после успешного завершения редактирования строки в этой таблице.
zh_hans: 在表中某一行被成功编辑后发生。
zh_hant: 發生在資料表中的資料列被成功編輯之後。

# DataTableRowChangingDescr
source: Occurs when the row is being changed so that the event handler can modify or cancel the change. The user can modify values in the row and should throw an exception to cancel the edit.
de: Tritt auf, wenn die Zeile geändert wird, damit der Ereignishandler die Änderung bearbeiten oder abbrechen kann. Der Benutzer kann Werte in der Zeile ändern und sollte eine Ausnahme verwenden, um den Bearbeitungsvorgang abzubrechen.
es: Tiene lugar cuando se cambia la fila, el controlador de eventos puede modificar o cancelar el cambio. El usuario puede modificar valores y puede iniciar una excepción para cancelar la edición.
fr: Se produit lorsque la ligne est en cours de modification afin que le gestionnaire d'événements puisse modifier ou annuler la modification. L'utilisateur peut modifier les valeurs dans la ligne et doit lever une exception pour annuler la modification.
it: Generato durante la modifica della riga affinché il gestore dell'evento possa cambiare o annullare la modifica. L'utente può modificare i valori della riga e deve generare un'eccezione per annullare la modifica.
ja: イベント ハンドラーが変更を修正またはキャンセルできるように行が変更されているときに発生します。ユーザーは行の値を変更することができます。また、編集をキャンセルするためには例外をスローする必要があります。
ko: 이벤트 처리기에서 변경 내용을 수정하거나 취소할 수 있도록 해당 행을 변경 중일 때 발생합니다. 사용자는 행의 값을 수정할 수 있으며 예외를 Throw하여 편집을 취소해야 합니다.
pt_br: Ocorre quando a linha está sendo alterada para que o manipulador de eventos possa modificar ou cancelar a alteração. O usuário pode modificar valores da linha e deve gerar uma exceção para cancelar a edição.
ru: Происходит при изменении строки таким образом, чтобы обработчик события мог изменить или отменить изменение. Пользователь может изменить значения в данной строке и должен создать исключение для отмены редактирования.
zh_hans: 当更改该行以便事件处理程序能够修改或取消所作更改时发生。用户能够修改该行中的值并应能够引发异常来取消编辑。
zh_hant: 發生於資料列被變更時，如此事件處理常式可以修改或取消變更。使用者可以修改資料列中的值，並且應該傳回例外狀況以取消編輯。

# DataTableRowDeletedDescr
source: Occurs after a row in the table has been successfully deleted.
de: Tritt auf, wenn eine Zeile in der Tabelle erfolgreich gelöscht wurde.
es: Tiene lugar después de que se elimine correctamente una fila de la tabla.
fr: Se produit une fois qu'une ligne de la table a été supprimée avec succès.
it: Generato in seguito all'eliminazione di una riga della tabella.
ja: テーブルの行が正常に削除された後に発生します。
ko: 테이블에서 행을 삭제한 후에 발생합니다.
pt_br: Ocorre depois que uma linha da tabela é excluída com êxito.
ru: Происходит после успешного удаления строки из этой таблицы.
zh_hans: 在表中某一行被成功删除后发生。
zh_hant: 發生在資料表中的資料列被成功刪除之後。

# DataTableRowDeletingDescr
source: Occurs when a row in the table marked for deletion. Throw an exception to cancel the deletion.
de: Tritt auf, wenn eine Zeile in der Tabelle zum Löschen markiert ist. Löst eine Ausnahme aus, um den Löschvorgang abzubrechen.
es: Tiene lugar cuando una fila de la tabla está marcada para eliminarla. Inicie una excepción para cancelar la eliminación.
fr: Se produit lorsqu'une ligne de la table est marquée pour suppression. Levez une exception pour annuler la suppression.
it: Generato quando una riga della tabella viene contrassegnata per l'eliminazione. Generare un'eccezione per annullare l'eliminazione.
ja: テーブルの行が削除にマークされているときに発生します。削除をキャンセルするには例外をスローしてください。
ko: 테이블의 행을 삭제하도록 표시한 경우 발생합니다. 예외를 Throw하여 삭제를 취소할 수 있습니다.
pt_br: Ocorre quando uma linha da tabela é marcada para exclusão. Gere uma exceção para cancelar a exclusão.
ru: Происходит, когда строка этой таблицы помечается для удаления. Для отмены этого удаления создайте исключение.
zh_hans: 当表中某行被标记为删除时发生。引发异常以取消删除。
zh_hant: 當資料表中的資料列已被標示為刪除時發生。擲出取消刪除的一個例外狀況。

# DataTableColumnChangingDescr
source: Occurs when a value has been submitted for this column. The user can modify the proposed value and should throw an exception to cancel the edit.
de: Tritt auf, wenn für diese Spalte ein Wert übermittelt wurde. Der Benutzer kann den vorgeschlagenen Wert ändern und sollte eine Ausnahme verwenden, um die Bearbeitung abzubrechen.
es: Tiene lugar cuando se envía un valor para esta columna. El usuario puede modificar el valor propuesto y puede iniciar una excepción para cancelar la edición.
fr: Se produit lorsqu'une valeur a été envoyée pour cette colonne. L'utilisateur peut modifier la valeur proposée et doit lever une exception pour annuler la modification.
it: Generato quando si propone un valore per questa colonna. L'utente può modificare il valore proposto e deve generare un eccezione per annullare la modifica.
ja: この列の値が送信されたときに発生します。ユーザーはこの指定された値を変更できます。また、編集をキャンセルするためには例外をスローする必要があります。
ko: 이 열의 값이 제출될 때 발생합니다. 사용자는 제안된 값을 수정할 수 있으며 편집을 취소하려면 예외를 throw해야 합니다.
pt_br: Ocorre quando um valor é enviado a esta coluna. O usuário pode modificar o valor proposto e gerar uma exceção para cancelar a edição.
ru: Происходит при передаче значения для этого столбца. Пользователь может изменить переданное значение и должен создать исключение для отмены редактирования.
zh_hans: 当已为该列提交值时发生。用户可以修改建议的值并且应当引发异常来取消编辑。
zh_hant: 當值已經送給這個資料行時發生。使用者可以修改建議值，並且應該擲回例外狀況以取消編輯。

# DataTableColumnChangedDescr
source: Occurs when a value has been changed for this column.
de: Tritt auf, wenn ein Wert für diese Spalte geändert wurde.
es: Tiene lugar cuando ha cambiado el valor para esta columna.
fr: Se produit lorsqu'une valeur a été modifiée pour cette colonne.
it: Generato quando si modifica un valore di questa colonna.
ja: この列の値が変更されたときに発生します。
ko: 이 열의 값이 변경될 때 발생합니다.
pt_br: Ocorre quando um valor é alterado nesta coluna.
ru: Происходит при изменении значения в этом столбце.
zh_hans: 当已为该列更改值时发生。
zh_hant: 當這個資料行的值已經變更時發生。

# DataTableRowsClearingDescr
source: Occurs prior to clearing all rows from the table.
de: Tritt vor dem Löschen aller Zeilen aus der Tabelle auf.
es: Tiene lugar antes de borrar todas las filas de la tabla.
fr: Se produit avant que toutes les lignes de la table aient été effacées.
it: Si verifica prima di eliminare tutte le righe dalla tabella.
ja: テーブルのすべての行がクリアされる前に発生します。
ko: 테이블에서 모든 행을 지우기 전에 발생합니다.
pt_br: Ocorre antes da limpeza de todas as linhas da tabela.
ru: Происходит перед очисткой всех строк в таблице.
zh_hans: 发生在从表中清除所有行之前。
zh_hant: 當從資料表中清除所有資料列前會發生。

# DataTableRowsClearedDescr
source: Occurs after all rows in the table has been successfully cleared.
de: Tritt auf, nachdem alle Zeilen in der Tabelle erfolgreich gelöscht wurden.
es: Tiene lugar después de borrar correctamente todas las filas de la tabla.
fr: Se produit lorsque toutes les lignes de la table ont été effacées avec succès.
it: Si verifica dopo che tutte le righe nella tabella sono state eliminate correttamente.
ja: テーブルのすべての行が正常にクリアされた後に発生します。
ko: 테이블에서 모든 행을 지운 후에 발생합니다.
pt_br: Ocorre após a limpeza com êxito de todas as linhas da tabela.
ru: Происходит после успешной очистки всех строк в таблице.
zh_hans: 发生在表中的所有行成功地被清除之后。
zh_hant: 當成功清除資料表中的所有資料列後會發生。

# DataTableRowsNewRowDescr
source: Occurs after a new DataRow has been instantiated.
de: Tritt auf, nachdem eine neue DataRow instanziiert wurde.
es: Tiene lugar después de crear una nueva instancia de DataRow.
fr: Se produit lorsqu'un nouveau DataRow a été instancié.
it: Si verifica dopo che è stata creata l'istanza di un nuovo DataRow.
ja: 新しい DataRow のインスタンスが作成された後に発生します。
ko: 새 DataRow가 인스턴스화된 후에 발생합니다.
pt_br: Ocorre após uma nova DataRow ser instanciada.
ru: Происходит после создания нового экземпляра DataRow.
zh_hans: 发生在实例化新的 DataRow 之后。
zh_hant: 當新的 DataRow 具現化後會發生。

# DataRelationRelationNameDescr
source: The name used to look up this relation in the Relations collection of a DataSet.
de: Der Name, der verwendet wird, um diese Beziehung in der Relations-Sammlung eines DataSets zu suchen.
es: El nombre utilizado para buscar esta relación en la colección Relations del DataSet.
fr: Le nom utilisé pour rechercher cette relation dans la collection Relations d'un DataSet.
it: Nome utilizzato per cercare questa relazione nella raccolta Relations di un DataSet.
ja: DataSet の Relations コレクションにあるこのリレーションシップを照合するために使われる名前です。
ko: DataSet의 Relations 컬렉션에서 이 관계를 찾는 데 사용되는 이름입니다.
pt_br: O nome usado para pesquisar esta relação na coleção Relations de um DataSet.
ru: Имя, используемое для поиска этого отношения в коллекции отношений Relations из DataSet.
zh_hans: 在 DataSet 的 Relations 集合中查找此关系时所用的名称。
zh_hant: 用來在 DataSet 的 Relations 集合中查詢這個關聯的名稱。

# DataRelationChildColumnsDescr
source: Indicates the child columns of this relation.
de: Gibt die untergeordneten Spalten in dieser Beziehung an.
es: Indica las columnas secundarias de esta relación.
fr: Indique les colonnes enfants de cette relation.
it: Indica le colonne figlio di questa relazione.
ja: このリレーションシップの子列を示します。
ko: 이 관계의 자식 열을 나타냅니다.
pt_br: Indica as colunas filho desta relação.
ru: Указывает дочерние столбцы этого отношения.
zh_hans: 指示此关系的子列。
zh_hant: 表示這個關聯的子資料行。

# DataRelationParentColumnsDescr
source: Indicates the parent columns of this relation.
de: Gibt die übergeordneten Spalten dieser Beziehung an.
es: Indica las columnas primarias de esta relación.
fr: Indique les colonnes parentes de cette relation.
it: Indica le colonne padre di questa relazione.
ja: このリレーションシップの親列を示します。
ko: 이 관계의 부모 열을 나타냅니다.
pt_br: Indica as colunas pai desta relação.
ru: Указывает родительские столбцы этого отношения.
zh_hans: 指示此关系的父列。
zh_hant: 表示這個關聯的父資料行。

# DataRelationNested
source: Indicates whether relations are nested.
de: Gibt an, ob die Beziehungen geschachtelt sind.
es: Indica si las relaciones están anidadas.
fr: Indique si les relations sont imbriquées.
it: Indica se le relazioni sono annidate.
ja: リレーションシップが入れ子かどうかを示します。
ko: 관계가 중첩되었는지 여부를 나타냅니다.
pt_br: Indica se as relações são aninhadas.
ru: Указывает, являются ли отношения вложенными.
zh_hans: 指示关系是否嵌套。
zh_hant: 表示關聯是否為巢狀。

# ForeignKeyConstraintDeleteRuleDescr
source: For deletions, indicates what kind of cascading should take place across this relation.
de: Für Löschvorgänge. Gibt an, welche Art von Überlappung in dieser Beziehung verwendet werden soll.
es: Para eliminaciones, indica el tipo de cascada que tiene lugar en la relación.
fr: Pour les suppressions, indique le type de cascade qui doit avoir lieu dans cette relation.
it: Indica il tipo di azioni a cascata associato a questa relazione per le eliminazioni.
ja: 削除操作において、このリレーションシップでどの連鎖処理を実行するかを示します。
ko: 삭제할 경우 이 관계에 수행할 관련 항목 적용(Cascade) 유형을 나타냅니다.
pt_br: Para exclusões, indica que tipo de cascata deve ocorrer nesta relação.
ru: Для удалений; указывает, какого рода каскадная схема должна использоваться в этом отношении.
zh_hans: 对于删除，指示通过此关系应发生哪种类型的级联。
zh_hant: 針對刪除，表示何種串聯必須跨這個關聯發生。

# ForeignKeyConstraintUpdateRuleDescr
source: For updates, indicates what kind of cascading should take place across this relation.
de: Für Updates. Gibt an, welche Art von Überlappung in dieser Beziehung verwendet werden soll.
es: Para actualizaciones, indica el tipo de cascada que tiene lugar en la relación.
fr: Pour les mises à jour, indique le type de cascade qui doit avoir lieu dans cette relation.
it: Indica il tipo di azioni a cascata associato a questa relazione per gli aggiornamenti.
ja: 更新操作において、このリレーションシップでどの連鎖処理を実行するかを示します。
ko: 업데이트할 경우 이 관계에 수행할 관련 항목 적용(Cascade) 유형을 나타냅니다.
pt_br: Para atualizações, indica que tipo de cascata deve ocorrer nesta relação.
ru: Для обновлений; указывает, какого рода каскадная схема должна использоваться в этом отношении.
zh_hans: 对于更新，指示通过此关系应发生哪种类型的级联。
zh_hant: 針對更新，表示何種串聯必須跨這個關聯發生。

# ForeignKeyConstraintAcceptRejectRuleDescr
source: For accept and reject changes, indicates what kind of cascading should take place across this relation.
de: Zum Akzeptieren und Ablehnen von Änderungen. Gibt an, welche Art von Überlappung in dieser Beziehung verwendet werden soll.
es: Para aceptar o rechazar los cambios, indica que tipo de cascada tiene lugar en esta relación.
fr: Pour l'acceptation ou le refus des modifications, indique le type de cascade qui doit avoir lieu dans cette relation.
it: Indica il tipo di azioni a cascata associato a questa relazione per la conferma o l'annullamento delle modifiche.
ja: 承認および却下の変更において、このリレーションシップでどの連鎖処理を実行するかを示します。
ko: 변경 내용을 적용 및 취소하는 경우 이 관계에 수행할 관련 항목 적용(CASCADE) 유형을 나타냅니다.
pt_br: Para aceitar e rejeitar alterações, indica que tipo de cascata deve ocorrer nesta relação.
ru: Для принятия и отклонения изменений; указывает, какого рода каскадная схема должна использоваться в этом отношении.
zh_hans: 对于接受和拒绝更改，指示通过此关系应发生哪种类型的级联。
zh_hant: 針對接受或拒絕變更，表示何種串聯必須跨這個關聯發生。

# ForeignKeyConstraintChildColumnsDescr
source: Indicates the child columns of this constraint.
de: Gibt die untergeordneten Spalten dieser Einschränkung an.
es: Indica las columnas secundarias de esta restricción.
fr: Indique les colonnes enfants de cette contrainte.
it: Indica le colonne figlio di questo vincolo.
ja: この制約の子列を示します。
ko: 이 제약 조건의 자식 열을 나타냅니다.
pt_br: Indica as colunas filho desta restrição.
ru: Указывает дочерние столбцы этого ограничения.
zh_hans: 指示此约束的子列。
zh_hant: 表示這個條件約束的子資料行。

# ForeignKeyConstraintParentColumnsDescr
source: Indicates the parent columns of this constraint.
de: Gibt die übergeordneten Spalten dieser Einschränkung an.
es: Indica las columnas primarias de esta restricción.
fr: Indique les colonnes parentes de cette contrainte.
it: Indica le colonne padre di questo vincolo.
ja: この制約の親列を示します。
ko: 이 제약 조건의 부모 열을 나타냅니다.
pt_br: Indica as colunas pai desta restrição.
ru: Указывает родительские столбцы этого ограничения.
zh_hans: 指示此约束的父列。
zh_hant: 表示這個條件約束的父資料行。
