Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SqlPipe_AlreadyHasAnOpenResultSet
source: A result set is currently being sent to the pipe. End the current result set before calling {0}.
de: Momentan wird ein Resultset an die Pipe gesendet. Beenden Sie das aktuelle Resultset vor dem Aufruf von {0}.
es: Se está enviando un conjunto de resultados a la canalización. Finalice el conjunto de resultados actual antes de llamar {0}.
fr: Une série de résultats est actuellement envoyée au canal. Terminez la série des résultats avant d'appeler {0}.
it: Si sta inviando alla pipe un set di risultati. Terminare il set di risultati corrente prima di chiamare {0}.
ja: 結果セットをパイプに送信しています。{0} を呼び出す前に現在の結果セットを終了してください。
ko: 현재 결과 집합을 파이프로 보내고 있습니다. {0}을(를) 호출하기 전에 현재 결과 집합을 종료하십시오.
pt_br: Um conjunto de resultados está sendo enviado para o pipe. Encerre o conjunto de resultados atual antes de chamar {0}.
ru: Результирующий набор данных сейчас отправляется в канал. Перед вызовом {0} необходимо завершить текущий результирующий набор данных.
zh_hans: 结果集当前正在发送到该管道。在调用 {0} 之前结束当前结果集。
zh_hant: 正傳送結果集至管線中。在呼叫 {0} 前請先結束目前的結果集。

# SqlPipe_DoesNotHaveAnOpenResultSet
source: Result set has not been initiated. Call SendResultSetStart before calling {0}.
de: Das Resultset wurde nicht initiiert. Rufen Sie 'SendResultSetStart' vor dem Aufruf von {0} auf.
es: No se ha iniciado el conjunto de resultados. Llame a SendResultSetStart antes de llamar {0}.
fr: La série de résultats n'a pas été initialisée. Appelez SendResultSetStart avant d'appeler {0}.
it: Il set di risultati non è stato iniziato. Chiamare SendResultSetStart prima di chiamare {0}.
ja: 結果セットが初期化されていません。{0} を呼び出す前に SendResultSetStart を呼び出してください。
ko: 결과 집합이 시작되지 않았습니다. {0}을(를) 호출하기 전에 SendResultSetStart를 호출하십시오.
pt_br: O conjunto de resultados não foi iniciado. Chame SendResultSetStart antes de chamar {0}.
ru: Результирующий набор данных не инициализирован. Вызовите SendResultSetStart перед вызовом {0}.
zh_hans: 结果集尚未启动。在调用 {0} 之前调用 SendResultSetStart。
zh_hant: 結果集尚未初始化。在呼叫 {0} 前請先呼叫 SendResultSetStart。

# SNI_PN0
source: HTTP Provider
de: HTTP-Anbieter
es: Proveedor HTTP
fr: Fournisseur HTTP
it: Provider HTTP
ja: HTTP プロバイダー
ko: HTTP 공급자
pt_br: Provedor de HTTP
ru: Поставщик HTTP
zh_hans: HTTP 提供程序
zh_hant: HTTP 提供者

# SNI_PN1
source: Named Pipes Provider
de: Named Pipes-Anbieter
es: Proveedor de canalizaciones con nombre
fr: Fournisseur de canaux nommés
it: Provider named pipe
ja: 名前付きパイプのプロバイダー
ko: 명명된 파이프 공급자
pt_br: Provedor de Pipes Nomeados
ru: Поставщик именованных каналов
zh_hans: 命名管道提供程序
zh_hant: 具名管道提供者

# SNI_PN2
source: Session Provider
de: Sitzungsanbieter
es: Proveedor de sesión
fr: Fournisseur de session
it: Provider sessione
ja: セッション プロバイダー
ko: 세션 공급자
pt_br: Provedor de Sessão
ru: Поставщик сеансов
zh_hans: 会话提供程序
zh_hant: 工作階段提供者

# SNI_PN3
source: Sign Provider
de: Signaturanbieter
es: Proveedor de signo
fr: Fournisseur de signe
it: Provider firma
ja: 署名プロバイダー
ko: 서명 공급자
pt_br: Provedor de Assinatura
ru: Поставщик входа
zh_hans: 签名提供程序
zh_hant: 簽署提供者

# SNI_PN4
source: Shared Memory Provider
de: Shared Memory-Anbieter
es: Proveedor de memoria compartida
fr: Fournisseur de mémoire partagée
it: Provider memoria condivisa
ja: 共有メモリ プロバイダー
ko: 공유 메모리 공급자
pt_br: Provedor de Memória Compartilhada
ru: Поставщик общей памяти
zh_hans: 共享内存提供程序
zh_hant: 共用記憶體提供者

# SNI_PN5
source: SMux Provider
de: SMux-Anbieter
es: Proveedor de SMux
fr: Fournisseur SMux
it: Provider SMux
ja: SMux プロバイダー
ko: SMux 공급자
pt_br: Provedor de SMux
ru: Поставщик SMux
zh_hans: SMux 提供程序
zh_hant: SMux 提供者

# SNI_PN6
source: SSL Provider
de: SSL-Anbieter
es: Proveedor de SSL
fr: Fournisseur SSL
it: Provider SSL
ja: SSL プロバイダー
ko: SSL 공급자
pt_br: Provedor de SSL
ru: Поставщик SSL
zh_hans: SSL 提供程序
zh_hant: SSL 提供者

# SNI_PN7
source: TCP Provider
de: TCP-Anbieter
es: Proveedor de TCP
fr: Fournisseur TCP
it: Provider TCP
ja: TCP プロバイダー
ko: TCP 공급자
pt_br: Provedor de TCP
ru: Поставщик TCP
zh_hans: TCP 提供程序
zh_hant: TCP 提供者

# SNI_PN8
source: VIA Provider
de: VIA-Anbieter
es: Proveedor de VIA
fr: Fournisseur VIA
it: Provider VIA
ja: VIA プロバイダー
ko: VIA 공급자
pt_br: Provedor VIA
ru: Поставщик VIA
zh_hans: VIA 提供程序
zh_hant: VIA 提供者

# SNI_PN9
source: CTAIP Provider
de: CTAIP-Anbieter
es: Proveedor de CTAIP
fr: Fournisseur CTAIP
it: Provider CTAIP
ja: CTAIP プロバイダー
ko: CTAIP 공급자
pt_br: Provedor de CTAIP
ru: Поставщик CTAIP
zh_hans: CTAIP 提供程序
zh_hant: CTAIP 提供者3

# SNI_PN11
source: SQL Network Interfaces
de: SQL-Netzwerkschnittstellen
es: Interfaces de red SQL
fr: Interfaces réseau SQL
it: Interfacce di rete SQL
ja: SQL ネットワーク インターフェイス
ko: SQL 네트워크 인터페이스
pt_br: Interfaces de Rede do SQL
ru: Сетевые интерфейсы SQL
zh_hans: SQL 网络接口
zh_hant: SQL 網路介面

# SNI_ERROR_1
source: I/O Error detected in read/write operation
de: E/A-Fehler bei Lese-/Schreibvorgang
es: Detectado error de E/S en operación de lectura y escritura
fr: Erreur d'E/S détectée dans l'opération de lecture/écriture
it: Errore di I/O rilevato nell'operazione di lettura/scrittura
ja: 読み取りまたは書き込み操作で I/O エラーが検出されました
ko: 읽기/쓰기 작업 중에 입/출력 오류가 발생했습니다.
pt_br: Erro de E/S detectado em operação de leitura/gravação
ru: При выполнении операции чтения-записи возникла ошибка ввода-вывода
zh_hans: 在读/写操作中检测到 I/O 错误
zh_hant: 在讀取/寫入操作中偵測到 I/O 錯誤

# SNI_ERROR_2
source: Connection was terminated
de: Verbindung wurde beendet
es: La conexión ha finalizado
fr: Connexion terminée
it: La connessione è stata interrotta
ja: 接続は解除されました
ko: 연결이 종료되었습니다.
pt_br: Conexão terminada
ru: Подключение прервано
zh_hans: 连接已终止
zh_hant: 連線已終止

# SNI_ERROR_3
source: Asynchronous operations not supported
de: Asynchrone Operationen werden nicht unterstützt
es: Operaciones asíncronas no admitidas
fr: Les opérations asynchrones ne sont pas prises en charge
it: Operazioni asincrone non supportate
ja: 非同期操作はサポートされていません
ko: 비동기 작업이 지원되지 않습니다.
pt_br: Não há suporte para operações assíncronas
ru: Асинхронные операции не поддерживаются
zh_hans: 不支持异步操作
zh_hant: 不支援非同步操作

# SNI_ERROR_5
source: Invalid parameter(s) found
de: Ungültige(r) Parameter
es: Se ha(n) encontrado parámetro(s) no válido(s)
fr: Paramètre(s) non valide(s) détecté(s)
it: Rilevati parametri non validi
ja: 無効なパラメーターが検出されました
ko: 잘못된 매개 변수가 발견되었습니다.
pt_br: Encontrados parâmetros inválidos
ru: Обнаружены недопустимые параметры
zh_hans: 发现无效参数
zh_hant: 找到無效的參數

# SNI_ERROR_6
source: Unsupported protocol specified
de: Angegebenes Protokoll wird nicht unterstützt
es: Protocolo especificado no admitido
fr: Protocole non pris en charge spécifié
it: Protocollo specificato non supportato
ja: サポートされていないプロトコルが指定されました
ko: 지원하지 않는 프로토콜이 지정되었습니다.
pt_br: Especificado um protocolo sem suporte
ru: Указан неподдерживаемый протокол
zh_hans: 指定的协议不受支持
zh_hant: 指定了不受支援的通訊協定

# SNI_ERROR_7
source: Invalid connection found when setting up new session protocol
de: Ungültige Verbindung beim Einrichten eines neuen Sitzungsprotokolls
es: Se ha encontrado una conexión no válida al configurar el nuevo protocolo de sesión
fr: Connexion non valide détectée lors de la configuration d'un nouveau protocole de session
it: Rilevata connessione non valida durante l'impostazione del nuovo protocollo di sessione
ja: 新規のセッション プロトコルを設定中に無効な接続が検出されました
ko: 새 세션 프로토콜을 설정하는 동안 잘못된 연결이 발견되었습니다.
pt_br: Encontrada uma conexão inválida ao configurar protocolo de nova sessão
ru: При настройке протокола нового сеанса обнаружено недопустимое соединение
zh_hans: 设置新的会话协议时发现连接无效
zh_hant: 設定新工作階段通訊協定時，找到無效的連線

# SNI_ERROR_8
source: Protocol not supported
de: Protokoll wird nicht unterstützt
es: Protocolo no admitido
fr: Protocole non pris en charge
it: Protocollo non supportato
ja: プロトコルはサポートされていません
ko: 지원되지 않는 프로토콜입니다.
pt_br: Protocolo sem suporte
ru: Протокол не поддерживается
zh_hans: 协议不受支持
zh_hant: 不支援通訊協定

# SNI_ERROR_9
source: Associating port with I/O completion mechanism failed
de: Zuordnung des Anschlusses mit E/A-Abschlussmechanismus fehlgeschlagen
es: Error al completar el mecanismo de asociación de puerto con E/S
fr: Échec de l'association du port avec le mécanisme de terminaison d'E/S
it: Associazione della porta al meccanismo di completamento I/O non riuscita
ja: ポートと I/O 完了メカニズムの関連付けに失敗しました
ko: 포트와 입/출력 완료 메커니즘의 연결이 실패했습니다.
pt_br: Falha ao associar porta e mecanismo de conclusão de E/S
ru: Сбой при сопоставлении порта механизму завершения ввода-вывода
zh_hans: 端口与 I/O 关联的完成机制失败
zh_hant: 關聯連接埠與 I/O 完成機制失敗

# SNI_ERROR_11
source: Timeout error
de: Timeoutfehler
es: Error de tiempo de espera
fr: Erreur de délai d'attente
it: Errore di timeout
ja: タイムアウト エラー
ko: 시간 초과 오류입니다.
pt_br: Erro de tempo limite
ru: Ошибка времени ожидания
zh_hans: 超时错误
zh_hant: 逾時錯誤

# SNI_ERROR_12
source: No server name supplied
de: Es wurde kein Servername angegeben
es: No se ha proporcionado el nombre del servidor
fr: Aucun nom de serveur fourni
it: Nessun nome server fornito
ja: サーバー名が指定されていません
ko: 서버 이름이 제공되지 않았습니다.
pt_br: Nenhum nome de servidor fornecido
ru: Отсутствуют поддерживаемые имена сервера
zh_hans: 未提供服务器名
zh_hant: 未提供伺服器名稱

# SNI_ERROR_13
source: TerminateListener() has been called
de: TerminateListener() wurde aufgerufen
es: Se ha llamado a TerminateListener()
fr: TerminateListener() a été appelé
it: È stato chiamato il metodo TerminateListener()
ja: TerminateListener() が呼び出されました
ko: TerminateListener()를 호출했습니다.
pt_br: TerminateListener() foi chamado
ru: Был выполнен вызов TerminateListener()
zh_hans: TerminateListener() 已被调用
zh_hant: 已經呼叫 TerminateListener()

# SNI_ERROR_14
source: Win9x not supported
de: Win9x wird nicht unterstützt
es: Win9x no admitido
fr: Win9x non pris en charge
it: Win9x non supportato
ja: Win9x はサポートされていません
ko: 지원하지 않는 Win9x입니다.
pt_br: Não há suporte para Win9x
ru: Win9x не поддерживается
zh_hans: 不支持 Win9x
zh_hant: 不支援 Win9x

# SNI_ERROR_15
source: Function not supported
de: Funktion wird nicht unterstützt
es: Función no admitida
fr: Fonction non prise en charge
it: Funzione non supportata
ja: 関数はサポートされていません
ko: 지원하지 않는 함수입니다.
pt_br: Função sem suporte
ru: Функция не поддерживается
zh_hans: 不支持函数
zh_hant: 不支援函數

# SNI_ERROR_16
source: Shared-Memory heap error
de: Shared-Memory-heap-Fehler
es: Error de heap de Shared-Memory
fr: Erreur heap Shared-Memory
it: Errore di heap di Shared-Memory
ja: Shared-Memory heap エラー
ko: Shared-Memory heap 오류
pt_br: Erro Shared-Memory heap
ru: Ошибка кучи общей памяти Shared-Memory heap
zh_hans: Shared-Memory heap 错误
zh_hant: Shared-Memory heap 錯誤

# SNI_ERROR_17
source: Cannot find an ip/ipv6 type address to connect
de: Es wurde keine Adresse vom Typ ip/ipv6 für die Verbindung gefunden
es: No se encuentra una dirección de tipo ip/ipv6 a la que conectarse
fr: Adresse de type ip/ipv6 pour connexion introuvable
it: Impossibile trovare un indirizzo di tipo ip/ipv6 a cui connettersi
ja: 接続先の IP/IPv6 アドレスが見つかりません
ko: 연결할 ip/ipv6 유형의 주소를 찾을 수 없습니다.
pt_br: Não é possível encontrar um endereço do tipo ip/ipv6 para conectar
ru: Не удается найти ip/ipv6-адрес для подключения
zh_hans: 找不到要连接的 ip/ipv6 类型地址
zh_hant: 找不到可連接的 ip/ipv6 類型位址

# SNI_ERROR_18
source: Connection has been closed by peer
de: Verbindung beendet durch Peer
es: Conexión cerrada por el usuario
fr: Connexion fermée par homologue
it: La connessione è stata chiusa da un computer peer
ja: ピアによって接続が閉じられました
ko: 피어가 연결을 끊었습니다.
pt_br: Conexão fechada pelo par
ru: Соединение было закрыто удаленным узлом
zh_hans: 连接已被对方关闭
zh_hant: 對等項目已關閉連線

# SNI_ERROR_19
source: Physical connection is not usable
de: Physische Verbindung unbrauchbar
es: La conexión física es inservible
fr: Connexion physique inutilisable
it: La connessione fisica non è utilizzabile
ja: 物理的な接続は使用できません
ko: 실제 연결을 사용할 수 없습니다.
pt_br: Conexão física não pode ser usada
ru: Физическое подключение недоступно
zh_hans: 物理连接不可用
zh_hant: 無法使用實際連線

# SNI_ERROR_20
source: Connection has been closed
de: Verbindung wurde beendet
es: La conexión se ha cerrado
fr: La connexion a été fermée
it: La connessione è stata chiusa
ja: 接続が閉じられました
ko: 연결이 끊어졌습니다.
pt_br: A conexão foi fechada
ru: Соединение было закрыто
zh_hans: 连接已关闭
zh_hant: 已經關閉連線

# SNI_ERROR_21
source: Encryption is enforced but there is no valid certificate
de: Verschlüsselung erzwungen, aber es liegt kein gültiges Zertifikat vor
es: Se ha forzado el cifrado, pero no hay ningún certificado válido
fr: Le chiffrement est activé mais il n'y a aucun certificat valide
it: La crittografia è stata imposta ma non sono disponibili certificati validi
ja: 暗号化が強制されましたが有効な証明書がありません
ko: 암호화가 적용되었으나 유효한 인증서가 없습니다.
pt_br: A criptografia é forçada, mas não há certificado válido
ru: Требуется шифрование, однако отсутствуют действительные сертификаты
zh_hans: 已执行加密但没有有效的证书
zh_hant: 強制執行加密，但沒有有效的憑證

# SNI_ERROR_22
source: Couldn't load library
de: Bibliothek konnte nicht geladen werden
es: No se pudo cargar la biblioteca
fr: Impossible de charger la bibliothèque
it: Impossibile caricare la libreria
ja: ライブラリを読み込めませんでした
ko: 라이브러리를 로드할 수 없습니다.
pt_br: Não foi possível carregar a biblioteca
ru: Не удается загрузить библиотеку
zh_hans: 无法加载库
zh_hant: 無法載入程式庫

# SNI_ERROR_23
source: Cannot open a new thread in server process
de: Es konnte kein neuer Thread im Serverprozess geöffnet werden
es: No se puede abrir un subproceso nuevo en el proceso del servidor
fr: Impossible d'ouvrir un nouveau thread dans le processus serveur
it: Impossibile aprire un nuovo thread nel processo server
ja: サーバー プロセスで新規のスレッドを開けません
ko: 서버 프로세스에서 새 스레드를 열 수 없습니다.
pt_br: Não foi possível abrir um novo thread no processo do servidor
ru: Не удается открыть новый поток в процессе сервера
zh_hans: 无法在服务器进程中打开新的线程
zh_hant: 無法在伺服器處理程序中開啟新執行緒

# SNI_ERROR_24
source: Cannot post event to completion port
de: Ereignis konnte dem Abschlussanschluss nicht bereitgestellt werden
es: No se puede exponer el suceso al puerto de terminación
fr: Impossible d'envoyer l'événement au port de terminaison
it: Impossibile inserire l'evento nella porta di completamento
ja: 完了ポートにイベントを通知できません
ko: 완료 포트에 이벤트를 게시할 수 없습니다.
pt_br: Não é possível postar evento na porta de conclusão
ru: Не удается отправить событие в порт завершения
zh_hans: 无法将事件张贴到完成端口
zh_hant: 無法將事件張貼到完成連接埠

# SNI_ERROR_25
source: Connection string is not valid
de: Die Verbindungszeichenfolge ist ungültig
es: La cadena de conexión no es válida
fr: Chaîne de connexion non valide
it: Stringa di connessione non valida
ja: 接続文字列が有効ではありません
ko: 연결 문자열이 잘못되었습니다.
pt_br: Cadeia de conexão não é valida
ru: Недопустимая строка подключения
zh_hans: 连接字符串无效
zh_hant: 連接字串無效

# SNI_ERROR_26
source: Error Locating Server/Instance Specified
de: Fehler beim Suchen des angegebenen Servers/der angegebenen Instanz
es: Error al buscar el servidor/instancia especificado
fr: Erreur lors de la localisation de Server/Instance spécifié
it: Errore nell'individuazione del server/dell'istanza specificati
ja: 指定された Server/Instance の位置を特定しているときにエラーが発生しました
ko: 지정된 서버/인스턴스를 찾는 중 오류가 발생했습니다.
pt_br: Erro ao Localizar Servidor/Instância Especificado
ru: Не удается обнаружить указанный сервер/экземпляр
zh_hans: 定位指定的 Server/Instance 时出错
zh_hant: 尋找指定的伺服器/執行個體時發生錯誤

# SNI_ERROR_27
source: Error getting enabled protocols list from registry
de: Fehler beim Abrufen der Liste aktivierter Protokolle aus der Registrierung
es: Error al obtener la lista de protocolos habilitados del registro
fr: Erreur d'obtention de la liste des protocoles activés à partir du Registre
it: Errore durante la lettura dell'elenco di protocolli abilitati dal registro di sistema
ja: レジストリからプロトコル一覧を有効化しているときにエラーが発生しました
ko: 레지스트리에서 사용할 수 있는 프로토콜 목록을 가져오는 중 오류가 발생했습니다.
pt_br: Erro ao obter lista de protocolos habilitados no Registro
ru: При получении списка разрешенных протоколов из реестра возникла ошибка
zh_hans: 从注册表获取已启用的协议列表时出错
zh_hant: 從登錄取得已啟用的通訊協定清單時發生錯誤

# SNI_ERROR_28
source: Server doesn't support requested protocol
de: Server unterstützt das angeforderte Protokoll nicht
es: El servidor no admite el protocolo requerido
fr: Le serveur ne prend pas en charge le protocole demandé
it: Il server non supporta il protocollo richiesto
ja: サーバーは要求されたプロトコルをサポートしていません
ko: 서버가 요청한 프로토콜을 지원하지 않습니다.
pt_br: O servidor não dá suporte ao protocolo solicitado
ru: Сервер не поддерживает запрошенный протокол
zh_hans: 服务器不支持请求的协议
zh_hant: 伺服器不支援所要求的通訊協定

# SNI_ERROR_29
source: Shared Memory is not supported for clustered server connectivity
de: Shared Memory wird für Konnektivität gruppierter Server nicht unterstützt
es: La conectividad con el servidor agrupado no admite la memoria compartida
fr: La mémoire partagée n'est pas prise en charge pour la connectivité de serveurs en cluster
it: Memoria condivisa non supportata per la connettività di server cluster
ja: クラスター化されたサーバーとの接続では共有メモリはサポートされていません
ko: 클러스터형 서버 연결에는 공유 메모리가 지원되지 않습니다.
pt_br: A conectividade de servidor em cluster não dá suporte à memória compartilhada
ru: При подключении к кластерному серверу использование общей памяти не поддерживается
zh_hans: 群集服务器连接不支持共享内存
zh_hant: 叢集伺服器連線不支援共用記憶體

# SNI_ERROR_30
source: Invalid attempt bind to shared memory segment
de: Ungültiger Versuch, Bindung mit Shared Memory-Segment herzustellen
es: Intento de enlazar con el segmento de memoria compartida no válido
fr: Tentative de liaison non valide au segment de mémoire partagée
it: Tentativo non valido di eseguire l'associazione al segmento di memoria condivisa
ja: 共有メモリ セグメントに対する無効なバインドです
ko: 공유 메모리 세그먼트에 대한 바인딩이 잘못되었습니다.
pt_br: Tentativa inválida de vincular a segmento de memória compartilhada
ru: Недопустимая попытка привязки к сегменту общей памяти
zh_hans: 绑定到共享内存段的尝试无效
zh_hant: 繫結到共用記憶體區段嘗試無效

# SNI_ERROR_31
source: Encryption(ssl/tls) handshake failed
de: Encryption(ssl/tls)-Handshake fehlgeschlagen
es: Error en el protocolo de enlace de cifrado (ssl/tls)
fr: Échec de la prise de contact de chiffrement (ssl/tls)
it: Handshake di crittografia (ssl/tls) non riuscita
ja: 暗号化 (SSL/TLS) のハンドシェイクに失敗しました
ko: 암호화(ssl/tls) 핸드셰이크가 실패했습니다.
pt_br: Falha de handshake de criptografia (ssl/tls)
ru: Сбой при согласовании параметров шифрования(ssl/tls)
zh_hans: 加密(ssl/tls)握手失败
zh_hant: 加密 (ssl/tls) 信號交換失敗

# SNI_ERROR_32
source: Packet size too large for SSL Encrypt/Decrypt operations
de: Paketgröße für SSL Encrypt/Decrypt-Operationen zu groß
es: El tamaño del paquete es demasiado grande para las operaciones de cifrado y descifrado SSL
fr: Taille de paquet trop importante pour les opérations de Encrypt/Decrypt SSL
it: Dimensione pacchetto troppo grande per le operazioni di crittografia/decrittografia SSL
ja: SSL Encrypt/Decrypt 操作に対するパケット サイズが大きすぎます
ko: SSL 암호화/암호 해독 작업에 필요한 패킷 크기가 너무 큽니다.
pt_br: Tamanho de pacote muito grande para operações Encrypt/Decrypt SSL
ru: Размер пакета слишком велик для операций шифрования и дешифрования SSL
zh_hans: SSL Encrypt/Decrypt 操作的数据包大小太大
zh_hant: 對於 SSL 加密/解密操作而言，封包大小過大

# SNI_ERROR_33
source: SSRP error
de: SSRP-Fehler
es: Error de SSRP
fr: Erreur SSRP
it: Errore SSRP
ja: SSRP エラー
ko: SSRP 오류
pt_br: Erro de SSRP
ru: Ошибка SSRP
zh_hans: SSRP 错误
zh_hant: SSRP 錯誤

# SNI_ERROR_34
source: Could not connect to the Shared Memory pipe
de: Verbindung zur Shared Memory-Pipe konnte nicht hergestellt werden
es: No se pudo conectar a la canalización de memoria compartida
fr: Connexion impossible au canal de mémoire partagée
it: Impossibile connettersi alla pipe di memoria condivisa
ja: 共有メモリ パイプに接続できませんでした
ko: 공유 메모리 파이프에 연결하지 못했습니다.
pt_br: Não foi possível conectar ao pipe de memória compartilhada
ru: Не удается подключиться к каналу общей памяти
zh_hans: 无法连接共享内存管道
zh_hant: 無法連接到共用記憶體管道

# SNI_ERROR_35
source: An internal exception was caught
de: Es wurde eine interne Ausnahme empfangen
es: Se interceptó una excepción interna
fr: Une exception interne a été interceptée
it: È stata intercettata un'eccezione interna
ja: 内部の例外が発生しました
ko: 내부 예외가 발견되었습니다.
pt_br: Ocorreu uma exceção interna
ru: Перехвачено внешнее исключение
zh_hans: 捕获内部异常
zh_hant: 攔截到內部例外狀況

# SNI_ERROR_36
source: The Shared Memory dll used to connect to SQL Server 2000 was not found
de: Die für die Verbindung mit SQL Server 2000 verwendete Shared Memory-DLL wurde nicht gefunden
es: No se encontró el archivo dll de memoria compartida utilizado para conectarse con SQL Server 2000
fr: La DLL de mémoire partagée utilisée pour la connexion à SQL Server 2000 est introuvable
it: La dll di memoria condivisa utilizzata per la connessione a SQL Server 2000 non è stata trovata
ja: SQL Server 2000 に接続するために使用されている共有メモリ DLL が見つかりませんでした
ko: SQL Server 2000 연결에 사용된 공유 메모리 dll이 없습니다.
pt_br: O DLL de memória compartilhada usado para conectar ao SQL Server 2000 não foi encontrado
ru: Не найдена библиотека общей памяти, использующаяся для установки соединения с SQL Server 2000
zh_hans: 找不到用来连接 SQL Server 2000 的共享内存 dll
zh_hant: 找不到用來連接到 SQL Server 2000 的共用記憶體 dll

# SNI_ERROR_37
source: The SQL Server 2000 Shared Memory client dll appears to be invalid/corrupted
de: Die Shared Memory-Client-DLL von SQL Server 2000 scheint ungültig/beschädigt zu sein
es: El archivo dll de cliente de memoria compartida de SQL Server 2000 parece no ser válido o estar dañado
fr: La DLL du client de mémoire partagée de SQL Server 2000 semble non valide/endommagée
it: La dll del client di memoria condivisa di SQL Server 2000 potrebbe essere danneggiata o non valida
ja: SQL Server 2000 共有メモリ クライアント DLL が無効であるか、または壊れています
ko: SQL Server 2000 공유 메모리 클라이언트 dll이 잘못/손상되었습니다.
pt_br: O DLL de memória compartilhada do cliente SQL Server 2000 parece estar inválido/danificado
ru: Клиентская библиотека общей памяти SQL Server 2000, по всей видимости, недействительна или повреждена
zh_hans: SQL Server 2000 共享内存客户端 dll 似乎无效/已损坏
zh_hant: SQL Server 2000 共用記憶體用戶端 dll 無效/已損毀。

# SNI_ERROR_38
source: Cannot open a Shared Memory connection to SQL Server 2000
de: Es konnte keine Shared Memory-Verbindung mit SQL Server 2000 hergestellt werden
es: No se puede abrir una conexión de memoria compartida con SQL Server 2000
fr: Impossible d'ouvrir une connexion de mémoire partagée à SQL Server 2000
it: Impossibile aprire una connessione di memoria condivisa a SQL Server 2000
ja: SQL Server 2000 への共有メモリによる接続を開けません
ko: SQL Server 2000에 대한 공유 메모리 연결을 열 수 없습니다.
pt_br: Não é possível abrir uma conexão de memória compartilhada com o SQL Server 2000
ru: Не удается установить соединение общей памяти с SQL Server 2000
zh_hans: 无法打开与 SQL Server 2000 的共享内存连接
zh_hant: 無法開啟連至 SQL Server 2000 的共用記憶體連線

# SNI_ERROR_39
source: Shared memory connectivity to SQL Server 2000 is either disabled or not available on this machine
de: Shared Memory-Konnektivität zu SQL Server 2000 ist entweder deaktiviert oder auf diesem Computer nicht verfügbar
es: La conectividad de memoria compartida a SQL Server 2000 está desactivada o no está disponible en este equipo
fr: La connectivité de mémoire partagée à SQL Server 2000 est désactivée ou indisponible sur cette machine
it: La connettività di memoria condivisa a SQL Server 2000 è stata disabilitata oppure non è disponibile nel computer
ja: SQL Server 2000 への共有メモリによる接続は無効であるか、またはこのコンピューターでは利用できなくなっています
ko: SQL Server 2000에 대한 공유 메모리 연결을 사용할 수 없거나 이 시스템에서 사용할 수 없습니다.
pt_br: A conectividade de memória compartilhada com SQL Server 2000 está desabilitada ou não está disponível neste computador
ru: Соединение общей памяти с SQL Server 2000 запрещено или недоступно на этом компьютере
zh_hans: 与 SQL Server 2000 的共享内存连接被禁用或在该计算机上不可用
zh_hant: SQL Server 2000 的共用記憶體連線已停用或無法在此電腦上使用

# SNI_ERROR_40
source: Could not open a connection to SQL Server
de: Es konnte keine Verbindung zu SQL Server hergestellt werden
es: No se pudo abrir una conexión con SQL Server
fr: Impossible d'ouvrir une connexion à SQL Server
it: Impossibile aprire una connessione a SQL Server
ja: SQL Server への接続を開けませんでした
ko: SQL Server에 대한 연결을 열 수 없습니다.
pt_br: Não foi possível abrir uma conexão com o SQL Server
ru: Не удалось открыть соединение с SQL Server
zh_hans: 无法打开与 SQL Server 的连接
zh_hant: 無法開啟 SQL Server 連線
