Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# DataTable_InvalidSortString
source: {0} isn't a valid Sort string entry.
de: {0} ist kein gültiger Sortierzeichenfolgen-Eintrag.
es: {0} no es una entrada de cadena de Sort válida.
fr: {0} n'est pas une entrée de chaîne Sort valide.
it: {0} non è una stringa Sort valida.
ja: {0} は有効な Sort 文字列エントリではありません。
ko: {0}은(는) 올바른 Sort 문자열 엔트리가 아닙니다.
pt_br: {0} não é uma entrada de cadeia de caracteres de Sort válida.
ru: {0} не является допустимой строковой записью сортировки Sort.
zh_hans: {0} 不是有效的 Sort 字符串项。
zh_hant: {0} 不是有效的 Sort 字串項目。

# DataTable_CanNotSerializeDataTableHierarchy
source: Cannot serialize the DataTable. A DataTable being used in one or more DataColumn expressions is not a descendant of current DataTable.
de: Die DataTable kann nicht serialisiert werden. Eine DataTable, die in einem oder mehreren DataColumn-Ausdrücken verwendet wird, ist kein nachfolgender Wert der aktuellen DataTable.
es: No se puede serializar DataTable. Una de las tablas DataTable utilizadas en una o varias expresiones DataColumn no es descendiente de la DataTable actual.
fr: Impossible de sérialiser le DataTable. Un DataTable utilisé dans des expressions DataColumn n'est pas un descendant du DataTable actuel.
it: Impossibile serializzare il DataTable. Un DataTable utilizzato in una o più espressioni DataColumn non è un discendente della DataTable corrente.
ja: DataTable をシリアル化できません。1 つ以上の DataColumn 式中で使われている DataTable が、現在の DataTable の子孫ではありません。
ko: DataTable을 serialize할 수 없습니다. 하나 이상의 DataColumn 식에서 사용되는 DataTable이 현재 DataTable의 하위 항목이 아닙니다.
pt_br: Não é possível serializar a DataTable. Uma DataTable usada em uma ou mais expressões de DataColumn não descende de DataTable atual.
ru: Не удалось сериализовать DataTable. DataTable, использующаяся в одном или нескольких выражениях DataColumn, не является потомком текущей DataTable.
zh_hans: 无法序列化 DataTable。一个或多个 DataColumn 表达式中使用的 DataTable 不是当前 DataTable 的后代。
zh_hant: 無法序列化 DataTable。用於一或多個 DataColumn 運算式的 DataTable 並非目前 DataTable 的下階。

# DataTable_CanNotRemoteDataTable
source: This DataTable can only be remoted as part of DataSet. One or more Expression Columns has reference to other DataTable(s).
de: Diese DataTable kann nur als Teil eines DataSet als remote festgelegt werden. Eine oder mehrere Expression Columns weisen einen Verweis auf andere DataTable(s) auf.
es: Esta DataTable sólo puede ser remota dentro de DataSet. Una o varias columnas Expression hacen referencia a otras tablas DataTable.
fr: Ce DataTable peut uniquement être distant s'il fait partie de DataSet. Des colonnes d'expression font référence à d'autres DataTable(s).
it: È possibile rimuovere questa DataTable solo come parte di DataSet. Una o più colonne Expression hanno riferimenti ad altre DataTable.
ja: この DataTable は、DataSet の一部としてリモートから操作できません。1 つ以上の複数の式列に他の DataTable への参照が保持されています。
ko: 이 DataTable은 DataSet의 일부로만 원격이 될 수 있습니다. 하나 이상의 Expression 열에 다른 DataTable에 대한 참조가 있습니다.
pt_br: Essa DataTable somente pode ser remota como parte de DataSet. Uma ou mais colunas de expressão fazem referência a outra DataTable(s).
ru: Удаленное взаимодействие с этой DataTable возможно только в составе DataSet. Имеются столбцы Expression, ссылающиеся на другие DataTable.
zh_hans: 此 DataTable 只能远程作为 DataSet 的一部分。一个或多个表达式列引用了其他数据表。
zh_hant: 此 DataTable 僅可被遠端控制為 DataSet 的一部分。一或多個 Expression Columns 已參考至其他 DataTable。

# DataTable_CanNotSetRemotingFormat
source: Cannot have different remoting format property value for DataSet and DataTable.
de: Für DataSet und DataTable ist kein unterschiedlicher Remote-Formateigenschaftenwert möglich.
es: DataSet y DataTable no pueden tener valores de propiedad de formato remoto diferentes.
fr: DataSet et DataTable ne peuvent pas comporter des valeurs de propriété de format de communication à distance différentes.
it: Impossibile avere valori differenti della proprietà di formattazione remota per DataSet e DataTable.
ja: DataSet および DataTable のリモーティング フォーマット プロパティの値は、同じでなくてはなりません。
ko: DataSet 및 DataTable에 대해 다른 원격 형식 속성 값을 설정할 수 없습니다.
pt_br: Não é permitido valor de propriedade de formato remoto diferente para DataSet e DataTable.
ru: Невозможно использовать разные значения свойства удаленного форматирования для DataSet и DataTable.
zh_hans: 不能对 DataSet 和 DataTable 使用不同的远程格式属性值。
zh_hant: DataSet 與 DataTable 無法具有不同的遠端格式屬性值。

# DataTable_CanNotSerializeDataTableWithEmptyName
source: Cannot serialize the DataTable. DataTable name is not set.
de: Die DataTable kann nicht serialisiert werden. Der DataTable-Name ist nicht festgelegt.
es: No se puede serializar DataTable. No se ha establecido el nombre DataTable.
fr: Impossible de sérialiser le DataTable. Le nom du DataTable n'est pas défini.
it: Impossibile serializzare la DataTable. Nome di DataTable non impostato.
ja: DataTable をシリアル化できません。DataTable の名前が設定されていません。
ko: DataTable을 serialize할 수 없습니다. DataTable 이름이 설정되지 않았습니다.
pt_br: Não é possível serializar a DataTable. Nome de DataTable não definido.
ru: Не удалось сериализовать DataTable. Не указано имя DataTable.
zh_hans: 无法序列化 DataTable。未设置 DataTable 名称。
zh_hant: 無法序列化 DataTable。未設定 DataTable 名稱。

# DataTable_DuplicateName
source: A DataTable named '{0}' already belongs to this DataSet.
de: Eine DataTable mit dem Namen '{0}' gehört bereits zu diesem DataSet.
es: DataTable denominada '{0}' ya pertenece a este DataSet.
fr: Un DataTable appelé '{0}' appartient déjà à ce DataSet.
it: Un DataTable di nome '{0}' appartiene già a questo DataSet.
ja: '{0}' という DataTable は既にこの DataSet に属しています。
ko: 이름이 '{0}'인 DataTable이 이 DataSet에 이미 속해 있습니다.
pt_br: Uma DataTable chamada '{0}' já pertence a este DataSet.
ru: DataTable с именем "{0}" уже принадлежит этому DataSet.
zh_hans: 名为“{0}”的 DataTable 已属于此 DataSet。
zh_hant: 名為 '{0}' 的 DataTable 已經屬於這個 DataSet。

# DataTable_DuplicateName2
source: A DataTable named '{0}' with the same Namespace '{1}' already belongs to this DataSet.
de: Eine DataTable mit dem Namen '{0}' mit demselben Namespace '{1}' gehört bereits zu diesem DataSet.
es: Una tabla DataTable denominada '{0}' con el mismo Namespace '{1}' ya pertenece a este DataSet.
fr: Un DataTable nommé '{0}' avec le même Namespace '{1}' appartient déjà à ce DataSet.
it: Una DataTable denominata "{0}" con lo stesso Namespace "{1}" appartiene già a questo DataSet.
ja: 同じ Namespace '{1}' の '{0}' という DataTable は、既にこの DataSet に属しています。
ko: 같은 Namespace '{1}'이(가) 있는 '{0}'(이)라는 DataTable이 이미 이 DataSet에 속해 있습니다.
pt_br: Este DataSet já possui uma DataTable nomeada '{0}' com o mesmo Namespace '{1}'.
ru: DataTable "{0}" с тем же пространством имен Namespace "{1}" уже принадлежит этому DataSet.
zh_hans: 具有同一 Namespace“{1}”、名为“{0}”的 DataTable 已属于此 DataSet。
zh_hant: 名為 '{0}' 且同為 Namespace 同為 '{1}' 的 DataTable 已屬於此 DataSet。

# DataTable_SelfnestedDatasetConflictingName
source: The table ({0}) cannot be the child table to itself in a nested relation: the DataSet name conflicts with the table name.
de: Die Tabelle ({0}) kann in einer geschachtelten Beziehung keine untergeordnete Tabelle von sich selbst sein. Der DataSet-Name steht mit dem Tabellennamen in Konflikt.
es: La tabla ({0}) no puede ser la tabla secundaria de sí misma en una relación anidada: el nombre de DataSet está en conflicto con el nombre de la tabla.
fr: La table ({0}) ne peut pas être sa table enfant dans une relation imbriquée : le nom DataSet est en conflit avec le nom de la table.
it: La tabella ({0}) non può essere figlia di se stessa in una relazione annidata: il nome del DataSet è in conflitto con quello della tabella.
ja: 入れ子にされたリレーションシップで、テーブル ({0}) をそれ自体の子テーブルにすることはできません。DataSet 名がテーブル名と競合しています。
ko: DataSet 이름과 테이블 이름이 충돌하므로, 중첩 관계에서 ({0}) 테이블은 자신의 자식 테이블이 될 수 없습니다.
pt_br: A tabela ({0}) não pode ser a tabela filho dela mesma em uma relação aninhada: o nome do DataSet está em conflito com o nome da tabela.
ru: Во вложенном отношении таблица ({0}) не может быть дочерней по отношению к себе: имя DataSet не согласуется с именем таблицы.
zh_hans: 在嵌套关系中，表({0})不能是自身的子表: DataSet 名称与表名称冲突。
zh_hant: 資料表 ({0}) 在巢狀關聯中不可作為本身的子資料表: DataSet 名稱與資料表名稱發生衝突。

# DataTable_DatasetConflictingName
source: The name '{0}' is invalid. A DataTable cannot have the same name of the DataSet.
de: Der Name '{0}' ist ungültig. Eine DataTable darf nicht den gleichen Namen wie der DataSet haben.
es: El nombre '{0}' no es válido. DataTable no puede tener el mismo nombre que DataSet.
fr: Le nom '{0}' n'est pas valide. Un DataTable ne peut pas avoir le même nom que le DataSet.
it: Il nome '{0}' non è valido. Il nome di un DataTable non può essere uguale a quello del DataSet.
ja: 名前 '{0}' は無効です。DataTable に DataSet と同じ名前を指定することはできません。
ko: 이름 '{0}'이(가) 잘못되었습니다. DataTable 이름에는 DataSet과 같은 이름을 사용할 수 없습니다.
pt_br: O nome '{0}' é inválido. Uma DataTable não pode ter o mesmo nome do DataSet.
ru: Недопустимое имя "{0}". Имя DataTable не может совпадать с именем DataSet.
zh_hans: 名称“{0}”无效。DataTable 不能与 DataSet 同名。
zh_hant: 名稱 '{0}' 無效。DataTable 不可以和 DataSet 同名。

# DataTable_AlreadyInOtherDataSet
source: DataTable already belongs to another DataSet.
de: Die DataTable gehört bereits zu einem anderen DataSet.
es: DataTable ya pertenece a otro DataSet.
fr: DataTable appartient déjà à un autre DataSet.
it: DataTable già appartenente a un DataSet diverso.
ja: DataTable は既に別の DataSet に属しています。
ko: DataTable이 이미 다른 DataSet에 속해 있습니다.
pt_br: DataTable já pertence a outro DataSet.
ru: DataTable уже принадлежит другому DataSet.
zh_hans: DataTable 已属于另一个 DataSet。
zh_hant: DataTable 已經屬於其他 DataSet。

# DataTable_AlreadyInTheDataSet
source: DataTable already belongs to this DataSet.
de: Die DataTable gehört bereits zu diesem DataSet.
es: DataTable ya pertenece a este DataSet.
fr: DataTable appartient déjà à ce DataSet.
it: DataTable già appartenente a questo DataSet.
ja: DataTable は既にこの DataSet に属しています。
ko: DataTable이 이미 현재 DataSet에 속해 있습니다.
pt_br: DataTable já pertence a este DataSet.
ru: DataTable уже принадлежит этому DataSet.
zh_hans: DataTable 已属于此 DataSet。
zh_hant: DataTable 已經屬於這個 DataSet。

# DataTable_NotInTheDataSet
source: Table {0} does not belong to this DataSet.
de: Die Tabelle {0} gehört nicht zu diesem DataSet.
es: La tabla {0} no pertenece a esta DataSet.
fr: La table {0} n'appartient pas à ce DataSet.
it: La tabella {0} non appartiene a questo DataSet.
ja: テーブル {0} はこの DataSet に属していません。
ko: {0} 테이블은 이 DataSet에 속하지 않습니다.
pt_br: Tabela {0} não pertence a este DataSet.
ru: Таблица {0} не принадлежит этому DataSet.
zh_hans: 表 {0} 不属于此 DataSet。
zh_hant: 資料表 {0} 不屬於這個 DataSet。

# DataTable_OutOfRange
source: Cannot find table {0}.
de: Die Tabelle {0} kann nicht gefunden werden.
es: No se puede encontrar la tabla {0}.
fr: Impossible de trouver la table {0}.
it: Impossibile trovare la tabella {0}.
ja: テーブル {0} が見つかりません。
ko: {0} 테이블을 찾을 수 없습니다.
pt_br: Não é possível encontrar a tabela {0}.
ru: Невозможно найти таблицу {0}.
zh_hans: 无法找到表 {0}。
zh_hant: 找不到資料表 {0}。

# DataTable_InRelation
source: Cannot remove a table that has existing relations. Remove relations first.
de: Eine Tabelle, für die Beziehungen vorhanden sind, kann nicht entfernt werden. Entfernen Sie zuerst die Beziehungen.
es: No se puede eliminar una tabla que contenga relaciones. Elimine primero las relaciones.
fr: Impossible de supprimer une table qui a des relations existantes. Supprimez tout d'abord les relations.
it: Impossibile rimuovere una tabella con relazioni. Rimuovere prima le relazioni.
ja: 既存のリレーションシップを含むテーブルを削除することはできません。最初にリレーションシップを削除してください。
ko: 기존 관계를 포함하는 테이블을 제거할 수 없습니다. 먼저 관계를 제거하십시오.
pt_br: Não é possível remover uma tabela que possui relações existentes. Remova as relações primeiro.
ru: Невозможно удалить таблицу, для которой существуют отношения. Сначала удалите отношения.
zh_hans: 不能移除包含现有关系的表。请首先移除关系。
zh_hant: 無法移除擁有已存在關聯的資料表。請先移除關聯。

# DataTable_InConstraint
source: Cannot remove table {0}, because it referenced in ForeignKeyConstraint {1}. Remove the constraint first.
de: Die Tabelle {0} kann nicht entfernt werden, da auf sie in der ForeignKeyConstraint {1} verwiesen wird. Entfernen Sie zuerst diese Fremdschlüsseleinschränkung.
es: No se puede eliminar la tabla {0}, porque hace referencia a ForeignKeyConstraint {1}. Elimine primero la restricción.
fr: Impossible de supprimer la table {0}, car elle est référencée dans ForeignKeyConstraint {1}. Supprimez tout d'abord la contrainte.
it: Impossibile rimuovere la tabella {0} perché esiste un riferimento ad essa in ForeignKeyConstraint {1}. Impossibile rimuovere la tabella senza prima rimuovere il vincolo.
ja: {0} は ForeignKeyConstraint {1} で参照されているため、削除できません。最初に制約を削除してください。
ko: {0} 테이블은 ForeignKeyConstraint {1}에서 참조했으므로 제거할 수 없습니다. 먼저 제약 조건을 제거하십시오.
pt_br: Não é possível remover a tabela {0}, porque ForeignKeyConstraint {1} faz referência a ela. Remova a restrição primeiro.
ru: Невозможно удалить таблицу {0}, т.к. ссылка на нее содержится в ForeignKeyConstraint {1}. Сначала удалите это ограничение.
zh_hans: 不能移除表 {0}，原因是它在 ForeignKeyConstraint {1} 中被引用。请首先移除该约束。
zh_hant: 無法移除資料表 {0}，因為它在 ForeignKeyConstraint {1} 中被參考。請先移除條件約束。

# DataTable_TableNotFound
source: DataTable '{0}' does not match to any DataTable in source.
de: Die DataTable '{0}' stimmt mit keiner DataTable in der Quelle überein.
es: DataTable '{0}' no coincide con ninguna tabla DataTable del origen.
fr: Le DataTable '{0}' ne correspond à aucun DataTable de la source.
it: La DataTable "{0}" non corrisponde ad alcuna DataTable nell'origine.
ja: DataTable '{0}' は、ソースの DataTable のどれにも一致しません。
ko: DataTable '{0}'이(가) 원본의 모든 DataTable과 일치하지 않습니다.
pt_br: DataTable '{0}' não corresponde a qualquer DataTable na origem.
ru: DataTable "{0}" не соответствует ни одной DataTable в источнике.
zh_hans: DataTable“{0}”与源中的任意 DataTable 都不匹配。
zh_hant: DataTable '{0}' 與來源中的任何 DataTable 不相符。

# DataMerge_MissingDefinition
source: Target DataSet missing definition for {0}.
de: Ziel-DataSet hat keine Definition für {0}.
es: Falta la definición del DataSet de destino {0}.
fr: Définition DataSet cible manquante pour {0}.
it: Nel DataSet di destinazione manca la definizione per {0}.
ja: ターゲットの DataSet に {0} の定義が見つかりません。
ko: 대상 DataSet에 {0}의 정의가 없습니다.
pt_br: DataSet de destino não tem definição para {0}.
ru: В конечном DataSet отсутствует определение {0}.
zh_hans: 目标 DataSet 缺少 {0} 的定义。
zh_hant: 目標 DataSet 遺漏 {0} 的定義。

# DataMerge_MissingConstraint
source: Target DataSet missing {0} {1}.
de: Ziel-DataSet hat kein {0} {1}.
es: Falta el DataSet de destino {0} {1}.
fr: DataSet cible manquant {0} {1}.
it: Nel DataSet di destinazione manca {0} {1}.
ja: ターゲットの DataSet に {0} {1} がありません。
ko: 대상 DataSet에 {0} {1}이(가) 없습니다.
pt_br: DataSet de destino inexistente {0} {1}.
ru: В конечном DataSet отсутствует {1} {0}.
zh_hans: 目标 DataSet 缺少 {0} {1}。
zh_hant: 目標 DataSet 遺漏 {0} {1}。

# DataMerge_DataTypeMismatch
source: <target>.{0} and <source>.{0} have conflicting properties: DataType property mismatch.
de: <target>.{0} und <source>.{0} haben Eigenschaften, die miteinander im Konflikt stehen: keine DataType-Eigenschaftenübereinstimmung.
es: Las propiedades de <target>.{0} y <source>.{0} están en conflicto: la propiedad DataType no coincide.
fr: <target>.{0} et <source>.{0} ont des propriétés en conflit : incompatibilité de propriété DataType.
it: Conflitto tra le proprietà <target>.{0} e <source>.{0} : proprietà DataType non corrispondente.
ja: <target>.{0} と <source>.{0} は競合するプロパティがあります : DataType プロパティの不一致
ko: <target>.{0}과(와) <source>.{0}의 속성이 충돌합니다. DataType 속성이 일치하지 않습니다.
pt_br: <target>.{0} e <source>.{0} têm propriedades conflitantes: propriedade DataType incompatível.
ru: <target>.{0} и <source>.{0} имеют несовместимые свойства: несоответствие свойства DataType.
zh_hans: <target>.{0} 和 <source>.{0} 的属性冲突: DataType 属性不匹配。
zh_hant: <target>.{0} 和 <source>.{0} 擁有衝突的屬性: DataType 屬性不符。

# DataMerge_PrimaryKeyMismatch
source: <target>.PrimaryKey and <source>.PrimaryKey have different Length.
de: <target>.PrimaryKey und <source>.PrimaryKey haben unterschiedliche Length-Werte.
es: <target>.PrimaryKey y <source>.PrimaryKey tienen un valor de Length diferente.
fr: Length différent pour <target>.PrimaryKey et <source>.PrimaryKey.
it: <target>.PrimaryKey e <source>.PrimaryKey hanno Length differenti.
ja: <target>.PrimaryKey と <source>.PrimaryKey の Length が異なります。
ko: <target>.PrimaryKey와 <source>.PrimaryKey의 Length가 다릅니다.
pt_br: <target>.PrimaryKey e <source>.PrimaryKey têm Length diferente.
ru: <target>.PrimaryKey и <source>.PrimaryKey имеют различную длину Length.
zh_hans: <target>.PrimaryKey 和 <source>.PrimaryKey 的 Length 不相同。
zh_hant: <target>.PrimaryKey 和 <source>.PrimaryKey 擁有不同的 Length。

# DataMerge_PrimaryKeyColumnsMismatch
source: Mismatch columns in the PrimaryKey : <target>.{0} versus <source>.{1}.
de: Spaltenkonflikt im PrimaryKey: <target>.{0} im Vergleich zu <source>.{1}.
es: Las columnas en PrimaryKey no coinciden: <target>.{0} frente a <source>.{1}.
fr: Colonnes incompatibles dans PrimaryKey : <target>.{0} versus <source>.{1}.
it: Errata corrispondenza di colonne nella chiave PrimaryKey tra <target>.{0} e <source>.{1}.
ja: PrimaryKey 内に列の不一致があります : <target>.{0} に対する <source>.{1} です。
ko: PrimaryKey의 열이 일치하지 않습니다 : <target>.{0} 및 <source>.{1}.
pt_br: Colunas incompatíveis em PrimaryKey: <target>.{0} versus <source>.{1}.
ru: Несоответствие столбцов в PrimaryKey: <target>.{0} относительно <source>.{1}.
zh_hans: PrimaryKey 中的列不匹配 : <target>.{0} 与 <source>.{1} 不匹配。
zh_hant: 不相符的資料行在 PrimaryKey 中: <target>.{0} 和 <source>.{1}。

# DataMerge_ReltionKeyColumnsMismatch
source: Relation {0} cannot be merged, because keys have mismatch columns.
de: Relation {0} kann nicht zusammengeführt werden, da Schlüsselspalten nicht übereinstimmen.
es: No se puede combinar la Relation {0}, porque las columnas de las claves no coinciden.
fr: La Relation {0} ne peut pas être fusionnée, car les clés ont des colonnes incompatibles.
it: Impossibile eseguire l'unione di Relation {0}. Errata corrispondenza tra le colonne specificate nelle chiavi.
ja: キーに一致しない列があるため、Relation {0} をマージできません。
ko: 해당 키에 일치하지 않는 열이 있으므로 Relation {0}을(를) 병합할 수 없습니다.
pt_br: A Relation {0} não pode ser mesclada porque as chaves têm colunas incompatíveis.
ru: Невозможно присоединить отношение Relation {0} из-за несоответствия столбцов в ключах.
zh_hans: 不能合并 Relation {0}，因为键具有不匹配的列。
zh_hant: Relation {0} 無法合併，因為索引鍵擁有不相符的資料行。

# DataMerge_MissingColumnDefinition
source: Target table {0} missing definition for column {1}.
de: Zieltabelle {0} hat keine Definition für Spalte {1}.
es: En la tabla de destino {0} falta la definición para la columna {1}.
fr: La table cible {0} n'a pas de définition pour la colonne {1}.
it: Nella tabella di destinazione {0} manca la definizione per la colonna {1}.
ja: ターゲット テーブル {0} に列 {1} の定義が見つかりません。
ko: {0} 대상 테이블에 {1} 열의 정의가 없습니다.
pt_br: Tabela de destino {0} não tem definição para a coluna {1}.
ru: В конечной таблице {0} отсутствует определение столбца {1}.
zh_hans: 目标表 {0} 缺少列 {1} 的定义。
zh_hant: 目標資料表 {0} 遺漏資料行 {1} 的定義。

# DataMerge_MissingPrimaryKeyColumnInSource
source: PrimaryKey column {0} does not exist in source Table.
de: PrimaryKey-Spalte {0} ist in der Quelltabelle nicht vorhanden.
es: La columna PrimaryKey {0} no existe en la tabla de origen.
fr: La colonne PrimaryKey {0} n'existe pas dans la table source.
it: La colonna PrimaryKey {0} non esiste nella tabella di origine.
ja: PrimaryKey 列 {0} は、ソースの Table にありません。
ko: PrimaryKey 열 {0}이(가) 원본 테이블에 없습니다.
pt_br: Coluna PrimaryKey {0} não existe na tabela de origem.
ru: Столбец PrimaryKey {0} отсутствует в исходной таблице.
zh_hans: 源表中不存在 PrimaryKey 列 {0}。
zh_hant: PrimaryKey 資料欄 {0} 不存在於來源 Table 中。

# DataIndex_RecordStateRange
source: The RowStates parameter must be set to a valid combination of values from the DataViewRowState enumeration.
de: Der RowStates-Parameter muss auf eine gültige Wertkkombination aus der DataViewRowState-Enumeration gesetzt sein.
es: Debe establecer el parámetro RowStates con una combinación válida de valores de la enumeración DataViewRowState.
fr: Le paramètre RowStates doit être défini à une combinaison valide de valeurs à partir de l'énumération DataViewRowState.
it: Il parametro RowStates deve essere impostato su una combinazione valida di valori appartenenti all'enumerazione DataViewRowState.
ja: RowStates パラメーターには、DataViewRowState 列挙値の有効な組み合わせを設定する必要があります。
ko: RowStates 매개 변수는 DataViewRowState 열거형의 유효한 값 조합으로 설정해야 합니다.
pt_br: O parâmetro RowStates deve ser definido com uma combinação válida de valores da enumeração DataViewRowState.
ru: Параметру RowStates должно быть присвоено допустимое сочетание значений из перечисления DataViewRowState.
zh_hans: RowStates 参数必须设置为 DataViewRowState 枚举值的有效组合。
zh_hant: RowStates 參數必須被設定為來自 DataViewRowState 列舉的有效值結合。

# DataIndex_FindWithoutSortOrder
source: Find finds a row based on a Sort order, and no Sort order is specified.
de: Sucht eine Zeile, basierend auf Sortierreihenfolge. Es wurde jedoch keine Sortierreihenfolge bestimmt.
es: Encuentra una fila basándose en el criterio de ordenación, pero no ha especificado ningún criterio de ordenación.
fr: Find recherche une ligne en fonction d'un ordre de tri et aucun ordre de tri n'est spécifié.
it: La funzione Trova individua una riga in base a un criterio di ordinamento, ma non ne è stato specificato nessuno.
ja: Find は、並べ替え順序に基づいて行を検索しますが、並べ替え順序が指定されていません。
ko: Find는 정렬 순서에 따라 행을 찾지만 정렬 순서가 지정되어 있지 않습니다.
pt_br: Find encontra uma fila com base em uma ordem de classificação, mas nenhuma ordem de classificação foi especificada.
ru: Поиск строк выполняется на основе порядка сортировки, а порядок сортировки не задан.
zh_hans: 查找基于排序顺序来查找行，但未指定任何排序顺序。
zh_hant: 尋找會依排序順序尋找資料列，而未指定任何排序順序。

# DataIndex_KeyLength
source: Expecting {0} value(s) for the key being indexed, but received {1} value(s).
de: Es werden {0}-Wert(e) für den Schlüssel, der indiziert wird, erwartet. Es wurden jedoch {1}-Wert(e) empfangen.
es: Se esperaban los valores {0} para la clave indizada, pero se han recibido valores {1}.
fr: {0} valeurs attendues pour la clé indexée, mais {1} valeurs reçues.
it: Previsto il valore {0} per la chiave che si sta indicizzando. Ricevuto valore {1}.
ja: インデックスを付加するキーには {0} 値が必要ですが、{1} 値を取得しました。
ko: 인덱싱되는 키에 대한 {0} 값이 필요한데 {1} 값을 받았습니다.
pt_br: Esperando {0} valor(es) para a chave que está sendo indexada, mas foi(foram) recebido(s) {1} valor(es).
ru: Ожидалось {0} значение (значений) индексируемого ключа, а получено {1} значение (значений).
zh_hans: 被编制索引的键需要 {0} 个值，但收到了 {1} 个值。
zh_hant: 所檢索的索引鍵需要 {0} 個值，但接收到 {1} 個值。

# DataStorage_AggregateException
source: Invalid usage of aggregate function {0}() and Type: {1}.
de: Ungültige Verwendung von Aggregatfunktion {0}() und Typ: {1}.
es: Uso no válido de la función de agregado {0}() y el tipo: {1}.
fr: Utilisation non valide de la fonction d'agrégation {0}() et du type : {1}.
it: Utilizzo non valido della funzione {0}() e del tipo di aggregazione: {1}.
ja: 集約関数 {0}() および型 : {1} の使用が無効です。
ko: 집계 함수 {0}() 및 형식 {1} 사용이 잘못되었습니다.
pt_br: Uso inválido da função de agregação {0}() e tipo: {1}.
ru: Недопустимое использование агрегатной функции {0}() и типа: {1}.
zh_hans: 无效的聚合函数 {0}()和类型 {1} 的用法。
zh_hant: 彙總函式 {0}() 和型別的無效用法: {1}。

# DataStorage_InvalidStorageType
source: Invalid storage type: {0}.
de: Ungültiger Speichertyp: {0}.
es: Tipo de almacenamiento no válido: {0}.
fr: Type d'enregistrement non valide : {0}.
it: Tipo di archiviazione non valido: {0}.
ja: ストレージ型 : {0} が無効です。
ko: 저장소 형식이 잘못되었습니다. {0}
pt_br: Tipo de armazenamento inválido: {0}.
ru: Недопустимый тип хранилища: {0}.
zh_hans: 无效的存储类型: {0}。
zh_hant: 無效的儲存型別: {0}。
