Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# TCE_SqlConnection_ColumnEncryptionKeyCacheTtl
source: Defines the time-to-live of entries in the column encryption key cache.
de: Definiert die Gültigkeitsdauer von Einträgen im Spaltenverschlüsselungs-Schlüsselcache.
es: Define el período de vida de las entradas de la caché de la clave de cifrado de la columna.
fr: Définit la durée de vie des entrées dans le cache de clés de chiffrement de colonne.
it: Consente di definire la durata (TTL) delle voci nella cache delle chiavi di crittografia di colonna.
ja: 列暗号化キー キャッシュのエントリの Time to Live を定義します。
ko: 열 암호화 키 캐시에 있는 항목의 TTL(Time to Live)을 정의합니다.
pt_br: Define a vida útil de entradas no cache de chave de criptografia de coluna.
ru: Определяет срок жизни записей в кэше ключа шифрования столбцов.
zh_hans: 定义列加密密钥缓存中各条目的生存时间。
zh_hant: 在資料行加密金鑰快取中定義項目的存留時間。

# SQL_Timeout_Execution
source: Execution Timeout Expired. The timeout period elapsed prior to completion of the operation or the server is not responding.
de: Das Ausführungstimeout ist abgelaufen. Der Timeoutzeitraum wurde überschritten, bevor der Vorgang beendet wurde, oder der Server antwortet nicht.
es: Se agotó el tiempo de espera de ejecución. El período de tiempo de espera transcurrió antes de la finalización de la operación o el servidor no responde.
fr: Le délai d'exécution a expiré. Le délai d'attente s'est écoulé avant la fin de l'opération ou le serveur ne répond pas.
it: Il timeout di esecuzione è scaduto. Il periodo di timeout è scaduto prima del completamento dell'operazione oppure il server non risponde.
ja: 実行タイムアウトの期限が切れました。操作完了前にタイムアウト期間が過ぎたか、サーバーが応答していません。
ko: 실행 제한 시간을 초과했습니다. 작업이 완료되기 전에 실행 제한 시간이 지났거나 서버가 응답하지 않습니다.
pt_br: Tempo Limite de Execução Expirado. O período de tempo limite terminou antes da conclusão da operação ou o servidor não está respondendo.
ru: Время ожидания выполнения истекло. Время ожидания истекло до завершения операции, или сервер не отвечает.
zh_hans: 执行超时已过期。完成操作之前已超时或服务器未响应。
zh_hant: 執行逾時到期。在作業完成之前超過逾時等待的時間，或是伺服器未回應。

# SQL_ExErrorNumberStateClass
source: Error Number:{0},State:{1},Class:{2}
de: Fehlernummer (Error Number):{0},Status (State):{1},Klasse (Class):{2}

# SqlMisc_NullString
source: Null
pt_br: Nulo
