Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_InvalidArgumentValue
source: Invalid argument value for method '{0}'.
de: Ungültiger Argumentwert für Methode '{0}'.
es: Valor de argumento no válido para el método '{0}'.
fr: Valeur d'argument non valide pour la méthode '{0}'.
it: Valore di argomento non valido per il metodo "{0}".
ja: メソッド '{0}' の引数の値が無効です。
ko: 메서드 '{0}'에 대한 인수 값이 잘못되었습니다.
pt_br: Valor de argumento inválido para o método '{0}'.
ru: Недопустимое значение аргумента для метода "{0}".
zh_hans: 方法“{0}”的参数值无效。
zh_hant: 無效的方法 '{0}' 引數值。

# ADP_OdbcNoTypesFromProvider
source: The ODBC provider did not return results from SQLGETTYPEINFO.
de: Der ODBC-Provider hat keine Ergebnisse für SQLGETTYPEINFO zurückgegeben.
es: El proveedor ODBC no devolvió resultados de SQLGETTYPEINFO.
fr: Le fournisseur ODBC n'a pas renvoyé de résultats à partir de SQLGETTYPEINFO.
it: Il provider ODBC non ha restituito risultati da SQLGETTYPEINFO.
ja: ODBC プロバイダーが SQLGETTYPEINFO から結果を返しませんでした。
ko: ODBC 공급자가 SQLGETTYPEINFO에서 결과를 반환하지 않았습니다.
pt_br: O provedor ODBC não retornou resultados de SQLGETTYPEINFO.
ru: Поставщик ODBC не вернул результаты из SQLGETTYPEINFO.
zh_hans: ODBC 访问接口未从 SQLGETTYPEINFO 返回结果。
zh_hant: ODBC 提供者未從 SQLGETTYPEINFO 傳回結果。

# ADP_NullDataTable
source: Unexpected null DataTable argument
de: Unerwartetes null DataTable-Argument
es: No se esperaba un argumento de DataTable null
fr: Argument DataTable null inattendu
it: Argomento DataTable null imprevisto.
ja: 予期しない null DataTable 引数です。
ko: 예기치 않은 null DataTable 인수입니다.
pt_br: Argumento DataTable null inesperado
ru: Непредусмотренный аргумент DataTable null
zh_hans: 意外的 null DataTable 参数
zh_hant: 未預期的 null DataTable 引數

# ADP_NullDataSet
source: Unexpected null DataSet argument.
de: Unerwartetes null DataSet-Argument.
es: No se esperaba un argumento de DataSet null.
fr: Argument DataSet null inattendu.
it: Argomento DataSet null imprevisto.
ja: 予期しない null DataSet 引数です。
ko: 예기치 않은 null DataSet 인수입니다.
pt_br: Argumento DataSet null inesperado.
ru: Непредусмотренный неопределенный аргумент null DataSet.
zh_hans: 意外的 null DataSet 参数。
zh_hant: 未預期的 null DataSet 引數。

# OdbcConnection_ConnectionStringTooLong
source: Connection string exceeds maximum allowed length of {0}.
de: Die Verbindungszeichenfolge überschreitet die zulässige Länge von {0}.
es: La cadena de conexión supera la longitud máxima permitida de {0}.
fr: La chaîne de connexion dépasse la longueur maximale autorisée {0}.
it: La stringa di connessione supera la lunghezza massima consentita, pari a {0}.
ja: 接続文字列が長さの最大許容値 {0} を超えています。
ko: 연결 문자열이 허용되는 최대 길이인 {0}을(를) 초과합니다.
pt_br: Cadeia de conexão excede o comprimento máximo permitido de {0}.
ru: Длина строки подключения превышает максимальную разрешенную величину {0}.
zh_hans: 连接字符串超出最大允许长度 {0}。
zh_hant: 連接字串超過允許的最大長度 {0}。

# Odbc_GetTypeMapping_UnknownType
source: {0} - unable to map type.
de: {0} - Typzuordnung nicht möglich.
es: {0} - no se puede asignar el tipo.
fr: {0} - Impossible de mapper le type.
it: {0}: impossibile mappare il tipo.
ja: {0} - 型をマップできません。
ko: {0} - 형식에 매핑할 수 없습니다.
pt_br: {0} - não é possível mapear tipo.
ru: {0} — не удается произвести сопоставление типа.
zh_hans: {0} - 无法映射类型。
zh_hant: {0} - 無法對應型別。

# Odbc_UnknownSQLType
source: Unknown SQL type - {0}.
de: Unbekannter SQL-Typ - {0}.
es: Tipo SQL desconocido - {0}.
fr: Type SQL inconnu - {0}.
it: Tipo SQL sconosciuto - {0}.
ja: 不明な SQL の種類です - {0}。
ko: 알 수 없는 SQL 형식입니다. {0}
pt_br: Tipo SQL desconhecido - {0}.
ru: Неизвестный тип SQL - {0}.
zh_hans: 未知 SQL 类型 - {0}。
zh_hant: 未知的 SQL 型別 - {0}。

# Odbc_UnknownURTType
source: Unknown URT type - {0}.
de: Unbekannter URT-Typ - {0}.
es: Tipo URT desconocido - {0}.
fr: Type URT inconnu - {0}.
it: Tipo URT sconosciuto - {0}.
ja: 不明な URT の種類です - {0}。
ko: 알 수 없는 URT 형식입니다. {0}
pt_br: Tipo URT desconhecido - {0}.
ru: Неизвестный тип URT - {0}.
zh_hans: 未知 URT 类型 - {0}。
zh_hant: 未知的 URT 型別 - {0}。

# Odbc_NegativeArgument
source: Invalid negative argument!
de: Ungültiges negatives Argument.
es: Argumento negativo no válido
fr: Argument négatif non valide !
it: Argomento negativo non valido.
ja: 無効な負の引数です!
ko: 음의 인수가 잘못되었습니다.
pt_br: Argumento negativo inválido!
ru: Недопустимый отрицательный аргумент!
zh_hans: 无效的负参数！
zh_hant: 無效的負引數!

# Odbc_CantSetPropertyOnOpenConnection
source: Can't set property on an open connection.
de: Eigenschaft kann für eine offene Verbindung nicht festgelegt werden.
es: No se puede establecer la propiedad en una conexión abierta.
fr: Impossible de définir une propriété sur une connexion ouverte.
it: Impossibile impostare proprietà su una connessione aperta.
ja: プロパティは開いている接続には設定できません。
ko: 열려 있는 연결에는 속성을 설정할 수 없습니다.
pt_br: Não é possível definir propriedade em uma conexão aberta.
ru: Невозможно назначить свойство для открытого подключения.
zh_hans: 无法对打开的连接设置属性。
zh_hant: 無法在開啟的連接上設定屬性。

# Odbc_NoMappingForSqlTransactionLevel
source: No valid mapping for a SQL_TRANSACTION '{0}' to a System.Data.IsolationLevel enumeration value.
de: Keine gültige Zuordnung einer SQL_TRANSACTION '{0}' zu einem System.Data.IsolationLevel-Enumerationswert.
es: Asignación no válida de SQL_TRANSACTION '{0}' a un valor de enumeración System.Data.IsolationLevel.
fr: Aucun mappage valide d'une valeur SQL_TRANSACTION '{0}' vers une valeur d'énumération System.Data.IsolationLevel.
it: Nessun mapping valido per un SQL_TRANSACTION "{0}" a un valore di enumerazione System.Data.IsolationLevel.
ja: System.Data.IsolationLevel 列挙値への SQL_TRANSACTION '{0}' の有効なマップがありません。
ko: SQL_TRANSACTION '{0}'에서 System.Data.IsolationLevel 열거형 값으로의 올바른 매핑이 없습니다.
pt_br: Não há mapeamento válido para uma SQL_TRANSACTION '{0}' para um valor de enumeração System.Data.IsolationLevel.
ru: Отсутствует действительное сопоставление SQL_TRANSACTION "{0}" значению перечисления System.Data.IsolationLevel.
zh_hans: 没有 SQL_TRANSACTION“{0}”到 System.Data.IsolationLevel 枚举值的有效映射。
zh_hant: SQL_TRANSACTION '{0}' 對應至 System.Data.IsolationLevel 列舉值無效。

# Odbc_CantEnableConnectionpooling
source: {0} - unable to enable connection pooling...
de: {0} - Verbindungspooling kann nicht aktiviert werden...
es: {0}, no se puede habilitar la agrupación de conexiones...
fr: {0} - impossible d'activer le regroupement de connexions...
it: {0}. Impossibile attivare la creazione di un pool di connessioni.
ja: {0} - 接続プールを有効にすることができません...
ko: {0} - 연결 풀링을 사용할 수 없습니다.
pt_br: {0} - não é possível ativar pool de conexão...
ru: {0} - не удалось активировать использование пула подключений...
zh_hans: {0} - 无法启用连接池...
zh_hant: {0} - 無法啟用連接共用...

# Odbc_CantAllocateEnvironmentHandle
source: {0} - unable to allocate an environment handle.
de: {0} - Umgebungshandle konnte nicht zugewiesen werden.
es: {0}, no se puede asignar un identificador de entorno.
fr: {0} - impossible d'allouer un handle d'environnement.
it: {0}. Impossibile allocare l'handle di ambiente.
ja: {0} - 環境ハンドルを割り当てることができません。
ko: {0} - 환경 핸들을 할당할 수 없습니다.
pt_br: {0} - não é possível alocar um identificador de ambiente.
ru: {0} - не удалось выделить дескриптор среды.
zh_hans: {0} - 无法分配环境句柄。
zh_hant: {0} - 無法配置環境控制代碼。

# Odbc_FailedToGetDescriptorHandle
source: {0} - unable to get descriptor handle.
de: {0} - das Deskriptorhandle kann nicht abgerufen werden.
es: {0} - no se puede obtener un identificador de descriptor.
fr: {0} - impossible d'obtenir le handle du descripteur.
it: {0} - impossibile ottenere un handle descrittore.
ja: {0} - 記述子ハンドルを取得できません。
ko: {0} - 설명자 핸들을 가져올 수 없습니다.
pt_br: {0} - não é possível obter o identificador do descritor.
ru: {0} — не удалось получить дескриптор.
zh_hans: {0} – 无法获取说明符句柄。
zh_hant: {0} – 無法取得描述元控制。

# Odbc_NotInTransaction
source: Not in a transaction
de: Nicht in einer Transaktion
es: No en una transacción
fr: Ne se trouve pas dans une transaction
it: Non in una transazione.
ja: トランザクションにありません。
ko: 트랜잭션에 없습니다.
pt_br: Fora de uma transação
ru: Отсутствует в транзакции
zh_hans: 不在事务中
zh_hant: 不在交易之中

# Odbc_UnknownOdbcType
source: Invalid OdbcType enumeration value={0}.
de: Ungültiger OdbcType-Enumerationswert, value={0}.
es: Valor de enumeración OdbcType no válido={0}.
fr: Énumération OdbcType value={0} non valide.
it: Valore di enumerazione {0} non valido per OdbcType.
ja: OdbcType 列挙の value={0} は無効です。
ko: OdbcType 열거형 값={0}이(가) 잘못되었습니다.
pt_br: Valor de enumeração OdbcType inválido={0}.
ru: Недопустимое значение value={0} перечисления OdbcType.
zh_hans: OdbcType 枚举 value={0} 无效。
zh_hant: 無效的 OdbcType 列舉值={0}。

# Odbc_NullData
source: Use IsDBNull when DBNull.Value data is expected.
de: IsDBNull verwenden, wenn DBNull.Value-Daten erwartet werden.
es: Utilice IsDBNull cuando se espera DBNull.Value.
fr: Utilisez IsDBNull lorsque des données DBNull.Value sont attendues.
it: Utilizzare IsDBNull se si prevedono dati DBNull.Value.
ja: DBNull.Value データが渡される場合は、IsDBNull を使用してください。
ko: DBNull.Value 데이터가 필요한 경우 IsDBNull을 사용합니다.
pt_br: Use o IsDBNull quando os dados DBNull.Value forem esperados.
ru: Используйте IsDBNull, если ожидаются данные DBNull.Value.
zh_hans: 如果预期为 DBNull.Value 数据，请使用 IsDBNull。
zh_hant: 當必須要產生 DBNull.Value 資料時請使用 IsDBNull。

# Odbc_ExceptionNoInfoMsg
source: {0} - no error information available
de: {0} - Keine Fehlerinformationen verfügbar
es: {0}, información de error no disponible
fr: {0} - aucune information d'erreur disponible
it: {0}. Informazioni sull'errore non disponibili.
ja: {0} - エラー情報が使用できません。
ko: {0} - 오류 정보가 없습니다.
pt_br: {0} - nenhuma informação de erro disponível
ru: {0} - информация об ошибках недоступна
zh_hans: {0} - 没有可用的错误信息
zh_hant: {0} - 找不到可用的錯誤資訊

# Odbc_ConnectionClosed
source: The connection is closed.
de: Die Verbindung wurde geschlossen.
es: La conexión está cerrada.
fr: La connexion est fermée.
it: La connessione è chiusa.
ja: 接続が閉じています。
ko: 연결이 닫혀 있습니다.
pt_br: A conexão está fechada.
ru: Соединение закрыто.
zh_hans: 连接已关闭。
zh_hant: 連接已關閉。

# Odbc_OpenConnectionNoOwner
source: An internal connection does not have an owner.
de: Eine interne Verbindung hat keinen Besitzer.
es: Una conexión interna no tiene un propietario.
fr: Une connexion interne n'a pas un propriétaire.
it: Una connessione interna non dispone di un proprietario.
ja: 内部接続の所有者がありません。
ko: 내부 연결에 소유자가 없습니다.
pt_br: Uma conexão interna não tem um proprietário.
ru: Внутреннее соединение не имеет владельца.
zh_hans: 内部连接没有所有者。
zh_hant: 內部連接沒有擁有者。

# Odbc_MDACWrongVersion
source: The .NET Framework Odbc Data Provider requires Microsoft Data Access Components(MDAC) version 2.6 or later. Version {0} was found currently installed.
de: Der .NET Framework-ODBC-Datenanbieter benötigt Microsoft Data Access Components (MDAC) 2.6 oder höher. Aktuell ist Version {0} installiert.
es: El proveedor de datos Odbc de .NET Framework requiere tener instalada la versión 2.6 o posterior de Microsoft Data Access Components(MDAC). Actualmente tiene instalada la versión {0}.
fr: Le fournisseur de données .NET Framework ODBC nécessite MDAC (Microsoft Data Access Components) version 2.6 ou ultérieure. La version {0} est actuellement installée.
it: Il provider di dati .NET Framework Odbc richiede Microsoft Data Access Components (MDAC) versione 2.6 o successiva. Versione correntemente installata: {0}.
ja: .NET Framework Odbc データ プロバイダーには、Microsoft Data Access Components(MDAC) バージョン 2.6 以降が必要です。現在インストールされているバージョンは {0} です。
ko: .NET Framework Odbc Data Provider를 사용하려면 MDAC(Microsoft Data Access Components) 버전 2.6 이상이 필요합니다. 현재 버전 {0}이(가) 설치되어 있습니다.
pt_br: O Provedor de Dados .NET Framework para ODBC exige os MDAC (Microsoft Data Access Components) versão 2.6 ou posterior. A versão {0} foi encontrada instalada no momento.
ru: Поставщик данных .NET Framework для ODBC требует наличия компонентов доступа к данным MDAC как минимум версии 2.6. Найдена установленная версия {0}.
zh_hans: .NET Framework Odbc 数据提供程序需要 Microsoft 数据访问组件(MDAC)版本 2.6 或更高版本。当前已安装版本为 {0}。
zh_hant: .NET Framework Odbc 資料提供者需要 Microsoft Data Access Components(MDAC) 2.6 版或更新版本。目前發現已安裝版本 {0}。

# OleDb_MDACWrongVersion
source: The .NET Framework OleDb Data Provider requires Microsoft Data Access Components(MDAC) version 2.6 or later. Version {0} was found currently installed.
de: Der .NET Framework-OLEDB-Datenanbieter benötigt Microsoft Data Access Components (MDAC) 2.6 oder höher. Aktuell ist Version {0} installiert.
es: El proveedor de datos OleDb de .NET Framework requiere tener instalada la versión 2.6 o posterior de Microsoft Data Access Components(MDAC). Actualmente tiene instalada la versión {0}.
fr: Le fournisseur de données .NET Framework OLEDB nécessite MDAC (Microsoft Data Access Components) version 2.6 ou ultérieure. La version {0} est actuellement installée.
it: Il provider di dati .NET Framework OleDb richiede Microsoft Data Access Components (MDAC) versione 2.6 o successiva. Versione correntemente installata: {0}.
ja: .NET Framework OleDb データ プロバイダーには Microsoft Data Access Components(MDAC) バージョン 2.6 以降が必要です。現在インストールされているバージョンは {0} です。
ko: .NET Framework OleDb Data Provider를 사용하려면 MDAC(Microsoft Data Access Components) 버전 2.6 이상이 필요합니다. 현재 버전 {0}이(가) 설치되어 있습니다.
pt_br: O Provedor de Dados .NET Framework para OLEDB exige os MDAC (Microsoft Data Access Components) versão 2.6 ou posterior. A versão {0} foi encontrada instalada no momento.
ru: Поставщик данных .NET Framework для OLE DB требует наличия компонентов доступа к данным MDAC как минимум версии 2.6. Найдена установленная версия {0}.
zh_hans: .NET Framework OleDb 数据提供程序需要 Microsoft 数据访问组件(MDAC)版本 2.6 或更高版本。当前已安装版本为 {0}。
zh_hant: .NET Framework OleDb Data Provider 需要 Microsoft Data Access Components(MDAC) 2.6 版或更新版本。目前發現已安裝版本 {0}。

# OleDb_SchemaRowsetsNotSupported
source: '{0}' interface is not supported by the '{1}' provider. GetOleDbSchemaTable is unavailable with the current provider.
de: Die Schnittstelle '{0}' wird nicht vom '{1}'-Provider unterstützt. GetOleDbSchemaTable ist mit dem aktuellen Provider nicht verfügbar.
es: El proveedor '{1}' no admite la interfaz '{0}'. GetOleDbSchemaTable no está disponible con el proveedor actual.
fr: L'interface '{0}' n'est pas prise en charge par le fournisseur '{1}'. GetOleDbSchemaTable n'est pas disponible avec le fournisseur actuel.
it: Il provider "{1}" non supporta l'interfaccia "{0}". GetOleDbSchemaTable non è disponibile con il provider corrente.
ja: '{0}' インターフェイスは、'{1}' プロバイダーではサポートしていません。GetOleDbSchemaTable を現在のプロバイダーで使用することはできません。
ko: '{0}' 인터페이스는 '{1}' 공급자에서 지원되지 않습니다. GetOleDbSchemaTable은 현재 공급자에서 사용할 수 없습니다.
pt_br: O provedor '{1}' não dá suporte para a interface '{0}'. GetOleDbSchemaTable não está disponível no provedor atual.
ru: Интерфейс "{0}" не поддерживается поставщиком "{1}". GetOleDbSchemaTable недоступен в составе текущего поставщика.
zh_hans: “{1}”提供程序不支持“{0}”接口。GetOleDbSchemaTable 不可用于当前提供程序。
zh_hant: '{1}' 提供者不支援 '{0}' 介面。目前的提供者無法使用 GetOleDbSchemaTable。

# OleDb_NoErrorInformation2
source: '{0}' failed with no error message available, result code: {1}.
de: '{0}' ist ohne Fehlermeldung fehlgeschlagen, Ergebniscode: {1}.
es: Fallo de '{0}' con mensaje de error no disponible, código de resultado: {1}.
fr: Échec de'{0}' sans aucun message d'erreur disponible, code de résultat : {1}.
it: '{0}' fallito senza alcun messaggio di errore disponibile, codice risultato: {1}.
ja: '{0}' は失敗しましたが、エラー メッセージはありません。結果コードは {1} です。
ko: 오류 메시지 없이 '{0}'이(가) 실패했습니다(결과 코드: {1}).
pt_br: '{0}' falhou sem nenhuma mensagem de erro disponível. Código do resultado: {1}.
ru: Сбой "{0}" без сообщения об ошибке, код результата: {1}.
zh_hans: “{0}”失败，没有可用的错误消息，结果代码: {1}。
zh_hant: '{0}' 失敗，沒有錯誤訊息，編碼: {1}。

# OleDb_NoErrorInformation
source: No error message available, result code: {0}.
de: Keine Fehlermeldung verfügbar, Fehlercode: {0}.
es: Mensaje de error no disponible, código de resultado: {0}.
fr: Aucune message d'erreur disponible, code de résultat : {0}.
it: Nessun messaggio di errore disponibile, codice risultato: {0}.
ja: エラー メッセージはありません。結果コードは {0} です。
ko: 오류 정보가 없습니다. 결과 코드: {0}
pt_br: Nenhuma mensagem de erro disponível, código de resultado: {0}.
ru: Сообщение об ошибке не предусмотрено, код результата: {0}.
zh_hans: 没有可用的错误消息，结果代码: {0}。
zh_hant: 沒有錯誤訊息，編碼: {0}。

# OleDb_MDACNotAvailable
source: The .NET Framework Data Providers require Microsoft Data Access Components(MDAC). Please install Microsoft Data Access Components(MDAC) version 2.6 or later.
de: Der .NET Framework-Datenanbieter benötigt Microsoft Data Access Components (MDAC). Installieren Sie MDAC 2.6 oder höher.
es: Los proveedores de datos .NET Framework requieren la instalación de Microsoft Data Access Components (MDAC). Instale la version 2.6 o posterior de Microsoft Data Access Components (MDAC).
fr: Les fournisseurs de données .NET Framework nécessitent MDAC (Microsoft Data Access Components). Installez MDAC version 2.6 ou ultérieure.
it: I provider di dati .NET Framework richiedono Microsoft Data Access Components (MDAC). Installare Microsoft Data Access Components (MDAC) versione 2.6 o successiva.
ja: .NET Framework データ プロバイダーには Microsoft Data Access Components(MDAC) が必要です。Microsoft Data Access Components(MDAC) バージョン 2.6 以降をインストールしてください。
ko: .NET Framework 데이터 공급자를 사용하려면 MDAC(Microsoft Data Access Components)가 필요합니다. MDAC(Microsoft Data Access Components) 버전 2.6 이상을 설치하세요.
pt_br: Os Provedores de Dados .NET Framework exigem os MDAC (Microsoft Data Access Components). Instale os MDAC (Microsoft Data Access Components) versão 2.6 ou posterior.
ru: Поставщики данных .NET Framework требуют наличия компонентов доступа к данным MDAC. Установите эти компоненты как минимум версии 2.6.
zh_hans: .NET Framework 数据提供程序需要 Microsoft 数据访问组件(MDAC)。请安装 Microsoft 数据访问组件(MDAC)版本 2.6 或更高版本。
zh_hant: .NET Framework Data Providers 需要 Microsoft Data Access Components(MDAC)。請安裝 Microsoft Data Access Components(MDAC) 2.6 版或更新版本。

# OleDb_MSDASQLNotSupported
source: The .NET Framework Data Provider for OLEDB (Microsoft.Data.OleDb) does not support the Microsoft OLE DB Provider for ODBC Drivers (MSDASQL). Use the .NET Framework Data Provider for ODBC (System.Data.Odbc).
de: Der .NET Framework-Datenanbieter für OLEDB (Microsoft.Data.OleDb) bietet keine Unterstützung für den Microsoft OLE DB-Anbieter für ODBC-Treiber (MSDASQL). Verwenden Sie den .NET Framework-Datenanbieter für ODBC (System.Data.Odbc).
es: El proveedor de datos .NET Framework para OLEDB (Microsoft.Data.OleDb) no admite el proveedor OLE DB de Microsoft para controladores ODBC (MSDASQL). Use el proveedor de datos .NET Framework para ODBC (System.Data.Odbc).
fr: Le fournisseur de données .NET Framework pour OLEDB (Microsoft.Data.OleDb) ne prend pas en charge le fournisseur Microsoft OLE DB pour les pilotes ODBC (MSDASQL). Utilisez le fournisseur de données .NET Framework pour ODBC (System.Data.Odbc).
it: Il provider di dati .NET Framework per OLEDB (Microsoft.Data.OleDb) non supporta il provider Microsoft OLE DB per driver ODBC (MSDASQL). Usare il provider di dati .NET Framework per ODBC (System.Data.Odbc).
ja: .NET Framework Data Provider for OLEDB (Microsoft.Data.OleDb) では、Microsoft OLE DB Provider for ODBC Drivers (MSDASQL) がサポートされていません。.NET Framework Data Provider for ODBC (System.Data.Odbc) を使用してください。
ko: .NET Framework Data Provider for OLEDB(Microsoft.Data.OleDb)는 MSDASQL(Microsoft OLE DB Provider for ODBC Drivers)을 지원하지 않습니다. .NET Framework Data Provider for ODBC(System.Data.Odbc)를 사용하세요.
pt_br: O Provedor de Dados .NET Framework para OLEDB (Microsoft.Data.OleDb) não dá suporte ao MSDASQL (Provedor OLE DB da Microsoft para Drivers ODBC). Use o Provedor de Dados .NET Framework para ODBC (System.Data.Odbc).
ru: Поставщик данных .NET Framework для OLE DB (Microsoft.Data.OleDb) не поддерживает поставщик Microsoft OLE DB для драйверов ODBC (MSDASQL). Используйте поставщик данных .NET Framework для ODBC (System.Data.Odbc).
zh_hans: 用于 OLEDB 的 .NET Framework 数据提供程序(Microsoft.Data.OleDb)不支持用于 ODBC 驱动程序的 Microsoft OLE DB 提供程序(MSDASQL)。请使用用于 ODBC 的 .Net Framework 数据提供程序(System.Data.Odbc)。
zh_hant: .NET Framework Data Provider for OLEDB (System.Data.OleDb) 不支援 Microsoft OLE DB Provider for ODBC Drivers (MSDASQL)。請使用 .NET Framework Data Provider for ODBC (System.Data.Odbc)。

# OleDb_PossiblePromptNotUserInteractive
source: The .NET Framework Data Provider for OLEDB will not allow the OLE DB Provider to prompt the user in a non-interactive environment.
de: Der .NET Framework-Datenanbieter für OLEDB lässt eine Benutzeraufforderung durch den OLE DB-Anbieter in einer nicht interaktiven Umgebung nicht zu.
es: El proveedor de datos .NET Framework para OLEDB no permitirá que el proveedor de OLE DB pregunte al usuario en un entorno no interactivo.
fr: Le fournisseur de données .NET Framework pour OLEDB n'autorisera pas le fournisseur OLE DB à afficher des invites utilisateur dans un environnement non interactif.
it: Il provider di dati .NET Framework per OLEDB non consente al provider OLE DB di chiedere all'utente di specificare un valore in un ambiente non interattivo.
ja: .NET Framework Data Provider for OLEDB では、非インタラクティブな環境にある場合、OLE DB プロバイダーがユーザーにメッセージを表示することを許可していません。
ko: .NET Framework Data Provider for OLEDB는 대화형이 아닌 환경에서 OLE DB 공급자가 사용자에게 확인하는 작업을 허용하지 않습니다.
pt_br: O Provedor de Dados .NET Framework para OLEDB não permitirá que o Provedor OLE DB faça solicitações ao usuário em um ambiente não interativo.
ru: Поставщик данных .NET Framework для OLE DB не позволит поставщику OLE DB отправлять пользователю запросы в неинтерактивной среде.
zh_hans: 用于 OLEDB 的 .NET Framework 数据提供程序禁止 OLE DB 提供程序在非交互式环境中提示用户。
zh_hant: .NET Framework Data Provider for OLEDB 不允許 OLE DB Provider 在非互動式環境中提示使用者。

# OleDb_ProviderUnavailable
source: The '{0}' provider is not registered on the local machine.
de: Der '{0}'-Provider ist nicht auf dem lokalen Computer registriert.
es: El proveedor '{0}' no está registrado en el equipo local.
fr: Le fournisseur '{0}' n'est pas inscrit sur l'ordinateur local.
it: Il provider '{0}' non è registrato nel computer locale.
ja: '{0}' プロバイダーはローカルのコンピューターに登録されていません。
ko: '{0}' 공급자는 로컬 컴퓨터에 등록할 수 없습니다.
pt_br: O provedor '{0}' não está registrado na máquina local.
ru: Поставщик "{0}" не зарегистрирован на локальном компьютере.
zh_hans: 未在本地计算机上注册“{0}”提供程序。
zh_hant: '{0}' 提供者並未登錄於本機電腦上。

# OleDb_CommandTextNotSupported
source: The ICommandText interface is not supported by the '{0}' provider. Use CommandType.TableDirect instead.
de: Die ICommandText-Schnittstellen wird vom '{0}'-Provider nicht unterstützt. Verwenden Sie stattdessen CommandType.TableDirect.
es: El proveedor '{0}' no admite la interfaz ICommandText. Utilice CommandType.TableDirect en su lugar.
fr: L'interface ICommandText n'est pas prise en charge par le fournisseur '{0}'. Utilisez CommandType.TableDirect à la place.
it: L'interfaccia ICommandText non è supportata dal provider '{0}'. Utilizzare CommandType.TableDirect.
ja: ICommandText インターフェイスは '{0}' プロバイダーによってサポートされていません。代わりに、CommandType.TableDirect 使用してください。
ko: ICommandText 인터페이스는 '{0}' 공급자에서 지원되지 않습니다. 대신 CommandType.TableDirect를 사용하십시오.
pt_br: O provedor '{0}' não dá suporte para a interface ICommandText. Em seu lugar, use CommandType.TableDirect.
ru: Интерфейс ICommandText не поддерживается поставщиком "{0}". Используйте CommandType.TableDirect.
zh_hans: “{0}”提供程序不支持 ICommandText 接口。请改用 CommandType.TableDirect。
zh_hant: '{0}' 提供者不支援使用 ICommandText 介面。請改用 CommandType.TableDirect。
