Repository: v-kaywon/SqlClient
Catalog: src/Microsoft.Data.SqlClient/netfx/src/Resources/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# ADP_Ascending
source: Ascending
de: Aufsteigend
es: Ascendente
fr: Croissant
it: Crescente
ja: 昇順
ko: 오름차순
pt_br: Crescente
ru: По возрастанию
zh_hans: 升序
zh_hant: 遞增

# ADP_CollectionIndexInt32
source: Invalid index {0} for this {1} with Count={2}.
de: Ungültiger Index {0} für {1} mit Count={2}.
es: Índice {0} no válido para {1} con Count={2}.
fr: Index {0} non valide pour ce {1} avec Count={2}.
it: Indice {0} non valido per {1} con Count={2}.
ja: Count={2} を持つこの {1} のインデックス {0} は無効です。
ko: Count={2}인 이 {1}에 대한 {0} 인덱스가 잘못되었습니다.
pt_br: Índice {0} inválido para esse {1} com Count={2}.
ru: Недопустимый индекс {0} для этого {1} с Count={2}.
zh_hans: 此 {1} 的 Count={2} 的索引 {0} 无效。
zh_hant: 此具有 Count={2} 的 {1} 有無效的索引 {0}。

# ADP_CollectionIndexString
source: An {0} with {1} '{2}' is not contained by this {3}.
de: {0} mit {1} '{2}' ist nicht in {3} enthalten.
es: {3} no contiene {0} con {1} '{2}'.
fr: Un {0} avec {1} '{2}' n'est pas contenu dans ce {3}.
it: {3} non contiene {0} con {1} '{2}'.
ja: {1} '{2}' を持つ {0} は、この {3} に含まれていません。
ko: {1}이(가) '{2}'인 {0}이(가) 이 {3}에 들어 있지 않습니다.
pt_br: {3} não contém {0} com {1} '{2}'.
ru: {0} с {1} "{2}" не содержится в данном {3}.
zh_hans: 此 {3} 中未包含带有 {1}“{2}”的 {0}。
zh_hant: 此 {3} 沒有包含具有 {0} 的 {1} '{2}'。

# ADP_CollectionInvalidType
source: The {0} only accepts non-null {1} type objects, not {2} objects.
de: {0} akzeptiert nur Nicht-Null {1}-Typenobjekte, nicht {2}-Objekte.
es: {0} sólo acepta objetos de tipo no nulo {1}, no objetos {2}.
fr: {0} accepte uniquement des objets de type {1} non null, et non des objets {2}.
it: {0} accetta solo oggetti di tipo {1} non null, non oggetti {2}.
ja: {0} は、{2} オブジェクトではなく、Null でない {1} 型オブジェクトのみ受け入れます。
ko: {0}은(는) Null이 아닌 {1} 형식 개체만 허용하고 {2} 개체는 허용하지 않습니다.
pt_br: {0} só aceita objetos do tipo {1} não nulo, não aceita objetos {2}.
ru: Для {0} могут задаваться только объекты типа {1}, имеющие определенные значения, но не объекты {2}.
zh_hans: {0} 只接受非空的 {1} 类型对象，不接受 {2} 对象。
zh_hant: {0} 只接受非 Null 的 {1} 型別物件，不接受 {2} 物件。

# ADP_CollectionIsNotParent
source: The {0} is already contained by another {1}.
de: {0} ist bereits in einem/einer anderen {1} enthalten.
es: Otro {1} ya contiene {0}.
fr: L'élément {0} est déjà contenu dans un autre {1}.
it: {0} è già contenuto in un altro {1}.
ja: {0} は、既に別の {1} に含まれています。
ko: {0}이(가) 이미 다른 {1}에 들어 있습니다.
pt_br: Outro {1} já contém {0}.
ru: {0} уже содержится в другом {1}.
zh_hans: 另一个 {1} 中已包含 {0}。
zh_hant: 另一個 {1} 已經包含 {0}。

# ADP_CollectionIsParent
source: The {0} with is already contained by this {1}.
de: {0} ist bereits in diesem/dieser {1} enthalten.
es: {0} con ya contenido por {1}.
fr: L'élément {0} est déjà contenu dans ce {1}.
it: {0} è già contenuto in questo {1}.
ja: {0} は、既にこの {1} に含まれています。
ko: {0}이(가) 이미 해당 {1}에 들어 있습니다.
pt_br: Este {1} já contém {0}.
ru: {0} уже содержится в этом {1}.
zh_hans: 此 {1} 中已包含 {0}。
zh_hant: 此 {1} 已經包含 {0}。

# ADP_CollectionNullValue
source: The {0} only accepts non-null {1} type objects.
de: {0} akzeptiert nur nicht-Null {1}-Typenobjekte.
es: {0} sólo acepta objetos de tipo no null {1}.
fr: {0} accepte uniquement des objets de type {1} non null.
it: {0} accetta solo oggetti di tipo {1} non null.
ja: {0} は Null でない {1} 型オブジェクトのみ受け入れます。
ko: {0}은(는) Null이 아닌 {1} 형식 개체만 허용합니다.
pt_br: {0} só aceita objetos do tipo {1} não nulo.
ru: Для {0} могут задаваться только объекты типа {1} с определенными значениями.
zh_hans: {0} 只接受非空的 {1} 类型对象。
zh_hant: {0} 只接受非 Null 的 {1} 型別物件。

# ADP_CollectionRemoveInvalidObject
source: Attempted to remove an {0} that is not contained by this {1}.
de: Es wurde versucht, ein {0} zu entfernen, das nicht in {1} enthalten ist.
es: Intentó quitar {0} que no está contenido por {1}.
fr: Tentative de suppression d'un {0} qui n'est pas contenu dans ce {1}.
it: Tentativo di rimuovere un {0} non contenuto in {1}.
ja: この {1} に含まれない {0} を削除しようとしました。
ko: 이 {1}에 들어 있지 않은 {0}을(를) 제거하려 했습니다.
pt_br: Tentativa de remoção de {0} que não estava contido em {1}.
ru: Попытка удалить {0}, который не содержится в этом {1}.
zh_hans: 试图移除此 {1} 不包含的 {0}。
zh_hant: 此 {1} 嘗試移除不包含的 {0}。

# ADP_CollectionUniqueValue
source: The {0}.{1} is required to be unique, '{2}' already exists in the collection.
de: {0}.{1} muss eindeutig sein. '{2}' ist in der Sammlung bereits vorhanden.
es: {0}.{1} debe ser único, '{2}' ya existe en la colección.
fr: {0}.{1} doit être unique, '{2}' existe déjà dans la collection.
it: {0}.{1} deve essere unico, '{2}' esiste già nella raccolta.
ja: {0}.{1} は一意でなければなりません。'{2}' は既にコレクションに存在します。
ko: {0}.{1}은(는) 고유해야 하는데 '{2}'이(가) 컬렉션에 이미 있습니다.
pt_br: {0}.{1} deve ser exclusivo, '{2}' já existe na coleção.
ru: {0}.{1} должен быть уникальным, "{2}" уже имеется в этой коллекции.
zh_hans: {0}.{1} 必须是唯一的，“{2}”在集合中已存在。
zh_hant: {0}.{1} 必須是唯一的，'{2}' 以存在於集合中。

# ADP_ConnectionAlreadyOpen
source: The connection was not closed. {0}
de: Die Verbindung wurde nicht geschlossen. {0}
es: La conexión no se cerró. {0}
fr: La connexion n'est pas fermée. {0}
it: La connessione non è stata chiusa. {0}
ja: 接続が閉じられていません。{0}。
ko: 연결이 닫혀 있지 않습니다. {0}
pt_br: A conexão não foi fechada. {0}
ru: Подключение не было закрыто. {0}
zh_hans: 连接未关闭。 {0}
zh_hant: 連接未關閉。{0}

# ADP_ConnectionStateMsg_Closed
source: The connection's current state is closed.
de: Der aktuelle Status der Verbindung ist 'Geschlossen'.
es: El estado actual de la conexión es cerrada.
fr: La connexion est actuellement fermée.
it: Lo stato attuale della connessione è chiuso.
ja: 現在の接続の状態は '終了" です。
ko: 현재 연결은 닫힌 상태입니다.
pt_br: O estado atual da conexão é fechada.
ru: Подключение закрыто.
zh_hans: 连接的当前状态为已关闭。
zh_hant: 連接目前的狀態已關閉。

# ADP_ConnectionStateMsg_Connecting
source: The connection's current state is connecting.
de: Der aktuelle Status der Verbindung ist 'Verbindung wird hergestellt'.
es: El estado actual de la conexión es conectando.
fr: L'état actuel de la connexion est en cours de connexion.
it: Lo stato attuale della connessione è connessione in corso.
ja: 現在の接続の状態は '接続中" です。
ko: 현재 연결은 연결 중인 상태입니다.
pt_br: O estado atual da conexão é conectando.
ru: Подключение устанавливается.
zh_hans: 连接的当前状态为正在连接。
zh_hant: 連接目前的狀態為連接中。

# ADP_ConnectionStateMsg_Open
source: The connection's current state is open.
de: Der aktuelle Status der Verbindung ist 'Geöffnet'.
es: El estado actual de la conexión es abierta.
fr: L'état actuel de la connexion est ouvert.
it: Lo stato attuale della connessione è aperto.
ja: 現在の接続の状態は 'オープン" です。
ko: 현재 연결은 열린 상태입니다.
pt_br: O estado atual da conexão é aberta.
ru: Подключение открыто.
zh_hans: 连接的当前状态为打开。
zh_hant: 連接目前的狀態為開啟。

# ADP_ConnectionStateMsg_OpenExecuting
source: The connection's current state is executing.
de: Der aktuelle Status der Verbindung ist 'Wird ausgeführt'.
es: El estado actual de la conexión es ejecutando.
fr: L'état actuel de la connexion est en cours d'exécution.
it: Lo stato attuale della connessione è esecuzione in corso.
ja: 現在の接続の状態は '実行中" です。
ko: 현재 연결은 실행 중인 상태입니다.
pt_br: O estado atual da conexão é executando.
ru: Подключение выполняется.
zh_hans: 连接的当前状态为正在执行。
zh_hant: 連接目前的狀態為執行中。

# ADP_ConnectionStateMsg_OpenFetching
source: The connection's current state is fetching.
de: Der aktuelle Status der Verbindung ist 'Abruf läuft'.
es: El estado actual de la conexión es obteniendo.
fr: L'état actuel de la connexion est en cours d'extraction.
it: Lo stato attuale della connessione è recupero in corso.
ja: 現在の接続の状態は 'フェッチ中" です。
ko: 현재 연결은 인출 중인 상태입니다.
pt_br: O estado atual da conexão é buscando.
ru: Подключение вызывается.
zh_hans: 连接的当前状态为正在获取。
zh_hant: 連接目前的狀態為擷取中。

# ADP_ConnectionStateMsg
source: The connection's current state: {0}.
de: Der aktuelle Status der Verbindung: {0}.
es: Estado actual de la conexión: {0}.
fr: État actuel de la connexion : {0}.
it: Lo stato attuale della connessione è: {0}.
ja: 接続の現在の状態は {0} です。
ko: 현재 연결 상태: {0}.
pt_br: O estado atual da conexão: {0}.
ru: Текущее состояние подключения: {0}.
zh_hans: 连接的当前状态: {0}。
zh_hant: 連接目前的狀態: {0}。

# ADP_ConnectionStringSyntax
source: Format of the initialization string does not conform to specification starting at index {0}.
de: Das Format der Initialisierungszeichenfolge stimmt nicht mit der Spezifikation überein, die bei Index '{0}' beginnt.
es: El formato de la cadena de inicialización no se ajusta a la especificación que comienza en el índice {0}.
fr: Le format de la chaîne d'initialisation n'est pas conforme à la spécification qui débute à l'index {0}.
it: Il formato della stringa di inizializzazione non è conforme alla specifica che inizia dall'indice {0}.
ja: 初期化文字列の形式が使用に適合しません。index {0} で始まっています。
ko: 초기화 문자열의 형식이 인덱스 {0}에서 시작하는 사양에 맞지 않습니다.
pt_br: O formato da cadeia de inicialização não está de acordo com a especificação iniciada no índice {0}.
ru: Формат строки инициализации не соответствует спецификации, начиная с индекса {0}.
zh_hans: 从索引 {0} 处开始，初始化字符串的格式不符合规范。
zh_hant: 初始化字串的格式從索引 {0} 處開始即與規格不符。

# ADP_DataReaderClosed
source: Invalid attempt to call {0} when reader is closed.
de: Ungültiger Versuch, {0} aufzurufen, da der Datenleser bereits geschlossen wurde.
es: Intento no válido de llamar a {0} cuando el lector está cerrado.
fr: Tentative d'appel de {0} non valide lorsque le lecteur est fermé.
it: Tentativo non valido di chiamare {0} con reader chiuso.
ja: リーダーが閉じている場合は、{0} の呼び出しは無効です。
ko: 판독기가 닫혀 있으면 {0}을(를) 호출할 수 없습니다.
pt_br: Tentativa inválida de chamar {0} quando o leitor estava fechado.
ru: Недопустимая попытка вызвать {0} при закрытом устройстве чтения.
zh_hans: 阅读器关闭时尝试调用 {0} 无效。
zh_hant: 當讀取器關閉時嘗試呼叫 {0} 無效。

# ADP_DelegatedTransactionPresent
source: Cannot enlist in the transaction because the connection is the primary connection for a delegated or promoted transaction.
de: Eine Eintragung in die Transaktion ist nicht möglich, da die Verbindung die primäre Verbindung für eine delegierte oder heraufgestufte Transaktion ist.
es: No se puede dar de alta en la transacción porque la conexión es la conexión principal de una transacción delegada o promovida.
fr: Inscription dans la transaction impossible car la connexion est la connexion principale d'une transaction déléguée ou promue.
it: Impossibile inserire nella transazione, perché la connessione è la connessione primaria per una transazione delegata o promossa.
ja: 接続が委任されたトランザクションまたは昇格されたトランザクションのプライマリ接続であるため、トランザクションに参加できません。
ko: 연결이 위임된 트랜잭션이나 확장된 트랜잭션에 대한 기본 연결이므로 트랜잭션에 참여할 수 없습니다.
pt_br: Não é possível se inscrever na transação porque a conexão é a conexão primária para uma transação delegada ou promovida.
ru: Невозможно включить в транзакцию, поскольку это главное подключение для делегированной или активизированной транзакции.
zh_hans: 无法登记在事务中，因为该连接是委派事务或提升事务的主要连接。
zh_hant: 無法編列至交易，因為連接已優先用於委派或提示交易。

# ADP_Descending
source: Descending
de: Absteigend
es: Descendente
fr: Décroissant
it: Decrescente
ja: 降順
ko: 내림차순
pt_br: Decrescente
ru: По убыванию
zh_hans: 降序
zh_hant: 遞減

# ADP_EmptyString
source: Expecting non-empty string for '{0}' parameter.
de: Für den Parameter '{0}' wird eine nicht leere Zeichenfolge erwartet.
es: Se esperaba una cadena no vacía para el parámetro '{0}'.
fr: Chaîne non vide attendue pour le paramètre '{0}'.
it: Prevista stringa non vuota per il parametro "{0}".
ja: '{0}' パラメーターには空でない文字列が必要です。
ko: '{0}' 매개 변수에 대한 문자열은 비어 있지 않아야 합니다.
pt_br: Esperando cadeia de caracteres não vazia para parâmetro '{0}'.
ru: Для параметра "{0}" ожидается непустая строка.
zh_hans: 应为“{0}”参数的非空字符串。
zh_hant: '{0}' 參數必須是非空字串。

# ADP_InternalConnectionError
source: Internal DbConnection Error: {0}
de: Interner DbConnection-Fehler: {0}
es: Error interno de DbConnection: {0}
fr: Erreur de DbConnection interne : {0}
it: Errore interno DbConnection: {0}
ja: 内部 DbConnection エラー : {0}
ko: 내부 DbConnection 오류: {0}
pt_br: Erro interno de DbConnection: {0}
ru: Внутренняя ошибка DbConnection: {0}
zh_hans: 内部 DbConnection 错误: {0}
zh_hant: 內部 DbConnection 錯誤: {0}

# ADP_InvalidDataDirectory
source: The DataDirectory substitute is not a string.
de: Die DataDirectory-Ersetzung ist keine Zeichenfolge.
es: El sustituto de DataDirectory no es una cadena.
fr: Le paramètre de substitution DataDirectory n'est pas une chaîne.
it: Il sostituto DataDirectory non è una stringa.
ja: DataDirectory の代入値が文字列ではありません。
ko: DataDirectory 대체 값이 문자열이 아닙니다.
pt_br: O substituto de DataDirectory não é uma cadeia de caracteres.
ru: Замена DataDirectory не является строкой.
zh_hans: DataDirectory 替换项不是字符串。
zh_hant: DataDirectory 替代項目不是字串。

# ADP_InvalidEnumerationValue
source: The {0} enumeration value, {1}, is invalid.
de: Der Enumerationswert von {0}, {1}, ist ungültig.
es: El valor {0} de enumeración, {1}, no es válido.
fr: La valeur d'énumération de {0}, {1}, n'est pas valide.
it: Il valore di enumerazione di {0}, {1}, non è valido.
ja: {0} 列挙値 {1} は無効です。
ko: {0} 열거 값 {1}이(가) 잘못되었습니다.
pt_br: O valor de enumeração {0}, {1}, é inválido.
ru: Недопустимое значение {1} перечисления {0}.
zh_hans: {0} 枚举值 {1} 无效。
zh_hant: {0} 列舉值 {1} 無效。

# ADP_InvalidKey
source: Invalid keyword, contain one or more of 'no characters', 'control characters', 'leading or trailing whitespace' or 'leading semicolons'.
de: Ungültiges Schlüsselwort. Enthält mindestens ein Zeichen des Typs 'Keine Zeichen', 'Steuerzeichen', 'Führendes oder nachfolgendes Leerzeichen' oder 'Führende Semikolons'.
es: Palabra clave no válida, contiene uno o más 'no characters', 'control characters', 'leading or trailing whitespace' o 'leading semicolons'.
fr: Mot clé non valide contenant soit aucun caractère, soit des caractères de contrôle, des espaces blancs de début ou de fin ou des points-virgules de début.
it: La parola chiave non è valida. Contiene uno o più 'caratteri di controllo', 'spazi iniziali o finali', 'punti e virgola iniziali' oppure 'nessun carattere'.
ja: キーワードが無効です。'no characters'、'control characters'、'leading or trailing whitespace'、'leading semicolons' のいずれかが 1 つ以上使用されています。
ko: 키워드가 잘못되었습니다. '문자 없음', '제어 문자', '선행/후행 공백' 또는 '선행 세미콜론' 중 하나 이상 있어야 합니다.
pt_br: Palavra-chave inválida: contém um ou mais 'caracteres não permitidos', 'caracteres de controle', 'espaço anterior ou posterior' ou 'ponto-e-vírgula anterior'.
ru: Недействительное ключевое слово, содержит "недопустимые знаки, "управляющие знаки, "открывающий или завершающий пробел" либо "открывающие точки с запятой".
zh_hans: 无效的关键字，包含“no characters”、“control characters”、“leading or trailing whitespace”或“leading semicolons”中的一个或多个。
zh_hant: 無效的關鍵字，包含一或多個「無字元」、「控制字元」、「前端或後端的空白」或「前端的分號」。

# ADP_InvalidOffsetValue
source: Invalid parameter Offset value '{0}'. The value must be greater than or equal to 0.
de: Ungültiger Offset-Parameterwert '{0}'. Der Wert muss größer oder gleich 0 sein.
es: Valor '{0}' del parámetro de desplazamiento no válido. El valor debe ser mayor o igual a 0.
fr: Valeur Offset du paramètre '{0}' non valide. Cette valeur doit être supérieure ou égale à 0.
it: Valore "{0}" del parametro Offset non valido. Il valore deve essere maggiore o uguale a zero.
ja: パラメーター Offset 値 '{0}' が無効です。値は 0 に等しいか、またはそれより大きくなければなりません。
ko: 매개 변수 Offset 값 '{0}'이(가) 잘못되었습니다. 이 값은 0보다 크거나 같아야 합니다.
pt_br: Valor Offset inválido do parâmetro '{0}'. O valor deve ser maior ou igual a 0.
ru: Недопустимое значение параметра Offset "{0}". Значение должно быть больше или равно нулю.
zh_hans: 参数偏移量值“{0}”无效。该值必须大于或等于 0。
zh_hant: 無效的參數 Offset 值 '{0}'。值必須大於或等於 0。

# ADP_InvalidValue
source: The value contains embedded nulls (\u0000).
de: Der Wert enthält eingebettete Nullen (\u0000).
es: El valor contiene elementos nulos incrustados (\u0000).
fr: La valeur contient des zéros incorporés (\u0000).
it: Il valore contiene valori null incorporati (\u0000).
ja: 埋め込まれた Null (\u0000) が値に含まれています。
ko: 값에 포함된 Null(\u0000)이 있습니다.
pt_br: O valor contém nulos inseridos (\u0000).
ru: Значение содержит внедренные нули (\u0000).
zh_hans: 值包含内嵌的 Null 值(\u0000)。
zh_hant: 值包含內嵌的空值 (\u0000)。

# ADP_InvalidXMLBadVersion
source: Invalid Xml; can only parse elements of version one.
de: Ungültiges Xml. Es können nur Elemente der Version Eins verarbeitet werden.
es: Xml no válido; sólo puede analizar los elementos de la primera versión.
fr: Xml non valide ; ne peut analyser que des éléments de la version un.
it: Xml non valido. È possibile analizzare solo gli elementi della versione 1.
ja: Xml が無効です。解析できるのはバージョン 1 の要素のみです。
ko: Xml이 잘못되었습니다. 버전 1의 요소만 구문 분석할 수 있습니다.
pt_br: Xml inválido; só é possível analisar elementos da primeira versão.
ru: Недопустимый Xml. Разбор возможен только для элементов версии 1.
zh_hans: 无效的 Xml；只能分析版本 1 的元素。
zh_hant: 無效的 Xml。只可以剖析版本 1 的元素。

# ADP_NoConnectionString
source: The ConnectionString property has not been initialized.
de: Die ConnectionString-Eigenschaft wurde nicht initialisiert.
es: No se ha inicializado la propiedad ConnectionString.
fr: La propriété ConnectionString n'a pas été initialisée.
it: La proprietà ConnectionString non è stata inizializzata.
ja: ConnectionString プロパティが初期化されていません。
ko: ConnectionString 속성이 초기화되지 않았습니다.
pt_br: A propriedade ConnectionString não foi inicializada.
ru: Свойство ConnectionString не инициализировано.
zh_hans: ConnectionString 属性尚未初始化。
zh_hant: 尚未初始化 ConnectionString 屬性。

# ADP_NonCLSException
source: A Non CLS Exception was caught.
de: Eine Nicht-CLS-Exception ist aufgetreten.
es: Se detectó una Exception no conforme a CLS.
fr: Exception non-CLS interceptée.
it: È stata rilevata Exception non CLS.
ja: 非 CLS Exception が発生しました。
ko: 비CLS Exception이 Catch되었습니다.
pt_br: Ocorreu uma Non CLS Exception.
ru: Перехвачено исключение Non CLS Exception.
zh_hans: 捕获到非 CLS Exception。
zh_hant: 已找到 Non CLS Exception。

# ADP_NotAPermissionElement
source: Given security element is not a permission element.
de: Das angegebene Sicherheitselement ist kein Berechtigungselement.
es: El elemento de seguridad proporcionado no es un elemento de permiso.
fr: L'élément de sécurité donné n'est pas un élément d'autorisation.
it: L'elemento di sicurezza specificato non è un elemento di autorizzazione.
ja: 指定されたセキュリティ要素は、アクセス許可要素ではありません。
ko: 지정된 보안 요소가 사용 권한 요소가 아닙니다.
pt_br: O elemento de segurança fornecido não é um elemento de permissão.
ru: Указанный элемент безопасности не является элементом разрешений.
zh_hans: 给定的安全元素不是权限元素。
zh_hant: 指定的安全性元素不是權限元素。

# ADP_OpenConnectionPropertySet
source: Not allowed to change the '{0}' property. {1}
de: Die '{0}'-Eigenschaft darf nicht geändert werden.{1}
es: No está autorizado a cambiar la propiedad '{0}'. {1}
fr: Impossible de changer la propriété '{0}'. {1}
it: Impossibile modificare la proprietà "{0}". {1}
ja: '{0}' プロパティを変更することはできません。{1}
ko: '{0}' 속성을 변경할 수 없습니다. {1}
pt_br: Não é permitido alterar a propriedade '{0}'. {1}
ru: Изменять свойство "{0}" не разрешается. {1}
zh_hans: 不允许更改“{0}”属性。{1}
zh_hant: 不允許變更 '{0}' 屬性。{1}

# ADP_PendingAsyncOperation
source: Can not start another operation while there is an asynchronous operation pending.
de: Während ein asynchroner Vorgang aussteht, kann kein anderer Vorgang gestartet werden.
es: No se puede iniciar otra operación mientras hay una operación asincrónica pendiente.
fr: Impossible de démarrer une autre opération pendant une opération asynchrone en attente.
it: Impossibile avviare un'altra operazione se è in sospeso un'operazione asincrona.
ja: 保留中の非同期操作があるときには、別の操作を開始できません。
ko: 비동기 작업이 보류 중인 동안 다른 작업을 시작할 수 없습니다.
pt_br: Não é possível iniciar outra operação enquanto houver uma operação assíncrona pendente.
ru: Пока ожидается выполнение асинхронной операции, другая операция не запустится.
zh_hans: 当存在挂起的异步操作时，无法启动另一个操作。
zh_hant: 暫止非同步作業時，無法啟動另一項作業。

# ADP_PermissionTypeMismatch
source: Type mismatch.
de: Typenkonflikt.
es: No coinciden los tipos.
fr: Incompatibilité de type.
it: Tipo non corrispondente.
ja: 型が一致しません。
ko: 유형이 일치하지 않습니다.
pt_br: Tipo incompatível.
ru: Несоответствие типов.
zh_hans: 类型不匹配。
zh_hant: 類型不符。

# ADP_PooledOpenTimeout
source: Timeout expired. The timeout period elapsed prior to obtaining a connection from the pool. This may have occurred because all pooled connections were in use and max pool size was reached.
de: Timeout abgelaufen. Das Zeitlimit ist vor dem Anfordern einer Verbindung aus dem Pool abgelaufen. Möglicherweise werden alle Verbindungen im Pool bereits verwendet, und die maximale Poolgröße wurde erreicht.
es: Valor de tiempo de espera caducado. El período de tiempo de espera expiró antes de obtener una conexión del grupo. Esto puede suceder porque todas las conexiones de la agrupación estaban en uso y se alcanzó el máximo tamaño del grupo.
fr: Expiration du délai d'attente. Le délai d'attente s'est écoulé avant obtention d'une connexion du pool. Ceci est probablement dû au fait que toutes les connexions regroupées sont en cours d'utilisation et que la taille maximale du pool a été atteinte.
it: Timeout scaduto. Il tempo disponibile è scaduto prima di aver ottenuto la connessione dal pool. Ciò potrebbe essere accaduto perché tutte le connessioni dal pool erano in uso ed era già stata raggiunta la dimensione massima del pool.
ja: タイムアウトに達しました。プールから接続を取得する前にタイムアウト期間が過ぎました。プールされた接続がすべて使用中で、プール サイズの制限値に達した可能性があります。
ko: 제한 시간이 만료되었습니다. 풀에서 연결을 만들기 전에 제한 시간이 경과되었습니다. 풀링된 연결이 사용 중이었거나 최대 풀 크기에 도달했기 때문일 수 있습니다.
pt_br: Tempo limite expirado. O período de tempo limite foi atingido antes que fosse obtida uma conexão do pool. Isso pode ter ocorrido porque todas as conexões do pool estavam em uso e o tamanho máximo do pool foi atingido.
ru: Истекло время ожидания. Время ожидания истекло раньше, чем удалось получить подключение из пула. Возможно, все подключения в пуле уже используются и достигнут максимальный размер пула.
zh_hans: 超时时间已到。超时时间已到，但是尚未从池中获取连接。出现这种情况可能是因为所有池连接均在使用，并且达到了最大池大小。
zh_hant: 已超過連接逾時的設定。在取得集區連接之前超過逾時等待的時間，可能的原因為所有的共用連接已在使用中，並已達共用集區大小的最大值。

# ADP_NonPooledOpenTimeout
source: Timeout attempting to open the connection. The time period elapsed prior to attempting to open the connection has been exceeded. This may have occurred because of too many simultaneous non-pooled connection attempts.
de: Timeout beim Versuch, die Verbindung zu öffnen. Die Zeitspanne, die vor dem Versuch, die Verbindung zu öffnen, verstreichen kann, wurde überschritten. Die Ursache sind möglicherweise zu viele gleichzeitige Versuche, Verbindungen ohne Pooling herzustellen.
es: Tiempo de espera agotado al intentar abrir la conexión. El periodo de tiempo de espera se ha superado antes de intentar abrir la conexión. Probablemente se produjo por haber demasiados intentos de conexión no agrupada a la vez.
fr: Lors de la tentative d'ouverture de connexion, le délai d'attente a expiré. La durée écoulée avant la tentative d'ouverture de connexion a été dépassée.
it: Timeout durante il tentativo di aprire la connessione. È stato superato il periodo di tempo trascorso prima del tentativo di apertura della connessione. È possibile che si siano verificati troppi tentativi di connessione simultanei non in pool.
ja: 接続を開く試行がタイムアウトしました。接続を開く試行を行う前にタイムアウト期間が過ぎました。非プールの同時の接続試行が多すぎた可能性があります。
ko: 연결을 여는 중 시간이 초과했습니다. 연결을 열기 전에 경과한 시간이 제한 시간을 초과했습니다. 이는 풀링되지 않은 연결 시도가 동시에 너무 많이 시도되어서 발생했을 수 있습니다.
pt_br: Tempo limite atingido ao tentar abrir a conexão. O período decorrido antes da tentativa de abrir a conexão foi excedido. Talvez isso tenha ocorrido por causa de muitas tentativas de conexão não em pool simultâneas.
ru: Превышено время ожидания открытия соединения. Период времени, прошедший до попытки открыть соединение, превысил максимум. Это могло случиться из-за слишком большого числа одновременных попыток соединения не из пула.
zh_hans: 尝试打开连接时超时。在尝试打开连接之前超时时间已过。出现这种情况可能是因为同时进行了太多非池化连接尝试。
zh_hant: 嘗試開啟連線時發生逾時。已超過嘗試開啟連線前所經過的時間。這可能是過多同時非共用連線嘗試所造成。
